{
  "Arcanine-Hisui": {
    "outdated": true,
    "sets": {
      "Magic Guard": {
        "description": "<p>Hisuian Arcanine is a strong wallbreaker, capable of denting many physically defensive Pokemon such as Scream Tail while taking advantage of Magic Guard by using Head Smash and Flare Blitz in combination with Life Orb without any drawbacks. Close Combat allows Hisuian Arcanine to hit Ting-Lu and Well-Baked Body Iron Treads, while Will-O-Wisp threatens burns on checks like physically defensive Quaquaval and Garchomp. Extreme Speed is useful priority that picks off weakened targets, Stealth Rock allows Hisuian Arcanine to act as an offensive entry hazard setter that pressures Corviknight and Iron Treads, and Flame Charge boosts its Speed to thwart potential revenge killers. As Hisuian Arcanine places a lot of pressure on physical walls, other physical cleaners like Meowscarada and Chien-Pao can be partnered with Hisuian Arcanine to clean up after it has broken those walls while providing speed control. Since Hisuian Arcanine is checked by Garchomp and bulky Water-types like Quaquaval, Refrigerate Regieleki makes a good partner for it by forcing these Pokemon out, pivoting Hisuian Arcanine in, and helping to deal with faster threats through its raw Speed. Hisuian Arcanine's middling Speed makes slow pivots like Corviknight good partners due to their ability to bring it in safely; alternatively, Corviknight's dual screens set allows Arcanine to take a hit and strike back.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Muk-Alola": {
    "outdated": true,
    "sets": {
      "RegenVest": {
        "description": "<p>With a great defensive typing, solid special bulk, and Knock Off, Alolan Muk is a great RegenVest user, repeatedly entering the battle and disrupting fierce special attackers like Iron Moth and Zapdos. Knock Off provides critical utility and disruption, deters potential answers from switching into it, and provides decent uninvested damage output against neutral targets. Poison Fang semi-reliably spreads Toxic poison onto opposing walls, while Poison Jab can 2HKO Enamorus-T and Meowscarada. Rock Slide hits Zapdos, Volcanion, Talonflame, and Volcarona hard, punishing them for switching in. Ice Punch nails common switch-ins like Landorus-T and Garchomp, while Thunderbolt snipes Corviknight. Physical walls like Corviknight, Unaware Scream Tail, and Quaquaval are a natural pairing, as they can better deal with the physical attackers that threaten Alolan Muk like Garchomp, Chien-Pao, and Galarian Zapdos. Mixed attackers like Magic Guard Volcanion and Heatran threaten Alolan Muk out, so offensive answers to these like Sword of Ruin Garchomp, Chien-Pao, and Galarian Zapdos are recommended. Entry hazards wear down Alolan Muk over the course of the game and prevent it from properly dealing with repeated attacks from threats like Iron Moth and Iron Jugulis, so hazard removers like Iron Treads, Quaquaval, and Corviknight are all recommended teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Cloyster": {"outdated": true, "sets": {"Technician": {}}},
  "Gengar": {
    "sets": {
      "Sheer Force": {
        "description": "<p>Gengar is a powerful offensive threat thanks to its high Special Attack, good Speed, and great coverage. Focus Blast provides perfect coverage with Shadow Ball and threatens RegenVest Roaring Moon and Hisuian Goodra. Nasty Plot makes Gengar even more threatening, as at +2, it can OHKO special walls like RegenVest Hisuian Goodra, being guaranteed to do so after a layer of Spikes, and Roaring Moon with Focus Blast, as well as OHKOing specially defensive Garchomp with Shadow Ball after two layers of Spikes. Gengar has a number of options for its last moveslot, such as Sludge Bomb—which helps against Volt Absorb Mandibuzz, as well as OHKOing Ogerpon-H and Ogerpon-W; Thunderbolt, which threatens Water- and Flying-types like Manaphy and Corviknight; and Knock Off to cripple opponents, especially RegenVest Pokemon like Manaphy and Roaring Moon that can switch into Gengar, by removing their items. Gengar still struggles against certain special walls like Unaware Blissey and RegenVest Goodra, so it pairs well with physically offensive teammates like Dragonite and Chien-Pao that can handle these Pokemon. Additionally, due to its defensive frailty, Gengar appreciates teammates like Corviknight and Hisuian Goodra that can switch in and take hits for it, as well as pivots like Meowscarda and Barraskewda that can safely bring it in on physical walls. Gengar also benefits from entry hazard setters, like Heatran and Garchomp which can chip down foes and make them easier for Gengar to OHKO.</p>"
      },
      "Hadron Engine": {
        "description": "<p>Hadron Engine Gengar uses its excellent Special Attack, good Speed, and good coverage options to function as a dangerous wallbreaker, pressuring physical and special walls alike. Hadron Engine-boosted Thunderbolt threatens an OHKO on Water- and Flying-types such as Empoleon and Mandibuzz and 2HKOes RegenVest Manaphy, while Focus Blast threatens an OHKO on Heatran and a 2HKO on Blissey, RegenVest Hisuian Goodra, and Roaring Moon. Trick can be used to cripple more defensive switch-ins such as Blissey and RegenVest users, while Sludge Bomb threatens an OHKO on Primordial Sea Zapdos and Ogerpon-C while also potentially crippling switch-ins with poison. Fast wallbreakers such as Barraskewda, Azelf, and Meowscarada appreciate Gengar's ability to pressure their walls like Kommo-o, Empoleon, and Corviknight, allowing them to clean late-game, while in return they can safely let in Gengar by pivoting out of such walls as they switch in. Azelf's Psychic Terrain blocking priority is appreciated by Gengar, as it allows it to avoid an OHKO from Dragonite's Extreme Speed and 2HKO it back with Sludge Bomb. Gengar's ability to absorb Toxic Spikes and OHKO Toxic Debris Great Tusk is greatly appreciated by offensive teams especially, as they can otherwise be crippled by them. Gengar is OHKOed by most Pokemon faster than it, such as Azelf, Barraskewda, and Roaring Moon, and takes takes heavy damage from most priority moves, so defensive teammates such as Corviknight, Great Tusk, and Empoleon are appreciated, with Corviknight and Great Tusk being able to remove the entry hazards that Gengar is prone to being chipped down by. Gengar also appreciates Corviknight and Empoleon being able to safely pivot it in due to their low Speed.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}, {"username": "Kinetic1000", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic1000", "user_id": 552227}, {"username": "UT", "user_id": 523866}, {"username": "cat", "user_id": 580765}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Milak", "user_id": 262594}]}]}
  },
  "Electrode-Hisui": {
    "sets": {
      "Magic Guard": {
        "description": "<p>Hisuian Electrode's fantastic Speed tier, fast Volt Switch, and powerful Chloroblast for Electric-immune foes like Great Tusk and Sandy Shocks make it a solid offensive pivot. Thunder Wave spreads paralysis for Hisuian Electrode's teammates, crippling switch-ins like Roaring Moon and Hisuian Goodra while providing support for Hex users like Gholdengo and Gengar. Alternatively, Leech Seed chips walls like Hisuian Goodra, Blissey, and Volt Absorb Empoleon, while Worry Seed allows Hisuian Electrode to ignore immunity abilities like Volt Absorb or Sap Sipper as well as Regenerator, letting it chip Kommo-o and Hisuian Goodra more meaningfully. Hisuian Electrode forms a fantastic VoltTurn core with fast offensive pivots like Roaring Moon, Meowscarada, and Barraskewda, bringing them in on walls like Hisuian Goodra, Meloetta, and Empoleon, while they bring it into physical walls like Corviknight, Great Tusk, and Kommo-o in return. Wallbreakers like Ogerpon-C and Galarian Zapdos appreciate Hisuian Electrode's presence, as it provides valuable chip on walls like Kommo-o and Fluffy Zapdos while also pivoting them in on weak, resisted hits. Hisuian Electrode appreciates entry hazard setters like Sandy Shocks, Great Tusk, and Garchomp, as hazards wear down its checks like Goodra and Meloetta, and hazard removers such as Corviknight, Mandibuzz, Quaquaval, and Great Tusk are forced out by Hisuian Electrode. Hisuian Electrode is frail and has a mediocre defensive typing, so it appreciates slow pivots like Corviknight and Manaphy, which can take a hit and pivot it in.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic1000", "user_id": 552227}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Gyarados": {"outdated": true, "sets": {"Dragon Dance": {}}},
  "Vaporeon": {"outdated": true, "sets": {"Defensive": {}}},
  "Zapdos": {
    "sets": {
      "Primordial Sea": {
        "description": "<p>Primordial Sea Zapdos's great defensive typing, high Special Attack, and decent Speed tier enable it to check a bevy of the tier's most threatening Pokemon. Primordial Sea allows Zapdos to potentially OHKO foes such as Kommo-o, Meowscarada, and Mandibuzz with its strongest STAB moves. Weather Ball threatens to OHKO Sandy Shocks and Fire-types such as Iron Moth and Ceruledge in rain. Volt Switch and U-turn allow Zapdos to switch out of problematic matchups such as Ogerpon-C and Chien-Pao without losing momentum. Zapdos is a fantastic partner for other offensive pivots such as Roaring Moon and Cinderace, baiting in targets such as Desolate Land Heatran and Volt Absorb Empoleon that they can take advantage of, while also forming a potent VoltTurn core to maintain momentum and pressure throughout a game. Zapdos likewise performs well alongside more defensively inclined teammates such as Corviknight, RegenVest Manaphy, and Empoleon, pivoting them into strong offensive threats such as Weavile, Walking Wake, and Ogerpon-C that they are more equipped to handle. Zapdos can struggle against special walls such as Volt Absorb Empoleon, Garchomp, and Hisuian Goodra, so strong attackers it can pivot into which can threaten these walls such as Ogerpon-C, Weavile, and Zamazenta-Crowned are recommended teammates.</p>"
      },
      "Defensive": {
        "description": "<p>Zapdos serves as a valuable defensive pivot, checking many of the tier's physical wallbreakers and pivots like Dragonite, Great Tusk, and its Galarian counterpart. Discharge's nasty paralysis chance further increases the utility Zapdos provides and cripples switch-ins like Blissey and Hisuian Goodra. Heat Wave is an option over Hurricane to hit Iron Treads and Volt Absorb Corviknight while 2HKOing non-Well-Baked Body Kingambit. U-turn allows Zapdos to switch in on the aforementioned physical threats and pivot out to a wallbreaker that threatens them. Intimidate is an option to weaken hits even after Zapdos switches out and also allow it to act as a check to Fire-types like Cinderace and Ceruledge. 108 Speed EVs notably allow it to outspeed Timid Volcanion and Adamant Slither Wing. Zapdos's inability to check Ice-types like Weavile, Mamoswine, and Chien-Pao and tendency to get worn down quickly makes other physical walls like Corviknight and Quaquaval great partners that can additionally switch into Knock Off from the likes of Great Tusk and Roaring Moon. Wallbreakers and pivots like Ogerpon-C, Azelf, and Barraskewda appreciate Zapdos's ability to switch into revenge killers like Roaring Moon, Choice Scarf Meowscarada, and opposing Barraskewda and pivot out, generating momentum for the team. If Zapdos is using Fluffy, a sturdy Fire-type check like Quaquaval or physically defensive Garchomp, which can switch into Pokemon like Cinderace and Ceruledge, pairs well with it.</p>"
      },
      "No Guard": {}
    },
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic1000", "user_id": 552227}, {"username": "UT", "user_id": 523866}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Zapdos-Galar": {
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Galarian Zapdos is a fearsome wallbreaker that breaks down common walls like Intimidate Corviknight, Great Tusk, and Kommo-o. Close Combat and Brave Bird have excellent neutral coverage, easily 2HKOing common walls like Scream Tail, Manaphy, and Mandibuzz while OHKOing Great Tusk and Kommo-o. Knock Off cripples switch-ins like defensive Zapdos and has a chance to OHKO non-Colbur Berry defensive Gholdengo. Adamant is the preferred nature for a good chance to 2HKO Intimidate Corviknight, while Jolly is an option to at least Speed tie the crowded base 100 Speed tier including Zapdos and Manaphy and outspeed offensive Great Tusk. Galarian Zapdos pairs well with fast cleaners that can take advantage of its wallbreaking prowess, including Weavile, Azelf, and Barraskewda; the latter two are especially noteworthy for pivoting it in on common walls like Hisuian Goodra and Kommo-o, respectively. Galarian Zapdos is relatively slow and easily revenge killed, so teammates like Corviknight and RegenVest Manaphy that can take hits for it are strongly recommended. Scream Tail is also a potential partner to provide Wish support.</p>"
      },
      "Magic Guard": {}
    },
    "credits": {"writtenBy": [{"username": "UT", "user_id": 523866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic1000", "user_id": 552227}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Moltres": {"outdated": true, "sets": {"Magic Guard": {}, "Desolate Land": {}}},
  "Moltres-Galar": {"outdated": true, "sets": {"Double Dance": {}}},
  "Dragonite": {
    "sets": {
      "Dragon Dance": {
        "description": "<p>Dragonite is a potent revenge killer, able to OHKO fast offensive threats like Iron Moth and Ogerpon-H with unboosted Extreme Speed thanks to its high Attack and Aerilate. Earthquake easily threatens almost everything that resists Extreme Speed, able to reliably OHKO Heatran and non-Earth Eater Empoleon, as well as hitting Gholdengo and Azelf, while Low Kick can be run instead to OHKO Hisuian Goodra and 2HKO Garganacl, as well as hitting Steel-types with Earth Eater. Dragon Dance skyrockets Dragonite's offensive potency, allowing it to OHKO Zamazenta-C with Earthquake as well as 2HKO Regenerator Manaphy and defensive Garchomp sets with Extreme Speed at +1. Investing in HP gives Dragonite some bulk to set up more safely, and it doesn't need Speed investment due to its primary method of dealing damage being a priority move. Life Orb increases Dragonite's power across the board in exchange for dealing recoil damage, while Sharp Beak powers up Extreme Speed slightly less in exchange for better longevity and less damage with Low Kick and Earthquake; alternatively, Dragonite can run Heavy-Duty Boots to repeatedly switch in without worrying about chip damage from Stealth Rock. Dragonite struggles against dedicated physical walls like Intimidate Corviknight, Fluffy Zapdos, and Unaware Scream Tail, so it appreciates teammates like Iron Moth and Chien-Pao that can remove them. Psychic Surge Azelf is particularly threatening to Dragonite, blocking Extreme Speed and outspeeding +2 Dragonite with Choice Scarf, so dedicated counters like Greninja and Weavile are a must. Additionally, if not running Heavy-Duty Boots, entry hazard removers like Corviknight and Great Tusk are needed to keep Dragonite healthy through repeated switches. Dragonite also benefits from hazard setters like Garchomp and Heatran wearing down the opposing team and making them easier to sweep through. Bulky pivots like Corviknight and Empoleon that can safely bring Dragonite onto the field without it taking damage are also highly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Mew": {
    "outdated": true,
    "sets": {
      "Choice Scarf Regenerator": {
        "description": "<p>Choice Scarf Regenerator Mew is a strong utility pivot that checks fast physical attackers with the combination of Will-O-Wisp + Volt Switch while still pressuring defensive cores with entry hazards and Trick. Ice Beam can be used as an alternative to Spikes to pressure Pokemon like Garchomp and Landorus-T. Trick can be used to neutralize support Pokemon and defensive pivots like Corviknight while serving as an emergency stop to bulky setup sweepers like Calm Mind Enamorus-T. 136 Speed EVs with a Timid nature ensure that Mew outspeeds Chien Pao, Hisuian Electrode, and +1 Jolly Quaquaval, as well as positive natured Slither Wing and Heatran after Trick. Bulky teammates like Corviknight, Garganacl, Zapdos, and Skeledirge benefit from Mew's ability to spread burns and set hazards, allowing them to absorb more hits from physical attackers and whittle down these attackers more quickly; Mew can also pressure fast attackers like Meowscarada and Talonflame that they struggle with. Additionally, late-game cleaners like Chien-Pao, Hisuian Arcanine, and Quaquaval benefit from Mew's ability to chip defensive switch-ins and hinder walls by giving them a Choice Scarf.</p>"
      },
      "Prankster": {
        "description": "<p>Prankster Mew is a good dual screens lead for hyper offense teams thanks to its good bulk, Speed, and movepool. Taunt blocks foes such as Garchomp, Landorus-T, and Iron Treads from setting entry hazards, Corviknight from clearing screens with Defog, and opposing setup sweepers like Volcarona from taking advantage of free turns. U-turn lets it pivot into its teammates and potentially re-set screens later in the game. Stealth Rock or Spikes can be used over U-turn to chip foes for teammates to KO. 96 Speed EVs and a Jolly Nature ensure that Mew always moves first against opposing leads like Prankster Corviknight and Masquerain, allowing Mew to hinder them with Taunt. Prankster Mew should only be used as a dual screens lead on hyper offense teams. Teammates such as Chien-Pao, Polteageist, Volcarona, and Roaring Moon all appreciate screens, which allow them to easily set up and make them less susceptible to revenge killers. The aforementioned Pokemon also provide good options for Mew to pivot into and gain momentum. Dark-type Pokemon such as Ting-Lu, Meowscarada, and Chien-Pao are immune to Prankster Taunt and can take advantage of Mew, so counters to them such as Zamazenta-C and Triage users, like Enamorus-T and Ursaluna, are good teammates.</p>"
      },
      "All-Out Attacker": {
        "description": "<p>Life Orb Mew is a very dangerous mixed wallbreaker that can decimate various walls with its colorful coverage. Ice Beam hits Ground- and Flying-types such as Garchomp, Landorus-T, and Zapdos. Gunk Shot 2HKOes Scream Tail, which otherwise switches into Mew freely. Close Combat takes care of Blissey and Steel-types such as Hisuian Goodra, Kingambit, and Heatran. Flamethrower 2HKOes non-Well-Baked Body Corviknight and Zamazenta-C, dissuading the latter from using Mew as setup fodder. A Mild nature helps Mew exert as much pressure as possible with Ice Beam and Flamethrower, while a Hasty nature most notably lets it outspeed Hydreigon and Speed tie Zapdos. Magic Guard negates chip damage from Life Orb and entry hazards, helping Mew stay healthy for longer and allowing it to better utilize its natural bulk to come into play. Sheer Force is an alternative particularly if Mew is used alongside a teammate with Magic Guard, such as Hisuian Electrode. It greatly increases Mew's power, notably letting it OHKO Garchomp and Iron Treads and pressure otherwise solid checks such as Meloetta, at the cost of its longevity. Bulky pivots such as Corviknight, Quaquaval, Iron Treads, and Meloetta can take on fast threats to Mew such as Chien-Pao, Roaring Moon, and Iron Moth and switch Mew in safely. Fast offensive pivots such as Meowscarada and Sandy Shocks are also strong partners that can give Mew opportunities to come into play and clean up late-game after it softens up their checks. Garchomp and Ting-Lu can set entry hazards to help Mew break down its checks over time.</p>"
      },
      "Setup Sweeper": {}
    },
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}, {"username": "Frozoid", "user_id": 532881}, {"username": "memesketch", "user_id": 537558}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}, {"username": "Adeleine", "user_id": 517429}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Typhlosion-Hisui": {
    "outdated": true,
    "sets": {
      "Desolate Land": {
        "description": "<p>Hisuian Typhlosion is a solid wallbreaker, exerting great offensive pressure with its great typing and offensive STAB move combinations. Eruption is Hisuian Typhlosion's go-to move, as Choice Specs boosts it enough to 2HKO common specially defensive walls such as Meloetta, Blissey, and Hisuian Goodra. Shadow Ball hits Fire-immune foes like Well-Baked Body Corviknight as well as Primordial Sea users like Volcanion, Zapdos, and Kilowattrel. Focus Blast notably 2HKOes RegenVest Roaring Moon and OHKOes Well-Baked Body Steel-types like Kingambit and Iron Treads. A Modest nature guarantees that Choice Specs Hisuian Typhlosion can 2HKO the previously mentioned special walls, but Timid can be used to outspeed max speed Quaquaval and Ceruledge. Choice Scarf and a Timid nature can turn Hisuian Typhlosion from a wallbreaker into a potent revenge killer that outspeeds and OHKOes other fast targets like Chien-Pao, Meowscarada, and Hisuian Electrode. Hisuian Typhlosion is very frail and struggles greatly against entry hazards, which also reduce Eruption's base power, so teammates that can clear hazards and pivot into it safely like Corviknight and Iron Treads are essential. Hisuian Typhlosion also has a mediocre Speed stat without Choice Scarf, so partners that can provide speed control like Regieleki, Chien-Pao, and Hisuian Electrode are also appreciated.</p>"
      },
      "Magic Guard": {}
    },
    "credits": {"writtenBy": [{"username": "I am BONK", "user_id": 603931}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Slowking": {"outdated": true, "sets": {"Defensive Pivot": {}}},
  "Slowking-Galar": {"outdated": true, "sets": {"Specially Defensive Pivot": {}}},
  "Donphan": {"outdated": true, "sets": {"Fluffy": {}, "RegenVest": {"outdated": true, "description": "<p>Assault Vest Donphan is a solid special pivot that can check the likes of Sandy Shocks while also removing entry hazards with Rapid Spin. Knock Off cripples switch-ins and can support offensive teammates. Body Press is used as a coverage option for Earth Eater Kingambit and Iron Treads, which would otherwise wall Donphan. Offensive Pokemon susceptible to hazards such as Chien-Pao and Dragonite appreciate Donphan's spinning capabilities. Physically defensive Pokemon like Corviknight and Garganacl also pair well with Donphan, as it can handle special attackers like Sandy Shocks that threaten them. Donphan can be prone to residual damage, so it's recommended to pair it with a Wish user like Scream Tail or Florges to extend its longevity.</p>"}}},
  "Blissey": {
    "sets": {
      "Unaware": {},
      "Special Wall": {
        "outdated": true,
        "description": "<p>Magic Guard Blissey is a solid wall and utility Pokemon that can effectively shrug off most viable special attackers, but it struggles against the tier's premier physically offensive options. Although it excels at switching into special attacks, it is left with rather passive options mainly chosen to maximize the potential of its teammates. Soft-Boiled is its essential recovery option that keeps it healthy to continue absorbing damage in the future. Heal Bell, Stealth Rock, and Thunder Wave are Blissey's utility options, allowing it to act as a cleric, entry hazard setter, or status spreader, respectively, to set up its teammates for success. Finally, Shadow Ball is a niche option that prevents Blissey from being passive against Ghost-types like Skeledirge, Hisuian Typhlosion, and Ceruledge. Well-Baked Body can be used instead of Magic Guard, improving its matchup against Fire-types like Magic Guard Volcanion and Heatran, as well as completely walling Skeledirge. Teams that use Blissey should also opt to carry a physical wall like Corviknight, Quaquaval, or Fluffy Landorus-T, as their ability to absorb physical attacks is valuable for preserving it as a special wall. Blissey can offer offensive teammates the ability to thwart their revenge killers with its switching unimpeded by entry hazards and damaging status conditions.</p>"
      }
    }
  },
  "Gardevoir": {"outdated": true, "sets": {"Tinted Lens": {}, "Prankster": {}, "Hadron Engine": {}}},
  "Masquerain": {"outdated": true, "sets": {"Sticky Web Lead": {}}},
  "Salamence": {"outdated": true, "sets": {"Aerilate": {}}},
  "Empoleon": {"sets": {"Type Immunity": {}}},
  "Gastrodon": {"outdated": true, "sets": {"Fluffy": {}}},
  "Mismagius": {"outdated": true, "sets": {"Normalize": {}, "Triage": {}}},
  "Garchomp": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>With solid defensive stats, a great defensive typing, and powerful phazing in Dragon Tail, Garchomp is a choice entry hazard setter and special wall, capable of switching into and pivoting around powerful attackers like Iron Moth, Zapdos, Sandy Shocks, and Gengar. Stealth Rock is an option over Spikes if a teammate like Ogerpon-H or Sandy Shocks is already running the latter move. Swords Dance can turn Garchomp into a potential wallbreaking threat, notably OHKOing unboosted Zamazenta-C and threatening a 2HKO on defensive Kommo-o and RegenVest Manaphy at +2, while Fire Blast chips Corviknight and Earth Eater Gholdengo. A Sassy Nature is preferred if running Fire Blast, sacrificing Speed to avoid a cut to Special Attack. Regenerator allows Garchomp to come in repeatedly over the course of a game, while Toxic Debris is an option on more offensive teams to set fatal Toxic Spikes, putting the opposing team on a timer and punishing Corviknight's U-turn. Strong attackers like Tail Glow Manaphy, Dragonite, and Zamazenta-C appreciate the entry hazards set by Garchomp softening up foes to be more vulnerable to their powerful attacks while also appreciating the defensive backbone Garchomp provides. Corviknight is an ideal partner for Garchomp, handling monstrous physical threats like Chien-Pao, Weavile, and Roaring Moon, while Garchomp handles special attackers like Iron Moth, Zapdos, and Heatran in return. Garchomp is vulnerable to being overwhelmed by foes such as Walking Wake, Manaphy, and Hisuian Electrode, especially without Regenerator, so Pokemon that can handle these powerful special attackers like Blissey, Empoleon, and Hisuian Goodra make great teammates.</p>"
      },
      "Mixed Attacker": {
        "description": "<p>Mixed Attacker Garchomp is a reliable entry hazard setter that packs enough power and Speed to consistently deter common hazard removal options like Corviknight and Great Tusk from safely switching in. Draco Meteor is the STAB move of choice, surprising offensive Great Tusk with a 2HKO, while Fire Blast 2HKOes Corviknight. Download is a niche option over Regenerator, letting it secure a 2HKO on Mandibuzz and offensive Manaphy with Draco Meteor while also freeing your Regenerator slot for a teammate like Kommo-o or Great Tusk, but it comes at the cost of cutting into Garchomp's longevity. Life Orb notably guarantees the 2HKO on specially defensive Garchomp with Draco Meteor. Offensive threats like Manaphy, Azelf, and Iron Moth appreciate Garchomp for its entry hazards and ability to threaten common defensive foes, chipping them down to be picked off later in the game. Defensive pivots such as Corviknight, Zapdos, and RegenVest Manaphy appreciate Garchomp outspeeding and threatening powerful offensive threats such as Great Tusk, Ceruledge, and Sandy Shocks, while Garchomp appreciates these defensive partners handling the faster attackers like Weavile, Azelf, and Chien-Pao that force Garchomp out. Garchomp is worn down very easily by hazards and appreciates Rapid Spin users like Great Tusk and Quaquaval and Wish support from Scream Tail, allowing it to come in repeatedly over the course of the game while greatly improving its longevity, especially if running Download. Garchomp also struggles to break through common defensive foes like Scream Tail and Earth Eater Empoleon, so it appreciates teammates such as Gengar and Zamazenta-C, which can break down these walls.</p>"
      },
      "Physically Defensive": {
        "description": "<p>Garchomp is an excellent entry hazard setter that checks many of the tier's Fire-types like Cinderace, Talonflame, and Ogerpon-H lacking Play Rough. Stealth Rock is an option over Spikes if a teammate like Ogerpon-H is carrying the move. Swords Dance allows Garchomp to threaten hazard removers like Quaquaval and act as a potential wincon late-game, while Dragon Tail forces switches, racking up entry hazard chip damage and preventing setup, and Liquidation hits both Landorus formes and Levitate Iron Treads and chips Corviknight. Toxic Debris punishes resisted physical hits and U-turn from pivots like Corviknight and RegenVest Manaphy and pressures the opposing team while leveraging Garchomp's Volt Switch immunity to threaten fast-paced teams with strong VoltTurn cores. Alternatively, Regenerator allows it to switch in more times throughout a game to find opportunities to set up entry hazards or Swords Dance, while Well-Baked Body punishes Fire-types like Cinderace and Ceruledge for clicking their strong STAB moves and increases its walling capabilities. Garchomp's inability to check threats like Chien-Pao, Weavile, and Galarian Zapdos facilitates another physical wall like Corviknight or Zapdos, which can switch into them and pivot out. Garchomp's inability to check special threats like Azelf, Gengar, and Walking Wake makes special walls like RegenVest Manaphy and Goodra great partners if Garchomp is not using Regenerator; if Garchomp is using Regenerator, Blissey and Empoleon are alternative options as special walls.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic1000", "user_id": 552227}, {"username": "UT", "user_id": 523866}, {"username": "Tranquility", "user_id": 475288}, {"username": "Isaiah", "user_id": 375662}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Milak", "user_id": 262594}]}]}
  },
  "Lucario": {
    "outdated": true,
    "sets": {
      "Magic Guard": {
        "description": "<p>Lucario is a devastating mixed wallbreaker, capable of tearing apart most defensive cores with ease thanks to its strong STAB moves and great mixed attacking stats. Close Combat and Steel Beam have excellent neutral coverage together and hit common walls like Hisuian Goodra and Scream Tail on their weaker defensive stat. Focus Blast 2HKOes standard Corviknight, while Aura Sphere provides a more consistent special attack. In the final moveslot, Nasty Plot allows Lucario to overwhelm slower teams, while Stone Edge provides coverage for Skeledirge and Zapdos. Bullet Punch is also an option that can turn the tables on would-be revenge killers such as Chien-Pao and Meowscarada after some chip damage. Naive is the recommended nature due to its ability to always outspeed Quaquaval and at worst Speed tie with Hisuian Arcanine. Lucario is best used as a mid-game wallbreaker that can pave the way for sweepers like Zamazenta-C and Hisuian Electrode by breaking through Pokemon like Corviknight and Garchomp. Lucario also heavily benefits from slow pivots like Meloetta, Corviknight, and Landorus-T; in return, they switch into Pokemon that threaten Lucario out, like Zapdos, Iron Treads, and Cinderace. While Lucario has limited switch-ins, the ones it does have, like Toxapex and Skeledirge, are very effective without using niche coverage options, so partners that can threaten them, like Zapdos and Quaquaval, are recommended; they can also bring Lucario in on their checks, like Goodra and Corviknight, with U-turn.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Hera", "user_id": 414072}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Hippowdon": {"outdated": true, "sets": {"Defensive": {}, "Fluffy": {"outdated": true, "description": "<p>Fluffy Hippowdon is a remarkable physical wall thanks to its defensive stats, reliable recovery in Slack Off, and pure Ground typing, letting it check offensive threats like Ceruledge, Kingambit, and Slither Wing. Whirlwind prevents foes like Talonflame from setting up. Rocky Helmet punishes the physical attackers it checks and lets it pseudo-spinblock Cyclizar and Iron Treads; alternatively, Leftovers gives it extra recovery without having to waste Slack Off PP. 25 Speed IVs let it underspeed Corviknight, allowing it to punish its Roost with Earthquake. Specially defensive walls like Corviknight, Florges, and Blissey can compensate for Hippowdon's poor Special Defense and check foes like Chi-Yu and Greninja. In return, they appreciate Hippowdon dealing with Ceruledge, Kingambit, and Slither Wing.</p>"}}},
  "Weavile": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Weavile serves as a great offensive wallbreaker, with a good offensive typing combined with high Attack and Speed stats. Ice Shard is used to snipe faster, chipped targets like Hisuian Electrode, Choice Scarf Roaring Moon, and Sandy Shocks. Loaded Dice is used for more consistency on Icicle Spear, while Life Orb trades consistency for power, which lets Icicle Spear OHKO defensive Great Tusk with five hits and defensive Kommo-o with four hits while also powering up Beat Up. Offensive pivots like Barraskewda and Azelf appreciate Weavile's ability to heavily chip down their respective checks, being Corviknight and Manaphy, which allows them to clean up late-game. Weavile has a hard time breaking through bulky Water-types like Toxapex and defensive Quaquaval, which makes Electric-types like Sandy Shocks and Zapdos great teammates. Strong physical wallbreakers like Dragonite, Slither Wing, and Great Tusk are also good teammates, as they help to power up Weavile's Beat Up. Weavile is very frail, making defensive pivots like Corviknight and RegenVest Manaphy great partners, as they can also bring it in safely. Weavile also has a glaring weakness to entry hazards, which means that hazard removers like Corviknight and Great Tusk are very appreciated.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band Weavile utilizes its excellent Attack and Speed alongside a nearly unresisted STAB combination to function as a deadly wallbreaker and sweeper. Technician Beat Up and Icicle Spear offer tremendous power, KOing Scream Tail with seven total hits of Icicle Spear, while Sword of Ruin is a more consistent option that still lets Weavile OHKO defensive Kommo-o and Zamazenta-C. Ice Shard picks off faster, frail foes like Hisuian Electrode, Choice Scarf Sandy Shocks, and Choice Scarf Roaring Moon, as well as chipped foes like Talonflame, Barraskewda, and Choice Scarf Walking Wake. Low Kick threatens Zamazenta-C, Heatran, and Kingambit, while Knock Off provides a reliable Dark-type STAB move once Beat Up is weakened. Weavile appreciates physically offensive teammates such as Galarian Zapdos, Ceruledge, and Ogerpon-H, which can pressure common switch-ins that it struggles to break through like Corviknight, Quaquaval, and Scream Tail while also boosting the power of its Beat Up on Technician sets. Weavile also appreciates special wallbreakers like Gengar and Walking Wake when using Sword of Ruin sets, as they can pressure its switch-ins while not decreasing the power of Beat Up. Weavile is frail and OHKOed by most Pokemon faster than it, so defensive teammates such as Corviknight, Great Tusk, and Manaphy are appreciated, with Corviknight and Great Tusk removing the entry hazards it is prone to being chipped down by. Pivots such as the aforementioned Corviknight and Manaphy as well as Zapdos and Empoleon are appreciated for their ability to safely bring in Weavile to pressure the foe. Fast cleaners such as Barraskewda and Azelf appreciate Weavile's ability to pressure many of their checks such as Kommo-o and Empoleon, respectively, allowing them to sweep late-game.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "I am BONK", "user_id": 603931}, {"username": "Kinetic1000", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic1000", "user_id": 552227}, {"username": "cat", "user_id": 580765}, {"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Rotom-Wash": {
    "outdated": true,
    "sets": {
      "Choice Item": {
        "description": "<p>Rotom-W can act as a good offensive pivot and revenge killer with Choice Scarf or as a wallbreaker with Choice Specs, as its formidable typing allows it to threaten a plethora of Pokemon including Ground-types such as Iron Treads, Landorus-T, and Garchomp with its Water-type moves while dealing with Desolate Land users such as Heatran, Skeledirge, and Ceruledge with its Electric-type moves. Hadron Engine boosts Rotom-W's Special Attack and Electric-type moves, while Primordial Sea provides an immunity to Fire-type moves and makes Thunder perfectly accurate. Will-O-Wisp and Trick provide good utility and cripple switch-ins such as Garchomp and Hisuian Goodra for teammates by burning them or removing their Assault Vest. However, Rotom-W can get worn out quickly due to entry hazards, so hazard removal options such as Iron Treads and Corviknight are good teammates. These two also provide slow pivoting support to Rotom-W. Similarly, hazard setters such as Garchomp, Ting-Lu, and Clodsire are good teammates, as Rotom-W can take advantage of chipped foes such as Garchomp and RegenVest users such as Meloetta, Goodra, and Hisuian Goodra. Rotom-W struggles a lot against specially defensive walls such as Goodra, Meloetta, and Hisuian Goodra, so threats to them in physical attackers such as Chien-Pao, Slither Wing, and Galarian Zapdos are good teammates, with the latter two also forming a good VoltTurn core with Rotom-W to put pressure on each other's checks.</p>"
      },
      "Nasty Plot": {},
      "Defensive": {}
    },
    "credits": {"writtenBy": [{"username": "Frozoid", "user_id": 532881}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Azelf": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>With its high Speed allowing it to outspeed nearly the entire unboosted metagame, a wide movepool, and powerful Psychic Terrain-boosted Expanding Force, Azelf functions as one of the best anti-offense pivots and cleaners in the tier. U-turn provides fast pivoting while threatening an OHKO on Meowscarada and putting pressure on the opponent. Trick allows Azelf to cripple a passive foe such as Blissey or Empoleon with a Choice Scarf while also securing a 2HKO on Manaphy with Expanding Force after minor hazard chip removing its Assault Vest. Flamethrower threatens an OHKO on Chien-Pao and a 2HKO on Corviknight and Kingambit, while Dazzling Gleam threatens an OHKO on offensive Roaring Moon, 2HKOes Hisuian Samurott, and chips Mandibuzz, forcing it to Roost. Knock Off is another option, allowing Azelf to cripple switch-ins such as Empoleon, Hisuian Goodra, and Scream Tail without the loss of its own item. Azelf pairs fantastically with fast, frail offensive pivots such as Barraskewda, Hisuian Electrode, and Roaring Moon, which appreciate Psychic Terrain eliminating their priority weakness while forming a potent VoltTurn core with Azelf, taking advantage of the special walls like Hisuian Goodra and Heatran that it can struggle with. Azelf is frail and vulnerable to entry hazards, so bulky hazard removers such as Corviknight, Great Tusk, and Quaquaval are recommended teammates, allowing Azelf to come in repeatedly over the course of a game to threaten out strong offensive threats that pressure these walls.</p>"
      },
      "Choice Specs": {
        "description": "<p>A combination of excellent Special Attack, high Speed, Psychic Surge, Expanding Force, and good coverage allows Choice Specs Azelf to function as a powerful threat that can OHKO many of the tier's dangerous offensive threats and sweep weakened teams with ease. Knock Off lets Azelf reliably 2HKO RegenVest Manaphy with Expanding Force and cripple switch-ins such as Empoleon, Heatran, and RegenVest Hisuian Goodra, while U-turn allows Azelf to pivot out of the aforementioned switch-ins. Dazzling Gleam threatens an OHKO on RegenVest Roaring Moon after a Knock Off and 2HKOes Mandibuzz. Trick can be used instead to more permanently cripple defensive switch-ins such as Blissey, Empoleon, and Mandibuzz, while Flamethrower can be used to threaten Steel-types, allowing Azelf to OHKO Kingambit and 2HKO Corviknight. Choice Specs allows Azelf to threaten an OHKO against Pokemon such as Dragonite, Primordial Sea Zapdos, and non-specially defensive Garchomp. Azelf pairs up well with fast and frail offensive Pokemon such as Barraskewda, Meowscarada, and Hisuian Electrode, as they appreciate the Psychic Terrain Azelf sets up. Azelf also appreciates pivots such as the previously mentioned teammates, Galarian Zapdos, and Roaring Moon, as they help pressure switch-ins such as Empoleon, Heatran, and RegenVest Hisuian Goodra, while also forming a VoltTurn core with Azelf to generate momentum. Defensive teammates such as Corviknight, RegenVest Manaphy, and Kommo-o are appreciated as they can check the faster threats that force Azelf out such as Roaring Moon, Meowscarada, and Chien-Pao. Pokemon that can remove the entry hazards Azelf is prone to, such as the aforementioned Corviknight, make great teammates as well.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Kinetic1000", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "Kinetic1000", "user_id": 552227}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}, {"username": "Clouds", "user_id": 356215}]}]}
  },
  "Heatran": {
    "sets": {
      "Desolate Land": {
        "description": "<p>High Special Attack and a good defensive typing make Heatran a solid Stealth Rock setter that has a good matchup against most entry hazard removers aside from Quaquaval. It can also check Water-types like Manaphy and Walking Wake as well as switch into Primordial Sea Zapdos thanks to Desolate Land. Earth Power can 2HKO Gholdengo and opposing Heatran and OHKO Iron Moth. Power Gem threatens Talonflame and Primordial Sea Zapdos, while Will-O-Wisp can cripple physical attackers like Dragonite, Garchomp, and Kommo-o that can switch into Heatran. 60 Speed EVs allow Heatran to outspeed uninvested Gholdengo. Heatran struggles against specially defensive Pokemon like Blissey and Roaring Moon, so it pairs well with physically offensive teammates like Ogerpon-H, Dragonite, and Chien-Pao. Ground-immune Pokemon like Corviknight, Mandibuzz, and Earth Eater Empoleon and Gholdengo help alleviate Heatran's 4x weakness against the common Earthquake. Primordial Sea users like Barraskewda and Zapdos can also threaten Heatran by overriding Desolate Land, so teammates like Kommo-o and Water Absorb Garganacl that can handle these Pokemon are appreciated.</p>"
      },
      "Magic Guard": {}
    },
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic1000", "user_id": 552227}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Cresselia": {
    "outdated": true,
    "sets": {
      "Unaware": {
        "description": "<p>Unaware Cresselia is an effective mixed wall and unorthodox setup sweeper with the ability to surprise opponents with its combination of Calm Mind and Stored Power. Cresselia is a reliable stop to powerful setup sweepers like Zamazenta-C and Garchomp, which can even be setup fodder for Cresselia. Once set up, Stored Power is Cresselia's main offensive option, dealing ridiculous damage against any non-Psychic-immune foes after two or three Calm Mind boosts. Additionally, Moonblast lets Cresselia threaten Dark- and Dragon-types like Chien-Pao and Garchomp. Because of Cresselia's passive stature and inability to make progress early-game, it shouldn't attempt to set up Calm Mind and sweep until physical attackers with super effective moves like Chien-Pao, Kingambit, and Slither Wing have been removed from play. Additionally, Cresselia fails to effectively defeat some special walls like Unaware Scream Tail and RegenVest Meloetta and Alolan Muk, making offensive teammates that threaten a 2HKO on either of these foes like Kingambit necessary to create openings for Cresselia to sweep. In addition to offensive pairings, this Pokemon appreciates defensive teammates like Intimidate Corviknight that can prevent it from being overwhelmed by Choice item users. Finally, Cresselia appreciates entry hazard removal from teammates like Corviknight, letting it preserve Moonlight's PP for the late-game.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Manaphy": {
    "sets": {
      "RegenVest": {
        "description": "<p>Manaphy with its good all around stats and excellent defensive typing in conjunction with fantastic moves in Scald, Knock Off, and U-turn makes for one of the premier RegenVest users that is able to check Gholdengo, Iron Moth, Walking Wake, and Magic Guard Heatran. Ice Beam can be used to hit Dragonite, Kommo-o, and Desolate Land Landorus, while Take Heart can be used to make Manaphy a late game setup threat as well as curing any status if its Assault Vest is removed by Knock Off. 0 Speed IVs and a Sassy nature ensure that Manaphy can slow pivot against opposing Manaphy, providing safer entry for its teammates. An alternative EV Spread of 252 HP / 252 Def / 4 SpD with a Relaxed nature can also be used to better check physical threats like Dragonite, Roaring Moon, and Great Tusk while still maintaining solid special bulk with an Assault Vest. Physically defensive walls like Mandibuzz, Corviknight, and defensive Zapdos appreciate Manaphy being able to soak up special hits and allowing them to wall more easily thanks to Scald + Knock Off. Frail offensive wallbreakers like Gengar, Roaring Moon, and Barraskewda are also good teammates, as Manaphy can give them safe entry with slow U-turn along with crippling walls with Scald and Knock Off, thus making it easier for them to clean through teams. Manaphy is vulnerable to Electric-type users like Thundurus, Sandy Shocks, and Regieleki, so it is recommended to pair it with an Electric-immunity like Volt Absorb Mandibuzz or Ground-types like Great Tusk and Garchomp. Manaphy can also be easily weakened by entry hazards, so it is advised to pair it with reliable hazard removers like Corviknight and Great Tusk.</p>"
      },
      "Tail Glow": {}
    },
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Samurott-Hisui": {
    "outdated": true,
    "sets": {
      "Choice Band": {
        "description": "<p>Hisuian Samurott is a decent wallbreaker due to Adaptability, Choice Band, and a great STAB combination that also pressures the ever-present Corviknight to choose between recovery and Defogging. Ceaseless Edge is a versatile move that deals good damage to foes while also setting up Spikes, helping Hisuian Samurott's teammates or even itself to pick off chipped foes later in the game. Knock Off provides utility by removing items from switch-ins such as Corviknight and Quaquaval. Sucker Punch is a good priority move that lets Hisuian Samurott deal heavy damage to faster foes such as Cinderace, Iron Moth, and Zapdos. Brick Break can be used instead to deal with dual screens leads such as Corviknight and Mew. Hisuian Samurott's ability to set up Spikes and pester defensive Pokemon such as Corviknight and Scream Tail by removing their items is appreciated by various offensive teammates such as Chien-Pao and Galarian Zapdos that can take advantage of chipped foes. Fluffy and Intimidate Quaquaval wall Hisuian Samurott very easily, so spinblockers such as Desolate Land Skeledirge and Ceruledge are good partners as they can pressure Quaquaval and block it from removing Spikes set by Hisuian Samurott. Hisuian Samurott is susceptible to getting revenge killed due to low Speed and bulk, so robust walls such as Corviknight and Meloetta that can pivot and provide safe switch in opportunities to it are appreciated.</p>"
      },
      "Swords Dance": {"description": "<p>After a Swords Dance boost, Hisuian Samurott becomes a terrifying wallbreaker that can dent physically defensive walls like Corviknight. Sucker Punch acts as speed control against Pokemon like Zapdos and Iron Moth. Ceaseless Edge forces defensive Pokemon, such as Corviknight, to switch in and choose between entry hazard removal or healing. Black Glasses is the item of choice, boosting its Dark-type moves without the recoil of Life Orb. Pokemon like Thundurus and Iron Moth are very useful teammates, as they compensate for Hisuian Samurott's average Speed tier and can heavily damage physical walls that counter Hisuian Samurott like Quaquaval and Zamazenta-C. In return, Hisuian Samurott wears down special walls with its ability to set up a layer of Spikes. Additionally, due to its unimpressive bulk, Hisuian Samurott relies on walls such as Corviknight and Hisuian Goodra to compensate for the lack of defensive utility it brings.</p>"}
    },
    "credits": {"writtenBy": [{"username": "LOrd Fernado", "user_id": 629794}, {"username": "Frozoid", "user_id": 532881}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Atha", "user_id": 450411}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Lilligant-Hisui": {"outdated": true, "sets": {"Fluffy": {}, "Sword of Ruin": {}}},
  "Haxorus": {"outdated": true, "sets": {"Protean": {}}},
  "Mandibuzz": {"sets": {"Physically Defensive": {}, "Volt Absorb": {}}},
  "Hydreigon": {
    "outdated": true,
    "sets": {
      "Nasty Plot": {},
      "The Clicker (Choice Specs)": {
        "description": "<p>Utilizing its high Special Attack, Beads of Ruin, powerful STAB attacks, and solid coverage options, Hydreigon is a formidable wallbreaker that can tear down the tier’s most robust special walls like Hisuian Goodra, Meloetta, and Blissey over the course of a game. Focus Blast is a powerful option to muscle past Hisuian Goodra, Blissey and Zamazenta-C. U-turn allows Hydreigon to provide additional utility as a pivot, ease prediction, and maintain momentum against switch-ins like Blissey and Diancie, while Flash Cannon serves as an option to handle the Fairy-type switch-ins like Enamorus-T and Diancie that Hydreigon would otherwise struggle to beat. Hydreigon has unimpressive Speed and can be revenge killed quite easily by threats such as Slither Wing, Chien-Pao, and Pixilate Scream Tail, so walls that can handle these like RegenVest users, Corviknight, and Quaquaval are appreciated, with the latter two being able to pivot Hydreigon in. Powerful physical wallbreakers like Galarian Zapdos and Slither Wing are appreciated, forming a potent VoltTurn core with Hydreigon if it opts for U-turn, handling the special walls that Hydreigon can struggle against, and pivoting in Hydreigon to break the physical walls they may struggle with.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "Tranquility", "user_id": 475288}, {"username": "KarpeChan", "user_id": 536333}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Volcarona": {
    "outdated": true,
    "sets": {
      "Quiver Dance": {},
      "Fast Support": {
        "outdated": true,
        "description": "<p>Volcarona serves as a solid support pokemon with valuable defensive utility to check the likes of Hariyama and Glaceon. Fiery Dance lets Volcarona increase its Special Attack without having to setup, while Flamethrower has more PP and immediate power. U-turn allows Volcarona to maintain momentum, while Quiver Dance serves as an option to go for a potential late-game sweep. Will-O-Wisp cripples switch-ins like Garganacl and is generally great for weakening physical attackers like Quaquaval. Teammates such as Meowscarada and Roaring Moon appreciate Volcarona's ability to sponge priority moves from Slither Wing and Hatterene. Bulky Ground-types like Ting-Lu and Donphan also benefit from Volcarona ability to somewhat safely switch into offensive Water-types such as Inteleon and non-Brave Bird Quaquaval. Volcarona is walled by common Well-Baked Body users like Kingambit and Corviknight, so attackers like Quaquaval and Sandy Shocks are helpful for breaking through them. Volcarona can also have trouble getting past Fire-resistant specially defensive walls that resist fire like Roaring Moon and Garganacl, so a physical wallbreaker such as Slither Wing is recommended.</p>"
      },
      "Offensive": {
        "outdated": true,
        "description": "<p>Volcarona serves as a passable late-game sweeper after checks such as Well-Baked Body Corviknight and special walls such as Garganacl, Blissey, and Clodsire have been eliminated from the game. Volcarona wants to quickly rack up stat boosts with Quiver Dance and Fiery Dance to sweep the enemy team while also providing a Water immunity in the form of Desolate Land. Alternatively, Volcarona can opt for Storm Drain to turn fast Primordial Sea users such as Greninja and Barraskewda into setup fodder. Will-O-Wisp is preferred on the last slot to cripple physical attackers such as Garchomp and Quaquaval, which seek to exploit Volcarona's low Defense, but Volcarona can run Bug Buzz to threaten bulky phazers such as Ting-Lu and RegenVest Roaring Moon or Psychic to chunk Haze users such as Toxapex and Clodsire. Volcarona is completely walled by Well-Baked Body Steel-types such as Corviknight and Kingambit; thus, partners such as Sandy Shocks help to eliminate them in the early-game. While Giga Drain can hurt Garganacl, Volcarona's massive weakness to Rock means it doesn't want to stay into Garganacl at all; thus, teammates such as Magic Guard Quaquaval are particularly helpful. Lastly, Volcarona appreciates entry hazard setters such as Garchomp and Clodsire, as the chip damage allows Volcarona to sweep more effectively.</p>"
      }
    }
  },
  "Thundurus": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Thundurus's excellent Special Attack, good Speed and coverage, and access to Nasty Plot allow it to function as a great wallbreaker. Focus Blast threatens RegenVest Roaring Moon, Hisuian Goodra, and Volt Absorb Empoleon. Psychic threatens Kommo-o, Great Tusk, and Iron Moth, while Sludge Bomb threatens Scream Tail. Sheer Force offers more power, letting Thundurus OHKO Garganacl with Focus Blast. Magic Guard lets Thundurus avoid chip damage and lets Sludge Bomb potentially poison switch-ins such as Kommo-o, specially defensive Garchomp, and Volt Absorb Mandibuzz; however, the drop in power significantly compromises its ability as a wallbreaker in exchange for utility. Fast cleaners like Meowscarada and Roaring Moon appreciate Thundurus being able to pressure their walls like Corviknight and Great Tusk, opening up the way for them to sweep late-game. Thundurus appreciates entry hazard support from the likes of Empoleon, Garchomp, and Sandy Shocks, as the chip damage from hazards allows Thundurus to secure OHKOs against Pokemon such as Hisuian Goodra and specially defensive Garchomp after a Nasty Plot, as well as Kommo-o, Iron Moth, and Volt Absorb Empoleon. Thundurus's poor bulk means it's OHKOed by most Pokemon faster than it, so walls such as Corviknight and Manaphy that can take hits for it and pivot it in are appreciated. Thundurus is prone to being worn down by Stealth Rock if not running Magic Guard, so entry hazard removers such as Great Tusk and the aforementioned Corviknight are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic1000", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Thundurus-Therian": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>A sky-high Special Attack stat combined with powerful coverage moves boosted by Sheer Force and access to Nasty Plot makes Thundurus-T a dangerous wallbreaker, able to threaten many common special walls such as Empoleon, RegenVest Manaphy, and Roaring Moon. Focus Blast threatens an OHKO on Volt Absorb Empoleon and a 2HKO on Blissey, RegenVest Roaring Moon, and Hisuian Goodra. Psychic threatens an OHKO on Kommo-o, Great Tusk, and Iron Moth. Fast cleaners like Azelf and Hisuian Electrode appreciate Thundurus-T being able to pressure their walls like Empoleon and Hisuian Goodra, respectively, opening up the way for them to sweep late-game. Thundurus-T appreciates entry hazard support from the likes of Kommo-o, Garchomp, and Sandy Shocks letting it more reliably OHKO specially defensive Garchomp and Hisuian Goodra after a Nasty Plot. Thundurus-T is prone to being chipped down by Stealth Rock and put in KO range of strong priority moves from threats like Dragonite and Ceruledge, so hazard removers like Great Tusk and Corviknight are appreciated. Thundurus-T is also easily revenge killed by most Pokemon that are faster than it like Chien-Pao and Meowscarada due to its low bulk and middling Speed, so walls such as Manaphy and the aforementioned Corviknight that can take a hit for it and safely pivot it in are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic1000", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Landorus": {"sets": {"Sheer Force": {}, "Desolate Land": {}}},
  "Landorus-Therian": {
    "outdated": true,
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Landorus-T is a specially defensive pivot with respectable offensive power to boot. Earthquake is its main STAB move, threatening offensive Steel- and Fire-types like Heatran and Iron Moth that fail to OHKO Landorus-T. U-turn allows Landorus-T to gain momentum and switch out, giving powerful-but-frail attackers like Chien-Pao and Iron Moth the ability to switch in for free. Rock Tomb and Sludge Bomb are used to whittle down Earth Eater Fire-types like Skeledirge and defensive Fairy-types like Scream Tail, respectively, with Rock Tomb being able to heavily damage Zapdos. Alternatively, Smack Down can be used to threaten switch-ins like Corviknight, (add comma) while Sandsear Storm can burn pivots like Garchomp. A Sassy nature with 0 Speed IVs lets Landorus-T underspeed defensive pivots like Garchomp, Scream Tail, and non-minimum Speed Corviknight with U-turn. RegenVest Landorus-T can form a powerful defensive VoltTurn core with physically defensive pivots like Corviknight and Iron Treads. Additionally, fast revenge killers and late-game sweepers like Chien-Pao and Hisuian Electrode benefit from slow pivots that can get them on the field without having to absorb an attack themselves. Due to its typing, Landorus-T does not act as an adequate switch-in to Water-type attackers like Volcanion; Water-resistant teammates like Dondozo and Water Absorb Iron Treads help mitigate this weakness.</p>"
      },
      "Fluffy": {
        "description": "<p>Fluffy makes Landorus-T a decent defensive pivot that can take hits from physical attackers such as Slither Wing, Kingambit, and Ursaluna. Stealth Rock + Smack Down makes Landorus-T a decent entry hazard setter against Corviknight, the most common hazard removal option; Smack Down also ensures that Talonflame can't use Landorus-T as setup fodder. Taunt can also be used to deny recovery to Corviknight and Scream Tail and setup opportunities to foes, such as Talonflame and Roaring Moon. Landorus-T best fits on balance and bulky offense teams, where it can provide defensive support against the aforementioned physical attackers. Common defensive Pokemon such as Corviknight, Hisuian Goodra, and Scream Tail are good teammates that can switch into Pokemon that threaten Landorus-T, such as Chien-Pao, Zapdos, and Quaquaval; Scream Tail can also provide Wish support. Landorus-T struggles to beat offensive Pokemon one-on-one, but its ability to safely pivot into teammates benefits fast offensive Pokemon such as Iron Moth, Greninja, and Chien-Pao.</p>"
      },
      "Well-Baked Body": {
        "description": "<p>With an added immunity to Fire, Landorus-T becomes a fantastic check to many of the Fire-types in the tier such as Cinderace, Ceruledge, and Iron Moth that also doubles as an entry hazards setter and a pivot. It differentiates itself from Garchomp as a Fire-type answer with its immunity to Will-O-Wisp as well as access to U-turn and Smack Down, allowing it to generate momentum and pressure Corviknight and other Flying-types. It can further capitalize on this added offensive presence with Swords Dance, especially if it has activated Well-Baked Body beforehand. Alternatively, running Hammer Arm over Smack Down allows it to still beat Earth Eater Heatran by itself and potentially hit Earth Eater Iron Treads hard on the switch. As a Fire-type answer, it makes a fantastic partner for Corviknight, which also appreciates its Fighting resistance to help against Pokemon like Slither Wing and in turn can handle many strong wallbreakers such as Roaring Moon and Chien-Pao that Landorus-T lacks the bulk and recovery to answer. Landorus-T also benefits RegenVest Pokemon such as Hisuian Goodra and Meloetta by preventing them from getting overwhelmed by strong Fire-type attacks and, in the case of Hisuian Goodra, helping against Ground-types such as Sandy Shocks and Landorus, while in return they handle the many special attackers in the tier. Water-immune partners, such as Desolate Land Heatran and Ceruledge, make good teammates for Landorus-T as well. Frail wallbreakers such as Chien-Pao and Cinderace also benefit from its pivoting ability to enter the battlefield safely as well as the hazards its sets to wear down their checks.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}, {"username": "Frozoid", "user_id": 532881}, {"username": "Don Vascus", "user_id": 322272}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "Isaiah", "user_id": 375662}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Adeleine", "user_id": 517429}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Meloetta": {
    "sets": {
      "RegenVest": {
        "description": "<p>Meloetta is a good slow pivot, being able to wall Pokemon like Gengar, Hisuian Electrode, and Iron Moth. Thunderbolt hits Water- and Flying-types like Empoleon, Corviknight, and physically defensive Mandibuzz. Low Kick can be used to chip down Hisuian Goodra, Heatran, and Kingambit, while Knock Off is used to cripple Pokemon like Corviknight for its teammates by removing their item. Offensive teammates such as Walking Wake, Barraskewda, and Weavile appreciate Meloetta's ablilty to take a hit and pivot them in safely. Meloetta is vulnerable to being worn down by entry hazards, so hazard removal from Great Tusk, Corviknight, and Mandibuzz is appreciated. Physical attackers such as Dragonite, Barraskewda, and Ceruledge threaten Meloetta, making it pair well with other walls like Scream Tail for Dragonite and Kommo-o for Barraskewda and Ceruledge. Offensive pivots such as Iron Moth, Roaring Moon, and Meowscarada make great partners for Meloetta, forming a VoltTurn core with it and bringing it in on foes to take a hit while it safely pivots them onto the field in return. Physically defensive pivots like Corviknight, Zapdos, and Quaquaval pair well with Meloetta, as it can pivot them in to cover its weakness to strong physical attackers like Roaring Moon, Dragonite, and Chien-Pao. In return, Meloetta can pivot in to help handle special attackers like Iron Moth, Sandy Shocks, and Scream Tail that threaten these defensive pivots</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yokoisop", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Kinetic1000", "user_id": 552227}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Chesnaught": {"outdated": true, "sets": {"Triage": {}, "Well-Baked Body": {}}},
  "Greninja": {
    "outdated": true,
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Greninja is a powerful offensive threat and pivot that uses its rain-boosted attacks to break past most neutral foes. Dark Pulse helps deal with common Desolate Land users like Iron Moth and Cinderace. Ice Beam provides coverage against Dragon-types like Goodra and Roaring Moon, while Surf lets Greninja clean up weakened teams without relying on the low PP and accuracy of Hydro Pump. U-turn lets Greninja switch out from its checks while still maintaining momentum, forming a VoltTurn core with physical wallbreakers like Galarian Zapdos and Cinderace that can threaten the specially defensive Pokemon that wall Greninja like Blissey and Hisuian Goodra. Greninja pairs well with entry hazard setters such as Ting-Lu and Garchomp, which can help it wear down its checks. Greninja also appreciates hazard removal from Pokemon like Corviknight and Iron Treads to avoid getting worn down when switching in; these two Pokemon can also pivot in Greninja.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yokoisop", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Talonflame": {
    "sets": {
      "Magic Guard": {
        "description": "<p>Talonflame is a fast late-game sweeper that uses its good Speed tier, powerful Brave Bird, and bevy of utility options to pick and choose its counters. With Swords Dance, it's able to set up and clean up games while being able to and take on pokemon Pokemon that would normally take its Brave Bird like Corviknight, physically defensive Manaphy, and Ogerpon-C, while Flare Blitz can be used as a way to break through other foes that would otherwise take on its Brave Bird such as Fluffy Zapdos and Heatran. Taunt allows Talonflame to set up on Pokemon with Unaware that would usually slow it down or wall it with healing like Blissey, Scream Tail, and Cresselia, while Will-O-Wisp can be used to cripple switch-ins, support teammates, and wear down checks to Talonflame like Garganacl, Primordial Sea Zapdos, and Garchomp. Pivots such as Corviknight, Barraskewda, and Manaphy like being able to pivot into Talonflame for it to set up a sweep or to take down certain threats and walls for them like Ogerpon-H, Ogerpon-W, and Kommo-o. Talonflame is forced out by Pokemon that are faster than it or have strong priority such as Barraskewda, Chien-Pao, Dragonite, and Choice Scarf Azelf, which can be taken on with teammates like Corviknight, Scream Tail, and Gholdengo.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Hiusi guy", "user_id": 603640}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic1000", "user_id": 552227}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Florges": {"outdated": true, "sets": {"Defensive": {}}},
  "Sylveon": {"outdated": true, "sets": {"Unaware": {}}},
  "Hawlucha": {"outdated": true, "sets": {"Magic Guard": {}}},
  "Goodra": {"sets": {"RegenVest": {}}},
  "Goodra-Hisui": {"sets": {"RegenVest": {}}},
  "Diancie": {"outdated": true, "sets": {"Defensive": {}, "Triage": {}}},
  "Hoopa": {
    "outdated": true,
    "sets": {
      "Special Wallbreaker": {
        "description": "<p>Hoopa is a passable wallbreaker that fits on offensive teams, particularly when paired with Sticky Web support from Masquerain and Spidops and teammates that can pivot it in safely. Psyshock allows Hoopa to hit special walls like Blissey on their weaker physical bulk, while Knock Off cripples RegenVest users like Alolan Muk and Meloetta that can otherwise take a hit and threaten a KO or pivot out to a faster offensive threat like Chien-Pao. Focus Blast 2HKOes Hisuian Goodra and KOes Kingambit that would attempt to switch in. Defensive pivots that can take a hit and pivot out like Corviknight and Meloetta can get Hoopa in safely. Dual screens setters like Prankster Corviknight and Mew also make for a good partner, as they allow Hoopa to have an easier time setting up with Nasty Plot or tank a hit in a pinch and retaliate. Offensive pivots like Slither Wing and Galarian Zapdos pair well with Hoopa with their ability to bait in and pivot out on checks like Corviknight and defensive Zapdos, allowing Hoopa to set up and threaten a KO; faster offensive threats like Chien-Pao and Barraskewda also pair well with it by making up for its lackluster Speed while Hoopa threatens out their checks like defensive Quaquaval.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Volcanion": {
    "outdated": true,
    "sets": {
      "Primordial Sea": {
        "description": "<p>Primordial Sea Volcanion excels as a fantastic wallbreaker with its great Special Attack and offensive typing. Rain-boosted Steam Eruption combined with Choice Specs allows Volcanion to 2HKO most Pokemon in tier, including most specially defensive walls such as RegenVest Garchomp, Meloetta, and Alolan Muk. Weather Ball dissuades promient Desolate Land users that might want to switch in to Volcanion such as Cinderace and Iron Moth. Earth Power is a more reliable way to deal with Desolate Land users like Iron Moth and Heatran, and it's a reliable way to hit Hisuian Goodra without missing. Focus Blast 2HKOes a would-be check in RegenVest Roaring Moon, as well as Hisuian Goodra after Spikes chip. Volcanion pairs well with entry hazard setters like Ting-Lu and Garchomp, which help wear down common RegenVest Pokemon like Goodra and Hisuian Goodra, and hazards also guarantee a 2HKO on Meloetta. Due to Volcanion's Stealth Rock weakness it pairs well with hazard removers like Corviknight and Quaquaval, which can also help pivot it in safely. Volcanion also pairs well with offensive pivots like Zapdos and Roaring Moon, which can help bring it in on targets like Corviknight.</p>"
      },
      "Magic Guard": {
        "description": "<p>Magic Guard Volcanion serves as a great mixed wallbreaker with a typing that also offers defensive utility. Flare Blitz is notably able to 2HKO RegenVest users like Hisuian Goodra and Meloetta, and Steam Eruption's burn chance deters would-be switch-ins like defensive Quaquaval and Garchomp. Earth Power reliably threatens Toxapex and Desolate Land users such as Iron Moth, Skeledirge, and Cinderace. Taunt can be used to hinder defensive walls with recovery such as Scream Tail and Quaquaval, while Will-O-Wisp is able to reliably burn switch-ins like defensive Quaquaval and Garchomp. Flame Charge is also a niche option to outspeed common revenge killers to Volcanion like Zapdos, Hisuian Arcanine, and Choice Band Galarian Zapdos. Magic Guard helps Volcanion with its weakness to entry hazards while also negating recoil from Flare Blitz and Life Orb. Offensive pivots such as Slither Wing and Iron Moth can bring Volcanion in against defensive cores featuring staples like Intimidate Corviknight and RegenVest users. Fast late-game cleaners like Chien-Pao and Regieleki also appreciate Volcanion's ability to weaken defensive checks like Quaquaval and common RegenVest users, which can allow them to take over games, while also providing speed control against faster threats to Volcanion like Zapdos, Hisuian Electrode, and Roaring Moon. Volcanion's susceptibility to being revenge killed by aformetioned threats makes defensive partners such as Corviknight and Meloetta essential, as they can tank hits and also help pivot to bring in Volcanion safely. Despite being immune to hazards, Volcanion still lacks recovery, so a teammate that can grant it longevity like Wish Scream Tail is also appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yokoisop", "user_id": 617542}, {"username": "I am BONK", "user_id": 603931}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Decidueye": {"outdated": true, "sets": {"Defensive": {}}},
  "Lycanroc": {"outdated": true, "sets": {"Rocky Payload": {}}},
  "Toxapex": {
    "outdated": true,
    "sets": {
      "Physically Defensive": {
        "description": "<p>Toxapex is a stout physically defensive wall that deters common physical attackers like Galarian Zapdos and Ceruledge. Toxic targets foes that commonly run Heavy-Duty Boots or are Ground immune like Cinderace and Galarian Zapdos, while Toxic Spikes provides excellent team support; Corrosion variants should always run Toxic to punish common switch-ins like Corviknight and Hisuian Goodra that otherwise might use Toxapex as free recovery. Prankster + Haze, on the other hand, is an excellent tool to frustrate hyper offense teams and stop dangerous setup sweepers like Chien-Pao, Polteageist, and Chesnaught. While the consistent recovery of Black Sludge is generally preferred, Rocky Helmet allows Toxapex to annoy non-Magic Guard Galarian Zapdos and Chien-Pao even when it is forced to use Recover. Toxapex is utterly unable to threaten most Magic Guard users, like Galarian Zapdos and especially Water-resistant ones like Hisuian Electrode and Quaquaval, so reliable checks to them like Hisuian Goodra and Fluffy Corviknight are recommended. Toxic Spikes variants appreciate spinners like Iron Treads, as they can provide entry hazard removal without removing Toxic Spikes as well. Toxapex can easily be overwhelmed by multiple attackers, so it should always have a secondary physically defensive teammate, especially one that handles Ground-types, like Intimidate Corviknight; this also relieves some of the pressure off of Toxapex of checking pivots without Regenerator.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "UT", "user_id": 523866}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Palossand": {"outdated": true, "sets": {"Physically Defensive": {}}},
  "Kommo-o": {
    "sets": {
      "Defensive": {
        "description": "<p>Kommo-o uses its unique typing and excellent bulk to serve as an fantastic physical wall, taking on the likes of Barraskewda, Meowscarada, and Roaring Moon while also taking advantage of the turns it generates by forcing these wallbreakers out to set up Stealth Rock. Body Press chips hazard removal options like Corviknight and Quaquaval, while Dragon Tail forces foes out, quickly racking up entry hazard chip on the opposing team. Iron Defense bolsters Kommo-o's walling capabilities and Body Press's damage output, turning it into a potential late-game wincon. Intimidate Corviknight is a good partner for Kommo-o, taking on the Ice-, Flying-, and Dragon-types that threaten it like Weavile, Galarian Zapdos, and Dragonite, while Kommo-o takes on the Electric- and Fire-types like Hisuian Electrode, Ogerpon-H, and Ceruledge that Corviknight struggles with. Empoleon particularly makes for another good partner with its ability to check Fairy- and Psychic-types like Enamorus-T and Azelf. Offensive pivots like Azelf and Barraskewda appreciate Kommo-o wearing down their checks like Corviknight and Roaring Moon, allowing them to form powerful a VoltTurn core that takes advantage of Kommo-o's Stealth Rock to quickly wear down those checks.</p>"
      },
      "Triage": {
        "description": "<p>Triage Kommo-o serves as the tier's do-or-die sweeper, using Belly Drum to boost its Attack to staggering levels. Drain Punch, in combination with Triage, allows it to virtually outprioritize the whole tier and regain the health lost from Belly Drum. Earthquake OHKOes non-Prankster Toxapex, which can otherwise use Haze to remove Kommo-o's stat boosts, Rock Slide OHKOes Zapdos, while Poison Jab hits Fairy-types like Scream Tail and Enamorus-T. While a Sitrus Berry improves Kommo-o's longevity, a Life Orb allows it to have good odds of OHKOing standard Dragon Dance Dragonite with Drain Punch. Unaware Scream Tail completely walls Kommo-o, taking minimal damage from Poison Jab bar the occasional poison, threatening a 2HKO in return with Dazzling Gleam, and healing off the damage sustained from Poison Jab with Wish. Hence, wallbreakers that can heavily wear down Scream Tail like Gengar and Cinderace make for good partners. Azelf and Ghost-types like Gengar and Ceruledge are immune to Drain Punch and threaten Kommo-o in return; therefore, teammates that threaten and remove these Pokemon like Weavile and Roaring Moon make for excellent teammates. Dual screens Mew pairs well with Kommo-o, allowing Kommo-o to set up with Belly Drum safely.</p>"
      },
      "Galvanize": {
        "description": "<p>Galvanize Kommo-o stands out as one of the tier's few mixed attackers while being flexible in its role as a Stealth Rock setter or setup sweeper depending on what its team requires. Boomburst denies Corviknight, Mandibuzz, and Quaquaval from removing hazards by unexpectedly OHKOing them, while Clanging Scales 2HKOes Great Tusk. Close Combat allows Kommo-o to threaten special walls like Hisuian Goodra and Blissey looking to switch into it and tank its special moves freely. With Kommo-o's ability to maintain Stealth Rock, it becomes an extremely effective offensive Stealth Rock setter when running it as its 4th move; alternatively, Clangorous Soul improves its bulk, damage output, and Speed, making it harder to revenge kill and allowing it to clean teams late-game. A Life Orb is preferred on Stealth Rock variants for consistency, while Throat Spray is better for Clangorous Soul variants to reduce the chip taken by Kommo-o while still increasing its damage output. Wallbreakers like Meowscarada and Chien-Pao appreciate Kommo's ability to remove checks like Corviknight and Quaquaval, allowing them to clean up after. Faster offensive pivots like Azelf and Barraskewda appreciate Kommo-o's Stealth Rock when forming a VoltTurn core, which wears down the opposing team quickly, or Kommo-o's ability to clean up with Clangorous Soul after they have heavily chipped the opposing team. Kommo-o requires good defensive pivots like Corviknight and RegenVest Manaphy as teammates, with their ability to switch into revenge killers that threaten Kommo-o like Weavile, Dragonite, and Enamorus-T and pivot out.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Cinderace": {
    "sets": {
      "Swords Dance": {},
      "Utility": {},
      "Magic Guard": {
        "description": "<p>Magic Guard Cinderace provides a blend of utility and firepower in a single teamslot; this in combination with its excellent Speed tier lets it serve as either a strong pivot or wallbreaker. Magic Guard allows Cinderace to fire off its strong Flare Blitz and use Life Orb without recoil while negating entry hazard chip damage. High Jump Kick forces out Garganacl and Well-Baked Body Kingambit as well as being the strongest move against neutral targets like Quaquaval and Mandibuzz. U-turn allows Cinderace to pivot out on switch-ins like Well-Baked Body Corviknight and Quaquaval, while Swords Dance changes its role from a pivot to a wallbreaker and late-game cleaner. Gunk Shot further increases its coverage, preying on Fairy-types like Scream Tail and Enamorus-T and threatening switch-ins like Primordial Sea Zapdos and Dragonite, while Will-O-Wisp allows it to cripple its switch-ins like Regenerator Great Tusk and physically defensive Garchomp, and Court Change allows it to control hazards in a pinch. Cinderace's ability to force out Steel-types like Corviknight is greatly appreciated by other physical wallbreakers like Chien-Pao and Galarian Zapdos, which in return can remove Corviknight if it is running Well-Baked Body for Cinderace so it can clean up afterwards. Cinderace is vulnerable to revenge killers like Dragonite, Barraskewda, and Azelf, making walls like Corviknight, defensive Zapdos, and RegenVest Manaphy good partners that can switch into these revenge killers and pivot out. Well-Baked Body Gholdengo completely shuts down Cinderace, so teammates that can remove it like Gengar and offensive Roaring Moon make for great partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "Kinetic1000", "user_id": 552227}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Inteleon": {
    "outdated": true,
    "sets": {
      "Primordial Sea": {
        "description": "<p>Inteleon is a strong wallbreaker that fits well on balance and bulky offense teams. U-turn allows it to pivot out on switch-ins like Hisuian Goodra and Blissey while also forming strong VoltTurn cores with other pivots like Galarian Zapdos and Slither Wing that can wear down each other's checks with entry hazards up. Mud Shot allows it to threaten Desolate Land Fire-types like Iron Moth and Cinderace that would otherwise switch into Inteleon freely. Ice Beam allows it to chip specially bulky Dragon-types like RegenVest Roaring Moon and Goodra, while Surf acts as a more reliable option late-game when the opposing team has been heavily chipped or to snipe frailer or slower targets like Azelf and both Zapdos formes. Physical wallbreakers like Chien-Pao and Roaring Moon appreciate Inteleon pivoting into them on its switch-ins like the aforementioned Hisuian Goodra and Blissey as well as Inteleon's ability to threaten physical walls like Corviknight and defensive Quaquaval. Inteleon brings close to no defensive utility bar a Fire-type move immunity, which means that walls like Corviknight and Goodra are a must-have to make up for the lack of defensive utility; these Pokemon also switch into revenge killing attempts from Slither Wing and Regieleki. Inteleon appreciates Spikes support from Pokemon like Garchomp and Ting-Lu that helps it to wear down RegenVest Pokemon like Meloetta and Alolan Muk.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Tranquility", "user_id": 475288}]}]}
  },
  "Corviknight": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Corviknight is one of the best physical walls and Defog users in AAA thanks to its high Defense and good defensive typing, which, when paired with Intimidate, allow it to switch into common physical threats like Great Tusk, Roaring Moon, and Weavile. An immunity ability like Volt Absorb or Well-Baked Body may be run to allow Corviknight to switch into Electric- or Fire-type attacks from the likes of Sandy Shocks or Ceruledge but at the cost of no longer checking Chien-Pao and Galarian Zapdos. Brave Bird is a strong attack that threatens Kommo-o and Great Tusk and still hits Ceruledge, while Body Press leverages Corviknight's Defense to OHKO Weavile and Chien-Pao. Minimum Speed and U-turn give Corviknight excellent utility as a slow pivot to bring in offensive teammates, while Bulk Up or Iron Defense can be run on immunity ability sets to set up on a Pokemon struggling to damage Corviknight. Due to its average Special Defense, Corviknight appreciates specially defensive teammates like Hisuian Goodra, Roaring Moon, and Manaphy that can form a solid defensive core with it. Corviknight is primarily a utility Pokemon, so it pairs well with offensive teammates like Azelf and Barraskewda, which in return make use of Corviknight's ability to safely pivot them in. A secondary physically defensive teammate like Manaphy or Quaquaval that can handle Fire- and Ice-types that Corviknight can struggle against helps it to more consistently check Pokemon like Great Tusk, Roaring Moon, and Meowscarda.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Drednaw": {"outdated": true, "sets": {"Shell Smash": {}}},
  "Barraskewda": {
    "sets": {
      "Primordial Sea": {
        "description": "<p>Barraskewda, with its fantastic Speed tier that surpasses nearly the entire unboosted metagame, great Attack, and Primordial Sea-boosted STAB moves, is a premier offensive pivot and cleaner, running circles around most of the tier. Close Combat provides fantastic coverage, threatening an OHKO on Hisuian Goodra and incoming Desolate Land Heatran while 2HKOing Zamazenta-C. Aqua Jet provides strong priority to revenge kill weakened Choice Scarf users such as Sandy Shocks, Slither Wing, and Volcarona, while Psychic Fangs or Drill Run provides coverage against Water-resistant foes, with Psychic Fangs targeting Kommo-o, Quaquaval, and Toxapex, and Drill Run being stronger against Iron Moth, Ceruledge, and Cinderace. Barraskewda is very frail and appreciates bulky pivots such as Corviknight, Zapdos, and Manaphy, which can take a hit such as Dragonite's Extreme Speed or Azelf's Expanding Force and bring it in safely to threaten the foe. Barraskewda performs well alongside specially offensive pivots such as Walking Wake and Iron Moth, threatening the checks such as Hisuian Goodra and Garchomp that they would otherwise struggle to break, while in return they threaten Barraskewda'schecks such as Fluffy Corviknight and Zapdos. Due to its frailty, Barraskewda appreciates entry hazard removers such as Great Tusk, Corviknight, and Quaquaval, ensuring it can come in as many times as possible to threaten the foe without fainting to hazard chip. Likewise, Barraskewda appreciates hazard setters such as Garchomp and Kommo-o wearing down checks such as Scream Tail and Desolate Land users over the course of a game, also securing a 2HKO on Manaphy lacking Defense investment with Close Combat after Stealth Rock damage.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Toxtricity": {"outdated": true, "sets": {"Shift Gear": {}, "Choiced Attacker": {}}},
  "Polteageist": {
    "outdated": true,
    "sets": {
      "Queenly Majesty": {},
      "Fluffy": {},
      "Shell Smash": {
        "outdated": true,
        "description": "<p>Polteageist is a dangerous setup sweeper and cleaner thanks to Shell Smash, Stored Power, and its excellent Special Attack, allowing it to sweep with a single turn of setup. Giga Drain provides coverage for Ting-Lu and Garganacl, Strength Sap gives Polteageist a way to restore its Focus Sash after chip damage and set up on weaker physical attackers, while Substitute allows for safe setup on status-reliant walls like Blissey. Focus Sash the preferred item to safely ensure Polteageist can use Shell Smash. Polteageist can often struggle to get itself onto the field safely, so it appreciates a slow pivot from Corviknight or Shed Tail Cyclizar who can also facilitate Polteageist's setup with screens or a passed Substitute. Polteageist pairs well with physical wallbreakers like Swords Dance Cinderace that can break through opposing walls. Due to its reliance on Focus Sash, Polteageist needs reliable entry hazard removal like Cyclizar and Iron Treads.</p>"
      }
    }
  },
  "Hatterene": {"outdated": true, "sets": {"Triage": {}}},
  "Zamazenta-Crowned": {
    "sets": {
      "IronPress": {
        "description": "<p>Zamazenta-C leverages its high bulk and Speed to be an excellent setup sweeper with Iron Defense + Body Press while also being able to check many of the tier's dangerous offensive threats with its excellent defensive typing. Zamazenta-C can only use Dauntless Shield, which increases its potency as a setup sweeper while boosting Body Press. Stone Edge threatens an OHKO on Iron Moth while 2HKOing Dragonite, Ceruledge, and Primordial Sea Zapdos. Substitute can be used to block status and phazing moves, notably surviving a Scald from defensive Manaphy and a Dragon Tail from Garchomp, as well as pivoting moves from defensive Pokemon such as Corviknight, Empoleon, Mandibuzz, and Manaphy. Special wallbreakers such as Gengar, Azelf, and Walking Wake appreciate Zamazenta-C being able to threaten switch-ins to them such as Empoleon, Hisuian Goodra, and RegenVest Roaring Moon, as well as offensive checks such as Weavile, Roaring Moon, and Ogerpon-C, as the aforementioned teammates are otherwise forced out by the threat of an OHKO; in return, they can remove Zamazenta-C's checks, such as defensive Kommo-o and Zapdos. Zamazenta-C struggles with physically defensive Pokemon that can counter it by setting up on their own, such as Iron Defense Kommo-o and Corviknight, as well as Bulk Up Great Tusk, so teammates that can check them such as Zapdos and Scream Tail are appreciated, with the latter being able to pass Wishes to Zamazenta-C. Zamazenta-C is also weak to entry hazards, so teammates that can remove hazards such as Corviknight and Great Tusk are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic1000", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Zarude": {"outdated": true, "sets": {"Adaptability": {}, "Fluffy": {}}},
  "Regieleki": {
    "sets": {
      "Refrigerate": {},
      "Special Refrigerate": {
        "outdated": true,
        "description": "<p>Regieleki makes use of its amazing Speed along with Refrigerate to be a solid offensive spinner and pivot that cannot be spinblocked; it also threatens Ground-types that could otherwise switch in and block Volt Switch such as Garchomp, Landorus-T, and Sandy Shocks with Tera Blast. Thunderbolt is a stronger STAB option to use on switch-ins such as Iron Moth and Skeledirge, forcing them to use their recovery moves while Regieleki can pivot out, while Explosion can be used to heavily chip common RegenVest users like Hisuian Goodra and Meloetta, opening up opportunities for Regieleki's teammates like Iron Moth and Enamorus-T. Heavy-Duty Boots is the preferred item, as it allows Regieleki to have better longevity for spinning and pivoting, but Never-Melt Ice and Life Orb can also be used to make Tera Blast and Explosion more potent. Since Regieleki has a very high natural Speed tier, an alternative EV spread of 244 HP / 252 SpA / 12 Spe can be ran with a Mild nature to have more bulk while still being able to outspeed every unboosted Pokemon in the tier. Due to its frail bulk, it is highly recommended to pair Regieleki with another spinner such as Quaquaval or Iron Treads, as they can take hits from common hazard setters like Garchomp and allow Regieleki to pivot in teammates more freely with Volt Switch. Regieleki also pairs up well with physical pivots like Galarian Zapdos, Slither Wing, and Meowscarada, as they can create a strong VoltTurn duo and threaten the Pokemon that Regieleki lures in such as Hisuian Goodra and Meloetta while Regieleki can pivot them in safely. Regieleki can struggle with breaking through bulky Pokemon such as Iron Treads and Scream Tail, so pairing it with a Pokemon that can break through both of them such as Zamazenta-C, Magic Guard Volcanion, or Heatran is advised.</p>"
      },
      "Physical": {"outdated": true}
    }
  },
  "Enamorus-Therian": {
    "sets": {
      "Triage": {
        "description": "<p>Triage lets Enamorus-T bypass its low Speed and use STAB Draining Kiss to revenge kill Fairy-weak threats like Chien-Pao, Weavile, and Roaring Moon. Furthermore, Enamorus-T doubles as a threatening sweeper by setting up with Calm Mind and Iron Defense. These moves improve Enamorus-T's already good natural bulk and let it shrug off attacks from revenge killers that can handle Draining Kiss like Cinderace and Ceruledge. Earth Power pairs well with Draining Kiss, since it hits Fire-, Poison-, and Steel-types that resist Draining Kiss, such as Ceruledge, Gengar, and Heatran. Life Orb boosts Enamorus-T's damage output to compensate for the low base power of Draining Kiss. Enamorus-T can switch into Ground-, Dragon-, and Fighting-types like Great Tusk and Kommo-o to set up. However, Steel-types that are immune to Earth Power, such as Earth Eater Gholdengo and Empoleon, completely wall Enamorus-T, so Fire-type Pokemon that prey on these Steel-types, such as Heatran and Iron Moth, make great partners. In exchange, Enamorus-T can wall Ground-type moves from Great Tusk and Garchomp that threaten the aforementioned Fire-types. If Enamorus-T has not set up, it can be vulnerable to super effective attacks from Pokemon that take Draining Kiss well, like Zapdos and Ogerpon-C. However, entry hazards can wear down many of these Pokemon into KO range of Draining Kiss. Enamorus-T's weakness to Stealth Rock limits its ability to set up, so hazard control from the likes of Corviknight and Great Tusk alleviate this. Finally, Psychic Surge Azelf completely prevents Enamorus-T from using Draining Kiss except on non-grounded foes, which increases the pool of Pokemon that can revenge kill it. Therefore, Enamorus-T likes to have a defensive teammates that can switch into Azelf and the foes that Azelf enables.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tbolt", "user_id": 555379}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Meowscarada": {"sets": {"Choice Item": {}}},
  "Skeledirge": {
    "outdated": true,
    "sets": {
      "Spinblocker": {
        "description": "<p>Thanks to its typing and good physical bulk, Skeledirge serves as an excellent spinblocker that can wall common spinners such as Iron Treads with Earth Eater and Quaquaval with Desolate Land. It also walls threats like Choice Band Cinderace and Zamazenta-C and, depending on its ability, Garchomp and Primordial Sea Zapdos. Skeledirge can then use Torch Song to set up on passive opponents like Scream Tail and non-Well-Baked Body Blissey or Will-O-Wisp to burn an incoming foe, including switch-ins like Hisuian Goodra and Alolan Muk. Hex alongside Will-O-Wisp does more damage, but Shadow Ball can be used for more consistent damage. Skeledirge pairs well with hazard setters such as Garchomp and Iron Treads, as it allows them to keep their hazards on the field, and they can in turn handle opposing Well-Baked Body Pokemon. Due to its middling Special Defense, Skeledirge appreciates specially defensive teammates like Blissey and Hisuian Goodra. Additionally, a teammate that covers the type that Skeledirge chooses not to be immune to, such as Quaquaval for Earth Eater variants and Corviknight for Desolate Land variants, helps form a strong defensive core. Dark-types like Meowscarada and Chien-Pao also OHKO Skeledirge with a bit of chip damage, so Pokemon like Galarian Zapdos and Slither Wing that can threaten them are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "cat", "user_id": 580765}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Quaquaval": {
    "sets": {
      "Intimidate": {},
      "Magic Guard": {},
      "Defensive": {
        "outdated": true,
        "description": "<p>Defensive Quaquaval uses its good physical bulk and typing to act as a physically defensive pivot, checking dangerous threats like Kingambit, Chien-Pao, and Hisuian Arcanine. Intimidate allows Quaquaval to weaken foes like Chien-Pao and Cinderace for its teammates, while Fluffy grants better bulk to better check Slither Wing and Roaring Moon. U-turn allows Quaquaval to maintain momentum and allows frailer teammates like Slither Wing and Hydreigon to pivot in safely while Rapid Spin offers role compression by allowing it to remove hazards while having a good matchup against entry hazard setters like Iron Treads and Garchomp. A Relaxed nature and 0 Speed IVs allow it to pivot out as slow as possible. Meloetta is a valuable teammate that can switch in on special threats such as Iron Moth and Zapdos that force Quaquaval out. Physical wallbreakers like Meowscarada and Talonflame have a good type matchup against Quaquaval, hence teammates that can force them out like Zamazenta-C and Regieleki make solid partners.</p>"
      }
    }
  },
  "Spidops": {"sets": {"Sticky Web Setter": {}}},
  "Pawmot": {"outdated": true, "sets": {"Offensive": {}}},
  "Garganacl": {
    "sets": {
      "Immunity Ability": {},
      "Specially Defensive": {
        "outdated": true,
        "description": "<p>Garganacl finds itself as a Stealth Rock setter that fits on balance and stall teams with its ability to force progress through passive damage and maintain entry hazards by annoying popular hazard removal options with Salt Cure. Toxic Debris allows Garganacl to punish weak physical attacks like U-turn from Corviknight and Meloetta, while Earth Eater allows it to check and set up with Iron Defense or Curse on Ground-types like Iron Treads, Landorus-T, and Garchomp, and Water Absorb allows it to check Greninja, Inteleon, and Quaquaval lacking Close Combat. Stealth Rock pairs well with Salt Cure, as Salt Cure heavily chips common hazard removal options like Iron Treads and Corviknight, while Iron Defense and Curse allow Garganacl to act as a bulky cleaner late-game. Protect allows Garganacl to scout the opponent's move, heal with Leftovers, and force more passive damage on foes, while Earthquake and Body Press hit Magic Guard Pokemon like Quaquaval and Heatran that otherwise switch in freely. Garganacl's inability to check common special wallbreakers like Sheer Force Iron Moth and Enamorus-T makes pivots like Regieleki and Slither Wing and physical wallbreakers like Chien-Pao great partners; in return, they appreciate Garganacl's ability to maintain Stealth Rock on the field and annoy their checks like Hisuian Goodra and Corviknight with Salt Cure. Garganacl gets rapidly worn down by entry hazards when carrying Leftovers, making physically defensive hazard removal options like Corviknight and defensive Quaquaval good partners; these Pokemon also check physical wallbreakers that threaten Garganacl like Galarian Zapdos, while it checks the special wallbreakers that threaten them. The aforementioned Magic Guard Quaquaval checks Garganacl lacking Iron Defense + Body Press and can spin away Garganacl's Stealth Rock; Desolate Land Skeledirge can spinblock Quaquaval effectively, making it a good partner for Garganacl.</p>"
      }
    }
  },
  "Ceruledge": {
    "sets": {
      "Desolate Land": {
        "description": "<p>Thanks to its great offensive typing, excellent coverage, and high Attack stat, Ceruledge makes for a good wallbreaker in the tier. Close Combat threatens Roaring Moon and Garganacl, while Shadow Sneak is used to pick off faster foes like Gengar and weakened foes like Iron Moth, Barraskewda, and opposing Ceruledge, making up for Ceruledge's mediocre Speed. Ceruledge appreciates being paired with entry hazard setters such as Sandy Shocks, Kommo-o, and Garchomp, which can put opposing Pokemon like Empoleon in range for Ceruledge to OHKO, as well as put opposing fast Pokemon in range for Shadow Sneak to OHKO. Faster foes like Roaring Moon, Meowscarada, and Azelf can threaten Ceruledge and force it out, so it pairs excellently with teammates like Great Tusk, Scream Tail, and Empoleon, which can wall these Pokemon, respectively. In return, Ceruledge can threaten their checks such as Scream Tail for Great Tusk and Heatran for Scream Tail. Pivots such as Manaphy, Meloetta, and Corviknight are also nice partners for Ceruledge, as they can bring it in on Pokemon it checks.</p>"
      },
      "Sword of Ruin": {
        "description": "<p>Sword of Ruin Ceruledge is a potent wallbreaker, thanks to its excellent coverage hitting almost everything in the tier for neutral damage, a high Attack stat, and Bitter Blade offsetting Life Orb recoil. Shadow Sneak picks off faster foes like Gengar and weakened Iron Moth, Hisuian Electrode, and Barraskewda, while Swords Dance can be used to boost Ceruledge's already high damage, letting it OHKO defensive Kommo-o, physically defensive Garchomp, and Zapdos. Close Combat OHKOes Roaring Moon, Well-Baked Body Kingambit, and Garganacl. Fast Pokemon such as Sandy Shocks, Walking Wake, and Chien-Pao force Ceruledge out, so it pairs excellently with bulky Pokemon that can wall them like RegenVest Roaring Moon, Empoleon, and Quaquaval, respectively; in return, Ceruledge can threaten their checks such as Scream Tail and Heatran. Ceruledge can quicky be worn down by Life Orb and entry hazard chip damage, so it appreciates hazard removal from the likes of Great Tusk, Corviknight, and Mandibuzz. Due to Ceruledge's frail defenses and several weaknesses, it often struggles to switch in, so pivots like Corviknight, Zapdos, and Manaphy pair excellently with it, being able to pivot it in on Pokemon it threatens.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yokoisop", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic1000", "user_id": 552227}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}, {"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Kilowattrel": {
    "outdated": true,
    "sets": {
      "Primordial Sea": {
        "description": "<p>Choice Specs Primordial Sea Kilowattrel is an explosive special attacker that takes advantage of Hurricane's and Thunder's accuracy buff in rain to rain down terror on unprepared while also checking Desolate Land users like Iron Moth and Cinderace. Weather Ball is Kilowattrel's best option against Ground-types like Iron Treads and Landorus-T which shrug off its other offensive options while also chipping Desolate Land Heatran and Cinderace. Pivoting partners like Landorus-T and Corviknight pair with Killowattrel to create a potent VoltTurn core, constantly creating momentum to easily bring each other in and deal big damage. Because of its ability to force switches, Kilowattrel appreciates teammates like Garchomp and Scream Tail that can both set entry hazards and mitigate its own frailty by switching in. Additionally, because of its weakness to Stealth Rock and inability to heal itself, hazard removers like Corviknight and Iron Treads are required to prolong its life and maximize the amount of times it can switch in. Finally, RegenVest users like Hisuian Goodra and Meloetta both comfortably shrug off Kilowattrel's attacks, so physically offensive teammates like Slither Wing and Chien-Pao can chip or remove them, escalating Kilowattrel's potency as a sweeper.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Brambleghast": {"outdated": true, "sets": {"Physically Defensive": {}}},
  "Tinkaton": {
    "outdated": true,
    "sets": {
      "Well-Baked Body": {},
      "Tinted Lens": {
        "description": "<p>Tinted Lens Tinkaton is a solid physical wallbreaker that provides utility while using Tinted Lens to bypass resistances to Gigaton Hammer, turning the tables on defensive Quaquaval and Corviknight, activating teammates like Choice Band Chien-Pao that are hindered by these Pokemon. Metal Coat can be considered as it grants Tinkaton a boosting option for Gigaton Hammer without recoil, granting good odds of OHKOing frailer offensive Pokemon like Ceruledge and Magic Guard Quaquaval after minor chip. Swords Dance allows Tinkaton to more effectively wallbreak, Knock Off is excellent utility that cripples switch-ins like Magic Guard Heatran and Volcanion while annoying switch-ins like Corviknight and Iron Treads, Stealth Rock allows it to act as an offensive entry hazard setter, Protect allows it to gain more Leftovers recovery on Gigaton Hammer's cooldown turn, and Thunder Wave cripples setup sweepers that may try to capitalize on Gigaton Hammer's cooldown turn. Tinkaton appreciates slow pivots like Corviknight and Meloetta that can live a hit and pivot in Tinkaton safely. Tinkaton also appreciates faster teammates that make up for its lackluster Speed like Roaring Moon and Hisuian Electrode. Entry hazard setters like Garchomp and Ting-Lu pair well with Tinkaton, as it forces numerous switches and removes Heavy-Duty Boots.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Palafin": {
    "outdated": true,
    "sets": {
      "Palafin": {
        "description": "<p>Palafin's powerful priority offense and pivoting make it a dangerous threat even with its standard ability. Jet Punch from Palafin-H easily revenge kills dangerous threats like Kilowattrel, Sandy Shocks, and Talonflame, as well as Chien-Pao after minor chip damage. Palafin is heavily hampered by Desolate Land; to take down their users, Zen Headbutt from Palafin-H easily OHKOes Iron Moth and 2HKOes Ceruledge, while Close Combat flings Cinderace into the sun. Pivoting teammates such as Kilowattrel, Meowscarada, and Corviknight not only form dangerous pivoting cores with Palafin, but also position it to both activate Zero to Hero and fire off its powerful Jet Punch. Due to its frequent need to switch and reliance on a recoil move to wallbreak, Palafin requires effective entry hazard removers like Corviknight and Donphan; WishPass Scream Tail is also a great teammate to heal off chip damage. Even with its strong coverage moves, Palafin struggles mightily against opposing Desolate Land, so reliable switch-ins like Well-Baked Body Slither Wing are strongly recommended. Palafin struggles against Dondozo, making teammates that can punish it like Meowscarada and Spikes Garchomp good additions.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "UT", "user_id": 523866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Alexender", "user_id": 313542}, {"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Glimmora": {"outdated": true, "sets": {"Defensive": {}}},
  "Dondozo": {"outdated": true, "sets": {"Curse": {}}},
  "Clodsire": {"outdated": true, "sets": {"Specially Defensive": {}}},
  "Kingambit": {
    "sets": {
      "Immunity Ability": {},
      "Swords Dance": {
        "outdated": true,
        "description": "<p>Swords Dance Kingambit excels as a mid-game wallbreaker that can boost on passive foes and tear through the opponent's team with its Adaptability-boosted STAB attacks. Kowtow Cleave and Iron Head are Kingambit's main attacks, heavily damaging defensive pivots like Corviknight, Hisuian Goodra, Scream Tail, and Garganacl. Sucker Punch lets it predict and punish faster attackers like Quaquaval, Volcarona, and Slither Wing that try and come in to revenge kill. 140 Speed EVs let Kingambit outspeed uninvested Corviknight and Skeledirge. Black Glasses lets Kingambit OHKO Iron Moth with Sucker Punch. Immunity abilities like Well-Baked Body and Earth Eater are options to pick up additional setup chances. Fast endgame sweepers like Chien-Pao, Meowscarada, and Hisuian Electrode benefit from Kingambit's early-game presence, capitalizing on chipped foes and scoring easy KOs. Defensive pivots like Intimidate Corviknight, RegenVest Meloetta, and Fluffy Landorus-T can thwart revenge killers targeting Kingambit and use U-turn to bring it in safely again. Finally, Primordial Sea Zapdos can help Kingambit by forcing Corviknight and Quaquaval, two of its most consistent checks, letting it chip them on their switch-in repeatedly.</p>"
      }
    }
  },
  "Great Tusk": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Great Tusk is a premier defensive wall thanks to its high physical bulk and access to utility such as Knock Off and Rapid Spin. Ice Spinner threatens Flying-type Pokemon like Landorus-T, Gliscor, and Dragonite. Bulk Up is used to boost Great Tusk's offensive and defensive presence, while Knock Off cripples switch-ins like Corviknight and Earth Eater Skeledirge. Regenerator provides reliable recovery and allows Great Tusk to switch back in to take hits from multiple threats, but Fluffy can be used to reduce damage taken from contact move users like Roaring Moon and physical Kommo-o. Alternatively, Toxic Debris can punish users of physical utility moves such as Knock Off and U-turn, forcing entry hazard removers like Corviknight in. Leftovers can be used for small but valuable recovery, while Rocky Helmet can be used to punish contact attackers. Frailer Pokemon that are weak to entry hazards such as Azelf and Weavile appreciate Great Tusk's ability to reliably remove hazards. Great Tusk's abysmal special bulk makes it susceptible to special attackers like Manaphy and Azelf. Therefore, Pokemon like Hisuian Goodra and RegenVest Manaphy can form a defensive core with Great Tusk, being able to switch into those wallbreakers and force them out with utility like Dragon Tail and Knock Off, respectively.</p>"
      },
      "Offensive Bulk Up": {
        "description": "<p>A solid offensive typing, a high Attack stat, and wide coverage make Great Tusk a potent wallbreaker. Bulk Up is the main source of Great Tusk's power, increasing its tanking capabilities and offensive prowess. Great Tusk's typing and coverage allow it to set up in front of multiple physical attackers like Roaring Moon, Kingambit, and Zamazenta-C. Ice Spinner OHKOes Primordial Sea Zapdos after a Bulk Up, OHKOes Dragonite and 2HKOes Landorus-Therian, while Knock Off threatens Skeledirge and Ceruledge if not running Headlong Rush and cripples defensive Pokemon like Corviknight, Quaquaval, and Earth Eater Gholdengo looking to switch in. Close Combat threatens Earth Eater Kingambit and Empoleon, as well as Roaring Moon, while Headlong Rush threatens Iron Moth, Skeledirge and Ceruledge. Toxic Debris provides a layer of danger, putting offensive teams on a timer and forcing Poison-type Pokemon to switch in, while Fluffy helps Great Tusk set up Bulk Up more easily with its heightened physical bulk, making it a powerful tank. Great Tusk is a potent wallbreaker and entry hazard remover, so Pokemon that are vulnerable to entry hazards like Ogerpon-H and Weavile benefit from its presence. In return, they threaten common defensive Pokemon that wall Great Tusk, such as Manaphy and Corviknight. Great Tusk has terrible special bulk and appreciates pivoting, so special walls like RegenVest Roaring Moon and the aforementioned Manaphy make for great teammates. Despite Great Tusk's high Attack stat, it still requires entry hazard chip damage to pick up KOes, Stealth Rock to OHKO itemless Zapdos at +1 and Stealth Rock and three layers of Spikes to OHKO Toxapex. Therefore, teammates like Sandy Shocks and Garchomp, which can set up Stealth Rock and Spikes, are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "LOrd Fernado", "user_id": 629794}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic1000", "user_id": 552227}, {"username": "cat", "user_id": 580765}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "deetah", "user_id": 297659}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Scream Tail": {
    "sets": {
      "Unaware": {
        "description": "<p>Scream Tail with its good bulk and excellent typing is a great Unaware user that is able to check a variety of threatening physical setup sweepers like Great Tusk, Dragonite, and Kommo-o while also being potential wincon on its own with Calm Mind. Scream Tail also functions as a Wish passer, providing longevity to Pokemon lacking reliable recovery such as Zamazenta-C, Heatran, and Walking Wake. Calm Mind can be used to set up on opposing setup Pokemon like Manaphy and Triage Enamorus-T, while Thunder Wave can be used to cripple incoming switch-ins such as Ceruledge and Heatran. Frail offensive Pokemon such as Barraskewda, Roaring Moon, and Weavile appreciate Scream Tail being able to take priority moves from Dragonite and Triage Kommo-o. Scream Tail is vulnerable to Ghost-types like Gholdengo, Gengar, and Ceruledge, so defensive checks to them like Manaphy and Mandibuzz are recommended. Scream Tail is also weak to entry hazard damage, so it is essential to pair it with a reliable hazard remover like Corviknight, Mandibuzz, or Great Tusk.</p>"
      },
      "Pixilate": {
        "description": "<p>Scream Tail leverages Pixilate Boomburst's natural raw power and its decent bulk and Speed tier to act as a niche Stealth Rock setter that threatens some of the tier's best entry hazard removers like Quaquaval, Mandibuzz, and Great Tusk. Protect allows it to receive its own Wishes safely while acting as an option to scout a Choice-locked foe, like Barraskewda, Azelf, or Sandy Shocks. Scream Tail's ability to force out wallbreakers like Great Tusk and Dragonite allows it to find opportunities to set up Stealth Rock; alternatively, Calm Mind allows it to act as a late-game cleaner after its checks like Iron Moth, Unaware Scream Tail, and RegenVest Hisuian Goodra have been heavily worn down or removed. Scream Tail's ability to maintain entry hazards in the face of spinners like the aforementioned Great Tusk and Quaquaval is greatly appreciated by pivots like Azelf and Barraskewda, which can form deadly VoltTurn cores that appreciate entry hazard chip damage on their checks like Corviknight and RegenVest Manaphy. Scream Tail's weakness to revenge killers like Dragonite, Barraskewda, and Choice Specs Azelf means it requires sturdy teammates like Corviknight, Empoleon, and RegenVest Manaphy, which can switch into these threats, live a hit, and pivot out. Scream Tail appreciates spinners that can maintain hazards on the opposing side. Additionally, Scream Tail appreciates wallbreakers like Barraskewda and Sandy Shocks, which can remove Fire- and Steel-types, allowing Scream Tail to clean the opposing team.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}, {"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "cat", "user_id": 580765}, {"username": "Kinetic1000", "user_id": 552227}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Slither Wing": {
    "sets": {
      "Choice Band": {},
      "Magic Guard": {
        "outdated": true,
        "description": "<p>Magic Guard Slither Wing serves as a revenge killer that aims to wear down and outlast its checks. Slither Wing possesses a unique combination of a strong STAB First Impression, U-turn, and Close Combat that is further boosted by a recoilless Life Orb with Magic Guard, which also allows it to switch in freely without racking up chip damage from entry hazards. Flare Blitz allows Slither Wing to hit checks like Intimidate Corviknight harder, while Earthquake hits walls like Toxapex and Skeledirge effectively, Will-O-Wisp can cripple checks like Fluffy Quaquaval and help to wear down defensive checks with added chip damage, and Morning Sun allows Slither Wing to remain healthy throughout a game. Specially offensive threats like Hisuian Electrode and Primordial Sea Inteleon pair well with Slither Wing for its ability to pivot and bring them in on physical walls to force them out and wear them down as well as for opportunities to wallbreak; together, they form a deadly VoltTurn core. Fast physical threats like Meowscarada and Chien-Pao also work well in combination Slither Wing to continuously wear down and overwhelm common physical walls like Corviknight, Quaquaval, and Scream Tail. Reliable hazard setters like Garchomp and Heatran are also appreciated to help wear down checks like Corviknight over the game and take advantage of the plethora of switches Slither Wing forces. Defensive pivots like Corviknight and RegenVest Meloetta are recommended to help pivot Slither Wing in to wallbreak and also absorb revenge killing attempts from the likes of Galarian Zapdos and Iron Moth.</p>"
      }
    }
  },
  "Sandy Shocks": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {},
      "Earth Eater": {},
      "Hadron Engine": {
        "outdated": true,
        "description": "<p>Hadron Engine Sandy Shocks is a powerful attacker with good STAB coverage and utility in Spikes. Choice Scarf outspeeds major threats like Cinderace, Choice Scarf Chi-Yu, and +2 Modest Polteageist, while Choice Specs better pressures opposing walls like Corviknight and Iron Treads. Spikes forces progress even when the opponent has a solid answer to Sandy Shocks, such as Ting-Lu. Sandy Shocks pairs well with strong attackers like Iron Moth and Hydreigon, as they take advantage of weakened special walls and the former can also fire off Terrain-boosted Discharge. Sandy Shocks also appreciates Pokemon that can switch into Ground-type attacks, such as Corviknight, which also gives a slow U-turn to bring Sandy Shocks in safely, and Garchomp, which can also help with stacking entry hazards. Entry hazard removal is particularly helpful, as the Pokemon that usually switch into Sandy Shocks, like Ting-Lu, will often use the opportunity to set entry hazards.</p>"
      }
    }
  },
  "Iron Treads": {
    "outdated": true,
    "sets": {
      "Ground Immunity": {
        "description": "<p>Iron Treads is an excellent spinner that is able to switch into common entry hazard setters such as Garchomp and Landorus-T with its own Levitate while also being able to use Knock Off on common switch-ins such as Corviknight. Iron Treads can opt to be a hazard setter itself with Stealth Rock, keep up momentum with Volt Switch on targets like Corviknight, or use Heavy Slam as a strong STAB option for Scream Tail and Chien-Pao. Levitate allows Iron Treads to be immune to Spikes while also being able to spin them away, whereas Earth Eater can be used as an alternative for better longevity against hazard setters like Garchomp and Smack Down Landorus-T. Offensive Pokemon that are weak to hazards such as Chien-Pao and Thundurus-T appreciate Iron Treads's ability to keep hazards off the field, as well as being able to pivot them in safely with Volt Switch. Strong physical attackers like Galarian Zapdos and Kingambit also are good teammates for Iron Treads, as they can more easily break through Corviknight with Knock Off support from Iron Treads. Iron Treads can be overwhelmed by coverage options from hazard setters such as Liquidation Garchomp, so running Wish Scream Tail, which can increase Iron Treads's longevity, or a secondary hazard remover like Corviknight and Quaquaval, which can also stave off hits, is recommended. Iron Treads is also vulnerable to strong Fighting-type attackers such as Galarian Zapdos and Slither Wing, so it is advised to pair it with a Fighting-resistant teammate such as Scream Tail or Fluffy Zapdos.</p>"
      },
      "Fire Immunity": {
        "description": "<p>Well-Baked Body Iron Treads is a spinner with a great defensive typing in addition to a Fire immunity and ability to compress several roles such as item and entry hazard removal into one Pokemon. It is notably able to threaten the tier's premier spinblocker in Skeledirge, allowing it to remove hazards freely. If there is already a Stealth Rock user on the team, Iron Treads can instead use Heavy Slam to check Calm Mind Scream Tail and Enamorus-T, Rock Slide to OHKO Talonflame and Volcarona, or Volt Switch to bring in teammates safely. 236 Speed EVs are used to outspeed and threaten an OHKO on Jolly Hisuian Arcanine. Pixilate Scream Tail and Primordial Sea users like Inteleon, Greninja, and Quaquaval all appreciate Iron Treads switching into their checks in Desolate Land Fire-types like Iron Moth and Ceruledge. Physical wallbreakers like Chien-Pao and Hisuian Arcanine appreciate Iron Treads removing items from shared switch-ins like Corviknight and Quaquaval. Fighting- and Ground- types like Galarian Zapdos, Slither Wing, and Garchomp threaten Iron Treads, so defensive partners like Scream Tail, Quaquaval, and Corviknight are recommended. Iron Treads's Rapid Spin also supports the hazard stacking effort from partners like Garchomp and Ting-Lu. Certain Fire-types like Cinderace and Ceruledge can still threaten Iron Treads with their coverage moves, so it appreciates a secondary check to them like Primordial Sea Zapdos.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}, {"username": "KarpeChan", "user_id": 536333}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "cat", "user_id": 580765}, {"username": "UT", "user_id": 523866}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "berry", "user_id": 226455}, {"username": "ken", "user_id": 594478}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Iron Jugulis": {
    "outdated": true,
    "sets": {"Sheer Force": {"description": "<p>With high-Base Power moves and decent Special Attack and Speed, Iron Jugulis is a solid wallbreaker that can outspeed and threaten common specially defensive foes, like Garchomp and Garganacl. Iron Jugulis offers a notable niche, as Hurricane + Dark Pulse + Focus Blast can hit every viable Pokemon for neutral damage. Taunt disrupts attempts to heal, set up, or set entry hazards, allowing Iron Jugulis to better handle Pokemon such as Blissey and Clodsire. Iron Jugulis struggles against special walls like Florges and Scream Tail, so physically offensive teammates like Cinderace and Ceruledge are necessary to break through them. Due to its frailty, it enjoys teammates like Slither Wing and Corviknight that can pivot it in, the latter of which can also remove hazards with Defog. Iron Jugulis also appreciates entry hazard setters such as Ting-Lu, which can enable it to secure KOs that it would typically miss, such as Garganacl.</p>"}},
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "Alexender", "user_id": 313542}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Iron Moth": {
    "sets": {
      "Desolate Land": {
        "description": "<p>Iron Moth makes a great offensive pivot in the tier thanks to its high Special Attack, good Speed tier, and ability to utilize Desolate Land excellently with Fiery Dance and Morning Sun. U-turn lets Iron Moth pivot out from Pokemon that threaten it such as Azelf, Roaring Moon, and Dragonite. Toxic can cripple switch-ins such as Meloetta and Manaphy. Discharge threatens Pokemon like Barraskewda, Primordial Sea Manaphy, Well-Baked Body Corviknight, and Mandibuzz. Dazzling Gleam can 2HKO Dragon-types such as Walking Wake, Dragonite, and RegenVest Roaring Moon, and can OHKO Kommo-o and offensive Roaring Moon. Sludge Wave OHKOs Pokemon like Ogerpon-H and Barraskewda, as well as being able to 2HKO Zapdos and Scream Tail. Iron Moth struggles to break through RegenVest Pokemon such as Hisuian Goodra, Meloetta, and Manaphy, so it pairs well with other offensive Pokemon such as Ceruledge, Weavile, and Thundurus, while in return, Iron Moth is able to absorb Toxic Spikes which can be crucial for its teammates. Iron Moth is weak to Knock Off users like Manaphy, which can allow for it to get chipped down by entry hazards, so it appreciates hazard removal from Pokemon such as Great tusk and Corviknight. Iron Moth also appreciates entry hazards from the likes of Garchomp, Heatran, and Empoleon, which wears down the opposing team, letting Iron Moth guarantee an OHKO on Zamazenta-C as well as pick off weakened Manaphy and Hisuian Goodra. Pivots such as Azelf, Zapdos, and Corviknight can pair well with U-turn Iron Moth sets by forming a VoltTurn core, letting Iron Moth pivot in on Pokemon it checks.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yokoisop", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic1000", "user_id": 552227}, {"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Iron Thorns": {"outdated": true, "sets": {"Dragon Dance": {}}},
  "Gholdengo": {
    "sets": {
      "Defensive": {},
      "Magic Guard": {
        "description": "<p>Magic Guard Gholdengo is an extremely powerful special wallbreaker that takes advantage of Nasty Plot, Life Orb, and Steel Beam, the latter two without recoil, to overwhelm special walls. Shadow Ball provides excellent neutral coverage, hitting Manaphy, Hisuian Goodra, and Empoleon. Hex is an alternative with Toxic Debris or other status support and bypasses Bulletproof. Recover gives Gholdengo the ability to heal off damage taken while setting up, as well as simply giving it the longevity to attack the opponent's team throughout the battle. Alternatively, Focus Blast hits Steel-types like Heatran and Hisuian Goodra, while Thunder Wave slows down faster attackers like Iron Moth and Roaring Moon that try to threaten Gholdengo while powering up Hex to break down bulkier Pokemon like Manaphy. Gholdengo's ability to beat down balanced cores with the sheer strength of Steel Beam benefits faster cleaners like Barraskewda, Chien-Pao, and Choice Scarf Azelf and Walking Wake. If Gholdengo runs Thunder Wave, it can also support other offensive Pokemon that appreciate faster attackers getting slowed down, such as Great Tusk, Ceruledge, and Dragonite. However, Gholdengo is vulnerable to faster Dark-types like Chien-Pao and Weavile, so Pokemon that can check them like Corviknight and Quaquaval are appreciated. Corviknight can even safely bring in Gholdengo with its U-turn. Additionally, if Gholdengo is not using Thunder Wave and Hex, RegenVest users like Manaphy and Meloetta completely wall it, so Pokemon that beat them with super effective STAB moves or physical attacks like Desolate Land Ogerpon-H and Roaring Moon are appreciated.</p>"
      },
      "Offensive": {
        "description": "<p>With Nasty Plot, a fantastic offensive and defensive typing, and solid coverage, Gholdengo is a terrifying wallbreaker that threatens to tear apart teams after a single free turn. Hex can be used over Shadow Ball with Thunder Wave or Toxic Debris support, with Life Orb sets 2HKOing badly poisoned RegenVest Manaphy while also threatening Bulletproof Gholdengo. Recover gives Gholdengo significant longevity and multiple opportunities to use Nasty Plot, while Substitute gives it a free turn to set up Nasty Plot or Thunder Wave against foes like Corviknight and Kommo-o and dodges phazing attempts from Dragon Tail users like Hisuian Goodra and Roaring Moon. Focus Blast hits Roaring Moon, Kingambit, and Hisuian Goodra, while Thunder Wave can boost the power of Hex and spread useful paralysis against threats like Manaphy, Roaring Moon, and Ogerpon-C. Leftovers and Colbur Berry both boost its longevity, with the latter letting Gholdengo survive Knock Off from Roaring Moon or +2 Ogerpon-C, while Life Orb boosts Gholdengo's power significantly, granting it feats such as guaranteeing a 2HKO on specially defensive Garchomp with Make It Rain. If running Focus Blast, Beads of Ruin is an option over Adaptability, boosting Focus Blast's power at the cost of revealing Gholdengo's ability and slightly decreasing the power of its STAB moves. Gholdengo can struggle to break through common special walls like Blissey, Bulletproof Empoleon, and RegenVest users like Hisuian Goodra and Meloetta, so it appreciates powerful offensive teammates like Roaring Moon, Ogerpon-C, and Galarian Zapdos that can handle these walls while Gholdengo picks off physical walls like Corviknight, Great Tusk, and Kommo-o. Gholdengo appreciates defensive pivots like Corviknight, Manaphy, and Empoleon that can take a hit and bring Gholdengo in against foes it forces out such as Kommo-o, Pixilate Scream Tail, and Galarian Zapdos.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tbolt", "user_id": 555379}, {"username": "Gimmickyasitgets", "user_id": 540420}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "LordBox", "user_id": 611238}, {"username": "Kinetic1000", "user_id": 552227}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Chien-Pao": {
    "sets": {
      "Choice Band": {
        "description": "<p>Chien-Pao is a fast and hard-hitting attacker able to burst through many weakened teams with little struggle, with its strong Ice- and Dark-type STAB moves and a Choice Band to increase its already good Attack to threaten many popular defensive Pokemon such as Great Tusk, Mandibuzz, and Zapdos. Chien-Pao uses Sacred Sword in order to guarantee an OHKO on Pokemon like Kingambit, Heatran, and Hisuian Goodra, as well as heavily chipping Zamazenta-C. It can also use Lash Out over Crunch, which can 2HKO Intimidate Corviknight after Stealth Rock damage, though getting extra chip on Corviknight can help to guarantee the 2HKO. With Chien-Pao having one of the highest Speed tiers, it's able to pick up OHKOs on many frailer offensive Pokemon like Ogerpon-C and Gengar, it also works excellently as a revenge killer because of Ice Shard and it's its aforementioned high Speed able to take down weakened Pokemon or force out Pokemon like Ceruledge, Zapdos, and Azelf. Offensive Pivots such as Barraskewda and Hisuian Electrode appreciate Chien-Pao's presence, as they like being able to pivot into Chien-Pao to deal with Hisuian Goodra or Corviknight. Chien-Pao is weak to entry hazards, limiting how many times it can come in, so teammates like Corviknight, Mandibuzz, and Great Tusk can all help with it whilst also taking hits that Chien-Pao can't take and pivoting to get it in safely. Even with help from pivoting, Chien-Pao does have a hard time breaking through common foes such as defensive Corviknight, Unaware Scream Tail, and Quaquaval, which can all switch in on it fairly easily, but the help of teammates like Mixed Garchomp, Magic Guard Heatran, and Hisuian Electrode can help deal with its checks.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Hiusi guy", "user_id": 603640}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Ting-Lu": {
    "outdated": true,
    "sets": {
      "Regenerator": {},
      "Specially Defensive": {"outdated": true, "description": "<p>Ting-Lu's absurd mixed bulk and unusual typing make it a formidable mixed wall, capable of checking several key threats such as Kingambit, Ceruledge, and Iron Moth. Ting-Lu's best entry hazard depends on its team, as it can form a strong hazard-stacking core with Stealth Rock and/or Spikes setters like Garganacl and Glimmora. Ruination spreads consistent damage, especially against Ground-immune foes like Earth Eater Kingambit, and forces defensive Pokemon like Corviknight, Hippowdon, and Blissey to waste their recovery PP. Whirlwind forces entry hazard damage onto foes and ensures Ting-Lu isn't setup fodder for threats like Talonflame and Quaquaval. The Speed IVs let it underspeed Corviknight to punish its Roost with Earthquake. Foes like Scream Tail and Lucario can endanger Ting-Lu by targeting its weaknesses, so Corviknight is a good teammate that also provides Defog.</p>"},
      "RegenVest Wall": {"outdated": true, "description": "<p>Ting-Lu's excellent defensive stats and useful typing let it check a plethora of special attackers such as Hydreigon and Iron Moth. Throat Chop provides STAB damage and lets it beat Boomburst users, Ruination + Sand Tomb traps and eliminates opposing Ting-Lu and Skeledirge, while also draining recovery PP from Hippowdon and Blissey. Some special attackers like Scream Tail can prove dangerous, so pairing Ting-Lu with Corviknight and Desolate Land Iron Moth are good options. Ting-Lu can switch into weaker physical attackers like Roaring Moon, but it should be used as help for the main physical wall on the team. Ting-Lu is vulnerable to opposing setup sweepers, so teammates like Unaware Corviknight are greatly appreciated. Corviknight can also reduce Ting-Lu's weakness to entry hazards.</p>"}
    }
  },
  "Chi-Yu": {
    "outdated": true,
    "sets": {
      "Choice Item Attacker": {
        "description": "<p>Chi-Yu's strong base stats and excellent STAB coverage make it a flexible offensive threat. Choice Specs provides maximum wallbreaking power, notably allowing it to OHKO physically defensive Ting-Lu with Desolate Land + Overheat, whereas Choice Scarf gives it the Speed to clean late-game and chase out faster threats like Cinderace and Chien-Pao. Desolate Land provides the most damage amplification and comes with an immunity to Water, whereas No Guard enables Chi-Yu to liberally spread burns with Inferno. Psychic is useful coverage to hit Clodsire and Iron Moth super effectively; alternatively, Will-O-Wisp allows Desolate Land sets to reliably spread burn, however Chi-Yu's poor bulk means it can be dangerous to use. Chi-Yu's best fit is on balance and offense teams that appreciate its high damage output, as well as its good matchups against common special walls like RegenVest Iron Treads. Bulky pivots, like the aforementioned Corviknight and Iron Treads, make particularly good Chi-Yu partners because both can clear entry hazards, particularly Stealth Rock.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Thanks to its high Special Attack and decent Speed, Chi-Yu is a potent wallbreaker that makes use of Nasty Plot and its unresisted STAB combination to tear through common walls like Sand Stream Garganacl and non-Unaware Florges. Chi-Yu generally prefers to run Heavy-Duty Boots to avoid entry hazard damage, but Life Orb can be run on Sheer Force sets for extra power. Chi-Yu also has several Fire-type STAB moves to choose from: Fire Blast is the most powerful, Flamethrower is the most consistent option, and Inferno is used on No Guard sets to punish switch-ins like Garganacl and Ting-Lu with a burn. Chi-Yu does struggle against special walls like Clodsire and Blissey, so physically offensive Pokemon like Meowscarada and Kingambit make good teammates. Chi-Yu is also physically frail, so it appreciates teammates like Corviknight and Avalugg that can switch into strong physical attacks and Wish passers like Florges and Scream Tail that can help it stay healthy.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Isaiah", "user_id": 375662}]}]}
  },
  "Roaring Moon": {
    "sets": {
      "RegenVest": {
        "description": "<p>Roaring Moon is an excellent user of RegenVest with a typing that plays well into the tier's special setup sweepers and pivots like Iron Moth, Sandy Shocks, and all variants of Zapdos. Knock Off cripples switch-ins like Great Tusk and Corviknight while also threatening a 2HKO on offensive Gholdengo and an OHKO on Gengar and Azelf. U-turn allows Roaring Moon to pivot out on these switch-ins, and Dragon Tail allows Roaring Moon to force out setup sweepers such as Manaphy, which Roaring Moon cannot meaningfully damage, while letting it rack up entry hazard damage. Stone Edge allows Roaring Moon to threaten the plethora of Flying- and Fire-types that the tier has, such as Thundurus, Iron Moth, and Zapdos, while Iron Head allows it to chip Fairy-types like Scream Tail and Diancie that otherwise can switch in freely. 192 Speed EVs and a Jolly nature ensure that Roaring Moon outspeeds Thundurus and Gengar. Roaring Moon appreciates physically defensive walls like Corviknight, Great Tusk, and Quaquaval that can remove entry hazards which limit Roaring Moon's walling capabilities, while it checks the special Electric- and Fire-types that threaten them like Hisuian Electrode and Iron Moth in return. Roaring Moon's presence is appreciated by pivots and wallbreakers like Galarian Zapdos and Sword of Ruin Ceruledge due to its ability to switch into revenge killing attempts from the likes of Hisuian Electrode, Sandy Shocks, and Azelf. Roaring Moon deathly fears Dragon- and Fairy-types like Hydreigon, Walking Wake, and Enamorus-T, making Earth Eater Empoleon a notable partner with its ability to pivot into these Pokemon.</p>"
      },
      "Choice Item": {
        "description": "<p>With high Attack and Speed and a powerful Knock Off, Roaring Moon is a great offensive pivot and wallbreaker, capable of threatening KOs while also generating momentum with U-turn. Knock Off OHKOes other offensive pivots such as Azelf, Barraskewda, and Hisuian Electrode, while also crippling defensive switch-ins like Corviknight and Great Tusk. Earthquake threatens Steel-types like Heatran and Empoleon, Iron Head hits Fairy-types like Scream Tail and Diancie, and Stone Edge hits Flying-types like Zapdos and Mandibuzz. Choice Scarf allows Roaring Moon to safely outspeed previously mentioned pivots, increasing its effectiveness as speed control, while Choice Band turns Roaring Moon into more of a wallbreaker, notably 2HKOing Scream Tail with Iron Head and OHKOing Fluffy Zapdos with Stone Edge. Roaring Moon struggles greatly against defensive Great Tusk, Quaquaval, and Kommo-o, which makes specially offensive partners like Azelf and Walking Wake great, as they allow Roaring Moon to potentially sweep late-game after its checks have been heavily chipped down. Other offensive pivots like Barraskewda and Sandy Shocks also like Roaring Moon, as they can form VoltTurn cores and pressure common switch-ins like Corviknight, Great Tusk, and defensive Zapdos. While fast, Roaring Moon is still weak to priority moves from the likes of Weavile, Slither Wing, and Dragonite, which makes defensive partners such as Corviknight and Scream Tail appreciated as well as Azelf thanks to Psychic Surge negating priority. Roaring Moon racks up chip damage from entry hazards easily with U-turn increasing how often it switches in, meaning that Teammates with hazard removal like Corviknight and Great Tusk are also appreciated. Hazard setters like Garchomp and Kommo-o are also helpful, as they help wear down its checks like Corviknight, allowing VoltTurn cores to be more effective.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}, {"username": "I am BONK", "user_id": 603931}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "Kinetic1000", "user_id": 552227}, {"username": "cat", "user_id": 580765}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "Clouds", "user_id": 356215}]}]}
  },
  "Walking Wake": {
    "sets": {
      "Choice Item": {
        "description": "<p>Walking Wake's excellent Special Attack, good Speed, and nearly unresisted STAB combination allow it to stand out as either a threatening wallbreaker or powerful speed control depending on its choice of item. Knock Off cripples switch-ins such as Empoleon and RegenVest Manaphy, Scald provides a more reliable STAB option on non-Primordial Sea sets while also threatening a burn on potential switch-ins, while Dragon Pulse provides a more reliable Dragon-type STAB move. Flip Turn is used in order to gain momentum for Walking Wake's teammates while also pivoting out of unfavorable matchups such as against Empoleon and Blissey. Primordial Sea allows Walking Wake to run Weather Ball instead of Hydro Pump, trading power for accuracy while also giving Walking Wake an easier time switching into Fire-types thanks to the Fire-type immunity. Dragon's Maw significantly boosts the power of Walking Wake's Dragon-type attacks, notably allowing it to OHKO RegenVest Manaphy after a Knock Off and one layer of entry hazards, at the cost of not increasing the power of its Water-type attacks and providing no additional defensive benefit. A Choice Specs can be used in order to increase Walking Wake's effectiveness as a wallbreaker, notably allowing non-Primordial Sea sets to 2HKO RegenVest Manaphy and Hisuian Goodra with Draco Meteor after a Knock Off, while a Choice Scarf can be used to outspeed and threaten an OHKO against would-be offensive checks, such as Weavile, Chien-Pao, and Roaring Moon. Walking Wake appreciates offensive teammates such as Galarian Zapdos, Meowscarada, and Ogerpon-C, which can pressure switch-ins like Empoleon, RegenVest Manaphy, and Desolate Land Heatran. Fast teammates such as Barraskewda and Choice Scarf Azelf also pair well with Walking Wake, as they appreciate the holes it breaks in the opponent's team while forming a VoltTurn core with the momentum they generate, potentially allowing them to sweep late-game. These teammates can also force out Walking Wake's offensive checks, such as Weavile, Chien-Pao, and Roaring Moon, which can outspeed it and threaten it with an OHKO.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic1000", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Iron Leaves": {
    "outdated": true,
    "sets": {
      "Choice Band": {"description": "<p>With its high Attack stat and variety of Sharpness-boosted moves, Iron Leaves is a decent wallbreaker that can OHKO common metagame threats like Garganacl and Quaquaval. Sacred Sword allows Iron Leaves to hit Grass- and Psychic-resistant foes like Kingambit and Hydreigon, while Wild Charge threatens Flying-types like Talonflame and Corviknight. Iron Leaves struggles with being prediction-reliant and having low physical bulk, especially with its 4x weakness to the extremely prevalent U-turn, which makes wrong predictions very punishing. Therefore, having defensive teammates like Ting-Lu and Corviknight that can repeatedly pivot it in safely are necessary. Due to its lack of recovery and need for repeated switching, Iron Leaves appreciates entry hazard removers like Iron Treads to keep it from getting worn down. Hadron Engine users like Sandy Shocks are also great teammates that power up both Psyblade and Wild Charge with Electric Terrain.</p>"}
    },
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "Alexender", "user_id": 313542}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Ogerpon-Wellspring": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Ogerpon-W's excellent power, great STAB coverage, good Speed tier, and bevy of useful moves make it a potent offensive threat that can overwhelm bulkier teams with Swords Dance. Ivy Cudgel not only boasts obscene power, but also is non-contact and has a high critical hit chance, bypassing Fluffy and Rocky Helmet and often bypassing Intimidate with critical hits. Power Whip is the preferred secondary STAB move to OHKO Manaphy, while Horn Leech provides recovery. Knock Off hits Desolate Land Ceruledge, Iron Moth, and Heatran, while Play Rough dispatches of Kommo-o, Trailblaze allows Ogerpon-W to potentially sweep offensive teams, and Spikes reliably wears down switch-ins like Hisuian Goodra, (comma) which can get 2HKOed after Spikes. Primordial Sea is the preferred ability to make Ivy Cudgel even stronger and provide a useful Fire immunity, while Sword of Ruin also boosts Ogerpon-W's other coverage, achieving important benchmarks like OHKOing Kommo-o. Ogerpon-W appreciates fast cleaners that can take advantage of the holes it creates in opposing teams, especially fast special pivots like Azelf and Hisuian Electrode that can get it in on special walls and overwhelm the physical walls like Kommo-o that it struggles with. Ogerpon-W has mediocre bulk, so it appreciates defensive teammates like Meloetta, defensive Zapdos, and Intimidate Corviknight to take hits and get it in safely or dual screens support from Prankster Corviknight to let it set up safely.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "UT", "user_id": 523866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Ogerpon-Hearthflame": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Ogerpon-H is a strong wallbreaker that is able to beat many of the tier's premier walls, such as Corviknight, Scream Tail, and Great Tusk thanks to its high Attack, excellent STAB moves, and good Speed tier. Power Whip can be used to get massive damage on Ground- and Water-types, including securing the KO on Intimidate Quaquaval and physically defensive Great Tusk after Swords Dance, while Horn Leech can be run instead to give Ogerpon-H more longevity. Ogerpon-H has a number of options for its last moveslot, such as Play Rough to hit Kommo-o and Roaring Moon, OHKOing both after a Swords Dance, and Knock Off to cripple foes, especially switch-ins like Primordial Sea Zapdos, which gets 2HKOed after Stealth Rock, as well as 2HKOing Well-Baked Body Gholdengo with Sword of Ruin. Desolate Land provides the most power to Ivy Cudgel and lets Ogerpon-H offensively check Water-types like Manaphy and Barraskewda, while Sword of Ruin allows Play Rough to OHKO Kommo-o and 2HKO Garchomp. Due to its average defenses and lack of recovery if not running Horn Leech, Ogerpon-H benefits both from entry hazard removers like Great Tusk and Quaquaval and slow pivots like Corviknight and Empoleon that can get it on the field safely. Ogerpon-H also appreciates hazard setters like Garchomp and Heatran, which can chip down walls like Scream Tail for it to more easily KO.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Kinetic1000", "user_id": 552227}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Ogerpon-Cornerstone": {"sets": {"Swords Dance": {}}}
}