{
  "Charizard": {"sets": [{"name": "Drought Wallbreaker"}, {"name": "Dragon Dance"}]},
  "Slowbro": {"sets": [{"name": "Defensive Pivot"}]},
  "Chansey": {"sets": [{"name": "Pink Blob (Defensive)"}]},
  "Gyarados": {"sets": [{"name": "Dragon Dance"}, {"name": "Dragon Dance + Flyinium Z"}]},
  "Ditto": {"sets": [{"name": "SUS"}]},
  "Dragonite": {"sets": [{"name": "Dragon Dance"}]},
  "Scizor": {
    "sets": [
      {
        "name": "Bulky Swords Dance",
        "description": "<p>Mega Scizor leverages its great bulk and solid defensive typing to serve as a sturdy check to many Pokemon—including Weavile, Kartana, and Tapu Lele—and a solid wincon as well. U-turn allows it to serve as a pivot: easily switching it out of checks such as Gholdengo, Urshifu-R, and Mega Charizard Y, it brings in teammates like Tapu Koko and Dragapult to deal with them. Close Combat can be used to dispose of Steel-types like Ferrothorn and Heatran much more quickly, greatly denting them on the switch. The given EV spread allows Mega Scizor to survive two Close Combats from Mega Lopunny after Stealth Rock and outspeed uninvested Heatran, with the HP and Special Defense EVs helping it check Tapu Lele and Espathra. Mega Scizor's pivot support is extremely valuable to Pokemon such as Tapu Koko, Rotom-W, and Zamazenta, which all also appreciate how well it exploits defensive Pokemon such as Clodsire, Ferrothorn, and Landorus-T. Rotom-W forms a strong VoltTurn core with Mega Scizor as well, with both pivoting out on their checks and racking up solid chip damage over time. Nasty Plot Tornadus-T appreciates Mega Scizor pressuring specially defensive walls and offensive Pokemon like Weavile and Clodsire, letting it go all-in as an offensive wallbreaker with ease. Mega Scizor wearing down Rotom-W and Heatran is also particularly useful for Tornadus-T, as these Pokemon can heavily damage or cripple Tornadus-T in one way or another. Mega Scizor being completely countered by Gholdengo mandates a Pursuit trapper like Weavile or Kingambit to pressure it. Skeledirge also hard counters Mega Scizor, encouraging the aforementioned teammates as well as Garganacl and Heatran.</p> "
      },
      {
        "name": "Swords Dance + 3 Attacks",
        "description": "<p>This set takes on a much more offensive role, using its solid defensive typing for easy entry points against Pokemon like Weavile, Kingambit, and Espathra, setting up, and threatening the vast majority of the metagame with its strong Technician-boosted attacks. Close Combat KOes Steel-types like Heatran and Ferrothorn, as well as providing a strong neutral hit against Rotom-W. Dual Wingbeat hits Clodsire and Toxapex for reliable neutral damage, hits Zamazenta super effectively, and breaks Substitute against Shed Tail hyper offense teams and Dragon Dance Dragapult. Knock Off is an alternative to hit Gholdengo reliably and remove items like Leftovers from Rotom-W and Heavy-Duty Boots from Tornadus-T, Skeledirge, and Volcarona. This allows a teammate or Mega Scizor to wear them down much more easily. Knock Off is especially relevant in Rotom-W's case, as removing Leftovers makes it easier to put into KO range of +2 Close Combat. Running Knock Off makes Toxapex a much worse matchup, however, so Pokemon like Great Tusk and Tapu Koko that can pressure it are appreciated. Sand Tomb can be used to reliably beat Clodsire, Toxapex, and Gholdengo, preventing them from reliably checking it. Offensive Mega Scizor fits much better on hyper offense teams, which appreciate its incredibly valuable—though short-term—defensive utility. Grimmsnarl is a perfect teammate, providing dual screens to let it set up against foes like Great Tusk, Dragonite, and Landorus-T; it also pivots Mega Scizor in and appreciates it baiting in Gholdengo, which prevents Grimmsnarl from pivoting as effectively. Gholdengo itself is also a notable partner, as it appreciates Mega Scizor dispatching the most popular Dark-types in Weavile and Kingambit. Entry hazards from suicide leads like Landorus-T and Garchomp allow Mega Scizor to clean late-game, as its foes must be chipped before any sweeping is done. Entry hazards particularly help in wearing down checks like Urshifu-R and bulkier Garchomp sets. Mega Scizor struggles against bulky Steel-resistant Pokemon like Rotom-W and Volcarona; Dragonite and Dragapult can take care of the latter, switching into Volcarona to set up as it switches into Mega Scizor, whereas Great Tusk can remove Leftovers from the former, making it easier for Mega Scizor to dispatch with +2 Close Combat. Physically defensive Unaware walls in Skeledirge and Dondozo completely wall Mega Scizor, so offensive Pokemon that can bait in or wear down these foes, including Calm Mind Espathra and Iron Valiant, make for solid partners.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 529732, "username": "adem"}, {"user_id": 515767, "username": "Ryuji"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 528036, "username": "Sulo"}]}
  },
  "Blissey": {"sets": [{"name": "Pink Blob (Defensive)"}]},
  "Tyranitar": {"sets": [{"name": "Stealth Rock"}, {"name": "Assault Vest"}]},
  "Pelipper": {
    "sets": [
      {
        "name": "Rain Setter",
        "description": "<p>Pelipper is a staple pick on rain teams thanks to its ability, Drizzle. Its physical bulk combined with Scald lets it check and potentially cripple foes such as Mega Lopunny, Mega Scizor, and Great Tusk. Hurricane is an alternative to Defog on teams that use Tornadus-T for entry hazard control, which offers better neutral coverage and the ability to hit foes such as Tangrowth and Tera Grass Heatran. Pelipper also operates as a slow pivot with U-turn, which is greatly appreciated by the team's wallbreakers to ensure that they can enter the field safely. Tera Ground offers an Electric immunity for threats such as Tapu Koko, whereas Tera Steel offers a strong defensive typing, letting Pelipper check Pokemon like Extreme Speed Dragonite in a pinch. As the premier rain setter, Pokemon that rely on rain to boost their power or operate effectively within it, such as Mega Swampert, Floatzel, Barraskewda, and Urshifu-R, make for common teammates. Mega Swampert offers a valuable Electric immunity for Pelipper, checking foes such as Tapu Koko. Tornadus-T can provide entry hazard control with Defog, letting Pelipper enter the field and summon rain without having to fear taking hazard damage. Ferrothorn takes advantage of Pelipper's typing and ability to form a solid defensive core and provide a robust blanket check for opposing rain. In return, Pelipper alleviates Ferrothorn's massive Fire weakness by setting rain, and it can check threats that Ferrothorn fails to cover, such as Mega Lopunny.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 385157, "username": "2020 idm boomer"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 580037, "username": "TheSorcer3r"}]}
  },
  "Medicham": {"sets": [{"name": "Wallbreaker"}]},
  "Torkoal": {"sets": [{"name": "Sun Setter"}]},
  "Gastrodon": {"sets": [{"name": "Defensive Entry Hazard Setter"}]},
  "Garchomp": {"sets": [{"name": "Suicide Lead"}, {"name": "Offensive Stealth Rock"}, {"name": "Defensive"}, {"name": "Swords Dance"}]},
  "Hippowdon": {"sets": [{"name": "Defensive"}]},
  "Rotom-Wash": {"sets": [{"name": "Defensive Pivot"}, {"name": "Choice Scarf"}]},
  "Alomomola": {"sets": [{"name": "Defensive"}]},
  "Volcarona": {"sets": [{"name": "Quiver Dance"}]},
  "Greninja": {"sets": [{"name": "Choice Scarf"}]},
  "Hawlucha": {"sets": [{"name": "Unburden Sweeper"}]},
  "Toxapex": {"sets": [{"name": "The Pex"}]},
  "Cinderace": {"sets": [{"name": "Swords Dance"}, {"name": "Offensive Pivot"}]},
  "Corviknight": {"sets": [{"name": "Defensive Pivot"}]},
  "Barraskewda": {"sets": [{"name": "Choice Band"}]},
  "Grimmsnarl": {"sets": [{"name": "Dual Screens"}]},
  "Dragapult": {
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<p>Dragon Dance Dragapult is one of the most dangerous setup sweepers in the tier due to its blazing Speed and immense power. After a Dragon Dance, Dragapult outspeeds all Choice Scarf and Booster Energy users, such as Kartana, Greninja, and Iron Valiant, making it extremely hard to stop if it sets up successfully. Ghostium Z-powered Phantom Force enables a boosted Dragapult to blast through bulky Steel-types such as Corviknight, Ferrothorn, and Heatran after slight chip damage. Dragapult's typing gives it opportunities to switch in and set up against certain Pokemon such as Volcarnoa, non-Ice Spinner Dragonite, and Urshifu-R locked into a Fighting-type move. Substitute is the preferred option in the last moveslot to ease prediction and facilitate setup while also avoiding priority. Substitute also allows Dragapult to play mind games with Kingambit. Fire Blast is another option that allows Dragapult to deal massive damage to physically defensive Ferrothorn and Mega Scizor, both of which can survive a boosted Never-Ending Nightmare at full health. Clear Body is the preferred ability to avoid stat drops from Intimidate, but Infiltrator can also be used to improve the matchup against dual screens and Shed Tail teams. A Jolly nature lets Dragapult outspeed Mega Lopunny and Tapu Koko prior to setting up. Dragon Dance Dragapult fits best on offensive teams, where it can function as a potent late-game cleaner with its Z-Move. Entry hazard support from Great Tusk, Garchomp, and Glimmora can help chip bulky foes such as Mega Tyranitar and Kingambit into range of Dragapult's attacks. Gholdengo can block attempts to remove entry hazards, as well as pressure certain physical walls that give Dragapult a hard time, such as Ferrothorn. Dragapult can struggle with bulky physical walls such as Dondozo, Garganacl, and post-Tera Skeledirge, so powerful special wallbreakers that can take advantage of these Pokemon, such as Tapu Lele and Mega Charizard Y, are greatly appreciated. Tapu Lele also provides Psychic Terrain, which thwarts revenge killing attempts from priority moves. A late-game cleaner such as Dragonite or Booster Energy Iron Valiant can take advantage of the holes Dragapult left behind in the enemy defensive core.</p> "
      },
      {"name": "Choice Specs"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 529732, "username": "adem"}, {"user_id": 528036, "username": "Sulo"}, {"user_id": 385157, "username": "2020 idm boomer"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 272785, "username": "nimzowitsch"}]}
  },
  "Meowscarada": {"sets": [{"name": "Offensive Pivot"}]},
  "Skeledirge": {"sets": [{"name": "Unaware Wall"}]},
  "Garganacl": {"sets": [{"name": "IronPress"}]},
  "Espathra": {"sets": [{"name": "Calm Mind"}]},
  "Cyclizar": {"sets": [{"name": "Shed Tail Utility"}]},
  "Glimmora": {"sets": [{"name": "Suicide Lead"}]},
  "Dondozo": {"sets": [{"name": "Unaware Wall"}]},
  "Annihilape": {
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Annihilape's amazing bulk and the fantastic Rage Fist make it an amazing late-game wincon and wallbreaker. Bulk Up makes it harder for foes such as Great Tusk and Dragonite to break through it, as well as allowing it to break through defensive Pokemon like Buzzwole and Mega Scizor. Taunt prevents status, recovery, and set up from Pokemon like Skeledirge, Mega Scizor, and Landorus-T while also forcing foes to damage Annihilape, boosting the power of Rage Fist. Rage Fist lacks no switch-in once boosted up and allows Annihilape to demolish Pokemon that wouldn't mind it unboosted, such as Gholdengo and Mega Scizor. It also notably invalidates Unaware, enabling it to break through Pokemon like Clodsire and Skeledirge. Drain Punch provides Annihilape with some additional recovery, preventing it from being worn down quickly. Rest combined with Chesto Berry can be used over Taunt, as it provides Annihilape with a one-time way to recover HP and status, as well as being the premier way to heal from strong incoming hits, but it can be easily exploited if the foe is able to chip down Annihilape enough. Tera Water is the premier option, as it boosts Annihilape's defensive profile, giving it resists to moves like Urshifu-R's Surging Strikes and Gholdengo's Make It Rain. Fairy is another option that gives Annihilape nice resistances to moves like Mega Lopunny's Close Combat and an immunity to Draco Meteor or Dragon Darts from Dragapult. Tera Fire gives Annihilape an immunity to Will-O-Wisp from Pokemon like Skeledirge and Rotom-W while giving it a Fairy resistance as well, preventing the likes of Mega Diancie and Iron Valiant from revenge killing it. Notably, all of these types give Annihilape a Flying- and Ghost-type neutrality, preventing Pokemon such as Tornadus-T, Dragapult, and Gholdengo from revenge killing it as easily. 28 Speed EVs help Annihilape outspeed Pokemon such as Mega Tyranitar, Gholdengo, and Rotom-W. The other EVs maximize its special bulk, letting it take hits comfortably from Pokemon like Heatran and Volcarona. Dual screens setters like Tapu Koko and Grimmsnarl let Annihilape tank hits more easily. Entry hazard support from Pokemon like Ting-Lu, Ferrothorn, and Heatran to wear down Pokemon like Iron Valiant and Tapu Lele is appreciated. Allies like Heatran and Tyranitar handle Pokemon such as Tapu Lele, Iron Valiant, and Tornadus-T, with Annihilape cleaning up once the aformentioned threats are removed.</p> "
      },
      {
        "name": "Entry Hazard Lead",
        "description": "<p>Annihilape carves a niche in being a Stealth Rock user that is immune to Rapid Spin from foes like Great Tusk and Iron Treads. Annihilape being a Defog deterrent due to Defiant, as well as its bulk and Final Gambit picking up easy KOs also strengthens this niche. Final Gambit lets Annihilape safely bring in a teammate while dealing massive damage due to its large HP stat. Taunt denies other entry hazards from being set up by Pokemon like Ting-Lu and preventing the use of Defog from Pokemon like Rotom-W and Tornadus-T on the switch. Defog can also activate Defiant, giving Annihilape way more offensive output for Rage Fist and making it easier to pick up a KO. Annihilape won't be Terastallizing often, but Tera Ghost can be used to boost the power of Rage Fist in scenarios where it is boosted, and it gives Annihilape neutralities to moves like Mega Diancie's Moonblast and Tornadus-T's Hurricane or Bleakwind Storm. Annihilape fits on hyper offense exclusively, so Pokemon that benefit from entry hazards being simultaneously denied and set up, such as Espathra and Dragonite, are good partners. Pokemon like Tornadus-T and Mega Diancie are very big problems for Annihilape, so partners like Gholdengo and Mega Scizor are very valuable. Final Gambit removing Pokemon like Great Tusk and Tornadus-T can also be a big help to teammates like Kingambit and Dragonite.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 529732, "username": "adem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 589564, "username": "hidingflames"}]}
  },
  "Clodsire": {"sets": [{"name": "Defensive Entry Hazard Setter"}]},
  "Kingambit": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Kingambit positions itself as a wallbreaker and late-game sweeper thanks to its signature ability in Supreme Overlord. Sucker Punch allows Kingambit to threaten faster opponents and would-be revenge killers such as Tornadus-T, Volcarona, and Mega Medicham. Tera Dark lets Kingambit strengthen its wallbreaking capabilities against bulkier teams. Tera Flying instead lets it play around potential revenge killers, putting them in checkmate situations by turning its Fighting and Ground weaknesses into resistances. 140 Speed EVs let Kingambit outspeed Skeledirge. Entry hazard leads such as Glimmora, Landorus-T, and Annihilape help Kingambit power through its checks by punishing switches. Kingambit is susceptible to faster Fighting-type Pokemon such as Great Tusk, Mega Lopunny, and Urshifu-R, as they will not succumb to a boosted Sucker Punch. Thus, wallbreakers like Dragapult, Dragonite, Espathra, and Iron Valiant that punish foes for using Fighting-type moves help form solid offensive cores; they can also pressure bulky Steel-types that check Kingambit, such as Ferrothorn, Corviknight, and Heatran. In return, Kingambit helps check Psychic-, Ghost-, and Fairy-types, such as Dragapult, Tapu Lele, and Gholdengo.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 501070, "username": "peap"}, {"user_id": 241308, "username": "sanguine"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 385157, "username": "2020 idm boomer"}]}
  },
  "Great Tusk": {
    "sets": [
      {
        "name": "Offensive Utility",
        "description": "<p>Great Tusk is an excellent Pokemon due to its amazing physical bulk, defensive typing, role compression, and movepool. It also has a very strong offensive presence and has utility moves in Rapid Spin and Stealth Rock to back it up. Headlong Rush is an amazing STAB move, letting Great Tusk force out Pokemon such as Heatran, Gholdengo, and Skeledirge very well. Earthquake can be used for a no-drawback STAB move, but the lack in power is certainly noticeable. Close Combat allows Great Tusk to annihilate Pokemon like Kingambit, and Ferrothorn, and it does a nice chunk to Rotom-W on the switch. Rapid Spin provides reliable entry hazard control, which is especially useful because Great Tusk forces out common Stealth Rock users like Heatran and Mega Tyranitar. It also lets Great Tusk outspeed foes like Iron Valiant, non-Choice Scarf Tapu Lele, and Tornadus-T. Ice Spinner lets Great Tusk hit Landorus-T, Dragonite, and Tornadus-T for good damage. Heavy-Duty Boots gives Great Tusk an entry hazard immunity and allows it to safely Rapid Spin, while Leftovers gives it passive recovery and lets it reliably check Pokemon like Kingambit and Garchomp. Booster Energy can be used to improve Great Tusk's already great offensive output, but since it is a one-time use item, it can be quite unreliable. Tera Water improves the matchup into Pokemon like Urshifu-R and Floatzel. Tera Ground removes Great Tusk's Fairy and Psychic weakness and bolsters its offensive output, letting it OHKO Pokemon like Iron Valiant, Choice Scarf Tapu Lele, and Volcarona. Tera Steel gives Great Tusk resistances to the majority of its weaknesses, letting it KO Pokemon such as Tornadus-T, Iron Valiant, Tapu Lele, and Tapu Koko after luring them. Gholdengo and Kingambit make excellent partners for Great Tusk, as Gholdengo safely handles Pokemon like Tapu Lele and Iron Valiant while Kingambit can force out and Pursuit Pokemon like Tornadus-T and Dragapult. Great Tusk is commonly used as setup fodder against Pokemon like Iron Valiant and Volcarona, so partners like Clodsire and Dragonite can support it in that case. Entry hazard setters like Ferrothorn appreciate Rapid Spin support from Great Tusk, as it lets them keep entry hazards up while removing opposing ones, preventing the team from being worn down quickly. Stealth Rock-weak wallbreakers like Nasty Plot Tornadus-T and Mega Charizard Y also appreciate entry hazard removal from Great Tusk, as it lets them come in multiple times and poke holes in the opposition.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 208105, "username": "Jho"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 589564, "username": "hidingflames"}]}
  },
  "Slither Wing": {"sets": [{"name": "Choice Band"}]},
  "Iron Treads": {"sets": [{"name": "Utility"}, {"name": "Assault Vest"}]},
  "Iron Hands": {"sets": [{"name": "Defensive Swords Dance"}, {"name": "Choice Band"}]},
  "Iron Moth": {"sets": [{"name": "Offensive"}]},
  "Baxcalibur": {"sets": [{"name": "Dragon Dance"}]},
  "Gholdengo": {"sets": [{"name": "Nasty Plot"}]},
  "Chien-Pao": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}]},
  "Ting-Lu": {"sets": [{"name": "Defensive Entry Hazard Setter"}]},
  "Iron Valiant": {"sets": [{"name": "Calm Mind"}, {"name": "Mixed Attacker"}, {"name": "Choice Specs"}]}
}