{
  "Dragonite": {"sets": {"Tank": {}, "Extreme Speed": {}}},
  "Porygon2": {"sets": {"Download Support": {}}},
  "Deoxys-Attack": {"sets": {"Expanding Force": {}, "Extreme Speed": {}}},
  "Heatran": {"sets": {"Offensive": {}}},
  "Amoonguss": {"sets": {"Bulky Support": {}}},
  "Tornadus": {"sets": {"Bulky Prankster": {}, "Focus Sash": {}}},
  "Landorus": {"sets": {"Sheer Force": {}}},
  "Landorus-Therian": {"sets": {"Bulky Support": {}, "Choice Scarf": {}}},
  "Volcanion": {"sets": {"Bulky Offense": {}}},
  "Incineroar": {"sets": {"Support": {}}},
  "Rillaboom": {"sets": {"Swords Dance": {}, "Bulky Pivot": {}}},
  "Indeedee-F": {"sets": {"Follow Me Support": {}}},
  "Iron Hands": {"sets": {"Swords Dance": {}}},
  "Gholdengo": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Gholdengo stands out as one of the best setup attackers, with its already massive Special Attack stat and reasonable bulk bolstered further by Nasty Plot and Recover. Additionally, it provides plenty of support thanks to Good as Gold making both itself and its partner immune to status moves including  Amoonguss's Spore and Incineroar's Parting Shot. Make It Rain is Gholdengo's standout move as an exceptionally high-powered spread attack, taking down the likes of Chien-Pao and Glimmora easily as well as Rillaboom at +2. Shadow Ball pressures other Ghost-types such as Sinistcha and opposing Gholdengo effectively while also hitting Steel-resistant foes such as Ogerpon-H well. Gholdengo can choose to run Recover in lieu of Protect if the rest of the team can provide the latter, making it incredibly hard to remove. As Gholdengo wants to sit on the field for as long as possible, Leftovers is the primary recovery item chosen to maximize healing; however, Sitrus Berry is a fine option for more immediate HP recovery. Gholdengo's inability to hit Incineroar for any meaningful damage make partners such as Ogerpon-W and Landorus greatly appreciated. The given bulk EVs allow Gholdengo to survive Landorus-T's Stomping Tantrum, Chien-Pao's Sucker Punch, and Heatran's Flash Fire-boosted Lava Plume. Its Speed allows it to outrun Choice Scarf Landorus-T in Tailwind. Tera Dragon is generally preferred to resist both Ogerpon-H's and Ogerpon-W's STAB moves; however, Tera Water is also fine as a good defensive typing overall.</p> <h1>Notable Partners</h1> <p><strong>Bulky Support Pokemon</strong>: The likes of Incineroar, Amoonguss, and Indeedee-F help make Gholdengo shine, with Intimidate nullifying physical attackers almost entirely and Fake Out, Rage Powder, and Follow Me providing safe opportunities to use Nasty Plot.</p> <p><strong>Other Setup Pokemon</strong>: Dragon Cheer Raging Bolt and Cosmic Power Deoxys-D appreciate Nasty Plot boosting their damage further, as well as the immunity to Taunt and Spore thanks to Good as Gold. Physical setup Pokemon such as Swords Dance Iron Hands particularly appreciate Good as Gold to provide them an immunity to Will-O-Wisp.</p> <p><strong>Pokemon With Immunity Abilities</strong>: Pokemon such as Heatran and Latios provide Gholdengo with Flash Fire and Levitate, respectively, making it immediately immune to types it would otherwise be weak to.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs turns Gholdengo into a behemoth of a special attacker, with it 2HKOing bulkier Pokemon such as Indeedee-F and Dragonite with its Tera Steel-boosted Make It Rain. Choice Specs also helps turn Shadow Ball into an OHKO against the likes of Latios, Sinistcha, and bulky Gholdengo. Dazzling Gleam is one of the best coverage options for Gholdengo, allowing it to deal significant damage to the plethora of Dragon-types in the metagame such as Raging Bolt and Walking Wake. Thunderbolt and Power Gem are alternative coverage options that improve Gholdengo's chances against Volcanion and Incineroar. Trick is an option that disrupts Trick Room setters such as Porygon2 as well as setup attackers like Iron Hands. Steel is Choice Specs Gholdengo's best Tera type, as it further boosts its strongest attack while also retaining its Dragon and Fairy resistances. Choice Specs is particularly good in Partners in Crime, as it allows Gholdengo to lock into its partner's move then later break the Choice lock by having its partner switch.</p> <h1>Notable Partners</h1> <p><strong>Tailwind Users</strong>: Whimsicott and Tornadus are Choice Specs Gholdengo's best friends, with Tailwind allowing it to deal massive damage immediately and its Good as Gold providing Whimsicott and Tornadus with a Taunt immunity. Whimsicott also offers Fake Tears to further boost Gholdengo's damage.</p> <p><strong>Setup Pokemon</strong>: Pokemon that require setup to be as threatening as possible such as Swords Dance Rillaboom appreciate the immediate bursts of damage that Gholdengo can provide.</p> <p><strong>Strong Special Attackers</strong>: Given that Gholdengo can break its Choice lock at any time by having its partner switch, a strong special attacker such as Volcanion and Landorus makes for a great partner. These also happen to pass it invaluable coverage for Fire- and Steel-types, letting it stand up to Incineroar and Heatran more easily.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yuki", "user_id": 294287}], "teams": [{"name": "Quality checked by", "members": [{"username": "HiZo", "user_id": 438997}, {"username": "Chromate", "user_id": 550768}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Chien-Pao": {"sets": {"Offensive": {}}},
  "Sinistcha": {"sets": {"Hospitality Support": {}}},
  "Ogerpon-Wellspring": {"sets": {"Offensive Redirector": {}}},
  "Ogerpon-Hearthflame": {"sets": {"Offensive Redirector": {}}},
  "Raging Bolt": {"sets": {"Setup": {}, "Offensive": {}}}
}