{
  "Charizard": {
    "comments": "<h3>Other Options</h3> <p>Charizard has Dragon Dance and Swords Dance in its arsenal for setting up without sacrificing half of its HP, but Charizard's Attack isn't amazing without multiple boosts, so Charizard needs teams to be significantly worn down before it can sweep. Solar Power might make Charizard look appealing as a sun attacker, but sun is an unreliable team style, Charizard is worn down quickly by Stealth Rock and Solar Power, and it faces competition from Scovillain as a sun sweeper. All-out attacker Charizard can run Focus Blast for greater damage against Rock-types, Snorlax, and Dudunsparce, but Scorching Sands has reliable accuracy and lets Charizard fish for burns on these targets. Belly Drum Charizard can run Tera Ground to turn the tables on Rock-types and Electric-types, and the boost in power to Earthquake lets Charizard reliably OHKO Regirock, Rhydon, and Naclstack. Tera Dark on Belly Drum Charizard can protect Charizard from moves affected by Prankster coming from foes like Grafaiai and Sableye.</p> <h3>Checks and Counters</h3> <p><strong>Faster Revenge Killers</strong>: Jolteon requires little chip damage to revenge kill Charizard, and Choice Specs Jolteon can OHKO Charizard outright. Choice Scarf users like Qwilfish, Magneton, and Rotom also have super effective STAB moves to revenge kill Charizard with less chip damage, and they also gain momentum against it with their pivot moves. Grafaiai, Sneasel, and Mismagius are strong attackers faster than Charizard, but few revenge killers can switch into it safely or repeatedly. Floatzel is unique as a fast physical revenge killer that doesn't fear burns thanks to Water Veil.</p> <p><strong>Rock-types</strong>: Regirock and Rhydon are difficult for Charizard to break on its own, and both still threaten Charizard even when they're burned. Sturdy on Hisuian Avalugg can help it survive even a +6 Earthquake from Belly Drum Charizard and retaliate with a strong Mountain Gale or Rock Blast, but its low special bulk leaves it very vulnerable to all-out attacker Charizard. Naclstack is an excellent wall to all-out attacker Charizard thanks to Recover, Purifying Salt shielding it from burns, and great bulk with Eviolite, but Belly Drum Charizard can OHKO it with a +6 Earthquake.</p> <p><strong>Specially Bulky Pokemon</strong>: Snorlax and Dudunsparce can use all-out attacker Charizard as an opportunity to set up. Dudunsparce can remain healthy with Roost, and Snorlax doesn't mind damage or burns thanks to Rest. Muk dislikes burns but can take repeated hits from Charizard and wear it down with Poison Jab and Knock Off.</p> <p><strong>Bulky Water-types</strong>: Cramorant comfortably walls all-out attacker Charizard thanks to Roost. Lanturn only minds burns cutting into its passive recovery, and it can gain momentum from Charizard with Volt Switch or threaten to spread burns with Scald.</p>",
    "sets": {
      "All-Out Attacker": {
        "description": "<p>Charizard's high Speed, great Special Attack, and unique offensive and defensive typing make it a great all-out attacker, checking many common Grass-types like Whimsicott and Hisuian Decidueye. Charizard's Hurricane is one of its strongest attacks and has few common resistances. Flamethrower has more reliable accuracy than Hurricane, destroys Steel-types like Magneton and Orthworm that can otherwise handle Hurricane, and melts Ice-types like Frosmoth, Glastrier, and Sneasel. Scorching Sands covers Rock-types like Regirock and Rhydon, lets Charizard fish for burns, and is a more accurate move than Hurricane against foes like Typhlosion. Will-O-Wisp punishes physical attackers like Snorlax, Dudunsparce, and Regirock that would otherwise try to take advantage of Charizard. Tera Ground stops fast Electric-types like Jolteon and Choice Scarf Magneton from taking advantage of Charizard with Volt Switch and flips its major 4x Rock weakness into a resistance to better handle Sandaconda and Regirock. Offensively, Tera Ground gives Charizard great odds to 2HKO Lanturn and always 3HKO defensive Muk after Stealth Rock chip.</p> <p>Charizard appreciates pivots like Jolteon and Whimsicott bringing it in safely on Pokemon that check them like Orthworm and Magneton; Charizard also benefits from these teammates checking Water-types like Floatzel, Lanturn, and Clawitzer that it otherwise struggles with. Regirock is a great teammate for Charizard, as it can check special walls like Snorlax and Dunsparce for Charizard and is an even sturdier wall to the threats Charizard burns with Will-O-Wisp. Grass-type partners like Virizion, Hisuian Decidueye, and Dipplin cover Charizard's weaknesses and are complemented by Charizard handling Whimsicott. Charizard is a great check to Palossand, one of the toughest walls for Hisuian Sneasel and Toxicroak, so they benefit from having Charizard as a partner while they threaten one of Charizard's biggest checks in Regirock.</p>"
      },
      "Belly Drum": {
        "description": "<p>After a Belly Drum, Charizard becomes a deadly sweeper capable of OHKOing most Pokemon that don't resist Acrobatics. Even physical walls like Weezing and Palossand are KOed by +6 Acrobatics after Stealth Rock damage. Earthquake wrecks bulky Pokemon that resist Acrobatics like Magneton, and at +6, Charizard's Earthquake OHKOes even Regirock after Stealth Rock damage, Rhydon after Spikes damage, and Naclstack. Earthquake has a small perk of avoiding negative contact effects such as Rocky Helmet damage from Qwilfish. Flame Charge makes Charizard harder to revenge kill by fast Pokemon like Jolteon and Choice Scarf Rotom, and at +6, it is likely to OHKO Orthworm after Stealth Rock damage. Sitrus Berry restores some of Charizard's health given that Stealth Rock and Belly Drum both take 50% of its HP, and it easily allows Charizard to consume its item and maximize damage from Acrobatics. Tera Flying boosts Acrobatics, allowing Charizard to reliably OHKO physical walls like Sandaconda and Palossand and take neutral damage from Aqua Jet users like Qwilfish and Veluza that can revenge kill it.</p> <p>Belly Drum Charizard usually has just one chance to sweep, so it primarily features on hyper offensive teams built around fast-paced setup sweepers. Charizard benefits immensely from teammates that set entry hazards, enabling it to OHKO foes like Palossand, Rhydon, and Regirock, all of which could otherwise survive its onslaught; offensive teammates like Hisuian Avalugg and Primeape can reliably set Stealth Rock, and Qwilfish and Hisuian Qwilfish can set Spikes for Charizard. Sandslash is an excellent partner for Charizard, as it can set up hazards, remove hazards with Rapid Spin, and check Rock- and Electric-types for Charizard. Parting Shot users like Grafaiai and Alolan Persian can weaken foes and ease Charizard's time setting up. Memento users like Mismagius and Whimsicott can put Charizard in a good position to sweep by debuffing foes. Offensive pivots like Mesprit and Whimsicott can bring Charizard into favorable matchups against Pokemon they lure in like Orthworm and Articuno. Other physical attackers like Hisuian Decidueye, Glastrier, and Toxicroak can break holes in teams so that Charizard can clean up afterwards, and they all appreciate its great Speed and potential to sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Raichu-Alola": {"sets": {"Nasty Plot": {}}},
  "Sandslash": {"sets": {"Rapid Spin": {}, "Swords Dance": {}}},
  "Venomoth": {"outdated": true, "sets": {"Offensive Quiver Dance": {}, "Quiver Dance + Disable": {}}},
  "Dugtrio-Alola": {"outdated": true, "sets": {"Fast Attacker": {}}},
  "Persian-Alola": {"outdated": true, "sets": {"Defensive Pivot": {}, "Choice Scarf": {}, "Nasty Plot": {}}},
  "Primeape": {"outdated": true, "sets": {"Offensive Stealth Rock": {}, "Bulk Up": {}, "Suicide Lead": {}}},
  "Poliwrath": {"outdated": true, "sets": {"Bulk Up": {}}},
  "Victreebel": {"sets": {"Sun Sweeper": {}}},
  "Magneton": {
    "sets": {
      "Offensive Pivot": {},
      "Choice Specs": {
        "description": "<p>Choice Specs Magneton is one of the most feared wallbreakers in the entire tier. Many teams are completely incapable of safely switching into Magneton thanks to its great STAB combination and access to Analytic, which amps up its power even further. Volt Switch complements Magneton nicely, as it is still quite powerful and allows Magneton to keep up momentum for its team. Magneton is generally quite good at pivoting, as many of the Pokemon immune to Electric, such as Palossand, Sandslash, and Sandaconda, fear Magneton's Steel-type STAB moves. Steel Beam is a monstrously powerful attack that is capable of hitting several notable power benchmarks, including OHKOing Sandaconda and Regirock so they can't KO Magneton back. While the massive recoil damage prevents it from being a staple attack, it gives a teammate free entry into battle should Magneton take itself out due to recoil. Tera Steel is preferred to jack up the power of Flash Cannon and Steel Beam even more, allowing the former to reliably 2HKO Jolteon, Dudunsparce, and specially defensive Mesprit and the latter to 2HKO Snorlax and Porygon2. However, Tera Blast with Tera Grass allows Magneton to threaten standard checks such as Lanturn and various Ground-types with high damage while also becoming resistant to their STAB moves. Analytic allows Magneton to hit switch-ins much harder than it would be able to otherwise, which has great synergy with its threatening wallbreaking profile as well as Volt Switch. It also boosts its power should it have to take a hit before moving, which can be useful versus weak moves that Magneton resists, such as STAB moves from Mesprit and Farigiraf. However, such situations should generally be avoided due to Magneton's middling bulk. A Timid nature is recommended in order to outrun Jolly Hisuian Decidueye and Farigiraf.</p> <p>Choice Specs Magneton fits well on teams ranging from offense to balance teams due to its ability to act as a strong wallbreaker and a reliable pivot. Magneton's toolkit is appreciated by a variety of offensive teammates. Magneton's power is intimidating, but special walls such as Snorlax and Porygon2 can check it. Teammates with powerful Fighting-type coverage, such as Passimian, Regirock, and Orthworm, are good teammates, as are Grass-types, such as Hisuian Decidueye, Virizion, and Brute Bonnet. Their ability to threaten Ground-types that might try to absorb Magneton's Electric-type STAB moves while still being able to break through standard special walls is very useful for Magneton, and they can also switch into annoying Ground-types, such as Sandaconda, Palossand, and Sandslash. Magneton, in return, can bring them in safely with Volt Switch and threaten physical walls such as Weezing, Orthworm, and Qwilfish. Switch-ins to Fire-types are also needed, as Magneton is easily revenge killed by foes such as Charizard, Typhlosion, and Pyroar. Bulky Water- and Rock-types, such as Cramorant, Lanturn, Regirock, and Rhydon, are therefore good teammates. Faster, frailer partners also appreciate Magneton's wallbreaking and pivoting capabilities; Passimian, Floatzel, Grafaiai, and Lycanroc appreciate Magneton threatening to break down defensive cores and bringing them in safely with Volt Switch. The first three can also form a pivoting core with it, while Passimian and Grafaiai can also use Knock Off to remove Heavy-Duty Boots from specially defensive Magneton checks, making them even more vulnerable to chip damage. On a related note, Magneton also benefits significantly from entry hazards being on the opponent's side of the field, as several of its bulkier checks, such as Porygon2 and Snorlax, do not normally hold Heavy-Duty Boots. Stealth Rock setters such as Mesprit, Sandaconda, and Regirock can set up the hazard reliably to assist Magneton's wallbreaking capabilities, and they are generally not significantly threatened by Magneton's bulky checks. Spikes setters such as Qwilfish, Hisuian Qwilfish, and Orthworm also work well. Teams utilizing Magneton require additional preparation for Lanturn, which is one of the only Pokemon in the tier that switches into Magneton with impunity and largely prevents it from performing its role as a wallbreaking pivot unless Magneton is packing Tera Grass. Dedicated Lanturn answers such as the aforementioned Grass-types as well as specially bulky teammates such as Dudunsparce, Porygon2, and Snorlax make for good teammates as a result.</p>"
      },
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 654091, "username": "FlamPoke"}, {"user_id": 452572, "username": "missangelic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Dodrio": {"sets": {"Swords Dance": {}}},
  "Muk": {"outdated": true, "sets": {"Defensive": {}, "Assault Vest": {}}},
  "Haunter": {"sets": {"Choiced": {}}},
  "Exeggutor-Alola": {"sets": {"Choice Specs": {}, "Offensive Trick Room": {}, "Bulky Attacker": {}}},
  "Hitmonlee": {"sets": {"Swords Dance": {}}},
  "Hitmonchan": {"sets": {"Bulky Rapid Spin": {}, "Swords Dance": {}}},
  "Weezing": {
    "overview": "<p>With its incredible physical bulk, great typing, and ability, Weezing serves as an excellent physical wall. Its Poison typing gives it a resistance to Fighting-type attacks, making it an incredible check to Fighting-types, such as Virizion, Hisuian Decidueye, and Passimian. Its bulk allows it to easily spread status through Will-O-Wisp and Sludge Bomb, making Weezing incredibly irritating to switch into. However, Weezing lacks any reliable recovery, making it easy to wear down over the course of a game. Its mediocre special bulk means it folds to any strong special attack. Weezing also faces competition from fellow Poison-types Qwilfish and Hisuian Qwilfish, which have access to Spikes and pivoting moves.</p>",
    "comments": "<h3>Checks and Counters</h3> <p><strong>Special Attackers</strong>: Weezing's lacking Special Defense makes it susceptible to any strong neutral attack from the likes of Charizard, Mismagius, and Jolteon. However, Sludge Bomb's nasty poison chance makes it hard to consistently switch these attackers in.</p> <p><strong>Residual Damage</strong>: As tanky as Weezing is, its lack of reliable recovery leaves it prone to being overwhelmed, especially in longer games versus bulkier teams. Strong attacks can easily bypass Pain Split's weak healing, leaving Weezing vulnerable to being forced past by attackers like Sneasel and Dodrio.</p> <p><strong>Psychic-types</strong>: Mesprit can easily switch in on Weezing, only fearing Sludge Bomb's poison chance, threaten it out, and use it to set entry hazards, pivot with U-turn, set up Substitute or boosts, or do any other of the million things it does. Farigiraf can also easily enter on Weezing and start boosting. Less common Psychic-types like Malamar, Indeedee-F, and Veluza still scare Weezing out with super effective Psychic-type attacks and use it to force progress throughout the game, though none of them enjoy being poisoned or burned.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Sludge Bomb's poison chance makes it the preferred attack of choice, threatening otherwise safe switches like Mesprit and Lanturn with uncomfortable chip damage. Will-O-Wisp cripples physical attackers and spreads chip damage on common switch-ins like Lanturn and Mesprit. Pain Split gives Weezing some staying power and helps it stick around in longer games. Haze denies setup sweepers like Swords Dance Virizion and Hisuian Decidueye. Taunt messes with defensive foes, denying attempts at setting entry hazards, spreading status, and recovery. Toxic Spikes messes with grounded Pokemon like Regirock and is great into bulkier teams. Rocky Helmet chips away at physical attackers using contact moves. Levitate lets Weezing hover over Spikes as well as Ground-type moves, letting it ignore Earthquake from Passimian and Sandaconda. Tera Steel makes Weezing resist Psychic-type attacks from Mespirit and Farigiraf, as well as a ton of other types like Flying, Normal, and Ice, making it a better check to many physical attackers like Dodrio and Glastrier. However, Tera Steel makes Weezing weak to Fighting-type attacks, reducing its effectiveness as a check to Fighting-types like Hisuian Decidueye and Passimian.</p> <p>Balance teams can tend to struggle against the many strong Fighting-types like Hisuian Decidueye and Passimian, so Weezing is a great fit on these teams to take this pressure off its teammates. Because of this, Fighting-weak partners like Porygon2 and Sneasel appreciate Weezing's presence. Weezing is one of the few counters to Poison-types like offensive Qwilfish and Grafaiai, a very useful trait compared to other balance staples like Regirock and Palossand, which can get overwhelmed by coverage and poison. Glastrier is another wallbreaker that balance teams struggle with, and Weezing can help its team dance around it. As Weezing can't take special hits very well, special walls like Lanturn and Orthworm are helpful for sponging the special attacks aimed at Weezing. Lanturn and Orthworm coincidentally form a powerful defensive core with Weezing, with Weezing covering Lanturn's Grass- and Ground-types for Lanturn and Fighting-types for Orthworm. In return, Lanturn blanket checks most special attackers for Weezing, particularly the Fire-types that can enter on a predicted Will-O-Wisp, as well as Magneton, which can use Weezing as an easy entry point. Dudunsparce and Snorlax appreciate Weezing's Fighting resistance and, in return, handle threatening special attackers like Mismagius and Rotom for it. Offensive threats like Glastrier and Frosmoth appreciate having Weezing to fall back on against would-be revenge killers like Passimian.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626095, "username": "sinnabyss"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 643347, "username": "marillvibes"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Rhydon": {"sets": {"Bulky Stealth Rock": {}, "Swords Dance": {}}},
  "Tauros": {"outdated": true, "sets": {"All-Out Attacker": {}}},
  "Jolteon": {
    "overview": "<p>With Speed only eclipsed by Hisuian Electrode backed up with good power, Jolteon establishes itself as a premier fast pivot. Its fast Volt Switch makes it an easy candidate on VoltTurn teams, and its adequate coverage with Alluring Voice and Shadow Ball discourages specially bulky Pokemon like Virizion and Mesprit from switching into it. Jolteon's decent set variety means it can be a deadly Calm Mind sweeper or a dangerous wallbreaker with Choice Specs. Jolteon's defensive utility with Volt Absorb and passable special bulk also makes it a situational switch-in to special attackers like Articuno, Cramorant, and Rotom. However, the lacking power of its coverage moves causes it to struggle quite hard against specially defensive Pokemon like Snorlax and Dudunsparce as well as Ground-types like Rhydon. Said Ground-types make Jolteon quite reliant on Terastalization to bypass its checks, which causes it to demand for more team support. Jolteon also faces competition from Hisuian Electrode, which boasts higher Speed and an additional Grass subtyping that allow it to beat Ground-types instead of being walled by them.</p>",
    "comments": "<h3>Other Options</h3> <p>On Choice Specs sets, Tera Blast Water can be used as a coverage move to drench Ground-types like Sandaconda and Sandslash. Tera Blast Ice and Tera Blast Fire both threaten Jolteon's Grass-type checks, with the former even targeting Ground-types. However, slotting Tera Blast makes Jolteon more reliant on team support to weaken its checks, and Terastalizing Jolteon into an Ice- or Fire-type requires entry hazard removal. Jolteon still gets walled by Grass-types if running Tera Blast Water. Tera Blast Flying allows Jolteon to beat Hisuian Electrode and gives it an immunity to Ground-type moves, though it once again demands hazard removal.</p> <h3>Checks and Counters</h3> <p><strong>Special Walls</strong>: Specially defensive Pokemon like Snorlax and Regirock are not particularly bothered by even Choice Specs Jolteon, as they have the bulk to weather repeated hits and can threaten huge damage on it back with their respective STAB moves.</p> <p><strong>Ground-types</strong>: Specially bulky Ground-types like Toedscool and Rhydon are Jolteon's biggest obstacles, preventing it from pivoting and threatening to OHKO it with their STAB moves. They can proceed to set up Stealth Rock against it, with the latter even using it setup fodder. However, Ground-types that have mediocre special bulk like Sandaconda, Sandslash, and Palossand, must be wary of Jolteon's Choice Specs-boosted coverage.</p> <p><strong>Grass-types</strong>: Shaymin's excellent natural bulk and Hisuian Electrode's resistances to Jolteon's entire moveset bar Shadow Ball make them the two most reliable Grass-type switch-ins, with both able to threaten it back with their own STAB moves. Other Grass-types like Hisuian Decidueye, Alolan Exeggutor, and Virizion are similarly effective but must watch out for coverage options.</p> <p><strong>Revenge Killers</strong>: Despite being the second fastest unboosted Pokemon in the metagame, Jolteon has mediocre longevity and can get picked off easily by faster Choice Scarf users like Bruxish, Passimian, and Mesprit without too much trouble; the aformentioned Hisuian Electrode can even pick off Jolteon without using a Choice Scarf. All of these Pokemon can also pivot on it in return, causing Jolteon's teammates to lose momentum. Slower cleaners or wallbreakers with priority moves like Sneasel and offensive Hisuian Decidueye can exploit Jolteon's low physical bulk without too much prior damage.</p>",
    "sets": {
      "Calm Mind": {
        "description": "<p>After one Calm Mind boost, Jolteon's Thunderbolt 2HKOes unboosted Orthworm. Volt Switch maintains momentum and allows it to escape bad matchups like Snorlax, Regirock, and Virizion. Jolteon's fourth moveslot is flexible and can depend on the team's need for coverage. Alluring Voice discourages certain Grass-types like Virizion and Hisuian Decidueye from switching in and also targets Dragon-types like Dipplin and Alolan Exeggutor that would be comfortable switching into its Electric-type STAB moves. It also hits Tera Dragon users like Sandaconda and Regirock, walls that would otherwise switch into Jolteon without too much trouble. Shadow Ball hits Psychic-types like Uxie and Mesprit harder than any of its STAB moves do while also hitting Ghost-types like Palossand and Mismagius quite hard. While Jolteon's Tera type is flexible, Tera Blast Ice synergizes the best when striking back at its overall checks, hitting Ground-types like Sandaconda and Rhydon and Dragon-types like Alolan Exeggutor and Dipplin. However, this comes at the cost of using up the Terastallization slot. Tera Fairy and Tera Ghost, on the other hand, strengthen Alluring Voice and Shadow Ball, respectively, and make Jolteon slightly better at taking Fighting-type attacks from Pokemon like Passimian and Virizion. Volt Absorb allows Jolteon to switch in against predicted Electric-type attacks from Pokemon like Rotom and opposing Jolteon.</p> <p>Jolteon's blistering Speed makes it a prime candidate for VoltTurn teams, pairing well with pivots like Mesprit, Passimian, and Hisuian Decidueye. In addition to pivoting, they all can provide utility with Knock Off. Knock Off support works especially well with Jolteon, as its Volt Switch is able to put more pressure on Pokemon reliant on items like Leftovers and Heavy-Duty Boots for longevity, such as walls like Snorlax and Hisuian Decidueye. Wallbreakers like Bruxish and Glastrier benefit from Jolteon's Volt Switch and can capitalize on its checks. Grass- and Water-types like Shaymin, Virizion, Qwilfish, and Poliwrath can switch in and force out the Ground-types Jolteon struggles against and delay its need to Terastallize. Similarly, checks to Grass-types like Qwilfish formes and Articuno can similarly benefit Jolteon either through entry hazard and status support or through pivoting, respectively, allowing it to Terastallize as a later time. Hisuian Electrode stands out as Jolteon's worst matchup, possessing a quadruple resistance to Jolteon's STAB moves, higher Speed, and an immunity to Alluring Voice; checks to Hisuian Electrode like Hisuian Decidueye and Alolan Exegutor can blank its Volt Switch and threaten the opposition with their powerful STAB moves. Deterrents to Snorlax like Regirock and Toxicroak are valuable for pressuring it to Terastalize sooner, which can be exploited by teammates like Qwilfish formes and Hisuian Sneasel.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs boosts Jolteon's decent power to more threatening levels while still leveraging its excellent Speed. Volt Switch allows Jolteon to escape from walls like Snorlax and Regirock and maintain momentum for its team. Alluring Voice and Shadow Ball are Jolteon's strongest options for coverage against Ground-type foes; the former strikes at Fighting- and Dragon-types like Virizion and Alolan Exeggutor, while the latter pressures Ghost-types like Palossand and Rotom. Despite Jolteon's frailty, Volt Absorb gives it limited defensive utility by making it a situational switch-in against Electric-types like Rotom, opposing Jolteon, and Hisuian Electrode.</p> <p>While Choice Specs's enhanced power makes Jolteon more threatening as a pivot, it still struggles to tackle Ground- and Grass-types. Water- and Grass-types like Bruxish, Clawitzer, Virizion, and Hisuian Decidueye are great candidates to threaten these walls. Jolteon can form VoltTurn cores with fellow pivots like Passimian, Qwilfish formes, and Grafaiai, keeping momentum while threatening Jolteon's checks like Snorlax and Alolan Exeggutor. Water-types like Bruxish and Clawitzer pair excellently with Jolteon, threatening out Ground-types like Rhydon and Palossand that intend to block Jolteon's Volt Switch while maintaining a VoltTurn core. Similarly, checks to Grass-types like Charizard and Hisuian Sneasel can take advantage of Jolteon's Volt Switch and threaten heavy damage.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 528485, "username": "DerpySuX"}]}]}
  },
  "Snorlax": {
    "overview": "<p>Continuing its dramatic fall from grace from the higher tiers, Snorlax now establishes itself as a dominant force in ZU with its Curse sets. Thanks to its overall outstanding bulk and offensive versatility, Snorlax is quite difficult to stop once it gets stat boosts, even when factoring in Rest turns. Snorlax isn't just limited to late-game cleaning, either — it can also use said bulk and Thick Fat to function as a reliable sponge to common special attackers like the Oricorio formes, Jolteon, and Typhlosion while also being a good paralysis spreader with Body Slam. Walls comfortable switching into Body Slam also have to be aware of Heat Crash, limiting the consistency of its switch-ins. However, its low Speed and reliance on Rest or Protect for recovery make it quite easy to pressure it into passivity and cost momentum for its team. Snorlax's lack of resistances also makes it easy for Fighting-types like Virizion and Passimian to pressure it to Terastallize earlier than expected, which forces careful play to ensure a successful sweep.</p>",
    "comments": "<h3>Other Options</h3> <p>Snorlax's coverage move is quite flexible -— Crunch hits Ghost-types like Palossand and Drifblim harder, while Heavy Slam more heavily pressures Tera Fairy setup sweepers like Mesprit and Dudunsparce. However, Crunch is usually noticeably weaker compared to Heat Crash, and Heavy Slam worsens its matchup against Steel-types and Tera Steel Pokemon and is still walled by Rock-types. Sleep Talk over Curse makes Snorlax more consistent as a special wall at the cost of its late-game potential. Heavy-Duty Boots is a notable alternative to Leftovers, allowing Snorlax to fare better against entry hazards and easing the need for hazard removal. However, Snorlax usually appreciates the passive recovery from Leftovers better. Offensive sets like Choice Band are usable to surprise the opposition but are held back by Snorlax's low Speed and giving up quite a lot of its bulk.</p> <h3>Checks and Counters</h3> <p><strong>Rock-types</strong>: Rock-types like Hisuian Avalugg, Regirock, and Rhydon are not particularly bothered by even a boosted Snorlax and can set up Stealth Rock or pressure it with repeated uses of Body Press, with the latter two even using it as setup fodder.</p> <p><strong>Fighting-types and Fighting-type Coverage</strong>: Fighting-types like Hisuian Decidueye, Virizion, and Passimian can threaten huge damage on Snorlax with their Fighting-type STAB moves, though none of them particularly enjoy it Terastallizing to Fairy. Hisuian Sneasel can even threaten Snorlax even when the latter Terastallizes with its Poison-type STAB moves. Pokemon with Fighting-type coverage like Clawitzer, Glasterier, and Braviary can also pressure it into Terastallizing sooner than expected.</p> <p><strong>Strong Wallbreakers</strong>: Strong physical wallbreakers like Glastrier, Dodrio, and Braviary can strike at Snorlax's initially lower physical bulk and cause it to use Rest sooner than expected.</p> <p><strong>Coil Sweepers</strong>: Coil sweepers like Orthworm and Dudunsparce can consistently keep up and eventually overpower Snorlax with their Steel typing and Dragon Tail, respectively, though the latter would need to PP stall a Terastallized Snorlax to win. While Sandaconda cannot outright beat Snorlax without critical hits, it can outlast Snorlax by PP stalling and can brush off status with Shed Skin.</p> <p><strong>Item Removal</strong>: Snorlax's Leftovers is an essential part for it to wall and sweep teams; Knock Off users like Grafaiai, Mesprit, and Dodrio endanger its chances of sweeping and follow up with strong STAB moves in their arsenals. Trick and Switcheroo users like Whimsicott, Grafaiai, and Mismagius can outright neuter Snorlax's sweeping potential with a Choice item, forcing it out.</p> <p><strong>Residual Damage</strong>: Snorlax hates taking residual damage, with common entry hazard setters like Orthworm, Qwilfish, and Sandaconda making it more difficult for Snorlax to sweep; the latter two can also rack up additional chip damage with Rocky Helmet. Status like burn and poison also forces Snorlax to use Rest, causing it to become more passive. Snorlax also can quickly get worn down by VoltTurn users like Mesprit, Whimsicott, and Jolteon as a switch-in to them, risking losing momentum against them.</p>",
    "sets": {
      "CurseLax": {
        "description": "<p>STAB Body Slam not only functions as Snorlax's primary attacking move but also threatens incoming switch-ins like Qwilfish formes and Hisuian Decidueye with the chance of paralysis. Heat Crash is a powerful coverage move that hits both Ghost-types like Rotom, Mismagius, and Oricorio-G that would freely switch into Body Slam and Tera Steel users like Hisuian Decidueye. Rest fully restores Snorlax's health and removes existing status conditions at the expense of making it passive for two turns. Alternatively, Protect scouts for Choice-locked foes like Passimian and Rotom and racks up additional Leftovers recovery at the cost of being unable to remove status. Tera Fairy turns its Fighting weakness into a resistance and provides an immunity to Dragon-type moves from foes like Dipplin and Alolan Exeggutor. Tera Fairy Snorlax also benefits from Poison- and Steel-type moves being uncommon. Thick Fat strengthens its defensive profile by making it a consistent switch-in to Fire- and Ice-types like Typhlosion, Charizard, and Frosmoth.</p> <p>Snorlax excels mid- or late-game as a setup sweeper that can take advantage of Fighting-types and wallbreakers being worn down. Physical walls like Qwilfish, Hisuian Decidueye, and Sandaconda shore up Snorlax's lower physical bulk and can provide entry hazards to wear down switch-ins like opposing Qwilfish and Dudunsparce; they are also excellent as Knock Off absorbers to preserve Snorlax's Leftovers. Choice item wallbreakers like Whimsicott and Jolteon can simulataneously provide wallbreaking and pivoting support for Snorlax to enter the field safely; they can help discourage physical walls like Palossand and Qwilfish formes from freely switching in. Poison-types like Qwilfish and Weezing can help with Snorlax's weakness to Fighting-types and provide additional utility. Rock-types like Regirock, Rhydon, and Hisuian Avalugg can easily ward off anything Snorlax can do, so checks to them like Virizion, Hisuian Decidueye, and Weezing are helpful to consistently force them out. Palossand stands out, as it can not only check the aformentioned Rock-types but also Fighting-types thanks to its excellent bulk and typing. Due to Snorlax's utility as a special wall and susceptibility to residual damage, Defoggers like Hisuian Decidueye and Cramorant are critical in preventing Snorlax from being worn down by hazards; the lack of hazards make it far more consistent walling foes and sweeping throughout a game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Articuno": {
    "comments": "<h3>Other Options</h3> <p>Hurricane is less reliable than Freeze-Dry but is stronger and much more significant against foes that resist Ice such as Typhlosion, Frosmoth, and Glastrier. A more offensive EV spread using Hurricane can catch faster or more offensive Pokemon expecting to get the jump on Articuno off-guard, letting Articuno nail foes weak to Freeze-Dry like Hisuian Decidueye, Rock Blast Sandaconda, and Clawitzer while still maintaining its good bulk. However, Articuno is not very strong on its own and tends to be outclassed by other offensive pivots like Mesprit, Passsimian, and Whimsicott for their superior power, coverage, and utility from moves like Knock Off, Trick, and Switcheroo. Tera Ground alleviates Articuno's 4x Rock weakness and gives it an immunity to Electric to enable it to block Volt Switch, but it worsens Articuno's matchups against specially offensive Grass-types like Whimsicott, Calm Mind Virizion, and Alolan Exeggutor that it's meant to check.</p> <h3>Checks and Counters</h3> <p><strong>Rock-types and Rock-type Coverage</strong>: Articuno's 4x Rock weakness makes Rock-type moves a huge threat to it. Regirock and Hisuian Avalugg can threaten out Articuno and use it as an opportunity to set up entry hazards. Though Rhydon is suspectible to Freeze-Dry, it is very offensively threatening to Articuno. Naclstack cannot get frozen, can recover off chip damage from Articuno, and wears Articuno down with Salt Cure. Sandaconda and Virizion commonly run Rock-type coverage but must be wary of Articuno's Freeze-Dry and strong Hurricane.</p> <p><strong>Item Removal</strong>: Articuno depends on its Heavy-Duty Boots to avoid losing 50% of its HP to Stealth Rock as it switches in, so losing them hurts its longevity and pushes it to Terastallize. Mesprit is a common special attacker that can lure Articuno in and threaten to use Knock Off or give it a Choice item with Trick. Mismagius and Whimsicott respectively run Trick and Switcheroo.</p> <p><strong>Steel-types</strong>: Orthworm shrugs off attacks from Articuno, threatens it with its Steel-type STAB moves, and can set up Coil or entry hazards on it. Magneton is only chipped by Articuno's attacks, threatens it with its STAB moves, and can keep up momentum if Articuno switches out with its STAB Volt Switch.</p> <p><strong>Electric-types</strong>: Jolteon, Rotom, and Alolan Raichu resist Hurricane, threaten Articuno with their Electric-type STAB moves, and can gain momentum with Volt Switch. All three of the Electric-types can use setup moves to blow through Articuno.</p> <p><strong>Fire-types</strong>: Charizard and Typhlosion overcome Articuno's massive special bulk thanks to their super effective STAB attacks. Although Typhlosion resists Freeze-Dry, it prefers not to take damage in order to preserve the power of its Eruption. Oricorio-F and Pyroar can use Taunt on Articuno, and the former can set up on Articuno with Quiver Dance and Roost. However, all of them struggle to break through Tera Dragon Articuno.</p>",
    "sets": {
      "Special Wall": {
        "description": "<p>Amazing bulk and reliable recovery make Articuno a cool special wall in the ZU metagame. Special attackers like Whimsicott and Calm Mind Dudunsparce struggle to break through Articuno on their own. Roost keeps Articuno healthy and lets it take repeated hits from special wallbreakers like Alolan Exeggutor and Clawitzer while stonewalling more passive Pokemon like Lanturn and Cramorant. Freeze-Dry has the best coverage and reliability of any of Articuno's moves, nailing special attackers like Cramorant, Lanturn, and Oricorio-G. U-turn helps Articuno keep up momentum against wallbreakers that might switch in against it like Charizard, Typhlosion, and Magneton. Haze immediately removes boosts from special setup users like Frosmoth and Oricorio-G. Roar is an alternative to Haze that lets Articuno rack up residual damage from entry hazards, but it forces Articuno to move second and fails if the target is the last active member of its team. Tera Dragon helps Articuno beat Fire-types it struggles against like Charizard and Typhlosion. Tera Steel gives Articuno a Toxic immunity and lets it more reliably check attackers like Grafaiai, Alolan Exeggutor, and Farigiraf.</p> <p>Articuno is a great choice for balance teams in need of a specially defensive Pokemon. However, Articuno can also support more offensive teams thanks to U-turn enabling teammates like Typhlosion, Charizard, and Clawitzer. Pokemon vulnerable to Grass-types and special attackers such as Sandaconda, Dipplin, and Palossand greatly appreciate Articuno's support, and they can assist it against threatening physical attackers like Rhydon and Passimian. Articuno can form cores with other pivots like Passimian, Jolteon, and Qwilfish. Articuno's 4x weakness to Rock is a major vulnerability that can be covered by partners like Hisuian Decidueye, Orthworm, and Palossand. Entry hazard setting partners like Naclstack, Regirock, and Hisuian Qwilfish complement Articuno running Roar, as Articuno racks up hazard damage with Roar, forces Dipplin out even if it Terastallizes, and pressures other Pokemon vulnerable to hazards like Snorlax and Regirock to switch in. Knock Off users like Mesprit, Grafaiai, and Passimian support Articuno if it runs Roar to rack up entry hazard chip damage by removing Heavy-Duty Boots from foes dependent on them to avoid hazard damage such as opposing Articuno, Sandslash, and Cramorant. Articuno struggles with Fire-types like Typhlosion and Charizard, so Snorlax and Regirock partner well with it by bolstering against these bad matchups. Steel-types like Orthworm and Magneton can respectively set up on Articuno and break through it, so teammates like Hisuian Decidueye, Passimian, and Virizion can threaten them for Articuno.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Typhlosion": {
    "overview": "<p>Choice Specs Typhlosion is an insanely powerful special attacker in a tier without much in the way of sturdy Fire-resistant Pokemon. Much of its power comes from its move Eruption, which has unparalleled strength with Typhlosion at full health and can OHKO most neutral targets such as Mesprit and Passimian. With Typhlosion's Speed tier, it outspeeds much of the unboosted metagame, meaning that it can frequently come in and pick up KOs. However, Choice Specs Typhlosion struggles against faster Pokemon such as Grafaiai and Choice Scarf users like Passimian that can damage it before it moves and limit its power; it's also checked by the few Pokemon that can take on its Eruption reliably such as Snorlax and Cramorant, necessitating a team to have good answers to them such as Regirock and Articuno, respectively. On the other hand, the Choice Scarf set misses some OHKOs such as against Mesprit and Palossand, but it outspeeds common Choice Scarf users like Rotom and Passimian and fast attackers like Sneasel and Jolteon. Typhlosion's Eruption is limited by Stealth Rock as well as other damaging entry hazards, meaning it requires hazard removal support from the likes of Cramorant and Hisuian Decidueye.</p>",
    "comments": "<h3>Other Options</h3> <p>Heavy-Duty Boots might seem tempting to ignore entry hazards and preserve the power of Typhlosion's Eruption, but this comes with the trade-offs of sacrificing vital power or Speed on Typhlosion, leaving it otherwise outclassed by Charizard once Eruption is no longer at full power. An alternative Tera type like Ground might seem interesting for Typhlosion to catch fast revenge killers like Jolteon and Choice Scarf Magneton off guard while powering up its Scorching Sands. However, Typhlosion should prioritize using its Fire-type moves to their fullest, as it without Tera Fire, it will otherwise miss out on KOs such as Choice Scarf Mesprit after Stealth Rock damage, Jolteon, and Mismagius.</p> <h3>Checks and Counters</h3> <p><strong>Entry Hazards</strong>: Stealth Rock, Spikes, and even Toxic Spikes ruin Typhlosion's stand-out power and the reason to use it. Sticky Web leaves Typhlosion prone to being outsped.</p> <p><strong>Special Sponges</strong>: Snorlax and Regirock can withstand Eruptions from Typhlosion. Typhlosion can deal significant damage to these Pokemon with Focus Blast, but the inconsistent accuracy and commitment of locking into a coverage move are hard on Typhlosion. Scorching Sands hits Lanturn for solid damage, but Typhlosion dislikes locking into it due to its low power and exploitability by foes immune to Ground such as Orthworm, Mesprit, and Cramorant. Defensive Terastallization flips Articuno from easy prey for Typhlosion to a wall capable of burning through the low PP of Typhlosion's moves with Pressure.</p> <p><strong>Pokemon Immune or Resistant to Fire</strong>: Typhlosion should prioritize using Eruption, so Pokemon immune to it and Pokemon that can tolerate it are a huge issue if Typhlosion is to keep its Eruptions powerful. Cramorant has reliable recovery and avoids a 2HKO from Choice Specs Eruption while threatening Typhlosion with Surf and Gulp Missile. Lanturn can pivot into Typhlosion's Fire-type moves and generate momentum with Flip Turn or Volt Switch. Charizard, Rhydon, and Clawitzer can retaliate with a strong hit against Typhlosion to impair its power after they withstand one Tera Fire Choice Specs Eruption. Oricorio-F can boost its Special Defense with Quiver Dance and stall Typhlosion out of Eruptions with Roost.</p> <p><strong>Priority</strong>: Even chip damage wrecks the power of Eruption, and Typhlosion's lacking Defense and defensive typing leave it prone to being picked off once it's in range of Blaze. Aqua Jet from the Qwilfish formes and Floatzel is especially harmful to Typhlosion. Even otherwise easy targets like Hisuian Decidueye, Toxicroak, and Dodrio can clip Eruption's power to make Typhlosion easier to handle.</p> <p><strong>Faster Revenge Killers</strong>: Choice Specs Typhlosion is speedy but still slower than Grafaiai, Jolteon, and Mismagius as well as Choice Scarf users like Mesprit, Rotom, and Passimian. Choice Scarf Typhlosion is quite fast for a Choice Scarf user but is still outsped by faster Choice Scarf users like Grafaiai, Hisuian Sneasel, and Floatzel.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<p>Eruption is Typhlosion main STAB attack, dealing insane damage at full health, even being able to 2HKO Fire-resistant Pokemon like Regirock and Appletun with the help of Tera Fire. Fire Blast and Flamethrower are to be used when Typhlosion gets weakened; both options are valid and come down to personal preference between power and accuracy. Fire Blast namely gives better odds to OHKO threats such as Sandslash and Passimian. Focus Blast gives Typhlosion a chance to 2HKO Snorlax, which can easily take Fire-type attacks, as well as being its strongest move against Rock-types like Regirock and Rhydon. Scorching Sands targets Fire-types such as opposing Typhlosion and Pyroar as well as some bulky Water-types like Lanturn and Qwilfish, and it is a more accurate option to threaten Rock-types. Flash Fire lets Typhlosion switch into powerful Fire-type attacks without losing power on Eruption, but this leaves it vulnerable to Trace Porygon2. Blaze boosts Typhlosion's secondary Fire-type STAB attack to insane levels in late-game scenarios, becoming about as strong as full-power Eruption.</p> <p>As a powerful wallbreaker, Typhlosion naturally benefits special cleaners such as Jolteon and Oricorio-G that appreciate special walls getting weakened. If opting for Flash Fire, its immunity to Fire-type moves makes it a great teammate for Fire-weak Pokemon such as Glastrier and Hisuian Decidueye. Typhlosion appreciates VoltTurn support that can force in walls to get nuked by it, such as Articuno, Lanturn, Qwilfish, and Mesprit as well as the aforementioned Jolteon and Hisuian Decidueye. Typhlosion has trouble breaking through Fire-resistant Pokemon, including Snorlax, Cramorant, and Appletun, which makes counters to these threats such as Orthworm and Articuno attractive. Entry hazard removal is also appreciated from Pokemon such as Sandslash and Hitmonlee to keep Typhlosion at full health as long as possible. Healing Wish Pokemon like Shaymin and Mesprit can give Typhlosion a second chance at full health Eruptions later in the match. Defensive pivots that can take on revenge killers such as Choice Scarf Passimian and Floatzel, like Palossand and Qwilfish, respectively, make for great partners.</p>"
      },
      "Choice Scarf": {
        "description": "<p>When it holds a Choice Scarf, Typhlosion is free to rain its powerful Eruption down onto the entire unboosted metagame and even a majority of the boosted metagame, making it powerful speed control, a dangerous revenge killer, and a strong cleaner all-in-one. Fast Pokemon like Jolteon, Grafaiai, and Choice Scarf Mesprit don't require much chip damage before they're at risk of being KOed by Eruption. Fire Blast lets Typhlosion keep up a good damage output once Eruption is no longer at maximum power, and it still threatens to OHKO foes like Sneasel, Virizion, and Whimsicott. Focus Blast 2HKOes Fire-resistant Pokemon like Regirock and Rhydon, and it is Typhlosion's strongest coverage move against one of the most common special sponges: Snorlax. Scorching Sands covers Fire-types like Pyroar and opposing Typhlosion, wears down Lanturn, has greater accuracy against Rock-types, and can spread burns with a little bit of luck. Tera Fire enables Typhlosion to OHKO Choice Scarf Mesprit with Eruption after Stealth Rock damage. Flash Fire powers up Typhlosion's STAB moves to make it an even more dangerous cleaner if it can switch in on a Fire-type move from Charizard, opposing Choice-locked Typhlosion, or Will-O-Wisp from Weezing and Spiritomb, although Typhlosion often doesn't switch into most Pokemon if it wants to preserve the power of Eruption. Blaze can reignite Typhlosion's power once it's been worn down enough, boosting Fire Blast beyond even Eruption's maximum power, although purposefully and safely getting Typhlosion into range of Blaze once Eruption is no longer at maximum power can be tricky.</p> <p>Choice Scarf Typhlosion distinguishes itself through the power of its Eruption, so it depends on teammates like Hisuian Decidueye, Cramorant, Sandslash, and Hisuian Avalugg to remove entry hazards that would dampen the power of Eruption. Special wallbreakers like Nasty Plot Mesprit, Choice Specs Jolteon, and Alolan Exeggutor can soften up or remove special sponges like Snorlax, Dudunsparce, and Hisuian Qwilfish for Typhlosion to more easily clean up. Snorlax is a very common special sponge that comfortably walls Typhlosion, so Typhlosion benefits from teammates that check Snorlax like Regirock, Rhydon, and Orthworm. Chip damage from hazards wears down common checks to Typhlosion such as Regirock, Snorlax, and Naclstack, making hazard setters like both Qwilfish formes and Orthworm excellent support for Typhlosion. Healing Wish support from Mesprit and Shaymin can give Typhlosion another opportunity to melt down targets with Eruption. Typhlosion appreciates pivots bringing it in safely, especially on their checks, such as Mesprit with Orthworm and Articuno and Jolteon with Shaymin and Magneton. Lanturn and Magneton are especially good pivots to partner with Typhlosion, as they give it opportunities to threaten Grass-types they invite in like Hisuian Decidueye and Virizion. Typhlosion struggles against Water-types such as Lanturn, Poliwrath, and Cramorant, so it appreciates partners that check each of them such as Whimsicott, Cramorant, and Articuno, respectively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 648292, "username": "budgetplayer"}, {"user_id": 369076, "username": "Tuthur"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Lanturn": {"sets": {"Defensive Pivot": {}}},
  "Bellossom": {"outdated": true, "sets": {"Bulky Quiver Dance": {}}},
  "Qwilfish": {
    "comments": "<h3>Other Options</h3> <p>Qwilfish can Terastallize into a Ghost-type to block Rapid Spin attempts, but this makes it significantly weaker against Pokémon like Oricorio-G and Hisuian Qwilfish. Defensive Qwilfish sets can run Leftovers to heal gradually throughout a game, but this recovery is often mitigated by having to switch into entry hazards multiple times per game. Qwilfish can strengthen its offensive potential by equipping a Choice Band, unleashing strong Aqua Jets and Flip Turns while still switching into a variety of physical attacks.</p> <h3>Checks and Counters</h3> <p><strong>Psychic-types</strong>: Strong Psychic-type attackers in ZU, including Mesprit, Veluza, and Indeedee-F, can threaten to outspeed and knock out Qwilfish. While these Pokemon don't love switching in against Qwilfish, they can afford to take a hit and deal massive damage in return.</p> <p><strong>Electric-types</strong>: Although their low bulk makes them struggle to switch into Qwilfish's attacks, Electric-type pivots like Rotom and Morpeko can outspeed and threaten an OHKO on Qwilfish. This can sometimes force opponents to use Terastallization on Qwilfish, limiting their offensive resources late-game. There additionally are Electric-type attackers with strong defensive profiles, such as Magneton and Vikavolt, that can switch into Qwilfish effectively.</p> <p><strong>Ground-types and Ground-type coverage</strong>: Qwilfish's Water-type STAB attacks may threaten out many Ground-types, but strong Ground-type attackers like Sandaconda, Palossand, and Sandslash can retaliate with super effective damage of their own. Many wallbreakers also pack Ground-type attacks that can heavily chip a Qwilfish looking to switch in, including Passimian, Glastrier, and Charizard.</p> <p><strong>Special Attackers</strong>: Due to its lack of Special Defense, Qwilfish struggles to handle hits from special wallbreakers like Rotom, Mismagius, and Clawitzer. On the other hand, setup sweepers like Oricorio-G, Frosmoth, and Dudunsparce can set up in its face, although they don't enjoy getting poisoned.</p> <p><strong>Entry Hazards</strong>: While Qwilfish can feel like a defensive stalwart, its lack of reliable recovery makes it especially prone to Stealth Rock and Spikes. If setters like Palossand, Orthworm, and Regirock can keep hazards on the field, Qwilfish can later get overwhelmed by wallbreakers it would normally check efficiently.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>As a result of its defensive profile synergizing well with its threatening attacks and serviceable Speed tier, Qwilfish is an incredibly versatile Choice Scarf user that can surprise opponents expecting a defensive set. Choice Scarf Qwilfish provides both offensive and defensive value, revenge killing weakened foes while using Intimidate to switch into attackers in a pinch. Gunk Shot sets Qwilfish apart from other Water-type attackers, letting it dismantle Grass-types like Hisuian Decidueye, Alolan Exeggutor, and Virizion. Liquidation is a similarly powerful STAB attack that helps it revenge kill weakened foes like Grafaiai and Sneasel. Flip Turn lets Qwilfish quickly pivot into a partner that can better handle walls like Orthworm and Weezing that switch into it. These forced switches also provide Qwilfish with the opportunity to lay down Spikes, allowing it to bluff a defensive set on certain occasions only for it to surprise the opponent with a revenge kill later on in the game. Barb Barrage is an alternative fourth move, being a more reliably accurate Poison-type attack that can also poison and thus wear down switch-ins like Regirock and Poliwrath. Lastly, Destiny Bond trades KOs with boosted threats like Braviary and Glastrier to prevent sweeps.</p> <p>Offense teams that need a combination of an offensive and defensive presence love the versatility provided by Qwilfish. Being able to finish off weakened Pokemon synergizes well with wallbreakers that specialize in dealing heavier damage, including Whimsicott, Magneton, and Glastrier. Finishing off foes assists setup sweepers like Oricorio-G, Frosmoth, and Virizion. Qwilfish's defensive utility means that it can still switch into wallbreakers like Hisuian Decidueye and can support extremely frail pivots like Jolteon, Rotom, and Grafaiai. While it primarily focuses on revenge killing, Qwilfish's pivoting with Flip Turn can result in lots of chip damage in tandem with entry hazards set up by Orthworm, Sandslash, or Mesprit. The latter two Pokemon, alongside other Knock Off users like Sneasel and Passimian, can remove Heavy-Duty Boots to ensure hazards help chip down foes. More defensively oriented teams also feature walls like Articuno and Snorlax that greatly appreciate Flip Turn switching them in. Ghost-types like Palossand and Sableye can block Rapid Spin and wall Toxicroak, one of Qwilfish's prominent checks.</p>"
      },
      "Swords Dance": {
        "description": "<p>Despite competition from other Swords Dance users in the tier, Qwilfish can still consistently set up to sweep thanks to its defensive typing and access to Intimidate. Qwilfish can turn the tables on would-be checks like Orthworm and Regirock by setting up Swords Dance in front of them. Liquidation and Gunk Shot are two powerful STAB moves that take out walls like Sandaconda, Snorlax, and Dipplin. Aqua Jet allows it to get the jump on faster foes like Sneasel, Jolteon, and Charizard, typically grabbing a KO after a boost and enough chip damage. This also makes Qwilfish an apt revenge killer, with Tera Water making Aqua Jet even stronger after a Swords Dance boost. Leftovers supports Qwilfish on top of its already great ability and typing, granting it significantly more staying power than other setup sweepers.</p> <p>Swords Dance Qwilfish provides a bulky dynamic to offensive teams looking to overwhelm foes with a variety of strong attacks. Pivots like Articuno, Mesprit, and Rotom can effectively bring in Qwilfish while also chipping walls like Regirock and Dudunsparce. Other wallbreakers like Toxicroak, Grafaiai, and Whimsicott can chip down the opposing team. to make its sweep easier. A more aggressive team with several sweepers like Virizion, Sneasel, and Frosmoth can let Qwilfish help overwhelm opposing teams. More balanced teams can also effectively use Swords Dance Qwilfish as a way to surprise opponents expecting a more defensive set. Since Qwilfish is purely invested in its offense, it's still important to support Qwilfish with a strong defensive backbone including walls such as Snorlax, Hisuian Decidueye, and Sandslash. Entry hazard setters like Sandaconda, Palossand, and Orthworm also chip down foes over the course of a longer game, possibly giving Qwilfish the chance to OHKO Snorlax after a boost.</p>"
      },
      "Defensive Pivot": {
        "description": "<p>As one of the most splashable Pokemon in ZU, Qwilfish threatens to deter physical wallbreakers with Intimidate, making it a premier Spikes setter with the longevity to set multiple layers up. Furthermore, by Terastallizing into a Ground-type, Qwilfish can surprise Electric-type foes, including Rotom and Jolteon. Flip Turn hits prominent Pokemon like Sandaconda, Oricorio, and Rhydon for super effective damage while allowing a teammate to switch in. Barb Barrage may hit Pokemon such as Hisuian Decidueye and Virizion for super effective damage, but switch-ins also dislike this move due to the poison chance. It can run a variety of moves for its fourth moveslot, but Taunt's capability of shutting down utility moves such as Recover and Defog make it the most preferable. Nevertheless, Pain Split is a valid alternative if one wants a semi-recovery option to increase its longevity, which is especially valuable against foes with high HP like Snorlax and Dudunsparce. Toxic and Thunder Wave are also good options to more reliably inflict status. Rocky Helmet's chip damage makes Qwilfish a fantastic punisher of spammable contact moves like U-turn and Knock Off, but Heavy-Duty Boots greatly helps Qwilfish's longevity.</p> <p>Qwilfish's versatility makes it a seamless fit onto many team styles, but balance and bulky offense teams especially love its entry hazard setting and defensive pivoting. By chipping down foes with its STAB combination while laying down layers of Spikes, late-game cleaners like Passimian and Mesprit can more easily take down worn out opponents. These threats also boast the ability to pivot, creating VoltTurn cores that bolster offensive pressure. By pivoting with Flip Turn, Qwilfish can safely bring in frail attackers like Jolteon, Dodrio, and Typhlosion, which can all wreak havoc when they're given the chance to enter the field healthy. Ghost-types like Oricorio-G and Mismagius are especially nice partners, since they provide an immunity to Rapid Spin to keep Spikes on the field. Grass-types like Hisuian Decidueye, Virizion, and Whimsicott also provide type synergy with Qwilfish, as their offensive and defensive strengths are bolstered by Qwilfish's overall utility. Qwilfish's defensive profile also makes life easier for bulky partners like Snorlax and Articuno, as Qwilfish can switch into threatening Fighting-types like Passimian, Hisuian Decidueye, and Hitmonchan. In return, those walls can more easily take on the special attacks that may scare Qwilfish out. Other defensive Pokemon like Sandaconda and Palossand can reinforce a team's physical backbone while also being immune to Volt Switch users that threaten to OHKO Qwilfish.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 528055, "username": "viet noa"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 594256, "username": "GraveBee"}, {"user_id": 649096, "username": "a blue banana"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Qwilfish-Hisui": {
    "overview": "<p>Hisuian Qwilfish is a versatile Pokemon in SV ZU thanks to its great movepool and unique defensive traits. Hisuian Qwilfish is an excellent check to threats like Mesprit, Oricorio-G, and Mismagius thanks to its defensive typing and solid bulk backed by Eviolite. Intimidate and few weaknesses make it a blanket answer to threats like Grafaiai, Whimsicott, and Brute Bonnet. Hisuian Qwilfish's good defensive profile creates many opportunities for utility sets to set Spikes against common Pokemon such as Mesprit, Brute Bonnet, and Whimsicott. Its setup opportunities against common Pokemon also apply for offensive sets with Swords Dance, which threaten to sweep faster Pokemon like Charizard and Typhlosion thanks to Aqua Jet as they break defensive cores that depend on Grass-types like Hisuian Decidueye and Dipplin. However, Hisuian Qwilfish is held back by its lack of longevity paired with its middling natural bulk, making it dependent on its Eviolite, and its Ground weakness leaves it vulnerable to Sandaconda and Sandslash as well as coverage moves from Passimian and Charizard.</p>",
    "comments": "<h3>Other Options</h3> <p>Swords Dance Hisuian Qwilfish can use Scale Shot to boost its Speed to evade revenge killing attempts by faster Pokemon like Jolteon, Whimsicott, and Choice Scarf Passimian, but Aqua Jet doesn't require an additional turn of setup. Poison Point doesn't activate Defiant on Passimian and Braviary and can punish U-turn users like Hisuian Decidueye and Whimsicott, but Intimidate offers more general and reliable defensive utility against physical attackers. Agility can be used on Swords Dance sets to make Hisuian Qwilfish less reliant on Aqua Jet but requires it to spend additional turns setting up.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types and Ground-type Coverage</strong>: Sandaconda is difficult for Hisuian Qwilfish to beat outright, and Sandslash can remove any entry hazards it sets. Although Palossand is weak to Hisuian Qwilfish's Crunch, it can wall the utility set barring Defense drops and wear it down with Scorching Sands. However, Sandslash can be worn down by repeated hits, and Palossand can be worn down by chip damage from poison or overwhelmed if Swords Dance Hisuian Qwilfish has boosted. Ground-type STAB moves from these Pokemon as well as Ground-type coverage from Passimian can efficiently dispatch Hisuian Qwilfish.</p> <p><strong>Physical Walls</strong>: Orthworm is immovable to Hisuian Qwilfish and can use it to set up its own entry hazards, Coil, or Iron Defense. Regirock dislikes Toxic, but it can wall Swords Dance Hisuian Qwilfish or use Tera to deny Toxic while chipping away at Hisuian Qwilfish with Body Press. Weezing is immune to Toxic and can burn Swords Dance Hisuian Qwilfish.</p> <p><strong>Special Wallbreakers</strong>: Magneton takes little to no damage from utility Hisuian Qwilfish's moves and can use it to come in and fire off powerful attacks. Typhlosion, Clawitzer, and Alolan Exeggutor deal immense damage to Hisuian Qwilfish, but they must be mindful of their health to avoid being finished off by the Swords Dance set.</p> <p><strong>Strong Physical Wallbreakers</strong>: Glastrier and Lycanroc threaten to cut through Hisuian Qwilfish's underwhelming bulk, especially if they've been unaffected by Intimidate. Sneasel is unaffected by Intimidate, and Passimian is even strengthened by it. However, several of these Pokemon do not enjoy switching into Barb Barrage, and Lycanroc is threatened by Aqua Jet from Swords Dance sets. Hisuian Sneasel notably resists Hisuian Qwilfish's STAB combination and can easily use the specially defensive set as setup fodder.</p> <p><strong>Residual Damage</strong>: Hisuian Qwilifsh lacks recovery, so entry hazards from opposing setters like Orthworm, Regirock, and Qwilfish can quickly wear it down. Burns spread by Charizard and Palossand chip away at Hisuian Qwilfish and make it far more passive, and Swords Dance sets are especially cramped by them.</p>",
    "sets": {
      "Specially Defensive": {
        "description": "<p>Hisuian Qwilfish's Eviolite-boosted bulk, Intimidate, and great typing make it an amazing defensive utility Pokemon. Thanks to its typing, Hisuian Qwilfish can check specially offensive setup sweepers like Mesprit, Farigiraf, and Mismagius thanks to its immunity to Stored Power and lack of weaknesses to common special coverage moves like Draining Kiss and Dazzling Gleam. Barb Barrage is a great STAB move for Hisuian Qwilfish, as it wears down Pokemon with its high chance to poison and powers up when its targets are poisoned, and walls like Regirock and Palossand do not appreciate being poisoned. Barb Barrage is great against the Grass-types Hisuian Qwilfish checks, such as Hisuian Decidueye, Virizion, and Dipplin, as well as Fairy-type Pokemon like Whimsicott and Tera Fairy Mesprit and Mismagius. Crunch is a stronger STAB move for foes that aren't yet poisoned and has great coverage against other specially offensive threats like Mesprit, Oricorio-G, and Mismagius. Hisuian Qwilfish's excellent defensive profile gives it plenty of opportunities to set up Spikes as it threatens out Grafaiai, Mesprit, and Dipplin and pressures the most common hazard remover: Hisuian Decidueye. Toxic more reliably statuses foes compared to Barb Barrage, and Toxic poison is deadlier to walls like Dudunsparce, Regirock, and Palossand. Taunt lets Hisuian Qwilfish shut down opposing defensive Pokemon like Dudunsparce, Orthworm, and Weezing to prevent them from recovering or supporting their teams. Haze removes boosts from specially offensive setup sweepers that Hisuian Qwilfish checks, such as Mesprit, Farigiraf, and Virizion. Intimidate lets Hisuian Qwilfish work as a stopgap to physical attackers like Grafaiai, Swords Dance Virizion, and Swords Dance Qwilfish. Tera Dragon lends Hisuian Qwilfish new resistances to Electric, Fire, and Water to make it a better check to special attackers like Typhlosion, Jolteon, and Cramorant.</p> <p>Hisuian Qwilfish fits on bulky offensive teams looking to compress a solid defensive backbone and entry hazard setter into one slot. Offensive Pokemon like Typhlosion, Charizard, and Jolteon are great beneficiaries of Spikes set by Hisuian Qwilfish, as common checks to them like Snorlax and Regirock are prone to being overwhelmed by residual damage. Roar Articuno and Dragon Tail Dipplin and Dudunsparce can put Spikes set by Hisuian Qwilfish to good use by quickly racking up residual damage. Sandslash's Earthquake and Rapid Spin are very threatening to Hisuian Qwilfish, so good checks to Sandslash like Hisuian Decidueye, Dipplin, and Orthworm help Hisuian Qwilfish, and Palossand can spinblock for Hisuian Qwilfish as a bonus. Grass-types in particular, such as Whimsicott, Virizion, and Shaymin, make great partners for Hisuian Qwilfish by covering its sole weakness to Ground. Hisuian Qwilfish can struggle against specially offensive foes like Jolteon, Typhlosion, and Charizard, so special walls like Snorlax, Regirock, and Dudunsparce can help deal with these foes while appreciating the residual damage that Hisuian Qwilfish spreads. Several physical attackers like Hisuian Decidueye and Sneasel ignore Intimidate while others like Passimian and Braviary can benefit from it, so physical sponges like Dipplin, Regirock, Palossand, and Sandaconda cover these foes for Hisuian Qwilfish. Teammates such as Passimian, Hisuian Decidueye, and Regirock appreciate Hisuian Qwilfish for checking special attackers like Mesprit, Mismagius, and Farigiraf for them.</p>"
      },
      "Swords Dance": {
        "description": "<p>Hisuian Qwilfish's excellent Eviolite-backed bulk and defensive typing enable it to comfortably set up Swords Dance and sweep. Hisuian Qwilfish's offensive STAB combination has excellent coverage, as it's only resisted by Hisuian Sneasel. Aqua Jet compensates for Hisuian Qwilfish's more middling Speed, picking off frail revenge killers like Jolteon, the aforementioned Hisuian Sneasel, and Sneasel. Aqua Jet's coverage is especially threatening to Fire-types like Charizard and Typhlosion and makes Hisuian Qwilfish a helpful revenge killer for them. Intimidate increases Hisuian Qwilfish's setup opportunities against physical attackers it neutralizes such as Snorlax, Qwilfish, and Virizion. Tera Water powers up Aqua Jet for more efficient cleaning, mitigates Ground-type attacks from the likes of Passimian and Sandaconda, and gives Hisuian Qwilfish a more comfortable defensive typing against Floatzel and Qwilfish.</p> <p>Swords Dance Hisuian Qwilfish works well on offense teams as a sweeper capable of taking advantage of common Pokemon like Mesprit and Grafaiai to set up, and its immunity to Prankster Encore moves from Grafaiai and Whimsicott is a great asset to these teams; it can also fit on balance teams as a wallbreaker. Wallbreakers like Typhlosion, Magneton, and Hisuian Decidueye can soften up teams for Hisuian Qwilfish to more easily clean up. Hisuian Qwilfish's Ground weakness means it benefits from teammates like Whimsicott, Virizion, and Glastrier that threaten Ground-types like Sandaconda, Palossand, and Sandslash. More defenisve partners like Orthworm, Articuno, and Dipplin can also handle the aforementioned Ground-types. Dipplin can also absorb Knock Off and Trick for Hisuian Qwilfish, which it appreciates given its dependence on Eviolite for its bulk. Entry hazard setters like Sandslash, Lycanroc, and Froslass support Hisuian Qwilfish by wearing down bulky Pokemon like Regirock and Snorlax to make breaking through them easier. Healing Wish support from teammates like Mesprit and Shaymin grants Hisuian Qwilfish a second chance to sweep. Hisuian Qwilfish appreciates hazard removal from partners such as Hisuian Decidueye, Cramorant, and Hisuian Avalugg to keep it healthier in the face of revenge killers like Passimian and Hisuian Sneasel. Leads that use Taunt such as Lycanroc and Froslass can also keep entry hazards from going up.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 626095, "username": "sinnabyss"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 643347, "username": "marillvibes"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Sneasel": {
    "sets": {
      "Fast Attacker": {},
      "Choice Band": {
        "description": "<p>Sneasel has very strong STAB moves and a great Speed tier to spam them. A Choice Band gives Sneasel the immediate raw power to make quick offensive progress against bulky Pokemon like Orthworm and Regirock. Choice Band also makes Sneasel a more reliable revenge killer to offensive threats like Grafaiai, Nasty Plot Mesprit, and Virizion. Low Kick is Sneasel's strongest move against physically bulky Pokemon like Glastrier, Regirock, Hisuian Avalugg, and Orthworm, which take neutral or resisted damage from its STAB moves, but its limited coverage and variable power make it a difficult option to lock into. Inner Focus is helpful for blocking Intimidate from Qwilfish and Hisuian Qwilfish. Tera Ice cranks up the power of Sneasel's strongest STAB move to ice out bulkier Pokemon such as Tera Fairy Nasty Plot Mesprit and Weezing. Tera Ice also boosts Sneasel's priority to more effectively pick off Jolteon, Oricorio-G, and Whimsicott, notably 2HKOing Lycanroc after damage from entry hazards.</p> <p>Choice Band Sneasel has great immediate damage output, quickly cutting through teams with Triple Axel and making progress with Knock Off. Choice Band Sneasel's ability to lure in and remove Leftovers from Regirock makes it a great enabler to offensive Pokemon that struggle against it such as Charizard, Snorlax, and Frosmoth, and it functions similarly against Orthworm to support Mesprit, Whimsicott, and Grafaiai. Knock Off removing Heavy-Duty Boots from foes creates excellent synergy with entry hazard setting Pokemon such as Qwilfish, Hisuian Qwilfish, and Orthworm. Choice Band Sneasel is vulnerable to being worn down by entry hazards, particularly Stealth Rock, so hazard removers like Hisuian Decidueye and Cramorant are critical to maximizing Sneasel's offensive presence. Defensive pivots like Hisuian Decidueye, Mesprit, and Qwilfish can bring Sneasel in safely in spite of its poor bulk and vulnerable defensive typing. While Sneasel resists Shadow Sneak and Sucker Punch from foes like Hisuian Decidueye, Muk, and Brute Bonnet, its frailty leaves it prone to strong and super effective priority users; Sandaconda, Palossand, and Weezing can check Lycanroc for Sneasel, and Qwilfish, Lanturn, and Poliwrath can check Floatzel. Choice Band Sneasel is fast but still struggles with revenge killers like Passimian, Choice Scarf Grafaiai, and Choice Scarf Typhlosion, which can be respectively handled by teammates like Orthworm, Weezing, and Regirock.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Sneasel-Hisui": {"sets": {"Swords Dance": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Piloswine": {"outdated": true, "sets": {"Stealth Rock": {}, "Choice Band": {}}},
  "Porygon2": {
    "comments": "<h3>Other Options</h3> <p>Tera Blast has equivalent power to Tri Attack and has solid coverage both with Tera Fairy and Foul Play, but the loss of spreading status while attacking leaves Porygon2 reliant on Thunder Wave, worsening its issues with passivity. Tera Ghost is an alternative to Tera Fairy for an immunity to Fighting-type moves like Focus Blast from Typhlosion, Aura Sphere from Clawitzer, and Body Press from Regirock and Orthworm. However, Passimian has Knock Off for coverage against Tera Ghost Porygon2, and Hisuian Decidueye can hit Porygon2 with its Fighting-type moves anyway because of Scrappy. Tera Poison shares the Fighting resistance of Tera Fairy and gives Porygon2 a coveted poison immunity for increased resilience against Grafaiai, Qwilfish, and Hisuian Qwilfish. However, the additional Psychic weakness makes Porygon2 less reliable as a check to specially offensive Psychic-types it would otherwise check like Mesprit and Farigiraf. Porygon2 has Trick Room in its movepool, tempting it to run it as a setter for its teammates or Trick Room attacker itself with Download. Aside from Trick Room being niche, Porygon2 struggles to be an effective Trick Room setter without a pivoting move, and it struggles to reliably get the right Download boost to be as offensively threatening as attackers like Alolan Exeggutor and Farigiraf. A more offensively inclined set with Download and Agility is similarly enticing, but the inconsistency of Download to get the correct boost and Porygon2's weaker STAB attack make it a poor sweeper compared to Farigiraf, Jolteon, and Oricorio-G.</p> <h3>Checks and Counters</h3> <p><strong>Fighting-types and Fighting-type Coverage</strong>: Hisuian Decidueye, Virizion, Passimian, and Hitmonlee all threaten Porygon2 with their powerful physical Fighting-type STAB moves, though only Hisuian Decidueye and Virizion can mitigate Porygon2's Thunder Wave by holding a Lum Berry. Hitmonlee's Limber means it isn't deterred by Thunder Wave. Regirock and Orthworm slam Porygon2 with Body Press and can use its passivity as their chance to set entry hazards or use Iron Defense to further power up Body Press. Lycanroc and Glastrier can use Close Combat to KO Porygon2 after a Swords Dance boost.</p> <p><strong>Knock Off, Trick, and Switcheroo</strong>: Porygon2 depends on Eviolite for its substantial bulk and should be wary of Pokemon that use item disruption tactics; Mesprit. Grafaiai, Sneasel, and Sandslash commonly run Knock Off and may soften up Porygon2 for their teammates if they can't break through it on their own. A Choice item from Whimsicott, Mismagius, and Rotom can enable these special attackers or their teammates to exploit or overwhelm Porygon2.</p> <p><strong>Residual Damage</strong>: Entry hazards take a toll on Porygon2's longevity and force it to become more passive by using Recover more often. The constant chip damage from Toxic Spikes from the Qwilfish formes and Weezing are especially noxious to Porygon2. Toxic from the Qwilfish formes and Dudunsparce directly puts Porygon2 on a timer to make it less effective as a wall. Poison Touch poisons from Grafaiai and even Will-O-Wisp from Charizard wear on Porygon2's health.</p> <p><strong>Substitute and Taunt Users</strong>: Mesprit can use Terastallization, Encore, and Substitute to turn Porygon2 into setup fodder for itself. Frosmoth may struggle to overcome Porygon2's substantial bulk, particularly if it copied Ice Scales with Trace, but Substitute both protects Frosmoth from Thunder Wave and cannot be broken by any of Porygon2's moves, enabling Frosmoth to fish for a desperate freeze against Porygon2. Mismagius may overwhelm Porygon2 with a mix of Terastallization, Taunt or Substitute, and setup.</p>",
    "sets": {
      "Specially Defensive": {
        "description": "<p>Porygon2's excellent bulk thanks to Eviolite, reliable recovery, and few weaknesses make it an excellent defensive answer to special attackers like Charizard and Magneton. Thunder Wave lets Porygon2 slow down Speed-boosting setup sweeepers like Oricorio and Farigiraf while punishing switch-ins like Passimian and Hisuian Decidueye. Foul Play deters frail physical attackers like Lycanroc and Dodrio from using Porygon2 as a setup opportunity. Tri Attack lets Porygon2 spread status as it attacks and has virtually perfect coverage with Foul Play. Ice Beam is an alternative for better coverage against Pokemon weak to Ice like Rhydon, Hisuian Decidueye, and Brute Bonnet, notably enabling Porygon2 to 2HKO defensive Ground-types like Sandaconda and Palossand. Trace gives Porygon2 added defensive utility against Pokemon like Jolteon, Flash Fire Typhlosion, and the Oricorio formes by copying their immunity abilities or Dancer. Trace also copies abilities that defensively augment Porygon2, such as Sticky Hold from Dipplin, Prankster from Grafaiai and Whimsicott, and Pressure from Articuno. Tera Fairy removes Porygon2's Fighting weakness to lessen its vulnerability to coverage moves from special wallbreakers such as Typhlosion and Clawitzer, and it can turn the tables on Fighting-type Pokemon that would otherwise break through Porygon2, such as Passimian and Hisuian Decidueye.</p> <p>Porygon2 is a capable backbone for bulky teams thanks to its longevity and single Fighting weakness. Physically defensive Pokemon like Palossand, Orthworm, and Sandaconda can form defensive cores with Porygon2, and they especially appreciate it as a check to special attackers that threaten them like Typhlosion, Charizard, and Magneton. Fighting-types like Hisuian Decidueye, Passimian, and Virizion threaten Porygon2, so it relies on checks to these Pokemon such as Weezing, Palossand, and Charizard. Porygon2 depends on its Eviolite for its bulk, so it is greatly appreciative of Pokemon that can absorb Knock Off such as Dipplin and Muk, providing Dipplin an answer to special attackers and Muk a check to Psychic-types in return. Hisuian Decidueye, Cramorant, Hisuian Avalugg, and Sandslash all maximize Porygon2's longevity by removing entry hazards that would otherwise wear it down. Porygon2 appreciates reliable answers to Nasty Plot Mesprit, such as Magneton and Hisuian Qwilfish. Pivots such as Magneton and Mepsrit can make Porygon2 get stuck in a loop of switching in, taking chip damage from entry hazards and pivot moves, and needing to switch out against a strong wallbreaker like Glastrier; Porygon2 benefits from partners that can break said cycle, such as bulky Hisuian Decidueye with its hazard removal.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 626095, "username": "sinnabyss"}, {"user_id": 654091, "username": "FlamPoke"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Smeargle": {"sets": {"Suicide Lead": {}}},
  "Sceptile": {"sets": {"Choice Specs": {}, "Swords Dance": {}}},
  "Shiftry": {"sets": {"All-Out Attacker": {}}},
  "Sableye": {"sets": {"Utility": {}}},
  "Medicham": {"outdated": true, "sets": {"Choice Scarf": {}, "Choice Band": {}, "All-Out Attacker": {}}},
  "Volbeat": {"sets": {"Weather Setter": {}}},
  "Cacturne": {"sets": {"Mixed Attacker": {}}},
  "Whiscash": {"outdated": true, "sets": {"Wall": {}}},
  "Regirock": {
    "comments": "<h3>Other Options</h3> <p>On paper, Sturdy gives a healthy Regirock a guaranteed turn to set up Stealth Rock, but between Regirock being so bulky and entry hazards being ubiquitous, it's unlikely that Regirock would be at risk of being OHKOed from full HP outside of uncommonly strong hits like Clawitzer's Water Pulse or Alolan Exeggutor's Leaf Storm. Regirock is totally dependent on the passive recovery from Leftovers to be a reliable wall, so even items like Heavy-Duty Boots and Rocky Helmet are suboptimal. Stone Edge is generally stronger than Rock Blast but has unreliable accuracy and poor PP, and it and Rock Slide cannot break past Substitute Pokemon. Curse can be used as a setup move over Iron Defense to power up Regirock's Rock Blast, but the extra Defense from Iron Defense is more useful to stonewall physical attackers, and Regirock's Body Press is more powerful and reliable than its STAB move anyway. Protect can enhance Regirock's recovery from Leftovers and allow Regirock to scout common Choice item attackers like Jolteon, Whimsicott, and Floatzel but it makes Regirock much more passive. Tera Ghost lets Regirock become immune to Fighting-type moves from major offensive threats like Hitmonlee, Toxicroak, and Passimian while preserving Regirock's ability to check Snorlax and enabling it to block Rapid Spin from Sandslash and Toedscruel. Tera Grass helps Regirock manage its common Grass, Water, and Ground weaknesses, whereas Tera Water lets Regirock better handle Glastrier, and Tera Steel shares Tera Poison's poison immunity and Grass resistance while giving Regirock an easier time against Mesprit and Farigiraf. Regirock can run a Careful nature to patch up its relatively lower special bulk, but Regirock is often tasked with taking on physical attackers, and more Defense investment benefits its IronPress combination.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Palossand counters Regirock and uses it as an opportunity to set up Stealth Rock, recover with Shore Up, or threaten Regirock and its teammates with burns from Scorching Sands. Sandaconda has great longevity, while Sandslash and Toedscruel can remove Regirock's entry hazards with Rapid Spin, but all three must be wary of Regirock boosting too much with Iron Defense.</p> <p><strong>Special Attackers</strong>: Regirock's lower special bulk leaves it prone to being overwhelmed by special attackers like Mesprit, Jolteon, and Rotom. Magneton can hit Regirock super effectively with its STAB Flash Cannon. However, most special attackers are physically frail, and Magneton takes a lot of damage from Regirock's Body Press. Many special attackers also cannot KO Regirock without significant chip or several boosts.</p> <p><strong>Fighting-types</strong>: Regirock's Fighting weakness can lead it to fall victim to Fighting-types like Hitmonlee, Passimian, and Hisuian Decidueye, the last of which can remove Regirock's Stealth Rock. However, Regirock can turn the tables on physically offensive Fighting-types with its IronPress combination and Terastallization. Specially offensive variants of Toxicroak and Virizion further exploit Regirock's lower Special Defense and circumvent Iron Defense boosts.</p> <p><strong>Grass-types</strong>: Whimsicott, Hisuian Electrode, and Sceptile can blow through Regirock with their strong super effective STAB moves, and Whimsicott is distinguished for avoiding a 2HKO from Regirock's Body Press after Stealth Rock. Alolan Exeggutor annihilates Regirock, while Dipplin can phaze Regirock with Dragon Tail and use Recover to wall it back.</p> <p><strong>Water-types</strong>: Swords Dance Qwilfish and Veluza both Body Press and can rely on their Water-type STAB moves to break through Regirock. Clawitzer can OHKO Regirock with Water Pulse but cannot switch into Regirock's Body Press more than once with Stealth Rock up.</p> <p><strong>Knock Off, Trick, and Switcheroo</strong>: Regirock relies on its Leftovers for recovery, so Knock Off users like Sneasel, Mesprit, and Grafaiai are disruptive to Regirock. Mespirit and Hisuian Sneasel can use Trick and Switcheroo to disrupt Regirock by giving it their Choice items.</p> <p><strong>Residual damage</strong>: Burns and poison neutralize Regirock's already limited passive recovery. Burns from Will-O-Wisp users like Weezing and Rotom halve Regirock's damage output, while Toxic from Hisuian Qwilfish, Dudunsparce, and Toedscruel puts Regirock on a timer. Entry hazards like Stealth Rock and Spikes cause Regirock to struggle to stay healthy.</p> <p><strong>Taunt and Encore</strong>: Encore users like Whimsicott and Grafaiai can lock Regirock into a move to exploit it though neither enjoy taking Body Press. Qwilfish and Primeape can use Taunt to stop Regirock from setting up Stealth Rock or Iron Defense. Sableye can run Taunt or Encore and does not fear Regirock's Body Press.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Thanks to its titanic Defense, Regirock can stonewall popular physical attackers like Snorlax and Dudunsparce and use them as an opportunity to set up Stealth Rock. Rock Blast deals reliable damage to Typhlosion, Oricorio-G, and Charizard and breaks Substitute on users like Frosmoth and Rotom. Body Press crushes Normal-types like Snorlax and Dudunsparce, Ice-types like Glastrier and Sneasel, and Steel-types like Orthworm and Magneton. Iron Defense boosts Regirock's physical bulk and powers up Body Press, turning Regirock into a bulky setup sweeper capable of suffocating physical attackers like Snorlax and overwhelming walls like Sandaconda. Thunder Wave slows down setup sweepers like Hitmonlee and fast Pokemon like Whimsicott but makes Regirock more passive. Clear Body helpfully denies stat debuffs from Intimidate, Shadow Ball, and Triple Arrows. 16 Defense EVs and an Impish nature is a useful jump point to balance Regirock's bulk. Tera Poison helps with Regirock's Grass and Fighting weaknesses and gives it an immunity to poison.</p> <p>Regirock fits best on teams looking for a physically defensive backbone that can set up Stealth Rock. While Regirock has great physical bulk, its typing and comparatively lesser special bulk leave it more prone to strong special attacks. Specially defensive partners like Snorlax, Articuno, and Hisuian Qwilfish complement Regirock's physical bulk and can intercept special attackers like Hisuian Electrode, Whimsicott, and Mesprit. Hisuian Decidueye and Toedscruel can form entry hazard cores with Regirock and help keep it from taking entry hazard chip damage. Other Grass-type partners like Alolan Exeggutor, Dipplin, and Virizion are also appreciated by Regirock, as they can cover its Ground, Grass, and Water weaknesses by taking on Sandslash, opposing Dipplin, and Clawitzer, while Regirock can take on threatening Flying-types like Oricorio-G and Articuno.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Floatzel": {
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Floatzel's great offensive STAB type and fantastic Speed make it a powerful pivot, wallbreaker, and revenge killer. Flip Turn lets Floatzel keep up momentum for its team while dealing chip damage and finishing off weakened foes. Aqua Jet lets Floatzel pick off faster Pokemon such as Jolteon and Choice Scarf Typhlosion and Speed-boosting setup sweepers like Frosmoth and Hisuian Sneasel. Ice Spinner provides useful coverage against Grass-types like Hisuian Decidueye, Whimsicott, and Dipplin. Ice Spinner is also useful against Pokemon that may use Tera Dragon, such as Sandaconda, Palossand, and Hisuian Qwilfish. Water Veil provides Floatzel with a burn immunity, letting it switch into Will-O-Wisp from Charizard and Scorching Sands from Palossand. Tera Water lets Floatzel OHKO Regirock after damage from Spikes or Stealth Rock and pick off Jolteon with Aqua Jet at just 62.7% health.</p> <p>Floatzel's multiple offensive roles earn it niches on several different types of teams. Floatzel is an excellent addition to VoltTurn teams with Electric-type partners like Magneton and Jolteon, exerting constant offensive pressure and wearing down their shared Grass-type checks. Other offensive pivots like Passimian and Grafaiai similarly make great cores with Floatzel by keeping up constant offensive momentum. Defensive pivots like Lanturn and Articuno can give Floatzel opportunities to come in and fire off Choice Band-boosted attacks; Lanturn can check Electric-types for Floatzel, and Floatzel can return the favor by answering Ground-types for Lanturn; Articuno can impede special attackers such as Clawitzer and Whimsicott that resist Floatzel's Water-type moves and could hit it back with strong attacks. Floatzel's nearly unparalleled ability to revenge kill setup sweepers like Grafaiai, Mesprit, and Jolteon is a huge asset to more defensive teams. Floatzel struggles to break through Grass-types like Hisuian Decidueye and Dipplin on its own, so it appreciates teammates like Charizard, Weezing, and Muk that threaten them. Offensive Ice-types like Glastrier and Frosmoth menace other Grass-types like Whimsicott and Dipplin that would give Floatzel trouble, and Floatzel can threaten Fire-types like Charizard and Typhlosion for them in return. Other powerful offensive Pokemon such as Lycanroc and Brute Bonnet appreciate Floatzel bringing them in safely with Flip Turn. Floatzel tends to be worn down by Wave Crash's recoil and entry hazard damage, so it appreciates teammates that provide hazard removal, such as Hisuian Decidueye, Hisuian Avalugg, and Sandslash. Healing Wish users like Mesprit and Shaymin can give Floatzel a second wind to clean up the very teams it weakened. Qwilfish is a pain for Floatzel between Intimidate, chip damage from its Spikes, and Rocky Helmet damage; Floatzel appreciates checks to Qwilfish such as Rotom and Mesprit. Water Absorb Lanturn prevents Floatzel from pivoting out or spamming its STAB moves, so Floatzel relies on checks to it such as Virizion and Dipplin.</p>"
      },
      "Bulk Up": {},
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 626095, "username": "sinnabyss"}, {"user_id": 654091, "username": "FlamPoke"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Drifblim": {"sets": {"Defog": {}}},
  "Mismagius": {"sets": {"Choice Specs": {}, "Nasty Plot": {}, "Calm Mind": {}}},
  "Spiritomb": {"sets": {"Physical Wall": {}}},
  "Abomasnow": {"outdated": true, "sets": {"Aurora Veil": {}, "Choice Specs": {}}},
  "Magmortar": {"outdated": true, "sets": {"All-Out Attacker": {}}},
  "Leafeon": {"sets": {"Sunny Day Attacker": {}}},
  "Froslass": {"sets": {"Suicide Lead": {}, "Utility Spikes": {}}},
  "Rotom": {"sets": {"Choice Scarf": {}, "Utility": {}, "Nasty Plot": {}}},
  "Rotom-Frost": {"outdated": true, "sets": {"Nasty Plot": {}}},
  "Mesprit": {
    "overview": "<p>Mesprit is a highly flexible Pokemon that is capable of fulfulling a multitude of roles within the ZU metagame. Its balanced stats and useful movepool allow Mesprit to work well in offensive and defensive utility roles, while its Nasty Plot set is a threatening sweeper that is extremely challenging for bulky builds to deal with. Mesprit is also a good check to Fighting-types such as Hisuian Decidueye and Passimian, and Levitate lets it deal with many Ground-types, such as Rhydon and Sandaconda. Unfortunately, Mesprit's balanced stats means that it isn't truly exceptional at any role that it tries to play, as its offensive stats aren't fantastic, and bulky sets are prone to getting chipped down over time. Its Psychic typing also leaves it vulnerable to common Dark-types, such as Sneasel, Brute Bonnet, and Hisuian Qwilfish, while also leaving it weak to the ubiquitous U-turn. Finally, Mesprit's coverage is quite limited, as it lacks a way to hit Steel-types hard and doesn't hit much of the metagame for super effective damage. This can lead to it sometimes struggling to break through bulky threats such as Articuno, Snorlax, and Porygon2.</p>",
    "comments": "<h3>Other Options</h3> <p>A Choice Specs set utilizing Psychic, Dazzling Gleam, Psyshock or Shadow Ball, and either Trick or U-turn is feasible. However, Mesprit isn't powerful enough to consistently break down defensive cores without perfect prediction, it can't hit Steel-types for significant damage, and its mediocre Speed tier means it isn't especially good against offensive teams either. The Nasty Plot set can consider Psychic Noise or Stored Power as its Psychic-type STAB move. The former prevents recovery from the likes of Articuno, Pallosand, and Snorlax, while the latter will become extremely powerful if Mesprit accrues multiple Nasty Plot boosts. However, Psyshock's ability to pressure common special walls like Lanturn, Snorlax, and Articuno makes it the most consistent option. The defensive pivot set can consider Colbur Berry as an alternative item to take Knock Off from the likes of Passimian, Hisuian Decidueye, and Grafaiai as well as Dark-type attacks from Brute Bonnet. However, the loss of Leftovers recovery means that only offensive teams looking to play fast should consider this, and it loses value if Mesprit is forced to Terastallize. The defensive pivot could also use other Tera types, such as Tera Fairy to give a Dark resistance that is useful when facing down Sneasel, Brute Bonnet, and Passimian and Tera Water to grant useful resistances for Typhlosion, Floatzel, and Clawitzer. Tera Water, however, leaves Mesprit open to common Grass- and Electric-type attacks from Hisuian Decidueye, Jolteon, and Brute Bonnet. Options like Thunder Wave to deter setup or and Pain Split to give Mesprit some form of recovery may seem appealing for the defensive set, but Mesprit tends to perform its role more consistently with the given moves.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types and Dark-type Coverage</strong>: Dark-types such as Sneasel, Brute Bonnet, and Hisuian Qwilfish threaten Mesprit with their STAB moves and either force it to switch out or Terastallize. Mesprit is capable of pivoting out or hitting them with Fairy-type coverage as they switch in, however. Pokemon that Mesprit would otherwise check, such as Grafaiai, Passimian, Hisuian Decidueye, Hisuian Sneasel, and Sandslash often run Dark-type coverage, limiting its ability to comfortably deal with them. Sableye and Spiritomb don't fear Mesprit's STAB moves, and Sableye can threaten to lock Mesprit into an ineffective move with Prankster Encore, though neither of them appreciate Fairy-type coverage, Knock Off, or Trick.</p> <p><strong>Ghost-types</strong>: Ghost-type attackers such as Oricorio-G, Mismagius, and Rotom threaten Mesprit with their STAB moves, but they can't comfortably switch in to most sets due to the threat of Knock Off, Trick, or a STAB move.</p> <p><strong>Steel-types</strong>: Steel-types such as Orthworm, Magneton, and Perrserker resist Mesprit's common coverage options, and they can use it as an opportunity to fire off a strong attack or, in Orthworm's case, set up Stealth Rock, Spikes, Coil, or Iron Defense. However, they must be wary of Trick or Knock Off. Additionally, certain Pokemon Mesprit usually checks, such as Defog Hisuian Decidueye and Whimsicott, often run Tera Steel and can therefore turn the tables on Mesprit.</p> <p><strong>Strong Wallbreakers</strong>: Mesprit's rather modest bulk means it can't comfortably answer many of the tier's strongest offensive threats. Typhlosion, Jolteon, and Floatzel outrun non-Choice Scarf Mesprit and threaten to do serious damage, even to the defensive set. Even slow wallbreakers such as Alolan Exeguttor and Clawitzer are still faster than the defensive pivot set and threaten it with extreme damage.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Mesprit is a great revenge killer to handle fast Pokemon like Jolteon and Hisuian Sneasel. Dazzling Gleam is Mesprit's best complementary coverage move for Psychic, covering Dark-types like Sneasel and Sableye. U-turn lets Mesprit keep up offensive momentum against switch-ins like Orthworm, Farigiraf, and Snorlax. Healing Wish lets Mesprit give teammates like Virizion, Snorlax, and Glastrier a second chance to set up and sweep. Mesprit can alternatively use Trick to make a defensive Pokemon like Snorlax, Orthworm, or Dudunsparce less threatening. Tera Fairy Mesprit is a more effective offensive and defensive answer to Sneasel, Toxicroak, and Passimian given their Dark-type coverage moves, and Tera Fairy lets Mesprit not play guessing games with Psychic and Dazzling Gleam against Tera Dark Pokemon like the aforementioned Toxicroak and Passimian. Tera Steel has good synergy with Levitate and gives Mesprit several new resistances to more easily answer Whimsicott, Sandslash, and Farigiraf.</p> <p>Offensive pivots like Jolteon and Magneton make great cores with Mesprit and appreciate Mesprit's Levitate to more easily play around Ground-types. Fighting-types like Hisuian Decidueye, Virizion, and Passimian are great offensive checks to Steel-types like Orthworm and Perrserker and specially defensive Normal-types like Snorlax and Dudunsparce, all of which give Mesprit trouble, and they appreciate Mesprit offensively checking Poison-types like Toxicroak, Weezing, and Hisuian Sneasel. Mesprit benefits from Ground-type teammates like Sandslash and Sandaconda patching up its poor matchup against Hisuian Qwilfish, while it can check foes like Virizion and Hisuian Decidueye for them. Setup sweepers like Oricorio-G, Regirock, and Frosmoth benefit from Mesprit providing them second chances to sweep with Healing Wish or making foes more exploitable with Trick. Physical wallbreakers like Hisuian Decidueye, Glastrier, and Toxicroak all benefit from Healing Wish giving them an additional chance for breaking, as they can break special walls that Mesprit cannot.</p>"
      },
      "Nasty Plot Sweeper": {
        "description": "<p>Nasty Plot Mesprit is a fearsome mid- or late-game sweeper thanks to the combination of Levitate and a somewhat high base 105 Special Attack stat. Its biggest perk is the ability to set up in front of most bulkier Pokémon. Mesprit can choose between Encore and Substitute as its setup tool; Substitute can be very good versus bulkier teams, as Mesprit can tank a hit from most of the passive mons such as Regirock and Lanturn if not being hit super effectively, obtaining a free turn to either set up Nasty Plot or fire off an attack. Encore helps to circumvent Mesprit's passivity and can take advantage of checks that need to set up or use status moves like Haze to wall Mesprit, like Articuno for the Haze case, and Dudunsparce for the set up. Psyshock is great to deal with specially defensive Pokémon such as Snorlax and Calm Mind users, like Dudunsparce. Draining Kiss allows Mesprit to outlast Dark-type checks such as Spiritomb and Sneasel while healing in the process, Thunderbolt allows it to hit Water- and Flying-types such as Cramorant and Clawitzer. Tera Fairy lets Mesprit set up in front of the aforementioned Dark-types, grants immunity to Dragon Tail from Dipplin, Appletun, and Dudunsparce, and increases the power of Draining Kiss, letting Mesprit restore more HP on the aforementioned threats and making it even harder to take down. Tera Steel improves Mesprit's defensive capabilities, making it take neutral damage from Dark- and Ghost-type attacks and giving it a Bug resistance, while only being weak to Fighting- and Fire-type moves due to Levitate. Tera Electric boosts the power of Thunderbolt and removes all of Mesprit's weaknesses.</p> <p>Nasty Plot Sweeper Mesprit works well with specific entry hazard setters and Fighting-types. Hazard setters like Orthworm and Hisuian Qwilfish both cover each other's weaknesses and let Mesprit get rolls it wouldn't otherwise, such as KOing Honchkrow with Tera Fairy Draining Kiss after Stealth Rock chip damage. Fighting-types such as Scarf Passimian, Virizion, or Hitmonlee deserve a highlight, as when paired with Mesprit, they provide good coverage for it, pressuring Dark- and Steel-types with their STAB moves and Ghost-types with Knock Off. Each of them offers additional utility, with Virizion being bulky enough to enter in and provide wallbreaking prowess, Passimian having access to U-turn to let Mesprit in safely and Knock Off to offer utility, and Hitmonlee providing support with Knock Off and Rapid Spin. Secondary wallbreakers that don't rely on Setup to make progress such as Clawitzer and Magneton will also appreciate being by Mesprit's side. Some cleaners also enjoy Mesprit's ability to make progress so they can clean late-game, such as Dodrio and Hisuian Sneasel.</p>"
      },
      "Specially Defensive Pivot": {
        "description": "<p>Mesprit's decent defensive profile and access to useful utility moves like Stealth Rock and Healing Wish allow it to act as a good defensive pivot. Its bulk and typing allows it to check foes such as Jolteon, Charizard, Dudunsparce, and Passimian locked into Close Combat. Psychic Noise is a useful STAB move that allows Mesprit to force out Hisuian Decidueye, which is the most common Defogger in the tier. Its decent Base Power and ability to prevent healing allow Mesprit to annoy other defensive Pokemon like Cramorant, Palossand, and Sandaconda. U-turn allows Mesprit to pivot out of poor matchups such as Glastrier and Spiritomb while keeping up momentum for its team. Knock Off allows Mesprit to punish foes that would feel comfortable coming in otherwise, such as Orthworm, Articuno, and Snorlax. Healing Wish is another option for offensive teams that allows Mesprit to fully heal an offensive teammate and give it another go at breaking down the opponent's team. It is capable of running both Knock Off and Healing Wish if your team already has another Stealth Rock user. Maximum Special Defense investment is preferred in order to better take hits from the likes of Charizard, Magneton, and Pyroar. A Sassy nature is preferred to give Mesprit a slow U-turn and maximize the damage that its physical attacks do. Steel is the preferred Tera type, as it turns each of Mesprit's weaknesses into a neutrality or a resistance and gives it a superb general defensive typing. It notably lets Mesprit handle Grafaiai, Dudunsparce, and Whimsicott with more confidence. Tera Steel also has good synergy with Levitate and allows Mesprit to comfortably handle foes such as Sandslash, Rhydon, and Palossand. Leftovers grants Mesprit passive recovery and helps it stay as healthy as possible throughout the match.</p> <p>Mesprit is one of the few bulky Stealth Rock setters in the tier that also has access to a pivoting move, which makes it highly useful for both balance and offense. Mesprit lacks reliable recovery, so teams utilizing it shouldn't expect it to be a stalwart wall. Rather, its good support movepool and defensive traits allow it to act as a stopgap that can take a few hits while also supporting its offensively oriented teammates via pivoting and utility moves such as Knock Off and Healing Wish. Mesprit's physical bulk is somewhat lacking, so physically defensive teammates such as Weezing, Sandaconda, and Palossand make for good partners. These three help out against Fighting-types such as Passimian, Hitmonlee, and Hisuian Sneasel, which Mesprit struggles to check in the long term. Dipplin serves as a good physically defensive partner and in particular a Knock Off absorber, which is highly useful for Mesprit because it fears Knock Off greatly. Mesprit is also vulnerable to Dark-types such as Hisuian Qwilfish, Sneasel, and Brute Bonnet. Teammates such as Hisuian Decidueye and Virizion can help with the latter, while Hisuian Qwilfish and the aforementioned Weezing can help with the former two. Teammates such as Passimian, Virizion, and Charizard can help check Steel-types such as Magneton and Orthworm, which Mesprit struggles to deal with on its own. Strong wallbreakers, such as Typhlosion, Glastrier, Brute Bonnet, and Alolan Exeggutor, appreciate Mesprit's slow U-turn getting them in safely, and they benefit from Mesprit's ability to use Knock Off to remove various items from defensive Pokemon such as Regirock, Orthworm, and Articuno. Mesprit also pairs well with other VoltTurn users; Passimian, Grafaiai, Whimsicott, and Floatzel also benefit from Mesprit bringing them in safely and can form a pivoting core that can slowly wear down the opponent's team. Pokemon such as Floatzel, Typhlosion, Charizard, and Glastrier appreciate Healing Wish support should Mesprit choose to run it, as they are all vulnerable to being worn down over the course of a match, and many teams are not prepared to deal with them a second time.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 475916, "username": "Sputnik"}, {"user_id": 644300, "username": "estra"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}, {"user_id": 452572, "username": "missangelic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}, {"user_id": 649096, "username": "a blue banana"}, {"user_id": 652656, "username": "Gambit"}]}]}
  },
  "Shaymin": {"sets": {"Offensive Utility": {}, "Choice Scarf": {}}},
  "Gurdurr": {"outdated": true, "sets": {"Bulky Attacker": {}}},
  "Whimsicott": {
    "overview": "<p>Blessed with the rare Fairy typing and an excellent Speed tier, Whimsicott makes for an excellent revenge killer and utility Pokemon. Whimsicott's unique typing allows it to beat many dangerous threats like Hisuian Decidueye and Virizion. A powerful Moonblast and pivoting coupled with Choice Specs allow Whimsicott to break past bulkier threats like Hisuian Qwilfish and Glastrier. However, Whimsicott's low offensive stats leave it often wanting for power, especially without Choice Specs, and it's incapable of fitting every move it wants. Furthermore, lack of reliable recovery and only average bulk makes it unable to consistently check the Pokemon it's supposed to like Regirock and Sandaconda.</p>",
    "comments": "<h3>Other Options</h3> <p>Psychic is an option that nails Poison-types like Weezing and Grafaiai. However, this comes at the cost of either losing U-turn's pivoting or the utility of Switcheroo or Encore. Whimsicott can use a SubSeed set to mess up its usual defensive checks like Snorlax and Orthworm and be a general nuisance. This set struggles to find setup opportunities however and relies heavily on getting a free Substitute on a forced switch.</p> <h3>Checks and Counters</h3> <p><strong>Poison-types</strong>: Whimsicott's 4x weakness to Poison and inability to hit Poison-types with its STAB attacks makes Poison-types like Grafaiai and Weezing good checks. However, these Pokemon lack reliable recovery and can thus be worn down over a game.</p> <p><strong>Steel-types</strong>: Steel-types like Magneton and Orthworm can take Whimsicott's STAB attacks with ease. Orthworm can start setting entry hazards or set up with Coil or Iron Defense, while Magneton can generate momentum with Volt Switch.</p> <p><strong>Fire-types</strong>: As Whimsicott's STAB attacks do little to them, Fire-types like Charizard, Typhlosion, and Magmortar can use Whimsicott as an entry point to start firing off powerful attacks. These Pokemon aren't usually defensively invested however and can struggle to switch in consistently.</p> <p><strong>Special Walls</strong>: Special walls like Dudunsparce, Snorlax, and Articuno aren't bothered by Whimsicott's attacks and can use it to start forcing progress with entry hazards, status, pivoting, or boosts. However, Switcheroo completely ruins these walls, especially Articuno, and Encore can force them to repeat their status moves, allowing Whimsicott to safely bring in a teammate.</p> <p><strong>Choice Scarf Users</strong>: Many common Choice Scarf users like Grafaiai, Qwilfish, and Gunk Shot Passimian get the jump on Whimsicott and can easily take it out.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Whimsicott takes advantage of its high Speed and Moonblast to be a powerful cleaner and revenge killer. U-turn lets It scout for switches and pivot out of unfavorable matchups like Weezing and Orthworm, allowing it to bring in a more suitable teammate. Switcheroo allows Whimsicott to cripple its defensive checks, greatly hindering special walls like Dudunsparce, Orthworm, and especially Articuno, letting Whimsicott and its teammates break past them later in the game. However, Whimsicott loses a substantial amount of power without its Choice Specs, so one must be careful about when to use Switcheroo. Infiltrator allows Whimsicott to bypass Substitute from foes like Glastrier and opposing Whimsicott.</p> <p>Choice Specs Whimsicott best fits on balance and bulky offense teams looking for a fast offensive cleaner that also provides some defensive utility. Whimsicott loves entry-hazard stacking teammates like Qwilfish and Orthworm to help push its otherwise average damage output. It can't handle Fire-types like Charizard and Typhlosion, so answers to them like Regirock and Snorlax help immensely. Whimsicott can in return take advantage of the Grass- and Fighting-types like Hisuian Decidueye and Passimian that these Pokemon are at a disadvantage against. Whimsicott struggles with Poison-types like Weezing and Grafaiai who resist its STAB attacks and threathen it with 4x super effective attacks, so answers like Qwilfish and Sandaconda make for great teammates. Whimsicott pairs well with offensive Fire-types like Typhlosion and Charizard that handle the Steel-types like Orthworm that it has difficulties breaking past, and in return, it handles their Water and Rock-type answers such as Regirock and Lanturn. Special sweepers such as Mesprit and Oricorio-G enjoy pairing with Whimsicott for its capability to pressure and cripple special walls like Snorlax and Hisuian Qwilfish.</p>"
      },
      "Offensive Pivot": {
        "description": "<p>Whimsicott leverages its superb Speed and access to Prankster to be a competent offensive pivot. Giga Drain is used for its ability to give Whimsicott staying power in longer games. Encore is key to this set, allowing it to force defensive foes into unfavorable moves like Stealth Rock and Recover, as well as shutting down setup sweepers like Oricorio-G and Snorlax by locking them into their setup moves. U-turn pairs beautifully with Encore, scouting any forced switches and allowing Whimsicott to bring in powerful teammates like Glastrier and Typhlosion. Tera Steel gives Whimsicott an immunity to Poison-type attacks from Grafaiai and Hisuian Qwilfish and a resistance to Flying-type attacks from Dodrio and Braviary as well as Ice-type attacks from Sneasel in a pinch. However, this still leaves Whimsicott vulnerable to Fire-type attacks from Charizard and Typhlosion and makes it weak to Fighting, making it unable to reliably switch into Hisuian Decidueye and Virizion. Tera Fire provides emergency resistances to Ice and Fire, but this makes Whimsicott unable to safely check Ground- and Rock-types like Sandaconda and Regirock.</p> <p>Balance teams enjoy Whimsicott's pivoting and Prankster Encore helping them deal with bulky defensive Pokemon and dangerous setup sweepers. Powerful physical wallbreakers like Glastrier and Passimian pair well with Whimsicott, as it baits in special walls like Articuno and can bring these teammates in with U-turn. Ground-types like Palossand and Sandaconda make for excellent partners, as Whimsicott helps them handle the Water- and Grass-types like Floatzel and Virizion that they struggle with, while they can handle Poison-types like Grafaiai that scare Whimsicott out. Fire-types like Charizard and Magmortar can easily gain entry on Whimsicott, so Fire-resistant teammates like Regirock, Rhydon, and Snorlax are helpful partners. Partners such as Charizard or Passimian that threaten Steel-types like Orthworm and Magneton can come in after a U-turn on these Steel-types to fire off attacks. Electric-types like Jolteon and Magneton appreciate Whimsicott's ability to handle Ground-types like Sandaconda, and in return, they handle the Flying-types like Dodrio and Articuno that Whimsicott struggles to beat. Other offensive pivots like Grafaiai and Floatzel can form a powerful VoltTurn core with Whimsicott, quickly racking up damage against walls like Regirock and Qwilfish, especially with entry hazards up.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626095, "username": "sinnabyss"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Lilligant": {"sets": {"Sun Sweeper": {}}},
  "Eelektross": {"outdated": true, "sets": {"Defensive Pivot": {}, "Coil": {}}},
  "Cryogonal": {"sets": {"Hazard Remover": {}}},
  "Braviary": {"sets": {"Bulk Up": {}}},
  "Virizion": {
    "overview": "<p>Virizion's great Speed tier and threatening offensive typing make it a dangerous offensive threat that can serve as both a wallbreaker and a late-game cleaner. Virizion has access to Swords Dance, which allows it to boost its attack and wallbreak consistently. Its great Speed tier lets it stay threatening versus offensive teams and even clean them up late-game when its checks are weakened or removed. Virizion has naturally high special bulk and a workable defensive typing that allow it to find set up opportunities versus Choice-locked special attackers like Jolteon, Magneton, and Clawitzer, and there is some ambiguity to its sets thanks to its good coverage and ability to run a physical or special set. However, Virizion isn't especially strong without a boost, and it can struggle to break through physically bulky checks like Weezing, Dipplin, and Qwilfish. Virizion also competes for a team slot with Swords Dance Hisuian Decidueye, which has a higher Attack stat and has useful tools such as Triple Arrows, Scrappy, and Sucker Punch. Hisuian Decidueye's popularity also means that many teams are naturally prepared for Virizion, as they share similar checks. However, Virizion retains a very solid niche thanks to its higher Speed tier and its ability to run coverage options like Stone Edge and Zen Headbutt.</p>",
    "comments": "<h3>Other Options</h3> <p>Virizion can run a Tera Flying Calm Mind set using Giga Drain, Air Slash, and Focus Blast or Aura Sphere. This turns the tables on many of Virizion's traditional answers such as Dipplin and Weezing, and Virizion's STAB combination threatens several common special walls, such as Lanturn, Dudunsparce, and Porygon2. However, Virizion can only boost its Special Attack by one stage at a time with Calm Mind, and it is forced to use weak moves unless it opts for the inaccurate Focus Blast as its Fighting-type STAB move, which makes the set considerably less threatening in practice. A mixed attacker set with Leaf Storm, Close Combat, Stone Edge, and Synthesis with a Life Orb can be threatening to certain offensive and balance teams but fails to make significant progress versus builds packing common walls such as Dipplin, Mesprit, and Muk. Sacred Sword is an interesting alternative to Close Combat that ignores the Defense boosts on IronPress foes such as Regirock, Orthworm, and Naclstack and doesn't lower Virizion's own defenses, but the drop in power is very noticeable. Tera Fairy is a fringe alternative Tera type that gives Virizion a Fighting resistance, allowing it to stave off revenge killing from Choice Scarf Passimian, and an immunity to Dragon Tail, which lets it potentially break past Dipplin after accruing multiple Swords Dance boosts. Tera Poison grants Virizion a generally useful defensive typing to counteract revenge killing attempts from the likes of Whimsicott, Passimian, and Grafaiai. These are inferior to the other Tera types outside of these specific situations, however.</p> <h3>Checks and Counters</h3> <p><strong>Dipplin</strong>: Dipplin's massive physical bulk allows it to handily deal with the standard Swords Dance set. It isn't even 2HKOed by a +2 Close Combat and can use Dragon Tail to phaze Virizion before healing off any damage, which makes it a very reliable answer. It has to be wary of a surprise Calm Mind set, however, and the rare Tera Fairy can turn it into setup fodder.</p> <p><strong>Poison-types</strong>: Bulky Poison-types such as Weezing, Muk, and Qwilfish resist Virizion's STAB moves and threaten it in return with their STAB moves or, in Weezing's case, a burn from Will-O-Wisp. They must be cautious of Zen Headbutt, however. Grafaiai, Hisuian Sneasel, and Choice Scarf Qwilfish are faster than Virizion and can OHKO it with Gunk Shot or, in Grafaiai's case, cripple it with Encore or Switcheroo. Additionally, several Pokemon that Virizion usually threatens, such as Brute Bonnet and Regirock, commonly run Tera Poison and can therefore turn the tables on it.</p> <p><strong>Revenge Killers</strong>: Virizion's Speed tier, while very solid, still leaves it outpaced by several common revenge killers. Choice Scarf Passimian, Lycanroc, Whimsicott, Sneasel, and Choice Scarf Typhlosion all outrun Virizion and can threaten to revenge kill it. All but the latter two need chip damage dealt before they can KO Virizion, however, and only Whimsicott and Passimian can directly switch in.</p> <p><strong>Status</strong>: Burns and paralysis are especially threatening to Virizion. Common Pokemon such as Weezing, Lanturn, Porygon2, Charizard, and Dudunsparce are all capable of spreading those status conditions, and Virizion is not capable of OHKOing any of them except for Charizard if it chooses to run Stone Edge. However, Lum Berry allows Virizion to circumvent this and set up on many of these foes fearlessly.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Swords Dance allows Virizion to break through bulky foes like Mesprit, Palossand, and Regirock. Stone Edge lets Virizion threaten Charizard, Articuno, and the Oricorio formes. Zen Headbutt can be used instead to threaten Poison-types like Qwilfish, Weezing, and Muk. Justified dissuades foes such as Passimian and Hisuian Decidueye from attempting to remove Virizion's item via Knock Off. Heavy-Duty Boots allows Virizion to come in multiple times throughout a game without fear of chip damage from entry hazards. However, Lum Berry is a viable alternative on offensive teams, as it allows Virizion to set up safely on foes that might try to cripple it with status, such as Mesprit, Rotom, and Sandaconda. Tera Rock allows Stone Edge to OHKO Whimsicott and 2HKO Weezing after Stealth Rock damage at +2. It also gives Virizion a resistance to Fire- and Flying-type attacks, which lets it deal with Charizard, Typhlosion, and the Oricorio formes with more confidence. Tera Psychic lets Zen Headbutt 2HKO Tera Poison Regirock at +2, do significantly more damage to Weezing and defensive Qwilfish, removes Virizion's weakness to their Poison-type STAB moves, and gives Virizion a useful Fighting resistance that can foil revenge killing attempts from Choice Scarf Passimian and opposing Virizion.</p> <p>Virizion's great Speed tier and ability to both wallbreak and sweep depending on the situation make it usable on teams ranging from balanced to hyper offensive team styles. Virizion dislikes facing down extremely bulky physical walls such as Dipplin and Weezing and Iron Defense Pokemon such as Regirock and Orthworm, which can also outlast Virizion should they begin boosting as it comes in. Strong special attackers, such as Nasty Plot Mesprit, Magneton, and Charizard, are therefore good teammates; the former is especially good at disrupting these extremely bulky threats. These teammates appreciate Virizion's Speed tier helping them out against offensive builds and its ability to threaten special walls like Lanturn and Porygon2. Virizion appreciates entry hazards on the opponent's side, as it tends to force a lot of switches and loves seeing its defensive checks worn down. Stealth Rock setters such as Mesprit, Dudunsparce, and Palossand are good teammates as a result, as are Spikes setters like Qwilfish and Orthworm. These bulky hazard setters help to check revenge killers that are dangerous to Virizion; Regirock, Rhydon, and Naclstack can help check Choice Scarf Typhlosion; Mesprit and Palossand help out versus Choice Scarf Passimian; and Qwilfish and Orthworm can deal with Choice Scarf Floatzel. Lanturn pivots into Fire-types like Typhlosion and Charizard easily and can bring Virizion into battle safely with Volt Switch. Virizion pairs well with other physical wallbreakers, especially on offense and hyper offense, as they can work together to break down their shared defensive answers. Teammates such as Swords Dance Qwilfish, Swords Dance Sneasel, and Glastrier work well as a result.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 654091, "username": "FlamPoke"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Pyroar": {"sets": {"Special Attacker": {}}},
  "Malamar": {"sets": {"RestTalk": {}, "Choice Scarf": {}}},
  "Clawitzer": {"sets": {"Choice Specs": {}}},
  "Avalugg-Hisui": {"outdated": true, "sets": {"Suicide Lead": {}, "Offensive Utility": {}}},
  "Decidueye-Hisui": {
    "overview": "<p>Hisuian Decidueye's unique bag of tricks, including its powerful Triple Arrows, rare utility in Defog, Swords Dance, U-turn, and Sucker Punch gives it a unique place as either a fearsome setup sweeper that tears through defensive teams or a defensive Defog-packing pivot that removes entry hazards in the face of the most common setters like Orthworm and Sandaconda. Its typing makes defensive sets adept at checking many threats like Brute Bonnet, Floatzel, and Lycanroc. However, Hisuian Decidueye's low speed makes it difficult for it to face up against offensive teams, as many revenge killers like Passimian and Virizion can easily take it out without fearing offensive sets's priority attacks. Hisuian Decidueye has trouble fitting every move it wants, especially on offensive sets, often leaving it walled by common foes like Charizard and Qwilfish. Lastly, Hisuian Decidueye faces competition from other Grass-types like Whimsicott and other Fighting-types like Passimian; it especially faces competition from Virizion, which shares its typing.</p>",
    "comments": "<h3>Other Options</h3> <p>Brave Bird seems tempting to nail Whimsicott on the switch-in but is quite bad otherwise and hard to fit. Scope Lens is a potential option on Swords Dance sets, letting Hisuian Decidueye have near-guarenteed critical hits on Triple Arrows and Leaf Blade, but this lacks the utility of Lum Berry. Defensive sets can invest varying degrees of speed to outpace threats like Glastrier, Orthworm, and Sandaconda.</p> <h3>Checks and Counters</h3> <p><strong>Poison-types</strong>: Weezing is a near-perfect wall to Hisuian Decidueye, taking minimal damage from its attacks and threatening it in return with super effective attacks or status conditions. Grafaiai threatens Hisuian Decidueye with Gunk Shot, or it can use encore to lock Hisuian Decidueye into an unfavorable move and force it to switch out, potentially gaining momentum with U-turn. Qwilfish greatly annoys defensive sets, easily setting up entry hazards on it, but must be wary of Swords Dance, since Intimidate is blocked by Scrappy, and a +2 Leaf Blade deals huge damage. Hisuian Qwilfish is unthreathened by Sucker Punch and can take Hisuian Decidueye out with a Poison-type attack, but it doesn't take Triple Arrows very well and hates having its Eviolte removed by Knock Off.</p> <p><strong>Flying-types</strong>: Hisuian Decidueye's 4x weakness to Flying makes it incredibly threatened by the likes of Dodrio, Oricorio-G, Oricorio-F, and Braviary, which can use it as an opportunity to set up. Cramorant is a shakier switch-in but can assist its team in pivoting around Triple Arrows. However, these Pokemon must think twice about switching in directly in fear of Knock Off or Triple Arrows.</p> <p><strong>Fire-types</strong>: Fire-types like Charizard and Pyroar put immense pressure on Hisuian Decidueye with their super effective STAB attacks. Will-O-Wisp lets them dance around Sucker Punch, reducing the effectiveness of Hisuian Decidueye's sweeping potential. Typhlosion doesn't enjoy Sucker Punch but likewise scares Hisuian Decidueye out. Knock Off ruins these Pokemon, however, making them wary of switching in.</p> <p><strong>Psychic-types</strong>: Mesprit offensively threatens Hisuian Decidueye with Psychic-type STAB moves, sets up Stealth Rock, can use Encore to lock it into a status move. Nasty Plot sets can set up a Substitute on Swords Dance Hisuian Decidueye's Sucker Punch, but Mesprit has to be wary of Knock Off, Shadow Sneak, and even U-turn from defensive sets. Farigiraf's Armor Tail and Indeedee-Fs Psychic Terrain block Sucker Punch completely, allowing them to fire at Decidueye unhindered. Knock Off does remove their items and greatly damages them, however, and U-turn also deals good damage while potentially putting them into precarious positions.</p> <p><strong>Ice-types</strong>: Sneasel and Frosmoth outpace Hisuian Decidueye and can destroy it with super effective attacks. They can also play around Sucker Punch with Ice Shard and Substitute, respectively. Glastrier has the bulk to take a Triple Arrows from Hisuian Decidueye and hit back with Icicle Crash. All of them are unable to switch in directly, however.</p> <p><strong>Faster Attackers</strong>: Several faster revenge killers like Whimsicott, Passimian, and Virizion outspeed Hisuian Decidueye and resist Sucker Punch, letting them retaliate with their own powerful attacks. Other faster special attackers like Jolteon and Magneton outspeed and threaten Hisuian Decidueye.</p> <p><strong>Status Conditions</strong>: Will-o-Wisp from Weezing and Charizard takes Hisuian Decidueye out of commision, severely weakening its attacks. Toxic from Qwilfish and Hisuian Qwilfish eats away at Hisuian Decidueye's HP and stops potential sweeps in their tracks. Lum Berry on Swords Dance sets can alleviate this problem once a game, but defensive sets can't afford to use this item.</p>",
    "sets": {
      "Defog": {
        "description": "<p>With its great matchups into many of the tier's hazard setters like Sandaconda and Orthworm, Hisuian Decidueye is an excellent user of the rare Defog while also serving as a good check to several offensive threats like Floatzel, Brute Bonnet, and Rhydon. Roost provides Hisuian Decidueye with reliable recovery. U-turn lets Hisuian Decidueye grab momentum against the switches it forces against Pokemon like Dudunsparce and Regirock. Knock Off removes items from otherwise-safe switch-ins like Charizard and Cramorant. Scrappy lets Triple Arrows nail Ghost-types like Spiritomb and Sableye and also blocks Intimidate from both Qwilfish. Tera Steel improves Hisuian Decidueye's matchup into hazard setters like Froslass and Qwilfish as well as threats like Whimsicott, Mesprit, and Sneasel.</p> <p>Hisuian Decidueye is immensely helpful for balance teams to remove hazards that would otherwise pressure them greatly. Defensive walls that struggle with hazards, such as Regirock and Porygon-2, love Hisuian Decidueye removing hazards to make them far harder to be taken down. Regirock in particular is an excellent partner in crime, with it stonewalling the Fire- and Flying-types like Typhlosion, Charizard, and Oricorio-G that greatly threaten Hisuian Decidueye while Hisuian Decidueye handles the Grass-, Ground-, and Water-types that Regirock struggles to handle, notably Virizion, Pallosand, and Floatzel. Snorlax also helps cover Fire-types for Hisuian Decidueye while appreciating the removal of entry hazards as well as Hisiuan Decidueye's positive matchup into counters like Orthworm and Regirock. Typhlosion is another notable teammate that enjoys Hisuian Decidueye's hazard removal and slow pivoting as well as its capability to deal with Rock- and Water-types like Rhydon and Lanturn that check Typhlosion. Psychic-types like Mesprit and Farigiraf can use Hisuian Decidueye as setup fodder, so teammates that deal with them like Hisuian Qwilfish and Magneton are useful teammates for Hisuian Decidueye. Weezing and Qwilfish can easily enter on Hisuian Decidueye and spread status or reestablish hazards, annoying it greatly, so teammates like Magneton and Mesprit are helpful in scaring them back. Whimsicott is a notable threat that can liberally switch into Hisuian Decidueye and start firing off attacks, so special walls that deal with it like Articuno and Dudunsparce help immensely. Hisuian Sneasel can take advantage of Hisuian Decidueye to start setting up, so teammates that can deal with it such as Pallosand and Weezing, are useful partners. Other pivots such as Grafaiai, Floatzel, and Jolteon, can form a powerful VoltTurn core with Hisuian Decidueye and appreciate it removing hazards to allow them to come in more times over the course of a game.</p>"
      },
      "Swords Dance": {
        "description": "<p>Hisuian Decidueye can take advantage of the many switches it forces to set up Swords Dance. Triple Arrows is the prefered Fighting-type STAB option for its lack of drawback and capability to brute force past foes with its myriad secondary effects. Leaf Blade threatens Ground-types like Sandaconda and Palossand. Knock Off annoys common switch-ins like Charizard and Rotom and allows Hisuian Decidueye to force progress before it's primed to sweep. Sucker Punch picks off faster Pokemon like Mespirit and Oricorio-G. Shadow Sneak hits some foes that resist Sucker Punch like Passimian, Hisuian Sneasel, and Hitmonlee. slightly harder but is generally not worth the loss of power against neutral targets. On certain teams like Sticky Webs offense, Hisuian Decidueye may opt to drop priority. Lum Berry lets Hisuian Decidueye shrug off status conditions like Will-O-Wisp from Weezing and Charizard once. Tera Dark boosts the power of Sucker Punch and Knock Off while giving Hisuian Decidueye a Psychic immunity, improving its matchup against Mesprit. Scrappy lets Hisuian Decidueye hit Ghost-types like Froslass, Spiritomb, and Sableye with Triple Arrows, with the added benefit of blocking Intimidate from Qwilfish and Hisuian Qwilfish.</p> <p>Hisuian Decidueye's unique capability to tear defensive Pokemon apart makes it a great pick on many teams ranging from semistall to hyper offense. Fellow Fighting-types like Passimian and Hisuian Sneasel enjoy teaming up with Hisuian Decidueye, overwhelming the few Fighting-type checks like Weezing and Charizard. Special attacking teammates like Mesprit and Whimsicott enjoy Hisuian Decidueye pressuring their checks like Snorlax, Dudunsparce, and Orthworm, and in return, they threaten physical walls like Qwilfish and Dipplin, respectively. Switch-ins to Fire-types like Lanturn and Regirock help Hisuian Decidueye deal with the likes of Charizard and Typhlosion. As Hisuian Decidueye can't touch Weezing, Pokemon that can deal with it such as Mesprit, Farigiraf and Magneton are great teammates. Entry hazard setters like Froslass, Qwilfish, and Orthworm greatly help Hisuian Decidueye sweep, especially if it's running Knock Off to remove Heavy-duty Boots. Whimsicott is a notable threat that easily switches into Hisuian Decidueye and threatens it back; as such, defensive answers to it like Charizard and Articuno are great partners. Dipplin can take Hisuian Decidueye's attacks and phaze it with Dragon Tail, so teammates that can scare it out like Whimsicott and Charizard make for great teammates. Pivots like Articuno, Jolteon and Grafaiai help bring Hisuian Decidueye in on foes like Orthworm and Dudunsparce, giving it setup opportunities.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626095, "username": "sinnabyss"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 452572, "username": "missangelic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 327515, "username": "Zrp200"}]}]}
  },
  "Vikavolt": {"sets": {"Sticky Web Pivot": {}}},
  "Crabominable": {"sets": {"Choice Band": {}, "Bulk Up": {}}},
  "Oricorio": {"sets": {"Offensive Quiver Dance": {}, "Bulky Quiver Dance": {}}},
  "Oricorio-Pa'u": {"outdated": true, "sets": {"Offensive Quiver Dance": {}, "Bulky Quiver Dance": {}}},
  "Oricorio-Sensu": {
    "overview": "<p>With its superb typing and access to Quiver Dance, Oricorio-G is a scary sweeper that aims to get boosts in the mid to late-game to clean up the enemy team. Its Ghost / Flying typing gives it a myriad of resistances, allowing it to check and set up on common Pokemon like Virizion and Toxicroak. Flying / Ghost STAB attacks are nearly unresisted, hitting everything save Naclstack and Morpeko for at least neutral damage while hitting many common Pokemon like Bruxish and Virizion super effectively. Offensive sets allow Oricorio-G to be a terrifying sweeper that can easily clean up mid- to late-game, while its defensive set uses its great typing to set up multiple times and slowly take apart bulkier teams. However, Oricorio-G has trouble setting up due to its deceptive frailty when uninvested and can struggle to threaten much without numerous boosts when invested into bulk. It's also quite reliant on Terastallization to bypass its answers like Sneasel and Snorlax.</p>",
    "comments": "<h3>Other Options</h3> <p>Substitute can be used over Taunt to shut down Dudunsparce as a check but doesn't do much else for Oricorio-G. Oricorio-G can be used as a defensive Defogger, but this role is better done by Drifblim.</p> <h3>Checks and Counters</h3> <p><strong>Normal-types</strong>: Snorlax and Dudunsparce are two of Oricorio-Gs best walls, as they can easily take it's moves with their huge bulk, and can threaten it in return with Crunch or Heat Crash from Snorlax and Toxic or Dragon Tail from Dudunsparce. However, Snorlax struggles with hazards and lack of reliable recovery, and both walls can be countered with Tera Fighting. Offensive Normal-types like Braviary and Indeedee-F can also switch into Oricorio-Gs moves and threaten it out.</p> <p><strong>Rock-types</strong>: Regirock and Rhydon can easily take hits from Oricorio-G and either cripple it or phaze it. Rhydon also threatens huge damage on Oricorio-G with its Rock-type moves. However, these Pokemon have no reliable recovery and can be worn down over the course of a game. Naclstack is also a huge annoyance due to it resisting both its STAB moves pre-Terastallization, and being able to wear it down with Salt Cure, and remain healthy with Recover.</p> <p><strong>Steel-types</strong>: While few, Steel-types like Orthworm and Magneton completely shut down bulky Oricorio-G and can set up on it or attack it back. Magneton threatens it with powerful super effective attacks, while Orthworm can set Stealth Rock and use Coil on it. However, these two Pokemon lack reliable recovery, allowing them to be worn down over the course of the game.</p> <p><strong>Electric-types</strong>: Electric-types like Jolteon and Hisuian Electrode can switch into Oricorio-G and severely damage it with their STAB moves. All Electric-types bar Rotom can also take any of Oricorio-Gs unboosted attacks and generate momentum on it with Volt Switch.</p> <p><strong>Special Walls</strong>: Offensive Oricorio-G gets completely shut down by Articuno, and, while bulky Oricorio-G can deny Haze and Roar with Taunt, it must be wary of being PP stalled out of its only attacking move. Hisuian Qwilfish can also beat Oricorio-G with Toxic and Pain Split while being generally unthreatened by its attacks. Other more uncommon special walls like Muk and Malamar can also shrug off its attacks and cripple it in return.</p> <p><strong>Strong Physical Attackers</strong>: Fast and powerful physical attackers like Sneasel and Bruxish can capitalize on Oricorio-G’s lower physical bulk and threatens it out with super effective attacks. However, these attackers tend to have difficulty switching in and can be outsped and KOed, should Oricorio-G get a boost prior. Glastrier is an exception to this with its huge bulk and can easily scare Oricorio-G out.</p>",
    "sets": {
      "Offensive Quiver Dance": {
        "description": "<p>Oricorio-G aims to be as offensively threatening as possible, with its STAB moves of Revelation Dance and Hurricane being near-unresisted, hitting most of the tier for at least neutral damage. Revelation Dance acts like a pseudo-Tera Blast that changes type when Terastallized, letting Oricorio-G tailor its coverage to beat certain types of Pokemon. Tera Fighting allows Oricorio-G to better threaten Normal-types like Dudunsparce, Dark-types like Sneasel, Steel-types like Orthworm, and Rock-types like Rhydon. Tera Ground hits Electric-types like Jolteon as well as the Poison- and Rock-types while giving it resistances to these types.</p> <p>Offensive Oricorio-G best fits on offensive teams alongside other setup sweepers like Virizion, Sneasel and Mesprit. They mutually benefit from each other softening up opposing walls like Articuno and Hisuian Qwilfish to enable a final sweep. Fighting-types like Toxicroak and Hisuian Sneasel threaten the Normal- and Dark-types that Oricorio-G struggles breaking past, easing its need to Terastallize. Defensive answers to Normal-types like Regirock and Palosand are appreciated as well. Oricorio-G also appreciates special wallbreakers like Clawitzer and Alolan Exeggutor that weaken the opposing team's special walls such as Snorlax. Entry hazard setters like Rhydon and Qwilfish help wear down foes to allow an easier sweep for Oricorio-G.</p>"
      },
      "Bulky Quiver Dance": {
        "description": "<p>Bulky Oricorio-G leverages its great defensive typing and decent bulk to be a threatening late-game Quiver Dance sweeper. Air Slash is used over Revelation Dance for its lack of immunities prior to Terastallization. Roost helps Oricorio-G stave off chip damage and stay healthy. Taunt denies opposing setup and recovery moves as well as status moves like Toxic from Qwilfish and Dudunsparce, Haze from Articuno, and Roar from Piloswine. Heavy-Duty Boots gives Oricorio-G an immunity to Stealth Rock, giving it more opportunities to switch in and set up. Grassy Seed is an alternative on Grassy Terrain teams to give Oricorio-G a Defense boost, giving it much needed physical bulk to take strong neutral attacks like Bruxish's Psychic Fangs. Tera Steel gives Oricorio-G a Rock resistance and a Poison immunity, while Tera Fairy gives it a Dark resistance and a Dragon immunity while still being resistant to Fighting.</p> <p>Balance teams can easily fit Oricorio-G for its myriad of immunities and potential to sweep late-game. Oricorio-G struggles with Rock- and Steel-type Pokemon such as Regirock and Orthworm, so Ground- and Water-type teammates like Qwilfish and Sandslash are good options for teammates. Fighting-type teammates like Virizion and Passimian are excellent partners, as they can also threaten Rock- and Steel- types as well as bulky Normal-types like Snorlax and Dudunsparce. Checks to Electric-type Pokemon such as Hisuian Decidueye and Toedscruel cover Oricorio-Gs weakness to them. Special wallbreakes like Whimsicott and Sceptile can help Oricorio-G to wear down special walls or clean up after it. Strong physical attackers like Bruxish and Passimian can also help threaten special walls that Oricorio-G struggles with like Articuno and Hisuian Qwilfish, and in return, it can take advantage of their checks like Dipplin and Sandaconda. Oricorio-G greatly benefits from entry hazard-stacking teammates like the aforementioned Qwilfish and Sandaconda, as they chip away at its checks, and Oricorio-G can double as a spinblocker for them. On Grassy Terrain teams it synergizes well with other setup sweepers like Farigiraf and Mesprit; on these teams, it aims to break apart bulky cores that its teammates may struggle with.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626095, "username": "sinnabyss"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 652656, "username": "Gambit"}]}]}
  },
  "Lycanroc": {"sets": {"Swords Dance": {}, "Suicide Lead": {}}},
  "Lurantis": {"outdated": true, "sets": {"Defog": {}}},
  "Passimian": {
    "comments": "<h3>Other Options</h3> <p>With a Choice Band equipped, Passimian 2HKOes non-Colbur Bery Palossand sets with Knock Off and physically defensive Sandaconda with Close Combat. However, Passimian's base 80 Speed leaves it very susceptible to faster offensive Pokemon like Jolteon, Charizard, and Whimsicott.</p> <h3>Checks and Counters</h3> <p><strong>Physically Defensive Pokemon</strong>: Dipplin and Sandaconda have the longevity and bulk to withstand repeated attacks from Passimian, and neither are particularly punished by Knock Off or its coverage moves. Gunk Shot can threaten Dipplin, but it suffers from poor accuracy and fails to 2HKO it. Weezing is a standout defensive check to Passimian between having great physical bulk, threatening to Will-O-Wisp Passimian, and punishing U-turn with Rocky Helmet.</p> <p><strong>Ghost-types</strong>: Palossand, Sableye, and Spiritomb cause Passimian to lose momentum when it's locked into Close Combat, and all three can burn it. Spiritomb dislikes losing its Leftovers to Knock Off though. Mismagius and Oricorio-G can use Passimian to set up if it's locked into Close Combat or Earthquake, but neither of them can switch into Knock Off.</p> <p><strong>Status</strong>: Will-O-Wisp from Rotom and Charizard debilitates Passimian, though they struggle to switch into its coverage moves safely. Paralysis leaves Passimian easily outsped and makes it poor speed control, so Regirock, Magneton, Porygon2, and Dudunsparce can punish Passimian trying to switch in on them with Thunder Wave or Glare.</p> <p><strong>Faster Choice Scarf Users</strong>: Rotom, Typhlosion, and Mismagius can outspeed and deal significant damage to Passimian, though none of them switch into the combination of Close Combat and Knock Off safely.</p> <p><strong>Fairy-types and Tera Fairy Pokemon</strong>: Whimsicott resists or takes neutral damage from most of Passimian's moves but must be wary of Gunk Shot, and Close Combat can 2HKO it after Stealth Rock damage. Tera Fairy users like Mesprit, Mismagius, and Jolteon can take advantage of Passimian's limited coverage to take a hit from it and KO it at the cost of burning Terastallization. Even Pokemon vulnerable to Passimian such as Snorlax and Dudunsparce can use Tera Fairy to defensively flip their matchups and wall Passimian, opening opportunities for themselves to set up.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Passimian is an excellent fast offensive pivot and revenge killer thanks to its strong STAB attacks, good physical bulk, Stealth Rock resistance, and resistance to priority moves like Accelerock from Lycanroc and Sucker Punch from Hisuian Decidueye and Brute Bonnet. Passimian OHKOes fast offensive threats like Lycanroc and Sneasel and KOes Typhlosion, Brute Bonnet, and Grafaiai after Stealth Rock damage. Knock Off makes Mesprit, Mismagius, and Oricorio-G unsafe switch-ins to Passimian, and it makes helpful progress by removing items from defensive checks like Palossand, Weezing, and Spiritomb. U-turn lets Passimian keep up momentum against switch-ins like Dipplin and Sableye. Earthquake is Passimian's best coverage move for Poison-types like Neutralizing Gas Weezing, Qwilfish, Hisuian Sneasel, and Muk. Gunk Shot OHKOes Whimsicott, is Passimian's best move against Dipplin, and keeps Passimian offensively relevant against Tera Fairy users like Snorlax, Dudunsparce, and Jolteon. Rock Slide hits Flying-types like Charizard, Cramorant, and Oricorio-F. Tera Fighting allows Passimian to outright OHKO offensive foes like Virizion and Typhlosion and 2HKO defensive foes like Hisuian Decidueye, Regirock, and Sandaconda after one layer of Spikes. Tera Dark improves Passimian's matchups against Mesprit and Farigiraf, powers up Knock Off to hurt Palossand and Spiritomb more, and denies Prankster-boosted moves from Grafaiai and Sableye. Defiant is Passimian's only viable ability, but it's useful for boosting Passimian against Intimidate Qwilfish formes and punishing Sticky Web and Defog Hisuian Decidueye.</p> <p>Passimian punishing Defog with Defiant and removing Heavy-Duty Boots with Knock Off makes it a great team player for entry hazard-stacking teams including Qwilfish, Sandslash, or Hisuian Qwilfish. Passimian's momentum is greatly appreciated by wallbreakers like Typhlosion, Clawitzer, and Alolan Exeggutor. Passimian luring in physically defensive Pokemon like Sandaconda and Dipplin enables partners like Mesprit and Whimsicott to take advantage of them when Passimian pivots out with U-turn, and in turn, Passimian threatens Steel-types like Orthworm and Magneton for them. Ghost-types like Palossand, Mismagius, and Oricorio-G can exploit Passimian locked into Close Combat, Earthquake, or Gunk Shot, so teammates like Dudunsparce, Snorlax, and Hisuian Qwilfish are great teammates. Likewise, Passimian appreciates specially offensive teammates like Mesprit, Farigiraf, and Charizard that can exploit physically defensive Pokemon like Weezing and Dipplin that it lures in. Once Passimian can form pivot cores with Pokemon like Jolteon, Magneton, and Lanturn, it can trap foes in the vortex and wear down mutual Ground-type checks such as Palossand, Sandaconda, and Sandslash. Physical wallbreakers like Choice Band Sneasel, Glastrier, and Choice Band Floatzel can open up holes in defensive cores to pave the way for Passimian to clean up late-game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Palossand": {
    "comments": "<h3>Other Options</h3> <p>A Colbur Berry can dull the initial damage from Knock Off if Palossand is facing off against strong attackers like Hitmonlee, Passimian, or Toxicroak, but the passive benefits of Rocky Helmet and Heavy-Duty Boots carry over better if Palossand Terastallizes. The additional power of Earth Power is less useful to Palossand compared to fishing for status with Scorching Sands and Sludge Bomb. Tera Dark affords Palossand more flexibility against Bruxish, Rotom, and Prankster-boosted status moves from Grafaiai and Whimsicott.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Virizion and Hisuian Decidueye can threaten Palossand and can set up to break past its physical bulk. Specially offensive Grass-types like Whimsicott, Hisuian Electrode, Sceptile, and Alolan Exeggutor take advantage of Palossand's poorer special bulk. Hisuian Decidueye and Lurantis can remove Palossand's Stealth Rock, and the both of them and Dipplin can use Palossand as an opportunity to set up. All Grass-types must be wary of Sludge Bomb though, and Scorching Sands's burn chance is problematic for physically offensive ones.</p> <p><strong>Ice-types</strong>: Bulky Ice-types like Frosmoth and Glastrier threaten Palossand and can use it to set up. Articuno is similarly bulky and only dislikes a lucky Sludge Bomb poison. Sneasel can break through Palossand, but neither it nor Glastrier want to take a burn from Scorching Sands, and chip damage from Rocky Helmet adds up on Sneasel if it uses Triple Axel. Palossand blocks Rapid Spin from Hisuian Avalugg and threatens it with Scorching Sands but takes a lot of damage from Mountain Gale.</p> <p><strong>Water-types</strong>: Bruxish, Floatzel, and Veluza can break past Palossand’s great bulk with their powerful Water-type STAB moves but must consider Water Compaction, Tera, and Palossand’s Shadow Ball. Clawitzer has few issues breaking Palossand. Cramorant's special bulk and Ground immunity let it consistently use Defog against Palossand.</p> <p><strong>Special Attackers</strong>: Special wallbreakers like Mesprit and Jolteon break past Palossand’s much lower special bulk but are vulnerable to Shadow Ball and Scorching Sands. Bulky special sweepers like Calm Mind Dudunsparce, Farigiraf, and Oricorio-G can exploit Palossand’s underwhelming damage output to set up, but the former two don’t enjoy taking an unlucky status, while Oricorio-G is weak to Shadow Ball and needs a Special Defense boost to comfortably set up on Palossand.</p> <p><strong>Flying-types</strong>: Oricorio-F and Braviary can capitalize on Palossand's difficulty in dealing damage to them to use it as setup fodder. Oricorio-G is weak to Shadow Ball but can use Quiver Dance to help itself get out of KO range and can target Palossand due to its low special bulk.</p> <p><strong>Trick and Switcheroo</strong>: A Choice-lock is terrible for Palossand's ability to wall foes, so Rotom and Mesprit are very disruptive if they swap a Choice item onto it with Trick.</p> <p><strong>Status</strong>: Toxic from Dudunsparce, Grafaiai, and Hisuian Qwilfish puts Palossand on a timer and makes it more reliant on using Shore Up, but neither of them tolerate burns from Palossand's Scorching Sands very well. Grafaiai can use Poison Touch, and Dudunsparce can use Poison Jab to fish for poisons on Palossand even if they drop Toxic.</p> <p><strong>Taunt and Encore</strong>: Grafaiai and Whimsicott can use Encore to lock Palossand into a status move or weak move to exploit it, but they are weak to Scorching Sands and Sludge Bomb, respectively. Primeape can use Taunt to stop Palossand from setting up Stealth Rock or recovering but dislikes Scorching Sands. Sableye can irritate Palossand with Taunt or Encore.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Palossand's great physical bulk, unique typing, and access to recovery enable it to wall many physical attackers such as Passimian, Snorlax, and Regirock. Palossand's Ghost typing enables it to block Rapid Spin from Sandslash and can help it in a pinch against Hisuian Avalugg despite Palossand's Ice weakness, which adds to Palossand's reliability as an entry hazard setter. Palossand's decent Special Attack and STAB Shadow Ball's neutral coverage are acceptably strong and keep Palossand from being too passive. Scorching Sands is a nice complementary STAB move that can spread burns, making Palossand’s role as a physical wall even easier by stifling physical sweepers such as Snorlax without Rest and Coil Dudunsparce. Sludge Bomb is an alternative to threaten Grass-types that check Palossand like Hisuian Decidueye and Whimsicott. Tera Dragon lets Palossand flip its weaknesses versus Water- and Grass-types, whereas Tera Water trades a Grass resistance for an Ice resistance, and both have great synergy with Water Compaction. Tera Poison grants Palossand a poison immunity and Grass resistance for Grass-type counters like Whimsicott and Dipplin while retaining a good defensive matchup against Fighting-type moves.</p> <p>Palossand is a great addition to teammates looking for a partner that provides role compression of taking on physical attackers and setting up Stealth Rock. Specially defensive Pokemon form great bulky cores with Palossand. Snorlax can use Thick Fat to take on challenging Ice-type attackers like Frosmoth and Articuno for Palossand, and it appreciates Palossand dealing with Fighting-type threats to it like Passimian and Hitmonlee. Articuno threatens Water- and Grass-types like Clawitzer and Whimsicott for Palossand with its Freeze-Dry, and in turn, it enjoys Palossand providing protection against problematic physical attackers like Regirock and Snorlax. Dudunsparce can take on special attackers like Sceptile and Mismagius for Palossand, using its great bulk, Toxic, and Dragon Tail to mitigate setup opportunities Palossand offers, while Dudunsparce appreciates Palossand taking on Fighting-types like Toxicroak and Hisuian Sneasel that would threaten to break it or cause it to Terastallize prematurely. Hisuian Decidueye and Lurantis resist many of Palossand’s weaknesses and can support Rocky Helmet Palossand by using Defog to help with hazard chip damage. Dipplin can absorb Knock Off for Palossand thanks to Sticky Hold, and other Grass-types such as Whimsicott and Virizion can also threaten the Grass- and Water-types Palossand struggles with, such as Bruxish. Qwilfish and Hisuian Qwilfish enjoy Palossand keeping their Spikes up, while Palossand appreciates Intimidate and hazard stacking to wear down the Pokemon it walls.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 543866, "username": "5Dots"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Thwackey": {"sets": {"Grassy Terrain": {}}},
  "Appletun": {"outdated": true, "sets": {"Special Wall": {}, "Iron Defense": {}}},
  "Sandaconda": {
    "overview": "<p>Sandaconda is a good defensive Pokemon in SV ZU thanks to its bulk and Shed Skin. The increased reliability of Rest as recovery lends Sandaconda the longevity to check Pokemon like Grafaiai, Toxicroak, and Passimian. Options like Stealth Rock, Glare, and Coil diversify Sandaconda into a great support Pokemon or a bulky setup sweeper. Sandaconda is an excellent Terastallization user to boot, enhancing its defensive profile to become even tougher to break or enabling its own sweeps. However, Shed Skin does not make Rest perfectly reliable, hampering Sandaconda's consistency. Physical attackers like Hisuian Decidueye, Glastrier, and Virizion are very problematic for Sandaconda and coerce it to burn Terastallization for its team. Despite its Electric immunity, Sancaonda's lower special bulk can leave it to be overwhelmed by coverage and additional STAB attacks from Jolteon, Magneton, and Rotom. Sandaconda also faces competition from Regirock, another Stealth Rock setter that much more reliably takes on physical attackers like Snorlax, Glastrier, and Sneasel.</p>",
    "comments": "<h3>Other Options</h3> <p>Sandaconda has access to Body Press, which does hit Orthworm and Snorlax harder, but Rock Blast and Scale Shot provide better general coverage against most Pokemon immune to Ground. High Horsepower can be run instead of Earthquake if Thwackey is a teammate.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Most Grass-types take little damage from Earthquake and threaten Sandaconda out with their STAB moves. Dipplin, Appletun, and Lurantis can wall Sandaconda in longer games. Defog Hisuian Decidueye and Toedscruel can remove Sandaconda's Stealth Rock and Rocky Helmet. Whimsicott and Calm Mind Virizion can easily take advantage of Sandaconda, though they don't appreciate Glare hurting their great Speed stats. Shaymin shrugs off paralysis from Glare thanks to Natural Cure. Tera Dragon and Scale Shot can give Coil Sandaconda some recourse against some Grass-types but can make its position against Pokemon like Dipplin, Whimsicott, and Dazzling Gleam Shaymin worse.</p> <p><strong>Pokemon Immune to Ground</strong>: Ground-immune walls like Articuno and Cramorant can walk on Sandaconda, while Orthworm can use it as fodder for setting up Coil or entry hazards. Mesprit and Mismagius can use Sandaconda to set up, block its Glare with Substitute, and use Tera Fairy to completely wall sets with Scale Shot. The Oricorio formes can set up on Sandaconda and use Taunt to deny Glare. However, Ground-immune Pokemon weak to Rock, such as Charizard and the Oricorio formes, must be wary of Rock Blast or Stone Edge. Only Vikavolt and Rotom are immune to Glare.</p> <p><strong>Special Attackers</strong>: Sandaconda's lower special bulk leaves it easily overwhelmed by Typhlosion, Jolteon, and Magneton, though all of them are OHKOed by Earthquake and must be wary of Sandaconda catching them with a defensive Terastallization. Calm Mind Dudunsparce is bulky enough to set up in front of Sandaconda.</p> <p><strong>Water-types</strong>: Cramorant threatens Sandaconda with Surf, is immune to Earthquake, and can remove Sandaconda's Stealth Rock with Defog, but Sandaconda can punish it switching in with a Rock Blast or Glare. Clawitzer, Floatzel, Veluza hit Sandaconda for strong super effective damage and generally tolerate an Earthquake. Qwilfish is capable of finishing off Sandaconda but is vulnerable to Earthquake.</p> <p><strong>Ice-types</strong>: Sneasel is powerful enough to overwhelm Sandaconda with a boost or some chip damage and can pick off Sandaconda's offensive Scale Shot set with Ice Shard even if Sandaconda has a boost, though it takes a lot of Rocky Helmet chip damage from Sandaconda when it uses Triple Axel. Glastrier is bulky enough to take two five-hit Rock Blasts from Sandaconda and threatens it with a strong Icicle Crash. While Frosmoth hits Sandaconda on its weaker special side, it is physically frail and very threatened by Rock Blast.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Sandaconda is a great wall thanks to its natural bulk, Shed Skin, and Ground typing. Common physical attackers like Grafaiai, Toxicroak, and Regirock struggle to break through Sandaconda, and its great defensive profile enables it to consistently set up Stealth Rock. Rock Blast lets Sandaconda strike foes such as Articuno, Charizard, and Mismagius that it cannot touch with Earthquake. Alternatively, Glare lets Sandaconda spread paralysis and punish Pokemon like Hisuian Decidueye, Orthworm, and Virizion that it would deal little damage to anyway. Rest and Shed Skin can keep Sandaconda healthy, especially as it takes on Poison Touch Grafaiai sets and Hisuian Qwilfish, although the inconsistency of Shed Skin can leave it out to dry. Rocky Helmet helps Sandaconda further wear down physical attackers like Snorlax, Regirock, and Dudunsparce trying to break through it, and it enables Sandaconda to punish U-turn from pivots like Hisuian Decidueye, Grafaiai, and Passimian. Tera Poison makes Sandaconda a more reliable wall to physical attackers like Passimian, Sneasel, and Hitmonlee. Tera Ghost makes Sandaconda an even more sturdy wall to physical setup sweepers like Snorlax, Dudunsparce, and Regirock, improves its matchups against other physical attackers like Passimian and Toxicroak, and lets it spinblock Sandslash and Hisuian Avalugg. Tera Water helps Sandaconda handle Floatzel, Sneasel, and Glastrier.</p> <p>Sandaconda is a good physical wall for balanced teams looking to compress entry hazard setting on a teammate that isn't bothered as much by residual damage and status compared to Regirock, Orthworm, and Sandslash. Bulkier offensive teams also benefit from the utility and bulk Sandaconda offers in Glare and absorbing status from Weezing, specially defensive Dudunsparce, and Hisuian Qwilfish for offensive teammates. Hisuian Qwilfish makes an excellent hazard-stacking core with Sandaconda, and they complement each other's defensive flaws; Hisuian Qwilfish defensively answers Grass-types like Hisuian Decidueye, Virizion, and Whimsicott and Levitate Pokemon like Mesprit and Mismagius, while Sandaconda deals with Toxicroak, Sandslash, and Muk. Sandaconda's Water weakness makes teammates like Lanturn, Whimsicott, and Dipplin helpful for managing Cramorant, Clawitzer, and Floatzel. Sandaconda is not offensively threatening to walls like Cramorant and Articuno, so teammates like Magneton and Charizard can compensate for Sandaconda's poor matchup against them and have an easier time against said targets if Sandaconda has paralyzed them with Glare. Sandaconda invites in hazard setters like Palossand and Orthworm due to its passivity, so teamamates that can remove hazards like Hisuian Decidueye and Cramorant make good partners for Sandaconda.</p>"
      },
      "Coil": {
        "description": "<p>Sandaconda serves as a deadly late-game threat with the powerful combination of Coil, Rest, and Shed Skin. Earthquake hits most of the tier for at least neutral damage, while Sandaconda's other attacking move hits Pokemon that are immune to Earthquake like Bombirdier, Oricorio formes, and Braviary. Scale Shot allows Sandaconda to boost its Speed, outspeeding the entire unboosted metagame except for Hisuian Electrode at +1 and outpacing common Choice Scarf users like Typhlosion at +2. Alternatively, Stone Edge doesn't drop Sandaconda's Defense and has more immediate potential to threaten Flying-types like Oricorio formes, Bombirdier, and Charizard. Rest acts as excellent recovery to keep Sandaconda healthy and combines well with Shed Skin to make it more reliable and help it serve as a wall in early- and mid-game scenarios, especially when combined with Tera Dragon to flip matchups on common Water- and Grass-types like Swords Dance Qwilfish and Hisuian Decidueye. Coil Sandaconda can opt to run less Speed in exchange for more bulk, with 224 Speed EVs and a neutral nature being enough to outpace base 110 Speed Pokemon at +1 and still outpace Choice Scarf Bruxish at +2; however, running these Speed EVs means it no longer outspeeds common Chlorophyll sweepers like Victreebel and faster Choice Scarf users like Mismagius and Floatzel at +2. Sandaconda can also opt to run Attack investment instead of HP, but this makes it more difficult to wall the foes it's tasked with setting up on late-game.</p> <p>Levitate users such as Mesprit and Mismagius serve as potentially problematic Pokemon, since they are immune to Earthquake and can become fully immune to Sandaconda's moves, if it's running Scale Shot, with Tera Fairy, so specially bulky teammates like Hisuian Qwilfish and Snorlax as well as faster teammates like Hisuian Electrode can be extremely helpful to counteract them. Orthworm poses similar issues due to Earth Eater and Iron Defense, so wallbreakers that threaten it like Charizard and Typhlosion are invaluable as teammates. These two as well as Bombirdier and Glastrier also threaten Grass-types, which cause problems for Sandaconda pre-Terastallization. Water-types pose similar issues while also often carrying super effective coverage for Terastallized Sandaconda, so teammates like Snorlax, Poliwrath, and Virizion benefit it greatly. In return for all of these potential partners' help, Sandaconda turns many physical attackers into setup fodder. Some common examples of Pokemon completely walled by it late-game include Passimian, Hisuian Qwilfish, and Rhydon; after Terastallization, this list expands to include other offensive threats like Bruxish, Qwilfish, and Hisuian Decidueye.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 598623, "username": "BaitWiz"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 435539, "username": "BloodAce"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Cramorant": {
    "overview": "<p>Cramorant is one of the best users of Defog in ZU due to its access reliable recovery and solid defensive typing. This gives Cramorant a decent defensive profile, and its STAB moves apply pressure to much of the offensive metagame. It notably checks several prominent metagame threats, including Charizard, Hisuian Decidueye, and Typhlosion, and it matches up well against common Stealth Rock setters like Sandaconda, Palossand, and Orthworm. Cramorant also has a unique ability in Gulp Missile, which gives it a unique way to punish attackers. Cramorant's main shortcomings stem from its abysmal physical bulk, as it is generally incapable of switching into any powerful physical attackers. This also leaves it as an unsuitable answer to most of the tier's Fighting-types despite its favorable type matchup. Cramorant's 4x weakness to Electric is also inconvenient, as it is easily forced out by foes such as Jolteon, Magneton, and Lanturn.</p>",
    "comments": "<h3>Other Options</h3> <p>Brave Bird is an option for more consistent Flying-type STAB move that also takes advantage of Gulp Missile's Defense drops, but Cramorant doesn't appreciate the recoil damage, and many offensive threats are threatened more appreciably by Hurricane. A set with Endure over Roost and Custap Berry turns Cramorant into an effective anti-lead that can force significant damage on leads such as Lycanroc and Hisuian Avalugg while also keeping their entry hazards off. This set is much worse against teams without these specific threats, however, so it is niche overall. 140 Speed EVs let Cramorant outspeed Jolly Hisuian Decidueye, while 16 Defense EVs let it avoid a 2HKO from Scarf Passimian's Close Combat and Scarf Floatzel's Wave Crash. Cramorant really needs as much special bulk investment as possible to reliably check Charizard and Typhlosion, however.</p> <h3>Checks and Counters</h3> <p><strong>Electric-types</strong>: Cramorant is forced out by every Electric-type in the tier. Magneton, Jolteon, Rotom, and Lanturn all force out Cramorant; The former three are capable of easily OHKOing it with STAB moves, and Magneton can even do so with Volt Switch, while the latter two have favorable rolls to do so. Lanturn does not OHKO Cramorant with Volt Switch, but Cramorant cannot hurt it at all with its standard movesets.</p> <p><strong>Strong Physical Attackers</strong>: Cramorant's bad physical bulk leaves it very vulnerable to strong physical attackers such as Qwilfish, Glastrier, Snorlax, and Sneasel, though they don't appreciate Gulp Missile's chip damage.</p> <p><strong>Rock-types and Rock-type coverage</strong>: Many of the tier's Rock-types threaten Cramorant, as they are either faster than it or take Surf comfortably. Lycanroc is faster than it and easily OHKOes Cramorant, while Naclstack and Regirock avoid a 2HKO from Surf and either threaten it or set up Stealth Rock. Foes such as Sandaconda and Passimian can also fit Rock-type coverage into their movesets, threatening to turn the tables on Cramorant.</p> <p><strong>Special Walls</strong>: Special walls such as Porygon2, Articuno, and Dudunsparce take Cramorant's attacks with ease; Porygon2 threatens it with status, while Articuno easily 2HKOes it with Freeze Dry. Dudunsparce is an especially problematic matchup, as Stealth Rock sets keep entry hazards up versus Cramorant consistently, while Coil and Calm Mind sets use it as setup fodder.</p> <p><strong>Toxic</strong>: Cramorant's longevity is ruined when it is badly poisoned. Common Pokemon such as Muk, Dudunsparce, and both Qwilfish formes are able to poison it. All but Muk are notable for their ability to set up entry hazards, preventing Cramorant from confidently removing hazards versus them.</p> <p><strong>Knock Off</strong>: Knock Off from the likes of Passimian, Grafaiai, Muk, and Gurdurr removes Cramorant's Heavy-Duty Boots, making it much worse at consistently entering battle to remove hazards and greatly reducing its ability to switch into Charizard and Typhlosion.</p>",
    "sets": {
      "Defog": {
        "description": "<p>Cramorant is a fantastic user of Defog, as it finds many opportunities to switch in battle thanks to its nice defensive profile and perform its role. Surf allows Cramorant to activate Gulp Missile while also giving it a reliable and accurate STAB move that pressures common entry hazard setters like Sandaconda and Rhydon. Hurricane OHKOes Hisuian Decidueye, KOes Passimian after Spikes damage, and 2HKOes Floatzel while generally applying good pressure to most non-Flying-resistant offensive threats. Roost allows Cramorant to stay healthy throughout a match and reliably check what it is usually tasked with. 96 Speed EVs allow Cramorant to outspeed Adamant Sandslash and maximum Speed Dudunsparce. The rest of the EVs are dumped into Special Defense to handle foes such as Charizard and Typhlosion better. Tera Ground allows Cramorant to turn its Electric weakness into an immunity in an emergency, allowing it to check and block Volt Switch from Jolteon and Magneton. It also turns its Rock weakness into a resistance, which allows it to take on foes such as Lycanroc and Regirock in a pinch. Alternatively, Tera Fairy can be used to give Cramorant a highly useful defensive typing that allows it to turn the tables on attackers such as Clawitzer and Alolan Exeggutor while still removing its problematic Electric weakness. Finally, Tera Dragon allows Cramorant to turn its Electric weakness into a resistance while retaining its resistances to Water- and Fire-type attacks.</p> <p>Cramorant fits well on many bulky offense and balance teams thanks to its ability to Defog, check relevant metagame threats, and force chip damage on foes with Gulp Missile. Entry hazard removal is paramount to the success of all sorts of teammates; fast pivots like Floatzel and Passimian, bulky teammates such as Dipplin and Porygon2, and strong wallbreakers like Typhlosion and Alolan Exeggutor all appreciate Cramorant clearing hazards for them so they can come into battle safely. Cramorant's physical bulk is very poor, and it should not be relied on as a switch-in to most of the tier's physical attackers. It therefore pairs well with physical walls such as Regirock, Palossand, Dipplin, and Weezing. The latter two work well in particular, as they can absorb Knock Off for Cramorant. Cramorant also requires a switch-in to the tier's Electric-types, as it is forced out by them and becomes an opportunity for them to gain momentum against it with Volt Switch. Ground-types such as Sandaconda, Sandslash, and Rhydon can block Volt Switch and help out versus Jolteon and Rotom. They don't prevent Magneton or Lanturn from pivoting, but additional specially defensive teammates such as Snorlax and Dudunsparce can help out with them. Gulp Missile is adept at chipping foes and potentially spreading paralysis. Strong wallbreakers such as Brute Bonnet, Magneton, Typhlosion, and Hisuian Decidueye appreciate the chip damage and the paralysis-spreading; physical attackers such as Brute Bonnet and Hisuian Decidueye also appreciate the Defense drop allowing them to pick off faster threats with priority, should they come in to attempt a revenge kill. Cramorant struggles to meaningfully pressure special walls such as Dudunsparce, Snorlax, and Porygon2, so teammates that can deal with them, such as Regirock, Orthworm, and Palossand, are good choices.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Hattrem": {"sets": {"Hazard Detterent": {}}},
  "Perrserker": {"sets": {"Hazard Setter": {}}},
  "Frosmoth": {"sets": {"Quiver Dance": {}}},
  "Indeedee-F": {"sets": {"Choiced": {}}},
  "Morpeko": {"outdated": true, "sets": {"Offensive Utility": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Glastrier": {
    "overview": "<p>Glastrier's defining role is that of a bulky physical wallbreaker. It has outstanding bulk for ZU; furthermore, its stellar base 145 Attack, Icicle Crash, and all the coverage it needs including Close Combat and High Horsepower make it extremely difficult to switch into. Lastly, Glastrier can boost its Attack even further with Swords Dance, allowing it to potentially OHKO or 2HKO almost the entire metagame. Defensive staples like Palossand, Snorlax, and Appletun are often forced to Terastallize or switch out versus it. This means that Glastrier's most reliable defensive counterplay is somewhat specific, being limited to almost exclusively both forms of Qwilfish, Regirock, and Orthworm, none of which have reliable recovery, and the latter two of which often require Terastallization to fully check Glastrier.</p>",
    "comments": "<h3>Other Options</h3> <p>Glastrier can opt to run Heavy Slam alongside Tera Steel over High Horsepower to hit light foes like Mesprit and Steel-weak foes like Tera Fairy Dipplin and Dudunsparce. However, trading out High Horsepower for Heavy Slam tends to be overkill, as Glastrier's standard three-move coverage sufficiently hits all relevant foes; furthermore, giving up High Horsepower makes it struggle more against foes like Hisuian Qwilfish. Glastrier can also consider running Substitute to ease prediction, but all of its coverage moves are near mandatory, and without Swords Dance, Glastrier can struggle to threaten the walls it needs to.</p> <h3>Checks and Counters</h3> <p><strong>Faster Attackers</strong>: Glastrier's awful Speed means it can often be a target for offensive threats like Typhlosion, Charizard, Passimian, and Hisuian Decidueye, though it often has to be chipped in order to not take them down with it.</p> <p><strong>Qwilfish</strong>: Both forms of Qwilfish can be quite problematic for Glastrier; regular Qwilfish resists every move except High Horsepower, which it takes relatively little damage from after Intimidate, while Hisuian Qwilfish sports better overall bulk due to its Eviolite. Furthermore, both can use Glastrier's massive HP stat against it with Pain Split, allowing them to trade positively with it and poison it with Barb Barrage or Toxic.</p> <p><strong>Bulky Threats</strong>: Iron Press users like Orthworm and Regirock can match Glastrier's setup and threaten it out, though they may at times require Terastallization to do so. Poliwrath and Snorlax can do the same with Bulk Up and Curse, respectively, though Snorlax must Terastallize first. Weezing is able to neuter Glastrier with Will-O-Wisp and can switch in fairly safely, only fearing boosted Icicle Crash.</p> <p><strong>Status</strong>: Glastrier gets worn down rapidly by poison from Pokemon like Qwilfish and Muk as well as burn from Pokemon like Weezing and Mismagius; burn also neuters its damage.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Swords Dance Glastrier acts as a fearsome wallbreaker, leveraging its outstanding bulk and the threat of its attacks to create setup opportunities for itself. Close Combat takes on bulky Pokemon that resist Icicle Crash like Orthworm and Thick Fat Snorlax. High Horsepower is near mandatory to hit Qwilfish and serves as effective coverage for Fire-types. Tera Ground gives Glastrier a resistance to Rock while boosting the power of High Horsepower, while Tera Water and Fairy flip Glastrier's weaknesses to common offensive types like Fire and Fighting. 252 Speed EVs allows it to outspeed slower walls like Dudunsparce and Porygon2, while the bulk investment lets it take on powerful attacks from various threats in the tier.</p> <p>Glastrier greatly appreciates teammates that can help bring it in safely like Jolteon, Qwilfish, and Mesprit, since it often has to take a hit after switching in due to its poor Speed. Glastrier also works well alongside other wallbreakers like Choice Specs Jolteon, Hisuian Decidueye, and Charizard, as they are able to break down checks like Snorlax, Regirock, and Qwilfish for each other. Due to its many weaknesses as an Ice-type, Glastrier loves teammates it can fall back on to support it; some of these teammates include Snorlax, Palossand, Regirock, and Qwilfish. As a wallbreaker, Glastrier does exceedingly well alongside Pokemon like Grafaiai, Oricorio formes, and Typhlosion that can often take advantage of the holes that Glastrier makes in defensive cores through removal of foes like Snorlax, Dudunsparce, and Porygon2.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 598623, "username": "BaitWiz"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Dachsbun": {"sets": {"Cleric": {}}},
  "Arboliva": {"outdated": true, "sets": {"Choice Specs": {}, "Bulky Attacker": {}, "Physically Defensive": {}}},
  "Naclstack": {"outdated": true, "sets": {"Stealth Rock": {}, "IronPress": {}}},
  "Mabosstiff": {"sets": {"Choiced": {}}},
  "Grafaiai": {
    "overview": "<p>Grafaiai's excellent choice of abilities paired with its high Speed and strong offensive movepool lets it play several offensive roles in SV ZU. Pivot sets are Grafaiai's showpiece given its excellent Speed tier and options to keep up momentum; they are extremely disruptive thanks to Knock Off and the choice between Poison Touch to spread status and Prankster's synergy with Encore. Grafaiai can also put its excellent Speed to work as a Swords Dance sweeper, and it can be further enabled by Prankster, Encore, and Copycat. Grafaiai even has a viable Choice Scarf set, and it's effectively one of the fastest Choice Scarf users in the metagame. However, Grafaiai is altogether frail and possesses a bad defensive typing, leaving pivot and Swords Dance sets easily revenge killed or threatened out by faster offensive Pokemon like Jolteon and Choice Scarf Passimian, while its Choice Scarf set can be stonewalled by defensive Pokemon like Regirock and Orthworm without good prediction.</p>",
    "comments": "<h3>Other Options</h3> <p>Grafaiai can be a niche Prankster weather setter for sun teams that further provides safe entry and setup opportunities for its teammates with U-turn, Parting Shot, and Encore. Grafaiai has Taunt in its toolkit but struggles to use it effectively given its underwhelming bulk and the comparatively greater potential of Encore. Choice Band sets can work given Grafaiai's excellent Speed and powerful STAB moves, but they lack the outstanding Speed of Choice Scarf sets to avoid being revenge killed by Choice Scarf users and faster revenge killers. Toxic can be used on pivot sets with Prankster for more reliable status spreading than Poison Touch, but Grafaiai's frailty makes spending a turn to poison a foe risky.</p> <h3>Checks and Counters</h3> <p><strong>Physical Walls</strong>: Even Swords Dance Grafaiai struggles to break through Sandaconda and Weezing on its own without prior chip damage, and pivot sets struggle to do more than remove their items or use Encore on them. Palossand dislikes losing its item to Knock Off or being poisoned, but it has the bulk and longevity to withstand attacks from Grafaiai. However, Palossand should be wary both of Encore and Swords Dance Grafaiai's Knock Off. Regirock can fend off pivot Grafaiai short-term thanks to its bulk but can be worn down by a combination of Knock Off, poison, and chip damage, and it risks being OHKoed by Swords Dance Grafaiai's Low Kick. Despite a Poison immunity, Orthworm is a similar story to Regirock, though it can survive Swords Dance Grafaiai's boosted Low Kick if Terastallization isn't in the picture.</p> <p><strong>Dark-types</strong>: Spiritomb's trio of immunities to Double-Edge, Low Kick, and Prankster moves on top of its 4x resistance to Gunk Shot makes it an excellent wall to Swords Dance Grafaiai, but its dependence on Leftovers for recovery can lead it to being worn down by offensive pivot sets using Knock Off and U-turn, especially when Poison Touch is in the picture. Grafaiai can overwhelm Hisuian Qwilfish between Knock Off, U-turn, and its lack of recovery. Sneasel can \"trap\" Grafaiai by blocking its escape with Prankster Parting Shot and threatening it with its strong STAB moves, and its Ice Shard is still faster than Prankster Copycat.</p> <p><strong>Faster Revenge Killers</strong>: Jolteon, Floatzel, and Lycanroc naturally outspeed Grafaiai and threaten it with their powerful STAB attacks, though they should be wary of Grafaiai's Prankster moves, Copycat in particular. Common Choice Scarf users such as Mesprit, Passimian, and Magneton similarly threaten to revenge kill Grafaiai and can gain momentum with their pivot moves, though Choice Scarf Grafaiai is faster than all of these and the aforementioned revenge killers. Choice Band Floatzel outspeeds Grafaiai's Swords Dance set and has Aqua Jet to finish it off even if Grafaiai has Prankster + Copycat.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Grafaiai distinguishes itself as a phenomenal offensive pivot and revenge killer by virtue of its decent Attack, powerful STAB options, and incredible Speed tier, outpacing the entire unboosted metagame and even many other Choice Scarf users such as Typhlosion and Passimian. Furthermore, Poison Touch gives Grafaiai the rare ability to punish otherwise safe switch-ins, such as Regirock, Palossand, and Hisuian Avalugg, with a chance to get poisoned as it pivots out with U-turn. Gunk Shot is essential to dispatch threats such as Whimsicott and Virizion. Knock Off provides Grafaiai with the coverage to hit foes that resist its STAB moves such as Mismagius, Froslass, and Oricorio-G. Additionally, it punishes bulky foes reliant on their items, such as Orthworm and Hisuian Qwilfish that cannot be afflicted by Poison Touch, as well as removing Rocky Helmet from the likes of Palossand, Sandaconda, and Qwilfish to ease its pivoting later. Double-Edge grants Grafaiai an accurate STAB option and enables it to muscle past Poison-resistant Pokemon such as Muk and Hisuian Qwilfish, though it comes at the cost of recoil damage. Double-Edge also eliminates the need for predicting Terastallization from potential Tera Ground users like Oricorio-F and Frosmoth compared to Gunk Shot. Switcheroo can be used instead to restrict defensive checks such as Orthworm and Palossand, as well as Choice-locking setup sweepers such as Dudunsparce, Oricorio formes, and Mesprit, though it requires subsequent use of Knock Off to be more measured to avoid unintentionally freeing them. Tera Dark allows Grafaiai to better revenge kill the likes of Oricorio-G and resist moves such as Sucker Punch from threats such as Brute Bonnet and Hisuian Decidueye. Furthermore, gaining an immunity to Psychic-type moves can allow Grafaiai to turn the tables against the likes of Mespirit and Farigiraf in a pinch. Alternatively, Tera Normal can be used in conjunction with Double-Edge to let Grafaiai secure reliable OHKOs, dispatching threats like Jolteon, Frosmoth, and, after Stealth Rock damage, Typhlosion.</p> <p>Grafaiai fits well on offense and balance teams that can benefit from its ability to generate momentum and take on top offensive threats. Offensive setup sweepers such as Virizion, Mesprit, and Oricorio formes appreciate Grafaiai's ability to revenge kill opposing setup sweepers for them such as Frosmoth. Grafaiai can form offensive pivot cores with the likes of Floatzel, Jolteon, Hisuian Decidueye, and Magneton, maintaining momentum and whittling down each other's checks. Grafaiai lures in Regirock and bulky Ground-type Pokemon like Sandaconda that are forced out by Floatzel and Hisuian Decidueye, while Grafaiai can return the favor by dealing with the likes of Whimsicott. Hisuian Decidueye is especially notable for its ability to bring Grafaiai in safely via slow pivoting support. Physical wallbreakers such as Swords Dance Hisuian Decidueye, Glastrier, and Brute Bonnet can open up holes in opposing teams by eliminating bulky Pokemon like Dudunsparce, Snorlax, and Sandaconda so Grafaiai can clean late-game. Powerful special attacking wallbreakers such as Alolan Exeggutor, Jolteon, and Clawitzer can take advantage of the physically defensive walls Grafaiai lures in such as Regirock, Orthworm, Hisuian Avalugg, and Weezing, assisting Grafaiai in getting past them. Fire-types such as Charizard and Typhlosion can take on Orthworm for Grafaiai while also benefiting from Grafaiai chipping down a shared check in Regirock. Entry hazard setters such as Mesprit and Orthworm synergize well with the residual damage inflicted from Grafaiai's Poison Touch, frequent pivoting, and Knock Off support, putting additional pressure on its aforementioned defensive checks, as well as bringing offensive threats like Typhlosion into range for Grafaiai to pick them off. Mesprit can also help against Poison- and Ground-types like Weezing, Qwilfish, and Sandslash. Bulky setup sweepers such as Dipplin, Snorlax, Regirock, and Dudunsparce benefit from poison spread by Grafaiai's Poison Touch, allowing them to more easily outlastfoes thanks to poison chip damage. Hazard removal support from the likes of Hisuian Decidueye, Cramorant, and Sandslash can help alleviate Grafaiai's weakness to chip damage that arises from its repeated pivoting.</p>"
      },
      "Swords Dance": {
        "description": "<p>Grafaiai is a threatening Swords Dance sweeper thanks to its high Speed and powerful STAB Double-Edge. Knock Off covers Ghost-types like Palossand, Rotom, and Oricorio-G that would otherwise wall Grafaiai, and it can soften up defensive Pokemon like Regirock and Orthworm to make them more easily picked off once they've been further chipped. Copycat's extra priority from Prankster lets Grafaiai overcome faster revenge killers like Jolteon, Sneasel formes, Floatzel, and Lycanroc as well as Choice Scarf users such as Mesprit and Passimian, though its efficacy can fluctuate depending on the move that was used last. Low Kick is an alternative for a direct attack to knock down Rock- and Steel-types like the aforementioned Regirock and Orthworm as well as Hisuian Avalugg and Magneton, overall enhancing Grafaiai's wallbreaking ability. Prankster is integral for sets running Copycat, but Grafaiai without it should use Posion Touch, which can help it make more progress against Regirock and other Pokemon early-game. Grafaiai can opt for an Adamant nature to increase its power for more reliable KOs against physically defensive Pokmeon such as Orthworm and Regirock with its coverage moves, relying more on Prankster Encore to sweep teams at the cost of moving after threats like Charizard, Typhlosion, and Mismagius. Tera Normal cranks up the power of Grafaiai's STAB move to blow through physical walls like Weezing and Sandaconda without needing much chip damage. Tera Fighting is an alternative Tera type that can be used to power up Low Kick in order to secure more KOs on troublesome foes like Regirock, Orthworm, and Magneton. Heavy-Duty Boots ensures Grafaiai won't be worn down if it comes out earlier in games to play as a revenge killer and soften up its checks with Knock Off. A Silk Scarf can further power up Tera Normal Grafaiai's Double-Edge to pull off feats like OHKOing Sandaconda and Weezing when at +2.</p> <p>Grafaiai fits on several types of teams thanks to its threatening offensive profile and great Speed, enabling it to be a revenge killer or cleaner alongside its role as a Swords Dance sweeper. Grafaiai especially benefits from pivot support from teammates such as Hisuian Decidueye, Jolteon, and Mesprit to bring it in safely and widen setup opportunities for it. Grafaiai appreciates entry hazards from setters like Lycanroc, Regirock, and Palossand wearing down foes like Regirock, Dipplin, and Snorlax so it can more effectively sweep. Spikes setters like Froslass, Qwilfish formes, and Orthworm are especially effective at softening up foes like Sandaconda, Palossand, and Magneton for Grafaiai. Grafaiai can maximize the utility of its hazard-setting partners by using Knock Off to remove Leftovers from Regirock as well as Heavy-Duty Boots from Pokemon like Palossand, Sandslash, and Hisuian Avalugg. Charizard, Passimian, and Typhlosion pressure Steel-types like Orthworm and Magneton that stand in Grafaiai's way and can soften up teams with their wallbreaking capabilities. Defensive teammates such as Poliwrath and Mesprit can help against revenge killers such as Floatzel, Lycanroc, and Sneasel, while Weezing and Palossand can help against others such as Passimian and Hisuian Sneasel.</p>"
      },
      "Offensive Pivot": {
        "description": "<p>Grafaiai uses Gunk Shot as its STAB move to most effectively threaten Grass-types like Whimsicott, Hisuian Decidueye, and Virizion. Knock Off lets Grafaiai make quick progress, especially with Poison Touch, and it effectively punishes defensive switch-ins such as Hisuian Qwilfish, Orthworm, and Regirock that depend on their items for their longevity. Knock Off also provides coverage against frail Ghost-types like Froslass, Oricorio-G, and Mismagius. Knock Off absorbers like Booster Energy Brute Bonnet and Dipplin are also threatened by STAB Gunk Shot and potential poisons from Poison Touch hindering them. U-turn has the best synergy with Poison Touch, breaks Focus Sash and Sturdy against entry hazard setters like Lycanroc and Hisuian Avalugg, and doesn't risk activating Passimian's Defiant unlike Parting Shot. Parting Shot allows Grafaiai to escape even faster Pokemon like Jolteon and Choice Scarf Mesprit in conjunction with Prankster, and its debuffs can enable Grafaiai's offensive and defensive teammates alike. Encore lets Grafaiai take advantage of passive Pokemon such as Palossand and Dipplin, and it can neutralize setup sweepers like Mesprit and Hisuian Decidueye. Prankster facilitates Encore even further, letting Grafaiai lock faster setup sweepers like Jolteon and Floatzel into their setup moves. Prankster Copycat can be used as an alternative to Encore to give Grafaiai a priority attack based on the last moved used and cut off would-be revenge killers like Choice Scarf Mesprit. Tera Dark affords Grafaiai a convenient defensive typing against Mesprit's Psychic-type STAB moves as well as Sucker Punch from Brute Bonnet and Hisuian Decidueye. Tera Dark also powers up Grafaiai's Knock Off to more effectively threaten Mesprit and previously mentioned Ghost-types. However, Grafaiai is often better off not Terastallizing given the limited benefits it gains from doing so, better preserving the resource for a teammate.</p> <p>Grafaiai is a great enabler to offensive teammates, especially physical wallbreakers like Hisuian Decidueye, Glastrier, and Virizion that can take advantage of defensive Pokemon it lures in such as Sandaconda and Palossand. Other Fighting-types like Passimian and Hitmonlee can also threaten Pokemon like Regirock, Orthworm, and Magneton for Grafaiai while benefitting from it softening up foes with Knock Off, poison status, and U-turn chip damage. Charizard and Typhlosion can threaten Orthworm and Magneton in particular for Grafaiai, and they're supported as wallbreakers by the safe entry points Grafaiai provides via U-turn and Parting Shot. Setup sweepers like Dudunsparce, Nasty Plot Mesprit, and Calm Mind Jolteon also benefit greatly from Grafaiai creating setup opportunities with Encore and Parting Shot, and they threaten physically defensive Pokemon Grafaiai struggles against. Grafaiai relies on partners like Mesprit and Magneton to deal with Poison-type walls like Qwilfish and Weezing. Bulky partners such as Lanturn and Porygon2 can help Grafaiai against Jolteon, a common revenge killer. Palossand and Sandaconda can intercept Choice Scarf Passimian from revenge killing Grafaiai, while Grafaiai helps them in return by threatening troublesome Grass-types like Whimsicott and Virizion. Floatzel is one more potential revenge killer to Grafaiai, and it can be handled by defensive teammates such as Hisuian Decidueye, Qwilfish, and Dipplin.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 435539, "username": "BloodAce"}, {"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 654091, "username": "FlamPoke"}, {"user_id": 452572, "username": "missangelic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 583607, "username": "PowerOfMemes"}]}]}
  },
  "Toedscruel": {"outdated": true, "sets": {"Offensive Rapid Spin": {}}},
  "Scovillain": {"sets": {"Choice Specs": {}}},
  "Rabsca": {"sets": {"Offensive Trick Room": {}}},
  "Orthworm": {
    "sets": {
      "Defensive": {
        "description": "<p>Orthworm is an excellent defensive Pokemon thanks to its great physical bulk, Steel typing, and complementary immunity to Ground from Earth Eater. Common Pokemon like Coil Dudunsparce, Snorlax, and Sandaconda struggle to break through Orthworm on their own, while other Pokemon like Grafaiai, Farigiraf, and Mesprit must either dedicate a coverage move for Orthworm or Terastallize. Orthworm's fantastic defensive profile gives it ample opportunities to switch in and set up entry hazards with Stealth Rock and Spikes for its teammates. Orthworm is also a resilient hazard setter against hazard removers like Sandslash and offensive Hisuian Avalugg. Heavy Slam has the best immediate power and coverage of Orthworm's attacks against foes like Grafaiai and Articuno, deals super effective damage to Froslass, and wrecks Whimsicott and Tera Fairy Pokemon such as Jolteon and Mesprit. Body Press is strong against Dudunsparce, Snorlax, and Glastrier, and it 2HKOes heavier foes and foes that resist Heavy Slam such as Magneton, Hisuian Avalugg, and Jolteon. The increased resilience and additional power to Body Press provided by Iron Defense enable Orthworm to beat physical attackers like Brute Bonnet, set up on setup sweepers such as Coil Dudunsparce and Snorlax, and overwhelm physically defensive Pokemon such as Hisuian Decidueye and Regirock lacking Iron Defense. Orthworm can lean into its hazard setting capabilities by running Stealth Rock and Spikes, taking advantage of Choice item attackers like Mesprit and Grafaiai and accepting its own lack of longevity as a defensive Pokemon. Protect helps Orthworm maximize recovery from Leftovers and scout Choice item attackers like Passimian, Magneton, and Typhlosion. Tera Ghost makes Orthworm more secure against Fighting-type physical attacks like Close Combat from Passimian, Glastrier, and Lycanroc, Body Press from Regirock and opposing Orthworm, and Low Kick from Grafaiai. Tera Ghost also enables Orthworm to block Rapid Spin from Sandslash and Hisuian Avalugg to preserve the entry hazards it sets. Tera Electric leaves Orthworm without weaknesses, so it can more efficiently set hazards and take on physical attackers. Orthworm's EVs are tailored to patch up its lower special bulk to enable it to take on special attackers like Mesprit, Farigiraf, and Whimsicott more comfortably while still giving it enough physical bulk to survive a +2 Low Kick from Grafaiai, Close Combat from Passimian, and 2 Low Kicks from Sneasel.</p> <p>Orthworm is a good fit for bulky offense teams looking for an entry hazard setter, and its limited longevity is a better fit for the playstyle compared to more passive hazard setters like Dudunsparce, Palossand, and Sandaconda. Offensive Pokemon such as Charizard, Jolteon, and Typhlosion adore checks to them like Snorlax and Regirock taking residual damage from Orthworm's entry hazards. Grafaiai, Mesprit, and Hisuian Decidueye commonly run Knock Off, which complements Orthworm's entry hazards by removing Heavy-Duty Boots from Pokemon such as Palossand, Dudunsparce, and Charizard and helping wear them down. Charizard can comfortably take Orthworm's attacks and threaten it out, so Orthworm appreciates support from partners like Snorlax, Floatzel, Lanturn, and Cramorant that can threaten Charizard and other Fire-types like Typhlosion. Hazard removers like Hisuian Decidueye and Cramorant are appreciated by Orthworm because residual damage from Spikes racks up quickly on it and limits its defensive capabilities. Rapid Spin users like Sandslash, Hitmonlee, and Cryogonal remove entry hazards without removing Orthworm's entry hazards. Fighting-types like Hisuian Decidueye, Virizion, and Passimian can overpower Orthworm with their super effective STAB moves, so checks to them such as Mesprit, Oricorio-G, and Weezing are appreciated. Orthworm is a great partner for Pokemon vulnerable to Ground-types such as Lycanroc, Qwilfish, and Jolteon locked into Electric-type moves.</p>"
      },
      "Coil": {}
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Veluza": {"sets": {"Fillet Away Sweeper": {}}},
  "Farigiraf": {
    "comments": "<h3>Other Options</h3> <p>Tera Fairy blunts the damage from Knock Off and other Dark-type moves from Sneasel, Brute Bonnet, and Passimian, and it also denies Dragon Tail from Dudunsparce, Dipplin, and Eelektross. Tera Fighting beats Steel-types, hits Snorlax and Dudunsparce harder and sooner than Stored Power can with limited boosts, and also flips Farigiraf's Dark and Bug weaknesses. A Weakness Policy on Stored Power sets can take advantage of weaker attacks like Knock Off and U-turn from Mesprit but is situational, tough to activate, and limits Farigiraf's longevity. Cud Chew, with a Sitrus Berry, can give Farigiraf more concentrated recovery than Leftovers, and, with a Lum Berry, it can help it more comfortably set up against Glare Sandaconda and Toxic Hisuian Qwilfish. Sap Sipper can provide Farigiraf with setup opportunities against Whimsicott and Shaymin locked into Grass-type moves. However, Armor Tail best enables Farigiraf as a sweeper by guarding it from priority moves. Farigiraf can run an offensive Trick Room set, though Alolan Exeggutor often does this role better because of its greater power and coverage. Farigiraf has other options in its movepool such as Future Sight, Wish, and Roar but struggles to support teams with its mediocre defensive typing.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: Hisuian Qwilfish, Brute Bonnet, and Malamar have enough special bulk to take a boosted hit from Farigiraf and retaliate with their Dark-type STAB moves, Sneasel outspeeds Farigiraf before an Agility and hits it hard with Knock Off, and Alolan Persian can Taunt Farigiraf before it can set up. Although Sableye and Spiritomb don't deal much damage to Farigiraf on their own, they can force it to exhaust Terastallization or totally counter it if it's no longer available.</p> <p><strong>Steel-types</strong>: Magneton, Orthworm, and Perrserker force Farigiraf to exhaust Tera in order to beat them if it lacks enough boosts for Stored Power, and Psyshock is particularly weak against their high Defense stats.</p> <p><strong>Bulky Pokemon</strong>: Snorlax, Dudunsparce, and Regirock can stomach Farigiraf's hits unless it's accumulated multiple boosts for Stored Power. Snorlax and Dudunsparce take significant damage from a boosted Psyshock, though. Dipplin, Dudunsparce, and Appletun can phaze Farigiraf with Dragon Tail; similarly, Articuno can use Haze to clear away Farigiraf's boosts or Roar to phaze it, and it has the bulk and recovery to repel Farigiraf repeatedly.</p> <p><strong>Taunt</strong>: With Taunt, Oricorio-G, Oricorio-F, and Mismagius can prevent Farigiraf from setting up, which is especially disruptive if Farigiraf lacks boosts and has Stored Power, and they can set up on it in return.</p>",
    "sets": {
      "Double Dance": {
        "description": "<p>Farigiraf can reach great heights as a setup sweeper thanks to its great bulk and solid Special Attack. Psyshock hits specially bulky Pokemon such as Snorlax and Articuno and ignores Special Defense boosts on sweepers like Frosmoth, Dudunsparce, and Jolteon. As Farigiraf accumulates multiple boosts, though, Stored Power helps it become a taller order for teams to check, and it hits physically bulkier Pokemon like Regirock and Sandaconda harder. However, Stored Power provides less immediate damage for breaking teams and is more inflexible by requiring Farigiraf to spend multiple turns boosting. Farigiraf can effectively use Tera Blast as a STAB move to beat Dark-types like Brute Bonnet, Hisuian Qwilfish, and Sneasel. After Terastallizing, it transforms into Tera Blast Fire, which lets it beat Orthworm, Frosmoth, Magneton, Spiritomb, and Tera Steel Pokemon like Hisuian Decidueye and Weezing. Armor Tail aids Farigiraf's sweep by denying priority attacks like Sucker Punch from Hisuian Decidueye, Aqua Jet from Floatzel, and Ice Shard from Sneasel. Armor Tail also saves Farigiraf from being locked into its setup by Prankster Encore from Grafaiai, Whimsicott, and Sableye. Farigiraf can invest fully in its Special Attack to become immediately more threatening, potentially sweeping just off of Agility, but full investment in HP gives it better opportunities to use multiple setup moves; Psyshock is better tailored for sets with maximum Special Attack investment, compared to Stored Power, which works better on maximum HP sets where it can more comfortably accumulate multiple boosts.</p> <p>Farigiraf fits on hyper offensive teams as a setup sweeper. Fellow setup sweepers such as Virizion, Braviary, and Qwilfish greatly appreciate partnering with Farigiraf, given its positive matchups against Prankster disruptors like Grafaiai, Whimsicott, and Sableye. Powerful offensive partners like Glastrier, Hisuian Decidueye, and Typhlosion can break holes in teams for Farigiraf to more easily sweep. Farigiraf has to exhaust Terastallization in order to beat Spiritomb, so it appreciates partners that can deal with it, such as Whimsicott and Hisuian Decidueye. Hyper offense leads like Froslass, Lycanroc, and Hisuian Avalugg can set up entry hazards to help weaken foes like Regirock, Dipplin, and Hisuian Qwilfish to better enable Farigiraf to sweep. Orthworm is a tough target for Fargiraf to break on its own, so it appreciates help from Fire-type teammates like Charizard, Typhlosion, and Oricorio-F that can pressure it. Fighting-type partners like Passimian, Virizion, and Hisuian Decidueye can handle Orthworm as well as another hard stop to Farigiraf in specially defensive Dudunsparce. Offensive partners like Magneton, Sandslash, and Rhydon can pressure Hisuian Qwilfish for Farigiraf. Hisuian Sneasel is a standout partner for Farigiraf by checking all three aforementioned stops to it, Orthworm, specially defensive Dudunsparce, and Hisuian Qwilfish, while Fargiraf pressures its defensive answers such as Weezing and Qwilfish.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 654091, "username": "FlamPoke"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Dudunsparce": {
    "overview": "<p>Dudunsparce stands out as one of the best Pokemon in the metagame. With a large movepool, good stat spread, and useful abilities, Dudunsparce is an unpredictable and flexible Pokemon that can take on a variety of offensive and defensive roles. Dudunsparce's setup sets are amongst the most theatening late-game wincons in the metagame thanks to its great bulk, fantastic attacking options, and access to reliable recovery. The fact that both physically and specially based sets are viable and dangerous adds yet another layer of peril to these sets. It can also serve as a reliable special wall that is capable of spreading status and setting up Stealth Rock. Dudunsparce's main shortcomings stem from its low Speed, which leaves it outpaced by virtually the entire offensive metagame. Its typing also offers no resistances, and it is weak to common Fighting-type attacks from the likes of Hisuian Decidueye, Passimian, and Hitmonlee.</p>",
    "comments": "<h3>Other Options</h3> <p>Dudunsparce's vast movepool leaves it with plenty of additional options. Glare is by far the best move not mentioned above; it allows Dudunsparce to spread paralysis without having to rely on Body Slam and it can paralyze Ghost-types such as Palossand, Rotom, and Mismagius. This also opens up the opportunity for the Coil set to run Glare and either Headbutt or Bite over Body Slam and Dragon Tail. While the well-known paraflinch strategy is extremely irritating to play against and can let Dudunsparce potentially break through even sturdy Normal-resistant Pokemon like Orthworm and Regirock, it is ultimately a luck-based and inconsistent strategy. This set also can't directly damage Ghost-types unless it opts for Bite, which is much weaker than Headbutt. Glare could also be considered on the specially defensive set, but Dudunsparce generally prefers Body Slam so that it can fit every move that the set wants. Body Press is an additional option on Coil sets that can heavily damage Normal-resistant Pokemon such as Orthworm, Regirock, and Rhydon, but this also makes Dudunsparce walled by Ghost-types and has significantly less overall utility than Dragon Tail or Poison Jab. Earthquake allows Dudunsparce to hit Regirock, Rhydon, and Naclstack, but it is walled by Orthworm and many of the tier's Ghost-types. The Calm Mind set could consider Flamethrower to more immediately threaten Orthworm and Magneton or Ice Beam to threaten Dipplin, but between Shadow Ball and Tera Ghost, it can usually beat these threats anyway, and the coverage is much worse. Ice Beam can be run with Serence Grace to fish for a freeze, but this is an unreliable strategy at best. Rest can take advantage of attempts to beat Dudunsparce via status, but it is significantly easier to take advantage of than Roost. Stored Power may look interesting for the Calm Mind sets, but its coverage is inferior to that of Shadow Ball, and it leaves Dudunsparce walled by Spiritomb and Sableye. Tera Fairy is also an option on the Calm Mind set to deny Dragon Tail attempts and give Dudunsparce a fantastic defensive typing, but it is generally not as effective as the Tera type options listed. Covert Cloak is an interesting option to prevent various detrimental secondary effects from moves like Psychic Noise, Triple Arrows, and Salt Cure, but it is overall niche compared to Heavy-Duty Boots or Leftovers. A dedicated specially based wallbreaker with Boomburst, Shadow Ball, Earth Power or Flamethrower, and Roost with Tera Normal or Ghost is actually quite difficult for many teams to switch into while having more longevity than most of its competitors, but it is ultimately too slow to perform its role consistently.</p> <h3>Checks and Counters</h3> <p><strong>Fighting-types and Fighting-type Coverage</strong>: Fighting-types such as Passimian, Hisuian Decidueye, Hitmonlee, and Virizion threaten Dudunsparce with their powerful STAB moves. Additionally, Fighting-type coverage commonly run by Regirock, Orthworm, and Glastrier can make life difficult for Dudunsparce. However, Dudunsparce almost always runs Tera types designed to give it a Fighting resistance, which can turn the tables on all of these answers.</p> <p><strong>Bulky Normal-resistant Pokemon</strong>: Bulky Normal-resistant Pokemon, such as Orthworm, Regirock, and Rhydon, can take Dudunsparce's STAB moves well. The former two can also set up Iron Defense to threaten Dudunsparce further. They lack reliable recovery, however, so a patient player can chip them down with entry hazard damage and then break through with Dudunsparce anyway, and Regirock and Rhydon are vulnerable to Toxic. Naclstack stands out as an option that has recovery and can apply Dudunsparce with Salt Cure; it is also significantly better against the Calm Mind set thanks to Purifying Salt giving it a Ghost resistance.</p> <p><strong>Ghost-types</strong>: Ghost-types such as Mismagius, Rotom, Spiritomb, and Sableye are immune to Dudunsparce's STAB moves and can threaten it with status, Taunt, or Encore. They must watch for Shadow Ball or Toxic, however, and Dudunsparce can phaze all of them with Dragon Tail.</p> <p><strong>Status</strong>: Dudunsparce hates being statused; Toxic is crippling for all sets in particular, while Coil sets greatly dislike being burned. Toxic spreaders such as Muk, Hisuian Qwilfish, and opposing Dudunsparce are therefore quite threatening to it. Will-O-Wisp users such as Weezing and Charizard require similar levels of caution, although the Calm Mind set can deal with them. Paralysis is also annoying; opposing Dudunsparce, Lanturn, and Mesprit can spread paralysis well against Dudunsparce.</p> <p><strong>Taunt and Encore</strong>: Dudunsparce's general reliance on setting up and using utility moves makes Encore and Taunt a good ways to shut it down. Encore users such as Whimsicott, Sableye, and Grafaiai can lock Dudunsparce into an unfavorable move and force it out. Similarly, Taunt from Hisuian Qwilfish, Lycanroc, and Mismagius is quite annoying, although this doesn't prevent Dudunsparce from attempting to phaze them with Dragon Tail or maiming them with a STAB move or Shadow Ball.</p>",
    "sets": {
      "Coil": {
        "description": "<p>Coil Dudunsparce is an extremely dangerous late-game wincon thanks to its bulk, access to Roost, and ability to overcome its checks via Serene Grace Body Slam and Dragon Tail. Coil notably complements its stat spread very well, as most special attackers struggle to break through Dudunsparce, while physical attackers fail to do so after Coil boosts Dudunsparce's Defense, and it makes Dragon Tail 100% accurate after one boost. Roost allows Dudunsparce to stay healthy and reliably accrue multiple Coil boosts versus more passive teams. Body Slam is preferred for a STAB move, as it comes with a nasty 60% paralysis chance thanks to Serene Grace. Dragon Tail is the preferred last option, as it allows Dudunsparce to phaze potential checks such as Sandaconda, Palossand, and Dipplin. This allows Dudunsparce to rack up entry hazard damage and make it easier for it to break through them. Poison Jab is an alternative that comes with a 60% chance to poison the foe with Serene Grace. It also lets Dudunsparce potentially win the mirror matchup over time and can cripple incoming checks, such as Rhydon and Regirock, more significantly than paralysis does. However, this leaves Dudunsparce with a significantly worse matchup against foes such as Orthworm and Naclstack, and Dudunsparce could potentially force one status onto a foe when the other would be preferred instead. Maximum Special Defense investment gives Dudunsparce setup opportunities against foes such as Jolteon, Cramorant, and Mesprit, while Leftovers is the preferred item for passive recovery. Tera Fairy allows Dudunsparce to become immune to Dragon Tail while removing its detrimental Fighting weakness, therefore allowing it to beat Dipplin, Passimian, and Hisuian Decidueye. However, Tera Poison boosts Poison Jab's power and makes it immune to Toxic from the likes of Hisuian Qwilfish and opposing Dudunsparce while still giving Dudunsparce a Fighting resistance. However, this leaves Dudunsparce vulnerable to Dragon Tail and also saddles it with undesirable weaknesses to Psychic- and Ground-type attacks.</p> <p>Coil Dudunsparce is an excellent wincon for balance and bulky offense teams thanks to its solid defensive presence combined with its threatening offensive profile. Dudunsparce loves having entry hazards on the opponent's side, as they help it chip down its defensive answers, such as Regirock, Orthworm, and Rhydon, while also having great synergy with Dragon Tail. Physically bulky Stealth Rock setters like Sandaconda, Palossand, and Regirock help check physical attackers for Dudunsparce; the former two in particular can help check Fighting-types like Passimian and apply further chip damage with Rocky Helmet. In a similar vein, Spikes setters like Sandslash and Qwilfish and Toxic Spikes setters like Weezing and Hisuian Qwilfish work great with this set. Weezing in particular can further help out with dangerous Fighting-types and is another great user of Rocky Helmet. Dudunsparce is capable of using Body Slam to spread paralysis early- and mid-game before setting up for a sweep, so slow attackers like Glastrier, Clawitzer, and Alolan Exeggutor are good teammates. These wallbreakers can help soften up checks to Dudunsparce such as Orthworm, Regirock, and opposing Dudunsparce. Dudunsparce hates status, so it appreciates status absorbers such as RestTalk Lanturn and Naclstack backing it up. Dudunsparce appreciates Ghost-types such as Mismagius, Rotom, and Sableye being taken care of before it attempts to win, so threatening Dark-types such as Sneasel and Brute Bonnet are good teammates to help threaten them. Coil Dudunsparce often needs to Terastallize to perform its role consistently, so teammates that are less dependant on Terastallizing, such as Mesprit, Palossand, and Grafaiai, are good teammates.</p>"
      },
      "Calm Mind": {
        "description": "<p>With towering bulk, access to reliable recovery, and STAB Boomburst in its arsenal, Calm Mind Dudunsparce is an incredibly threatening setup sweeper without much long-term counterplay. Commonly used moves like Knock Off and U-turn that pressure other walls also benefit Dudunsparce thanks to Rattled, which prevents Intimidate users like the Qwilfish formes from freely switching into it, too. Shadow Ball complements Boomburst well, dealing with Ghost-types like Palossand, Rotom, and Tera Ghost Orthworm. The additional sustenance that Leftovers offers often makes it the better item choice, but Heavy-Duty Boots is a valid alternative mainly on teams lacking reliable entry hazard removal. In addition to strengthening Shadow Ball, Tera Ghost turns the tables on Fighting-types like Passimian and can potentially help Dudunsparce defeat Orthworm, Regirock, and Snorlax, three huge nuisances otherwise. Tera Poison prevents foes like Grafaiai, the Qwilfish formes, and Weezing from poisoning Dudunsparce, which only makes it harder to bring down, and also lets Dudunsparce wall Whimsicott. Tera Poison is also better against Hisuian Decidueye in particular, which has Scrappy to deal with Tera Ghost Dudunsparce.</p> <p>Calm Mind Dudunsparce works well on bulky offense and balance teams in need of a sturdy wincon and secondary wall. Fighting-types like Passimian, Hisuian Decidueye, and Hisuian Sneasel can break through Steel- and Rock-types like Orthworm and Rhydon, which don't mind Dudunsparce's unboosted attacks and strike it back hard. Orthworm and Regirock match up well against troublesome special walls like Articuno and Porygon2 and set entry hazards so that Dudunsparce can more easily sweep. Switch-ins to Fighting-types, such as Mesprit, Palossand, and Weezing, are important to have so that Dudunsparce doesn't need to Terastallize prematurely when facing a threat like Hisuian Sneasel. These Pokemon can also switch into other physical attackers like Regirock, allowing Dudunsparce to stay healthy so it can more easily set up. If Dudunsparce opts to hold Leftovers, hazard removers become useful partners to have. As far as Defoggers go, Hisuian Decidueye and Cramorant do well at switching into and denying hazards from Orthworm and Sandslash and take on threats like Jolteon and Typhlosion, respectively. On the other hand, Sandslash and Hitmonlee are good spinners, with both also having Knock Off to wear foes like defensive Mesprit down. Sandslash can also make sweeping easier for Dudunsparce by setting its own hazards. Dudunsparce is incredibly vulnerable to Encore from the likes of Mesprit, Grafaiai, and Whimsicott, which makes checks to these foes such as Hisuian Qwilfish and Charizard appealing to have around. Even if Dudunsparce fails to completely sweep, it often leaves teams battered enough for a secondary sweeper like Jolteon or a cleaner such as Choice Scarf Passimian to easily finish the job. Both Pokemon can also support Dudunsparce early-game by using pivoting moves to get it in safely.</p>"
      },
      "Specially Defensive": {
        "description": "<p>Specially defensive Dudunsparce is a good defensive Pokemon in ZU, as it has great bulk, reliable recovery in Roost, and several useful utility options. Body Slam is the STAB move of choice, as its high paralysis chance with Serene Grace makes Dudunsparce surprisingly challenging to switch into safely. Dudunsparce is a decent Stealth Rock setter thanks to its bulk giving it opportunities to set up entry hazards and its longevity enabling it to set them up again if they're removed. Dragon Tail allows Dudunsparce to phaze out foes and rack up hazard chip damage. It also prevents Dudunsparce from being setup fodder for Nasty Plot Mesprit, Mismagius, Farigiraf and Calm Mind Dudunsparce unless they Terastallize Fairy. Toxic can be used over either of these moves to let Dudunsparce spread additional status and allows it to pressure Ghost-types such as Mismagius and Oricorio-G on the switch. It is also Dudunsparce's best way to pressure very bulky foes like Articuno, Regirock, and Palossand. Tera Fairy has great synergy with Dudunsparce's Normal typing, as it gives Dudunsparce a Fighting resistance while also equipping it with a generally solid defensive typing. This notably allows it to keep Stealth Rock on the field versus the common Defog Hisuian Decidueye. On the other hand, Tera Dragon powers up Dragon Tail and grants Dudunsparce notable resistances to Water-, Electric-, and Fire-type attacks, letting it match up better into threats such as Charizard, Typhlosion, Floatzel, and Jolteon. However, Floatzel and Jolteon run coverage moves that hit Dragon-types super effectively, so it must be used with caution.</p> <p>This Dudunsparce set fits well onto balance teams due to its longevity as an entry hazard setter and useful defensive profile. Physically defensive teammates such as Regirock, Sandaconda, and Spiritomb appreciate Dudunsparce shoring up their lesser special bulk and can form a solid defensive core with it. These teammates take on strong physical attackers like Snorlax, Hisuian Sneasel, and Braviary for Dudunsparce. Slow offensive teammates such as Glastrier, Magneton, and Clawitzer really appreciate paralysis support as well as Dudunsparce's Dragon Tail racking up hazard damage. Spikes setters such as Qwilfish, Hisuian Qwilfish, and Sandslash are also good teammates in order to maximize Dragon Tail's utility even further. Slower late-game sweepers such as Brute Bonnet, Swords Dance Hisuian Decidueye, and Nasty Plot Mesprit also appreciate the extra chip damage and paralysis support. On the other hand, faster cleaners such as Jolteon, Grafaiai, and Sneasel appreciate Dudunsparce chipping the opponent's team with Dragon Tail and Toxic damage. Dudunsparce's Normal typing doesn't provide it with any resistances and leaves it weak to common Fighting-types such as Hisuian Decidueye, Passimian, and Hisuian Sneasel. Teammates such as Qwilfish, Palossand, and Dipplin can help out against these Fighting-types; Qwilfish deals with Hisuian Decideye and Hisuian Sneasel, while Dipplin and Palossand can help take down Passimian. A special mention also goes to Weezing, which checks all of these Fighting-types and helps to wear them down with Rocky Helmet and burns. It can also set Toxic Spikes, which Dudunsparce can help facilitate with Dragon Tail, and it absorbs attempts to poison Dudunsparce from foes such as Qwilfish and Grafaiai, as Dudunsparce is vulnerable to the status condition. Charizard also threatens Dudunsparce with a status condition, in this case burn from Will-O-Wisp, so teammates such as Naclstack and RestTalk Lanturn can help to fully cover this threat.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400292, "username": "asa"}, {"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 452572, "username": "missangelic"}, {"user_id": 601970, "username": "sleid"}, {"user_id": 654091, "username": "FlamPoke"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 555379, "username": "Tbolt"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Brute Bonnet": {
    "overview": "<p>Brute Bonnet is a menacing attacker in ZU thanks to a laundry list of highly useful offensive attributes. Brute Bonnet's STAB combination hits much of the tier for neutral damage, and it can utilize coverage moves to cover the few Pokemon that it can't, such as Hisuian Decidueye, opposing Brute Bonnet, Hisuian Qwilfish, and Virizion. STAB Sucker Punch allows Brute Bonnet to cleave through weakened offensive teams late-game, and Synthesis in conjunction with its solid bulk makes Brute Bonnet difficult to chip down. Brute Bonnet is also capable of boosting its already high Attack stat with Booster Energy, making it a potent wincon, or by utilizing a Choice Band set, which turns it into a devastating wallbreaker. However, Brute Bonnet is burdened with a poor defensive typing, as it is weak to common Fighting-, Bug-, Ice-, and Poison-type attacks. Its poor Speed tier also leaves it very reliant on Sucker Punch to reliably threaten offensive teams, and they often carry Fighting-, Dark-, or Fairy-types that resist it. Brute Bonnet is capable of using Terastallization to circumvent these issues; however, this makes the standard offensive set Tera-dependent in many matchups. The Choice Band set can also be taken advantage of, as Brute Bonnet's STAB combination can be played around with common Pokemon that fit on both offensive and bulkier team styles, such as Hisuian Decidueye, Dipplin, Virizion, and Charizard.</p>",
    "comments": "<h3>Other Options</h3> <p>Growth is Brute Bonnet's best boosting option; it is especially dangerous under sun, where Protosynthesis is activated and Growth grants +2 Attack. This makes Tera Dark set with Growth / Sucker Punch / Crunch / Close Combat with Dread Plate or Life Orb especially dangerous on sun teams, as Brute Bonnet becomes extremely powerful with these boosts and can break down defensive cores for its fellow sun sweepers, such as Leafeon, Scovillain, and Victreebel, to take advantage of. Growth sets can also be run outside of sun teams, but Brute Bonnet's power is much less impressive, and such a set tends to require significant support to be effective when not under sun. Zen Headbutt can be used to hit bulky Poison- and Fighting-types harder, most notably Hisuian Decidueye, Weezing, and Muk, but Close Combat's targets are generally more relevant. Tera Blast can be run on offensive sets utilizing Tera Poison to hit several of Brute Bonnet's traditional checks, including Hisuian Decidueye, Virizion, Whimsicott, and Dipplin. Such sets should use Booster Energy in order to 2HKO Dipplin after Stealth Rock damage. This makes Brute Bonnet reliant on Terastallizing in almost every single game to be effective, however, and forces Brute Bonnet to drop Close Combat, which makes it vulnerable to threats such as Orthworm, Hisuian Avalugg, Hisuian Qwilfish, and Glastrier. Trailblaze can boost Brute Bonnet's Speed, but it is quite weak, and Brute Bonnet is still quite slow even after a boost. As a result, Sucker Punch is generally a more reliable way to take down faster threats.</p> <h3>Checks and Counters</h3> <p><strong>Fighting-types</strong>: Most of the tier's Fighting-types are quite threatening to Brute Bonnet. Hisuian Decidueye, Virizion, and Hisuian Sneasel all resist Brute Bonnet's STAB moves and threaten it heavily in return with their own Fighting-type STAB moves. Passimian easily outruns and threatens Brute Bonnet with both Close Combat and U-turn. Brute Bonnet can turn the tables on all of them by running Tera Poison, however.</p> <p><strong>Physically Defensive Walls</strong>: Dipplin takes all of Brute Bonnet's attacks with ease and can phaze it with Dragon Tail. Weezing can chip Brute Bonnet down with Rocky Helmet and burn it with Will-O-Wisp. Both Qwilfish formes are also good checks, as Brute Bonnet fears their Poison-type STAB moves and struggles to take them down due to Intimidate.</p> <p><strong>Fast Revenge Killers</strong>: Dark-resistant foes that are faster than Brute Bonnet generally present problems for it, as it is reliant on Sucker Punch to threaten faster foes. Whimsicott takes Sucker Punch with ease and can threaten Brute Bonnet with Moonblast, U-turn, or Switcheroo. It can also cripple Brute Bonnet with Encore should it choose to Terastallize. Sneasel outruns Brute Bonnet and threatens to OHKO it with Triple Axel. While not weak to Sucker Punch, foes with certain setup options such as Substitute + Calm Mind Jolteon, Nasty Plot + Encore Mesprit, or Tera Fighting Quiver Dance Oricorio-F can force Brute Bonnet into an uncomfortable guessing game or, in the case of Mesprit, lock it into Sucker Punch and turn it into setup fodder.</p> <p><strong>Status</strong>: Any form of status is crippling to Brute Bonnet. Common foes such as Charizard, Porygon2, Dudunsparce, Qwilfish, and Spiritomb can all cripple Brute Bonnet with a debilitating status condition. Tera Poison makes Brute Bonnet immune to attempts by Dudunsparce or Qwilfish to poison it, however.</p>",
    "sets": {
      "Offensive": {
        "description": "<p>Crunch is generally preferred over Seed Bomb, as Dark is a superior offensive typing and hits more of the metagame for neutral damage. It notably hits Muk, Weezing, Dipplin, and Articuno harder, but keep in mind that Brute Bonnet will still need the latter three to be chipped if it hopes to break through them. Crunch also comes with a handy chance to drop Defense, which can be useful in a late-game situation when faced down with Dipplin or Hisuian Decidueye. However, Seed Bomb can be considered, as it hits Rhydon, Sandaconda, and Lanturn harder. Sucker Punch is mandatory, as Brute Bonnet is quite slow, and access to powerful priority allows it to become threatening to offensive builds. Close Combat provides crucial coverage against foes such as Orthworm, Glastrier, opposing Brute Bonnet, and Porygon2. It also hits Hisuian Decidueye, Hisuian Qwilfish, and Virizion neutrally, which is crucial, as they are three of the very few Pokemon that resist Brute Bonnet's STAB attacks. Synthesis allows Brute Bonnet to stay healthy throughout a match and allows it to potentially outlast defensive Pokemon that try to beat it with consistent chip damage, such as Snorlax, Sandaconda, and Naclstack. If Brute Bonnet Terastallizes, Synthesis notably allows it to consistently beat defensive Hisuian Decidueye. Heavy-Duty Boots allows Brute Bonnet to come in multiple times throughout a game without fear of chip from entry hazards; this makes it quite challenging to take down in conjunction with Synthesis. On the other hand, Booster Energy gives Brute Bonnet a one-time boost to its Attack, which makes it a very threatening late-game wincon. Notably, it allows Sucker Punch to OHKO Jolteon after Stealth Rock damage while significantly improving damage rolls against crucial targets such as Grafaiai, Floatzel, and Lycanroc. Booster Energy can only be used once, however, which restricts Brute Bonnet's flexibility throughout a game. Tera Poison is the preferred Tera type, as it grants Brute Bonnet a resistance to Fighting-, Bug-, Poison-, and Fairy-type attacks. This allows it to turn the tables on several of its traditional checks, such as Hisuian Decidueye, Qwilfish, and Passimian. Tera Water can also be used to give Brute Bonnet a resistance to Fire- and Ice-type attacks, letting it deal with Sneasel, Glastrier, and Typhlosion. An Adamant nature is run for maximum damage output.</p> <p>Brute Bonnet's powerful attacks and access to Sucker Punch give it a solid place on many balance and offensive teams. Do note that it is best to use teammates that are not reliant on Terastallizing to perform their roles consistently, as Brute Bonnet often needs to Terastallize if it is looking to sweep late-game. Brute Bonnet benefits from teammates that help to chip down its offensive answers into range of its powerful Sucker Punch. Fast pivots such as Passimian, Jolteon, Floatzel, and Grafaiai can help chip much of the offensive metagame, and Brute Bonnet also appreciates their ability to get it in safely. On the other hand, physically bulky teammates such as Weezing, Palossand, and Sandaconda check Fighting-types like Passimian and Primeape, and the former also reliably handles Hisuian Decidueye. All three also run Rocky Helmet, which is great to further chip physical attackers like Sneasel, Hisuian Sneasel, and Virizion. The latter two also set Stealth Rock to chip down Brute Bonnet's offensive answers even further. Two of Brute Bonnet's best and most common answers are Charizard and Whimsicott, so special walls such as Dudunsparce, Porygon2, and Snorlax help by checking these big threats. Brute Bonnet pairs well with other powerful wallbreakers, such as Magneton, Floatzel, and Glastrier, as they can help to break down each other's defensive answers; the former two can also pivot to get Brute Bonnet in safely.</p>"
      },
      "Choice Band": {
        "description": "<p>Choice Band Brute Bonnet uses its great STAB combination, good overall coverage, and sizable bulk to become an effective wallbreaker. Close Combat allows Brute Bonnet to hit foes such as Orthworm, Hisuian Decidueye, and Virizion hard. Sucker Punch allows Brute Bonnet to revenge kill dangerous offensive threats such as Floatzel, Magneton, and Typhlosion in an emergency. However, it should be used with caution, as being locked into Sucker Punch is very undesirable due to how easily it can be exploited by the opponent. Tera Dark gives Crunch a significant power boost, giving Brute Bonnet the ability to 2HKO bulky foes such as Weezing, Orthworm, and physically defensive Qwilfish after Stealth Rock. Tera Fighting, however, can be used as an alternative to power up Close Combat, allowing it to OHKO Virizion, 2HKO defensive Hisuian Decidueye, and 2HKO defensive Hisuian Qwilfish after Stealth Rock. An Adamant nature is required to give Brute Bonnet as much power as possible.</p> <p>Choice Band Brute Bonnet fits best on bulky offense and balance teams. Brute Bonnet tends to invite in threats such as Hisuian Decidueye, Virizion, Passimian, and Whimsicott to attempt a revenge kill. Bulky Poison-types such as Weezing, Qwilfish, and Muk are therefore standout partners, as they can help stave off these threats. Brute Bonnet complements them by coming in on Ground- and Psychic-type attacks from the likes of Rhydon, Palossand, Sandaconda, and Mesprit, which offensive teammates such as Lycanroc and Jolteon appreciate as well. Dipplin is another great teammate that can help out against most physical revenge killers. A specially bulky teammate, such as Dudunsparce, Mesprit, or Lanturn, can help stave off revenge killing attempts from the likes of Charizard, Typhlosion, and Magneton; the last two also help Brute Bonnet get in safely with their slow pivot moves, while the first two can set Stealth Rock or spread status for Brute Bonnet to take advantage of. Brute Bonnet is also quite slow, and it benefits from VoltTurn partners that can get it in safely. It therefore loves faster pivoting teammates, such as Jolteon, Choice Scarf Passimian, and Choice Scarf Floatzel, that can help it overcome the shortcoming of its low Speed. These teammates appreciate Brute Bonnet's wallbreaking capabilities facilitating a potential late-game sweep. Brute Bonnet hates being statused, so teammates that can absorb attempts to burn and paralyze it, such as Naclstack, Typhlosion, and Lanturn are appreciated. It also appreciates paralysis being spread onto the opposing team, as teams can take advantage of its poor Speed tier. As such, teammates like Porygon2, Dudunsparce, Cramorant, and Sandaconda make for good partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475916, "username": "Sputnik"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 626095, "username": "sinnabyss"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Dipplin": {
    "comments": "<h3>Other Options</h3> <p>Dipplin's shallow movepool leaves little room for variety. Tera Water eliminates its Ice weakness and defensively answers Floatzel and Glastrier, but it does not fix Dipplin's vulnerability to Articuno's Freeze-Dry and worsens its matchups against Grass-type physical attackers like Hisuian Decidueye, Virizion, and Brute Bonnet that it would otherwise check.</p> <h3>Checks and Counters</h3> <p><strong>Whimsicott</strong>: The Grass / Fairy typing leaves Whimsicott barely scratched by Dipplin's Giga Drain and immune to Dragon Tail. Even without Choice Specs, Whimsicott has a 93.4% chance to 2HKO Dipplin with Moonblast. Even if Dipplin Terastallizes, pivot Whimsicott sets can lock Dipplin into a non-damaging move with Encore and whittle it down.</p> <p><strong>Ice-type Pokemon and Coverage</strong>: Articuno 2HKOes Dipplin with Freeze-Dry, has great bulk and Roost, can remove Dipplin's boosts with Haze or Roar if it Terastallizes, and can PP stall Dipplin with Pressure. Cryogonal has Freeze-Dry, recovery, and Haze similar to Articuno but isn't as bulky. Sneasel, Glastrier, and Hisuian Avalugg overcome Dipplin's massive Defense by exploiting its 4x Ice weakness, but Dipplin Terastallizing sours their positive matchups against it. Frosmoth OHKOes Dipplin with Ice Beam and can still overpower it even if it Terastallizes thanks to its high Special Attack. Choice Band Floatzel 2HKOes Dipplin with Ice Spinner.</p> <p><strong>Flying-types</strong>: Charizard 2HKOes Dipplin with Hurricane and can switch in while Dipplin uses Growth, Recover, or Giga Drain. The Oricorio formes similarly 2HKO Dipplin with Hurricane, threaten to set up on Dipplin with Quiver Dance, and can Taunt Dipplin. Braviary can use Bulk Up and Brave Bird to power through Dipplin while avoiding Dragon Tail with Substitute. Uninvested Cramorant has a 49.2% chance to 2HKO Dipplin with Hurricane. Dodrio can cut through Dipplin's physical bulk if it gains a Swords Dance boost.</p> <p><strong>Strong Special Attackers</strong>: Choice Specs Jolteon 2HKOes Dipplin with Alluring Voice. Shaymin can exploit the Special Defense drops from Seed Flare and one of its coverage moves to break through Dipplin, and it has the bulk to take boosted hits from Dipplin. Alolan Exeggutor takes a big chunk of damage from Dragon Tail but can switch in on Recover, Growth, or Giga Drain and exploit the negative priority of Dragon Tail to blow Dipplin away with Draco Meteor. Vikavolt 2HKOes Dipplin with Bug Buzz and can comfortably take attacks from Dipplin. Clawitzer must be wary of Giga Drain but has a 68.8% chance to OHKO Dipplin with a Choice Specs-boosted Dragon Pulse.</p> <p><strong>Tera Fairy Users</strong>: Dipplin's dependence on Dragon Tail to phaze setup sweepers makes it setup fodder for Tera Fairy users like Nasty Plot Mesprit, Calm Mind Jolteon, and Mismagius. Coil Dudunsparce has a harder time breaking through Dipplin compared to Calm Mind users but can phaze Dipplin with Dragon Tail or fish for poison with Poison Jab to wear it down. Snorlax must fish for paralysis with Body Slam but can overcome Dipplin in the long run with luck.</p> <p><strong>Residual Damage</strong>: Dipplin relies on its Eviolite for its bulk and is vulnerable to damaging entry hazards, which force it to use its limited Recover more often and become more passive. Toxic from Dudunsparce, Hisuian Qwilfish, and Qwilfish puts Dipplin on a timer and prevents it from gaining enough boosts to sweep. Even burns from switching into ideal foes like Palossand hurt Dipplin's longevity and dampen the power of its Dagon Tail. Weezing can fish for a poison on Dipplin with Sludge Bomb, burn it with Will-O-Wisp, and wash away its boosts with Haze.</p> <p><strong>Haze and Phazing</strong>: Weezing and Muk can wipe Dipplin's boosts with Haze and threaten it with their Poison-type STAB moves, and they have the bulk to take even boosted hits from Dipplin. Dudunsparce can phaze Dipplin first with Dragon Tail before getting phazed itself.</p> <p><strong>Encore</strong>: Sableye can switch in as Dipplin sets up and lock it into a non-damaging move like Growth or Recover. Even if Dipplin Terastallizes to improve its matchups against them, Mesprit and Grafaiai can still disrupt it.</p>",
    "sets": {
      "Growth": {
        "description": "<p>Dipplin is a fantastic check to physical attackers like Hisuian Decidueye, Regirock, and Passimian thanks to its substantial physical bulk and ability to absorb Knock Off. Dipplin's walling capabilities give it many opportunities to set up Growth against passive or ineffective foes like Sandaconda and Brute Bonnet to function as a bulky sweeper. Dragon Tail phazes setup sweepers that might try to break through Dipplin such as Snorlax, Virizion, and Calm Mind Dudunsparce. Giga Drain keeps Dipplin healthy as it attacks to make it less reliant on Recover to quickly devour Pokemon weak to Grass like Regirock, Palossand, and Sandaconda. Sticky Hold distinguishes Dipplin from other NFE Pokemon dependent on their Eviolite such as Rhydon and Porygon2 by protecting Dipplin from Knock Off, Switcheroo, and Trick from users like Grafaiai and Mesprit. Tera Poison improves Dipplin's matchups against Fighting-types like Hisuian Sneasel, allowing it to maintain good matchups against Poison-types like Grafaiai and Hisuian Qwilfish as well as an immunity to poison at the cost of vulnerability to Mesprit and Farigiraf. Tera Fairy protects Dipplin from Dragon Tail users like Coil Dudunsparce and opposing Dipplin, and it improves Dipplin's vulnerability to Alolan Exeggutor and Appletun. Tera Steel turns the tables against checks like Glastrier, Sneasel, and Tera Fairy Mesprit and protects Dipplin from poison from Grafaiai, the Qwilfish formes, and Muk at the cost of worsening its matchups against Fighting-types.</p> <p>Dipplin's capability to absorb Knock Off makes it a great partner to Pokemon that are reliant on their items, including Articuno, Regirock, and Hisuian Qwilfish. Snorlax is an excellent partner to handle threats to Dipplin like Articuno, Typhlosion, and Charizard, and Dipplin takes physical attacks and Knock Off from Hisuian Decidueye, Passimian, and Lycanroc for Snorlax in return. Dipplin amplifies residual damage from entry hazard stacking thanks to Dragon Tail, so hazard setters like Hisuian Qwilfish, Orthworm, Qwilfish, and Sandslash have great synergy with Dipplin. Knock Off users like Mesprit, Passimian, and Grafaiai can remove Heavy-Duty Boots from foes to ensure they take damage from entry hazards when Dipplin uses Dragon Tail. Teammates weak to Water and Grass like Regirock, Sandaconda, and Sandslash appreciate Dipplin taking on Floatzel, Brute Bonnet, Lanturn, and Virizion for them. Teammates like Charizard, Typhlosion, and Orthworm can handle special attackers with Fairy- and Ice-type coverage for Dipplin, offensively checking Whimsicott, Frosmoth, and Articuno. Regirock, Naclstack, and Rhydon help Dipplin by defensively answering Flying-types like Dodrio, Charizard, and the Oricorio formes for it. Dipplin is vulnerable to being overwhelmed by chip damage from hazards, so it depends on partners with hazard removal like Cramorant and Sandslash to mitigate this vulnerability.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 452572, "username": "missangelic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  }
}