{
  "Arcanine": {"sets": [{"name": "Utility"}]},
  "Gyarados": {"sets": [{"name": "Support"}]},
  "Dragonite": {"sets": [{"name": "Assault Vest"}, {"name": "Lum Berry"}, {"name": "Choice Band"}]},
  "Murkrow": {"sets": [{"name": "Tailwind Support"}]},
  "Tyranitar": {"sets": [{"name": "Assault Vest"}]},
  "Pelipper": {"sets": [{"name": "Rain Setter"}]},
  "Torkoal": {"sets": [{"name": "Support"}, {"name": "Trick Room Sweeper"}]},
  "Gastrodon": {"sets": [{"name": "Tank"}]},
  "Garchomp": {"sets": [{"name": "Offensive"}, {"name": "Scarf"}]},
  "Abomasnow": {
    "overview": "<ul> <li> <p>Snow lets Abomasnow carve itself a niche in the current metagame.</p> </li> <li> <p>Abomasnow is a decent offensive support Pokemon with Aurora Veil, which partners well with various Ice-types such as Baxcalibur, Cetitan, and Glaceon, as they gain a Defense boost in snow.</p> </li> <li> <p>Abomasnow's offensive typing is well-suited in a metagame filled with Ground-, Dragon-, and Water-types such as Garchomp, Hydreigon, and Rotom-W.</p> </li> <li> <p>Despite the Defense boost in snow, Abomasnow is still fairly specially frail with a poor set of weaknesses that leave it vulnerable to some of the most common special attackers in the format like Gholdengo and Armarouge.</p> </li> </ul> ",
    "sets": [
      {
        "name": "Support",
        "description": "<ul> <li> <p>Giga Drain gives Abomasnow some longevity when behind Aurora Veil and lets it beat the likes of Rotom-W and Palafin which resist Blizzard. Earth Power is an alternative that hits Fire- and Steel-types like Torkoal and Gholdengo, notably OHKOing the former when Terastallized.</p> </li> <li> <p>Abomansow runs items that help it overcome its crucial weaknesses. Focus Sash allows it to take any one hit, such as Rotom-H's Overheat, letting it set up Aurora Veil. Babiri Berry serves a similar purpose, allowing it to survive Gholdengo's Make It Rain and Tera Steel Hydreigon's Flash Cannon.</p> </li> <li> <p>The Speed investment allows Abomsnow to outspeed Garchomp while in Tailwind.</p> </li> <li> <p>Water is the primary Tera type used by Abomasnow, turning its Fire and Steel weaknesses into resistances. Ground is an alternative Tera type that allows it to fire off STAB-boosted Earth Powers, catching its common checks by surprise.</p> </li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "yuki", "user_id": 294287}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yourwelcomethanku", "user_id": 541847}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Rotom-Wash": {"sets": [{"name": "Bulky Water"}]},
  "Lilligant": {"sets": [{"name": "Sun supporter"}]},
  "Gothitelle": {"sets": [{"name": "Support"}]},
  "Amoonguss": {"sets": [{"name": "Support"}]},
  "Hydreigon": {
    "overview": "<ul> <li> <p>Hydreigon is a strong contender for the title of best Pokemon in the Series 1 metagame thanks to its diverse movepool and high damage output.</p> </li> <li> <p>Terastallization proves to be a boon for Hydreigon, as it can get rid of its ever-burdening Fairy-type weakness by changing to much more beneficial types such as Steel.</p> </li> <li> <p>Hydreigon has a good offensive typing, leaving few Pokemon able to switch in safely. It is one of the best checks to Gholdengo and also pairs well with it, forming a fundamentally powerful core when used with Tailwind support from Murkrow. Armarouge and Garchomp also synergize well with Hydreigon, covering for Steel-types, which it may not be able to damage effectively depending on its Tera type. Hydreigon can, however, struggle against damage reduction such as Snarl and Light Screen, with the latter coming especially from Grimmsnarl, which can easily take its STAB moves and OHKO it back with Spirit Break if Hydreigon is not Terastallized. Repeated usage of Draco Meteor can also make Hydreigon deal unimpressive amounts of damage, but this can be counteracted with Haze from Murkrow, allowing it to continue dealing devastating damage.</p> </li> </ul> ",
    "sets": [
      {
        "name": "Life Orb",
        "description": "<ul> <li> <p>Tailwind allows Hydreigon to support allies such as Armarouge and Sylveon, forming strong offensive combinations. The third moveslot depends on Hydreigon's Tera Type and can be changed accordingly. Protect is utilized on teams with a different primary Tailwind setter such as Murkrow, but Hydreigon can still be kept as a secondary setter.</p> </li> <li> <p>Life Orb lets Hydreigon dish out consistent damage without the need to set up.</p> </li> <li> <p>The Steel Tera type synergizes wonderfully with Hydreigon's original typing and Levitate, allowing it to resist a plethora of common types such as Fairy, Ground, and, Dragon. This makes Hydreigon one of the best checks to Tera Ground Garchomp, which cannot hit Hydreigon with Earthquake and deals minimal damage to it with Dragon Claw and Rock Slide. A Fire Tera type allows Hydreigon to beat opposing Tera Steel Pokemon such as Hydreigon and Salamence. The Poison Tera type lets Hydreigon maintain the resistance to Fairy that Steel and Fire possess while also gaining an additional resistance to Fighting, crucial against the likes of Annihilape, Hariyama, and Close Combat Lycanroc. It is only left with Psychic as a relevant weakness, synergizing well with its original Dark typing. Tera Blast should be used instead of Flash Cannon for coverage against Fairy-types on sets that use Tera Poison.</p> </li> </ul> "
      },
      {"name": "Scope Lens", "description": "<ul> <li> <p>Heat Wave is a great coverage move to deal with Steel-types that can withstand Draco Meteor such as Gholdengo and Kingambit.</p> </li> <li> <p>Scope Lens takes advantage of the +2 critical hit rate from Focus Energy, allowing Hydreigon to always critical hit, especially through Draco Meteor Special Attack drops and other means of damage reduction such as Light Screen.</p> </li> <li> <p>A Timid nature lets Hydreigon speed tie other Hydreigon as the raw power it gains from having the ability to always critical hit is enough. A Modest nature can, however, be utilized on teams with good methods of speed control such as Tailwind from Murkrow.</p> </li> <li> <p>The Fire Tera type powers up Hydreigon's Heat Wave, letting it OHKO Kingambit on a critical hit and nearly OHKO Amoonguss, and gives Hydreigon a Fairy resistance.</p> </li> </ul> "},
      {
        "name": "Assault Vest",
        "description": "<ul> <li> <p>Snarl is an immensely useful tool for reducing the damage dealt by strong special attackers such as Gholdengo, Psychic Terrain-boosted Expanding Force Armarouge, and opposing Hydreigon.</p> </li> <li> <p>Flash Cannon in combination with the Steel Tera type is used as a way to keep Fairy-types such as Grimmsnarl and Sylveon in check. Heat Wave is used as coverage to hit opposing Steel-types, but Dark Pulse is usually preferred over it for its ability to deal consistent damage to most other types overall.</p> </li> <li> <p>Assault Vest makes Hydreigon a very potent sponge against special moves when combined with its ability to use Snarl for further reduction, especially for its teammates. Its high Special Attack lets it deal respectable damage despite running a more support-oriented set.</p> </li> <li> <p>The Speed EVs allow Hydreigon to outrun maximum Speed Timid Gholdengo, and as a result, Armarouge of all Speed investments, allowing it to immediately use Snarl and lower their damage output. The Special Attack EVs let it always 2HKO maximum HP and 4 Special Defense Armarouge and uninvested Gholdengo with Dark Pulse. The Special Defense EVs make -1 Modest maximum Special Attack Choice Specs Gholdengo's Shadow Ball only a possible 5HKO on Tera Steel Hydreigon, while Make It Rain rocks a petty chance to even 7HKO. -1 Armarouge Aura Sphere also only has about a 50% chance to 4HKO Hydreigon. Note that Hydreigon should not be Terastallized against Armarouge to maintain the Fire resistance and Psychic immunity, as it is still weak to Aura Sphere when Terastallized. Opposing Tera Fire Hydreigon never OHKOes Tera Steel Hydreigon with Life Orb Heat Wave when spread damage is accounted for, allowing Hydreigon to retaliate with Snarl. The physical bulk allows Hydreigon to never be 2HKOed by maximum Attack Adamant Annihilape Drain Punch and Jolly maximum Attack Garchomp Brick Break.</p> </li> <li> <p>Steel Tera type is the best defensive type for Hydreigon, allowing it to hard check most special attackers such as Gholdengo and Sylveon while holding its own against Pokemon such as Grimmsnarl. Poison Tera type, on the other hand, lets Hydreigon maintain the Fairy resistance that Steel gives it while also awarding it an additional resistance to Fighting in the face of Pokemon such as Annihilape and Hariyama. Tera Blast should be used instead of Flash Cannon to hit Fairy-types on Tera Poison sets.</p> </li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Sole Survivor", "user_id": 518634}], "teams": [{"name": "Quality checked by", "members": [{"username": "yuki", "user_id": 294287}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Volcarona": {"sets": [{"name": "Quiver Dance Sweeper"}, {"name": "Support"}]},
  "Talonflame": {"sets": [{"name": "Support"}]},
  "Sylveon": {"sets": [{"name": "Bulky Attacker"}]},
  "Mimikyu": {"sets": [{"name": "Offensive"}]},
  "Corviknight": {"sets": [{"name": "Bulk Up"}, {"name": "Tailwind Support"}]},
  "Hatterene": {"sets": [{"name": "Offensive"}]},
  "Grimmsnarl": {"sets": [{"name": "Dual Screens"}]},
  "Indeedee-F": {"sets": [{"name": "Redirector"}]},
  "Meowscarada": {"sets": [{"name": "Offensive"}]},
  "Pawmot": {"sets": [{"name": "Revival Blessing"}]},
  "Maushold": {"sets": [{"name": "Friend Guard"}]},
  "Maushold-Four": {"sets": [{"name": "Wide Lens"}, {"name": "Support"}]},
  "Garganacl": {"sets": [{"name": "Salt Cure"}]},
  "Armarouge": {"sets": [{"name": "Offensive"}]},
  "Ceruledge": {"sets": [{"name": "Bulk Up Sweeper"}]},
  "Kilowattrel": {
    "overview": "<ul> <li> <p>Kilowattrel stands out as one of the best Tailwind setters in the current metagame. Its base 125 Speed stat lets it set Tailwind first, with very little Prankster Tailwind Pokemon stopping it from doing so.</p> </li> <li> <p>Kilowattrel has a respectable base 105 Special Attack stat and a good offensive typing, allowing it to tackle the likes of Meowscarada and Gyarados well.</p> </li> <li> <p>Kilowattrel appreciates immediately hard-hitting partners such as Choice Specs Gholdengo and Garchomp to break through opposing teams. Gholdengo is great in particular thanks to its immunity to Dragonite's Extreme Speed.</p> </li> <li> <p>Kilowattrel is particularly frail, meaning it often only gets to set Tailwind and fire off a single attack before it faints. It also means in late-game scenarios, it is unreliable at dueling the meta's most common attackers like Gholdengo and Hydreigon.</p> </li> </ul> ",
    "sets": [
      {"name": "Support", "description": "<ul> <li> <p>Air Slash is Kilowattrel's primary Flying-type STAB move of choice due to its higher accuracy than Hurricane, though the latter may be seen on rain teams.</p> </li> <li> <p>Discharge is a good spread option when next to a Ground- or Electric-type partner like Garchomp or Rotom-F. Volt Switch allows Kilowattrel to use its high base Speed to pivot into a partner that can better use the extra Speed from Tailwind.</p> </li> <li> <p>Competitive acts as an Intimidate-deterrent for physically attacking partners such as Garchomp, Baxcalibur, and Ceruledge.</p> </li> <li> <p>Focus Sash is a must-have, as Kilowattrel is incredibly frail and unable to take any super effective or strong neutral attacks such as Baxcalibur's Icicle Crash and Tera Normal Dragonite's Extreme Speed.</p> </li> <li> <p>Kilowattrel rarely Terastallizes, but when it does, it prefers to use same type Tera to boost the power of one of its STAB moves.</p> </li> </ul> "}
    ],
    "credits": {"writtenBy": [{"username": "yuki", "user_id": 294287}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yourwelcomethanku", "user_id": 541847}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Tinkaton": {
    "overview": "<ul> <li> <p>Tinkaton is primarily a bulky attacker, but it also has an amazing defensive typing and Fake Out, giving it good defensive utility.</p> </li> <li> <p>Tinkaton does extremely well against Murkrow teams, including Pokemon common on them like Annihilape, Hydreigon, Meowscarada, Maushold, and Murkrow itself. This makes it a very good partner for Dondozo + Tatsugiri teams, which feel pressured by Murkrow's Haze. Many of the aforementioned Pokemon are also very common on teams without Murkrow, so Tinkaton checking them well is broadly useful.</p> </li> <li> <p>Mold Breaker + Fake Out Tinkaton does well against dedicated Trick Room teams because its Fake Out bypasses Oranguru's Inner Focus and Farigiraf's Armor Tail, and it can OHKO Mimikyu through Disguise.</p> </li> <li> <p>Tinkaton struggles with the extremely common Fire-types, as well as Garchomp and Steel-types like Corviknight and Scizor, which wall it entirely. Water-types help deal with the majority of its counters, especially Rotom-W.</p> </li> </ul> ",
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<ul> <li> <p>Knock Off hits Pokemon that resist both its STAB moves like Gholdengo, Armarouge, and Ceruledge and can cripple Pokemon with the item removal, especially Dondozo.</p> </li> <li> <p>Tinkaton has many opportunities to use Swords Dance, especially because opponents will often use Protect consecutively in front of it, expecting a Fake Out or Gigaton Hammer. It's also a good move to use on the Gigaton Hammer recharge turns.</p> </li> <li> <p>Assault Vest turns Tinkaton into a sponge against special attackers, which helps against common Pokemon such as Hydreigon and Gholdengo.</p> </li> <li> <p>Sitrus Berry lets Tinkaton run Protect, which helps it stall out Gigaton Hammer recharge turns. This also pairs well with Swords Dance, which is similarly convenient to have on the recharge turns.</p> </li> <li> <p>Mold Breaker is mainly good when used with Fake Out, as the ability lets Tinkaton flinch Dragonite, Farigiraf, and Oranguru. Mold Breaker also bypasses Mimikyu's Disguise.</p> </li> <li> <p>Own Tempo is valuable because there are multiple good Intimidate users: Arcanine and Gyarados, as well as Paldean Tauros-A, Paldean Tauros-B, and Salamence. If you're not very worried about dedicated Trick Room teams or Dragonite, this is a good way to improve your matchup against bulkier teams.</p> </li> <li> <p>Tera Steel is by far the best Tera type for Tinkaton, as it makes Gigaton Hammer very powerful, even doing good damage to targets that resist it. For example, it 2HKOes maximum HP Talonflame.</p> </li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Robbie35646", "user_id": 562330}], "teams": [{"name": "Quality checked by", "members": [{"username": "Yourwelcomethanku", "user_id": 541847}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Palafin": {"sets": [{"name": "Bulky Attacker"}]},
  "Glimmora": {"sets": [{"name": "Specs"}, {"name": "Mortal Spin"}]},
  "Dondozo": {"sets": [{"name": "Commander Sweeper"}]},
  "Tatsugiri": {"sets": [{"name": "Choice Item"}, {"name": "Sash"}]},
  "Annihilape": {"sets": [{"name": "Rage Fist"}, {"name": "Final Gambit"}]},
  "Farigiraf": {
    "overview": "<ul> <li> <p>Farigiraf is currently one of the bulkiest Trick Room setters in the meta. Its ability, Armor Tail, prevents its teammates from succumbing to priority moves, making it difficult to prevent Farigiraf from setting Trick Room.</p> </li> <li> <p>Hariyama, Amoonguss, and Kingambit are good partners for Farigiraf. Hariyama and Farigiraf both benefit from each other, as Fake Out allows Farigiraf to more consistently get up Trick Room, which enables Hariyama, as it thrives inside of Trick Room and checks Farigiraf's common counters. Amoonguss can redirect moves targeted at Farigiraf and Spore anything inside Trick Room to take them out of the game. Kingambit benefits from the Snarl that Farigiraf struggles against and plays well in Trick Room.</p> </li> <li> <p>Choice Band Meowscarada and Hydreigon are the biggest checks to Farigiraf, as both threaten to OHKO it. Amoonguss is another check, as it can Spore Farigiraf before it manages to get Trick Room up. It also struggles against Imprison from Indeedee, Gallade, and opposing Farigiraf.</p> </li> </ul> ",
    "sets": [
      {
        "name": "Bulky Trick Room",
        "description": "<ul> <li> <p>Hyper Voice is a decently strong Normal-type STAB move for Farigiraf to spread chip damage that softens up opponents for its allies. Psyshock tackles common Psychic-weak Pokemon such as Amoonguss and Gengar, whereas Dazzling Gleam improves its matchup into common checks like Meowscarada and Hydreigon. Helping Hand allows Farigiraf to supplement a harder hitting teammate's damage output. Imprison is used on fast offensive teams that would otherwise struggle against opposing Trick Room teams.</p> </li> <li> <p>Safety Goggles provides an immunity to Spore from Amoonguss and Breloom, who would otherwise prevent Trick Room from going up with it. Sitrus Berry gives Farigiraf longevity with recovery. Colbur Berry allows Farigiraf to consistently get Trick Room up in the face of Meowscarada and Hydreigon.</p> </li> <li> <p>For other notable items, Mental Herb prevents fast Taunt users like Talonflame from interrupting Farigiraf's Trick Room. Life Orb or Throat Spray are good options to improve Farigiraf's already decent damage output. Rocky Helmet can also be used for an answer to unsuspecting Maushold.</p> </li> <li> <p>180 EVs in HP allow Farigiraf to survive maximum HP Annihilape Final Gambit, and the defensive investment allows it to always survive Tera Steel Choice Specs Gholdengo Make It Rain and Focus Sash Meowscarada Knock Off.</p> </li> <li> <p>Tera Fairy is more of a defensive Tera type, giving it a resistance to all the types that Farigiraf was previously weak to while gaining STAB on Dazzling Gleam. Tera Normal adds damage onto Hyper Voice and removes its Dark weakness.</p> </li> </ul> "
      }
    ],
    "credits": {"writtenBy": [{"username": "CbuttyVGC", "user_id": 615665}], "teams": [{"name": "Quality checked by", "members": [{"username": "yuki", "user_id": 294287}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Kingambit": {"sets": [{"name": "Assault Vest"}, {"name": "Swords Dance"}]},
  "Great Tusk": {"sets": [{"name": "Offensive"}, {"name": "All-Out-Attacker"}]},
  "Scream Tail": {"sets": [{"name": "Support"}, {"name": "Perish Song"}]},
  "Brute Bonnet": {"sets": [{"name": "Loaded Dice"}, {"name": "Support"}]},
  "Flutter Mane": {"sets": [{"name": "Choice Specs"}, {"name": "SpA Booster"}]},
  "Iron Bundle": {"sets": [{"name": "Glass Cannon"}, {"name": "Snow Abuser"}]},
  "Iron Hands": {"sets": [{"name": "Setup Sweeper"}, {"name": "Assault Vest"}]},
  "Iron Jugulis": {"sets": [{"name": "Tailwind Support"}]},
  "Iron Moth": {"sets": [{"name": "Acid Spray"}]},
  "Baxcalibur": {"sets": [{"name": "Offensive"}, {"name": "Loaded Dice"}]},
  "Gholdengo": {"sets": [{"name": "Nasty Plot"}, {"name": "Choice Specs"}]},
  "Chien-Pao": {"sets": [{"name": "Offensive"}]},
  "Ting-Lu": {"sets": [{"name": "Bulky Attacker"}]},
  "Chi-Yu": {"sets": [{"name": "Choice Specs"}, {"name": "Nasty Plot"}, {"name": "Choice Scarf"}]},
  "Roaring Moon": {"sets": [{"name": "Speed Booster"}, {"name": "Attack Booster"}, {"name": "Sun Attacker"}]}
}