{
  "Pikachu": {
    "sets": [
      {
        "name": "Imposter",
        "description": "<p>Thanks to Light Ball, Pikachu is a niche Imposter user that can break past less-sturdy Imposter-proofers, although it forgoes defensive utility in exchange. When Pikachu transforms, only the ability, item, HP EVs, and Tera type listed here matter. Tera Fairy is useful against Dragon-types like Koraidon and Palkia-O, while Tera Dragon lets Pikachu transformed into Palkia-O 2HKO Ice Scales Dialga-O after Spikes. The listed moves, non-HP EVs, and nature will very rarely see use: since Pikachu outspeeds all other Imposter users like Chansey, it is extremely rare that Pikachu is not transformed. Nevertheless, Volt Switch provides a reasonably strong pivoting option against opposing transformed Imposter users, which cause Pikachu's Imposter to fail, while Glare can paralyze threats to aid Pikachu later on. Healing Wish and Spikes both provide some utility if Pikachu is no longer needed. Since Pikachu is extremely frail, it can easily fall to any strong move from opposing threats it wants to transform into. Therefore, significant team support is needed to realize its potential. Paralysis spam through Nuzzle and Glare ensures Pikachu always outspeeds opposing threats like Koraidon, and it can also generate free turns. Knock Off invalidates Pikachu, so Knock Off absorbers, such as Arceus with a held Plate and Guts + Flame Orb users like Slaking, are recommended. Bulky special walls like Ice Scales Arceus-Ground and Dialga-O check Palkia-O and Arceus-Ghost, which Pikachu cannot safely transform into: the former is unsafe to switch in to, and the latter Imposter-proofs itself. Substitute + Baton Pass is a niche option to provide free turns to Pikachu, and this has the benefit of scouting potential Terastallization.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Chansey": {
    "sets": [
      {
        "name": "Imposter",
        "description": "<p>With Imposter, Chansey transforms into a far bulkier version of the opposing Pokemon, which can be further bolstered by Eviolite. This provides a myriad of benefits, including blanket checking most Pokemon, scouting sets, and PP stalling less threatening foes. While Eviolite is usually the best item, Covert Cloak is useful against Nuzzle and Spirit Shackle users. The given moves offer the most utility in the rare situations Chansey is not transformed, like phazing Substitute users, pivoting, and acting as a cleric. Offensive threats such as Palkia-O and Flutter Mane appreciate the information Imposter Chansey provides through scouting. Imposter Chansey appreciates slow pivoting from Pokemon like Dondozo and RegenVest Ting-Lu for safe scouting; these Pokemon can also provide Knock Off support, aiding against Judgment users that can otherwise defeat Imposter Chansey. Tera Normal gives Chansey a STAB boost on Judgment, improving its matchup into Pokemon like Arceus-Ground, while Tera Fire and Tera Ghost are useful against V-create users and trapping moves, respectively.</p> "
      },
      {
        "name": "Ice Scales",
        "description": "<p>With Eviolite and Ice Scales, Chansey becomes the bulkiest specially defensive wall in the tier, capable of walling virtually every special attacker. Ruination bypasses Chansey's meager offenses to deal damage. Toxic cripples bulky Pokemon like Arceus formes and setup sweepers like Palkia-O. Parting Shot allows Chansey to safely pivot teammates in thanks to its low Speed. Chansey’s low Attack limits Strength Sap healing from common special attackers, making it effective at wearing them down in the long run. Chansey's poor Defense means that it enjoys Fur Coat teammates like Groudon, Eternatus, and Arceus to check powerful physical attackers like Slaking, Groudon, and Koraidon. Chansey is also hindered by poison from Mortal Spin and Toxic, so having Hell Bell somewhere on the team is useful. Tera Ghost protects Chansey from being trapped, whereas Tera Poison makes it immune to poison and grants a resistance to Pixilate Extreme Speed from Arceus-Fairy.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}, {"username": "ponchlake", "user_id": 574634}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "TTTech", "user_id": 338877}, {"username": "Chessking345", "user_id": 355040}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Slaking": {
    "sets": [
      {
        "name": "Guts",
        "description": "<p>Guts Slaking is a strong Pokemon that boasts great role compression as a damage dealer, entry hazard remover, and status absorber. Facade has downright absurd damage output, OHKOing everything that isn't a Fur Coat user or resistant to Normal at +1, and it has high enough PP to outlast Strength Sap on most walls. Tidy Up bolsters Slaking's offensive profile and also clears entry hazards, which when combined with Flame Orb's burn and disposability makes it a near-perfect switch-in to RegenVest users. V-create slams Steel-types like Zamazenta-C and picks off weakened Arceus-Ghost, while Wicked Blow hits Arceus-Ghost and Giratina harder. Strength Sap provides reliable recovery and allows Slaking to switch in and beat most Fur Coat Groudon sets one-on-one. Slaking's best fit is on balance and offense teams, as these can give it multiple opportunities to set up and heavily benefit from a good switch-in to RegenVest users like Ting-Lu. Fur Coat Arceus-Ghost is a common obstacle for Slaking and drastically reduces how fast it makes progress, so teammates that can limit its Strength Sap recovery, like Chansey and Liquid Ooze users, are recommended. Fur Coat Giratina is rare but basically unbeatable with Slaking, so a teammate like Choice Band Koraidon is appreciated to remove it or force it to Terastallize. Ghost-types and Zamazenta-C are the preferred Imposter-proofs for Slaking, as even though Fur Coat users like Groudon and Dondozo are usually sufficient, they can crumple if the Imposter user is statused.</p> "
      },
      {
        "name": "Fur Coat",
        "description": "<p>Fur Coat Slaking is a reliable physical wall that can both deal damage and spread status. Body Slam threatens many physical attackers such as Groudon and opposing Slaking with paralysis. Toxic punishes Arceus-Ghost for switching in and using Slaking as setup fodder, whereas Stone Axe allows Slaking to support its teammates and provides more instant damage than Toxic, which benefits teammates like Choice Band Groudon. Knock Off removes items like Covert Cloak and Rocky Helmet to more freely use Body Slam against targets like support Arceus formes and Groudon; alternatively, Victory Dance allows Slaking to outrun and threaten Palkia-O and Koraidon. Covert Cloak blocks Nuzzle paralysis from Pokemon like RegenVest users. Fur Coat Slaking's best fit is on balance teams that want a reliable, non-passive Fur Coat wall without giving up the Arceus slot. Teammates like Choice Band Groudon enjoy Slaking's presence, as Knock Off ensures opposing walls' bulk is stretched even thinner. Imposter-proof Knock Off variants with Arceus-Ghost, though Slaking can trade paralysis with the Imposter user in a pinch; Imposter-proof Toxic variants with Covert Cloak Cotviknight.</p> "
      },
      {
        "name": "Population Bomb",
        "description": "<p>Population Bomb Slaking is a terrifying wallbreaker thanks to Population Bomb's huge damage output, crushing even resistant targets like Hisuian Goodra and Dialga-O. Magic Guard negates chip damage from entry hazards and Rocky Helmet, the latter of which will almost always KO Slaking if using Population Bomb. With Magic Guard, Tidy Up + Wide Lens makes Slaking a reliable source of entry hazard removal while also allowing it to outrun Eternatus and Koraidon, whereas Coil + Life Orb offers higher damage. Flame Orb + Guts blocks crippling burns at the cost of forcing Coil and either itself or an ally into using Knock Off. V-create offers a more immediate damaging option against opposing Steel-types, notably OHKOing Zacian-C unboosted; alternatively, Wicked Blow deals heavy damage to Ghost-types like Arceus-Ghost and Giratina, and Toxic allows Slaking to wear them down in the long run while also dissuading Imposter users from switching in. Population Bomb Slaking best fits on bulky offense teams that can wear down Slaking's hardest checks like Arceus-Ghost and Prankster Giratina. A Spooky Plate Imposter user is recommended to turn the tables on Fur Coat Arceus-Ghost, although Hoopa-U can fit the bill on more offensive teams. Imposter-proof Slaking with a Giratina or Fur Coat Arceus-Ghost.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Dondozo": {
    "sets": [
      {
        "name": "Fur Coat",
        "description": "<p>Fur Coat Dondozo is a great defensive Pokemon with its high physical bulk and typing, which allows it to wall physical attackers such as Slaking and Groudon. Spikes supports offensive teammates, while Haze stops foes like Tidy Up Groudon and Slaking from setting up. Knock Off removes items such as Covert Cloak and Leftovers, and Scald burns provide chip damage on foes. Flip Turn makes it easier to pivot into offensive teammates such as Koraidon, since Taunt, Dark-types, and Magic Bounce don't block it; alternatively, Parting Shot makes the foe easier to handle for Dondozo's teammates, but it's stopped by Taunt and Good as Gold. Heavy-Duty Boots, notably eases Dondozo's pivoting, while Rocky Helmet punishes contact moves such as U-turn and V-create. Covert Cloak protects against secondary effects like confusion from Magical Torque and burns from Scald. Tera Fire allows Dondozo to resist Magical Torque and Grass-type moves from Arceus-Fire, and it maintains Dondozo's resistance to Fire-type moves such as V-create. Dondozo appreciates defensive teammates with typing synergy such as RegenVest Ting-Lu, which helps protect Dondozo from threatening Pokemon such as Eternatus.</p> "
      },
      {
        "name": "Prankster",
        "description": "<p>Prankster Dondozo with Haze can reliably check physical setup sweepers such as Slaking and Groudon thanks to its huge physical bulk. Entrainment forces out Pokemon dependent on their abilities, Encore can lock foes into unfavorable moves such as setup moves or V-create, and Glare debilitates fast attackers such as Koraidon and Palkia-O. Parting Shot allows Dondozo to maintain momentum against opposing threats such as Arceus-Ghost with its priority pivoting and attack stat reduction, making it easier for teammates such as Ting-Lu to take hits from them; alternatively, Flip Turn provides a pivoting option unaffected by Taunt, Dark-types, and Magic Bounce. Heavy-Duty Boots, notably eases Dondozo's pivoting, while Covert Cloak protects it from status conditions from moves such as Nuzzle, Mortal Spin, and Magical Torque. Tera Fire improves Dondozo's matchup against Arceus-Fire with Grass-type coverage and lets it resist V-create and Magical Torque, whereas Tera Dark makes Dondozo immune to status moves from other Prankster users and improves its matchup against Ghost- and Dark-types. RegenVest Hisuian Goodra, Ting-Lu, and Fur Coat users synergize with Dondozo, covering threats such as Arceus-Fairy, Groudon, and Palkia-O.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TTTech", "user_id": 338877}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Flutter Mane": {
    "sets": [
      {
        "name": "Flare Boost",
        "description": "<p>Flame Orb + Flare Boost grants Flutter Mane a pseudo-immunity to crippling status like paralysis and poison while granting a power boost that cannot be removed by Knock Off. At +2, Flutter Mane is capable of 2HKOing even Ice Scales Arceus formes with Astral Barrage. Due to Flutter Mane's naturally low HP stat, Pain Split is an effective way to increase its longevity while notably annoying Chansey and being ineffective for Imposter users. Tera Fairy boosts Moonblast's damage while shedding Flutter Mane's Ghost weakness, making it useful against Knock Off and stray Ghost-type moves. Tera Ghost further boosts Astral Barrage, helping Flutter Mane break past walls like Calm Mind Ice Scales Arceus formes, and helps defensively against Dialga-O's Revelation Dance. Tera Steel prevents potential revenge killing from Iron Bundle's Boomburst and Koraidon's Gigaton Hammer, as well as resisting Dialga-O's Revelation Dance. Flutter Mane pairs very well with other special attackers, such as Palkia-O, Eternatus, and setup Arceus formes, that place heavy pressure on opposing special walls like Chansey and Ice Scales Dialga-O. Setup Arceus formes can also inflict Chansey with poison using Toxic or Mortal Spin, greatly increasing Flutter Mane's capability of stalling it out of recovery. Defensive pivots like Ting-Lu can provide entry hazard support, deny momentum from Chansey, and pivot Flutter Mane in safely. Paralysis support from the likes of Ting-Lu can also slow down the troublesome Zacian, which outspeeds and threatens Flutter Mane. Imposter-proof Flutter Mane with a special wall with a relatively low HP stat like Ice Scales Zacian, though your Chansey can also Imposter-proof it at the risk of providing Pain Split healing for the opposing Imposter.</p> "
      },
      {
        "name": "Pixilate",
        "description": "<p>Pixilate Flutter Mane takes advantage of the lack of sturdy Fairy-resistant special walls to fire off powerful Pixilate-boosted Boombursts. Volt Switch retains momentum, chips checks like Chansey and Ice Scales Zacian, and scouts Terastallization. Pain Split increases Flutter Mane's longevity while chipping Chansey for good damage. Trick is an alternative to cripple special walls like Chansey for teammates. Tera Fairy further boosts Boomburst's damage output, letting it 2HKO Ice Scales Zacian, as well as 2HKOing Ice Scales Dialga-O and Arceus formes after 1 layer of Spikes. Flutter Mane greatly appreciates Knock Off support from teammates like Ting-Lu to remove items like Assault Vest, Heavy-Duty Boots, and Chansey's Eviolite to enhance its offensive potential. Entry hazards and paralysis support from the likes of Ting-Lu and Dialga-O help chip down special walls into 2HKO range and neutralize faster threats like Zacian, respectively. Other special attackers like Palkia-O and Eternatus can capitalize on crippled special walls from Flutter Mane's Trick. Flutter Mane can be easily Imposter-proofed by your own Chansey, but a Ground-type like Ice Scales Arceus-Ground can deny momentum from the Imposter user's Volt Switch.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Iron Bundle": {
    "sets": [
      {
        "name": "Refrigerate",
        "description": "<p>Iron Bundle's niche lies in its good Speed and fair Special Attack, allowing it to outrun and chase out Koraidon and Flutter Mane. Refrigerate + Boomburst hits every relevant special wall for decent damage, notably OHKOing Ting-Lu after Spikes. Steam Eruption targets non-Desolate Land Arceus-Fire, which can otherwise tank Boomburst, and it also threatens to force extra chip damage on foes with a burn. Volt Switch maintains momentum against Iron Bundle's checks and helps rack up Spikes damage. Electro Drift 2HKOes Arceus-Water, Kyogre, and Eviolite Imposter users; alternatively, Trick can cripple switch-ins like Chansey, although it's ineffective against most Arceus. Iron Bundle's best fit is on balance teams, which can give it multiple opportunities to wallbreak and can keep it safe from entry hazards. Iron Bundle's damage output is relatively low compared to other special attackers like Flutter Mane and Palkia-O, even with Tera Ice, so entry hazard support from the likes of Zacian and Ting-Lu is highly recommended to break through walls like Ice Scales Dialga-O and Arceus. Iron Bundle's low bulk and vulnerability to paralysis mean that slow pivoting teammates, like Dialga-O and Ting-Lu, are recommended to get it on the field safely. Imposter-proof Iron Bundle with Chansey or an Ice Scales user like Zacian or Dialga-O.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Ting-Lu": {
    "sets": [
      {
        "name": "RegenVest",
        "description": "<p>RegenVest Ting-Lu is a reliable special wall and a premier momentum generator. Regenerator gives Ting-Lu reliable recovery without conflicting with Assault Vest. Nuzzle discourages dangerous attackers like Palkia-O from switching in. U-turn allows Ting-Lu to safely bring in teammates thanks to its low Speed. Stone Axe forces chip damage on foes, letting offensive teammates wallbreak more easily. Knock Off removes items like Heavy-Duty Boots and Covert Cloak, making Ting-Lu's own utility more effective; it also punishes Imposter users attempting to gain Regenerator. Ting-Lu fits best on balance teams, which appreciate its ability to spread paralysis and safely bring in teammates thanks to its huge bulk. Dangerous wallbreakers like Koraidon and Palkia-O help maximize the effectiveness of U-turn pivoting. Ting-Lu is unable to naturally check Palkia-O and Fairy-types like Flutter Mane, so a teammate that helps shore up this weakness, such as Arceus-Grass or Hisuian Goodra, is appreciated. Tera Fairy provides an immunity to Dragon, allowing Ting-Lu to block Dragon Energy from Palkia-O and Glaive Rush from Koraidon; alternatively, Tera Grass provides a Water resistance, covering for Palkia-O's Water Spout.</p> "
      },
      {"name": "Prankster"},
      {"name": "Magic Bounce"}
    ],
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Koraidon": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Koraidon is a premier wallbreaker thanks to its Speed and typing. Glaive Rush is immensely spammable and lacks consistent switch-ins outside of Fur Coat Dondozo and Zacian, and it's bolstered even further by Tera Dragon, which allows Koraidon to 2HKO Fur Coat Groudon and Arceus after Spikes. Mold Breaker is an alternative to Sword of Ruin that secures said 2HKOes without the need for Spikes, albeit at the cost of less damage against non-Fur Coat Pokemon. Close Combat nukes Slaking, Ting-Lu, and Corviknight. Gigaton Hammer threatens Zacian, Arceus-Fairy, and Enamorus, which are otherwise hard counters, and it also helps against Tera Fairy users like Groudon. Flip turn allows Koraidon to maintain momentum, helps scout Terastallization, and dents Groudon, whereas Toxic can benefit its team by forcing extra chip damage onto Fur Coat users. Koraidon's best fit is on balance and offense teams, as these give it multiple opportunities to wallbreak, and they easily take advantage of the passive walls it can't beat one-on-one, like Fur Coat Dondozo. Koraidon's mediocre defensive typing and vulnerability to status mean that slow-pivoting teammates, like Ting-Lu and Dialga-O, are recommended to bring it in safely; helpfully, Koraidon forces out Imposter users transformed into these pivots. Teammates that can limit opposing Strength Sap, like Chansey and Liquid Ooze users, help ensure that foes hit by Gigaton Hammer can't safely heal as Koraidon switches. To Imposter-proof Flip Turn sets, use bulky Fur Coat users that aren't weak to Koraidon's attacks, like Groudon or Arceus-Water, and Imposter-proof Toxic variants with Fur Coat Arceus-Poison or Prankster Corviknight.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  }
}