{
  "Charizard": {
    "sets": [
      {
        "name": "Special Attacker",
        "description": "<p>Charizard is a threatening special attacker with great typing and solid bulk. It also outspeeds a majority of the metagame's threats like Rotom-F, Houndoom, and non-Scarf Sawsbuck, which makes it even more difficult to deal with. Fire Blast can be slotted over Flamethrower for a more powerful STAB move, although there are accuracy problems for both of it STAB moves. Focus Blast is great coverage with the ability to OHKO the likes of Lycanroc-N, Alolan Persian, and Vigoroth, whereas its STAB moves do not. Tera Blast Steel can be picked over Focus Blast to target counters that Charizard struggles with like Carbink and Dachsbun. Will-O-Wisp helps cripple opposing physical attackers, which can safely come in on Charizard like Gabite, Vigoroth, and specially defensive Skuntank. However, Air Slash can be chosen over Will-O-Wisp for a more consistent Flying-type STAB alongside the somewhat inaccurate Hurricane. Tera Flying is for greatly boosting Hurricanes power, allowing it to pick up the 2HKO on bulky Gabite sets, Camerupt, and Dachsbun and the OHKO on the threatening Basculin. Defensively, Tera Dragon is the best choice for Charizard. It turns its weaknesses to Electric- and Water-type moves into resistances while still keeping its previous resistances to Grass and Fire and turning Rock-type moves turn into neutral hits. This allows it to take hits from its many threats like Raichu, Golduck, and Lycanroc-N. Tera Fire helps Flamethrower make up for the loss of power when chosen over Fire Blast, especially if it gets into Blaze range. It allows Charizard to 2HKO bulky Pokemon it otherwise wouldn't like Articuno and Tinkatuff. Deciding to Terastallize into either of its offensive types helps relieve its quad weakness to Rock, allowing it to live a hit from Gogoat, Gabite, and Alolan Persian.</p> <p>Special Charizard works well on balance and offensive teams that are looking for a fast and powerful attacker. Charizard does great when paired with a physical breaker like Perrserker, Basculin, or Lycanroc-N to help with the special walls like Carbink and Dachsbun that it struggles to get through. On the other hand, it does great at breaking through the physically defensive Pokemon that physical attackers like Perrserker, Gogoat, and defensive setup sweeper Carbink have trouble with such as Dartrix, Misdreavus, and Leafeon. Charizard appreciates being paired with the likes of Quaxwell, Mareanie, and Lumineon to take hits for it from Golduck, Basculin, and opposing Lumineon. Although, its most glaring issue is the 4x weakness to Rock, which Lycanroc-N, Dugtrio, and Gabite can take advantage of. There are also other Pokemon like Misdreavus, Gogoat, and Alolan Persian that can slot Rock-type moves to catch Charizard switching in. This is why Charizard appreciates the presence of Whiscash and its own Gabite to handle these issues. Charizard only has one full counter, which is Carbink, barring Tera Blast Steel; however, there are a few other options using Tera such as using Tera Steel Dachsbun, Tera Rock Misdreavus, and Tera Rock Gogoat that can check it in a pinch. Although, the likes of Gabite, Perrserker, and Golduck can help come in and remove them after they Terastallize. Skuntank, Sawsbuck, and Flapple appreciate Charizard for helping them handle Perrserker. It is also worth mentioning that it prefers to be on the same team as a Knock Off absorber like Alolan Persian or Skuntank, because losing Heavy-Duty Boots greatly impacts its longevity.</p> "
      },
      {
        "name": "Setup Sweeper",
        "description": "<p>With its excellent typing, coverage for nearly everything in PU, and a great Speed tier, Charizard is one of PU's most threatening sweepers. Dragon Dance gives a solid damage boost and also allows Charizard to outspeed common Scarf users after a boost, such as Flapple and Basculin; however, Swords Dance can be used instead, trading away extra Speed for more firepower. While Flare Blitz is the normal STAB move of choice for Charizard, Flame Charge can be used on Swords Dance sets, as it boosts Charizard's Speed and removes the recoil from Flare Blitz, although at the cost of being much weaker. Earthquake is valuable coverage, hitting Pokemon such as Carbink, Skuntank, and Lycanroc-N for super effective damage. Dragon Claw hits opposing Dragon-types such as Gabite and Tera Dragon Articuno for good damage, and Thunder Punch can deal solid damage into Water- and Flying-types such as Lumineon, Golduck, and opposing Charizard. Charizard's Tera Type is very adjustable; Tera Ground is normally preferred to resist Rock-type attacks from Pokemon such as Lycanroc-N, boost the power of Earthquake, and remove Charizard's weakness to the Electric-Type, while Tera Dragon allows for resistances to Water and Electric and should be used with Dragon Claw. Finally, Tera Electric should be used with Thunder Punch.</p> <p>Charizard's best partners are ones that can beat its offensive and defensive checks to open it up to set up and sweep easier. Wallbreakers such as Choice Band Basculin can help with the Ground-types that Charizard can struggle with. Grass-types such as Gogoat can threaten out Water- and Rock-types that would stop Charizard from setting up such as Basculin and Carbink. Articuno can U-turn to get Charizard in safely and checks the Dragon-types that would otherwise beat Charizard without Dragon Claw such as Gabite. In return, Charizard threatens out Steel-types that check Articuno. On Swords Dance sets, Sticky Web Masquerain can be a good partner, as it allows Charizard to beat the Choice Scarfers that normally outspeed and KO Swords Dance Charizard otherwise, such as Lycanroc-N.</p> "
      },
      {"name": "Mixed Dragon Dance"}
    ],
    "credits": {"writtenBy": [{"username": "sleid", "user_id": 601970}, {"username": "uhBella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "asa", "user_id": 400292}, {"username": "UberSkitty", "user_id": 355061}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Raichu": {"sets": [{"name": "Nasty Plot"}, {"name": "Choice"}]},
  "Dugtrio": {"sets": [{"name": "Swords Dance"}]},
  "Dugtrio-Alola": {"sets": [{"name": "Wallbreaker"}, {"name": "Choiced Attacker"}]},
  "Persian-Alola": {"sets": [{"name": "Pivot"}, {"name": "Nasty Plot"}]},
  "Golduck": {"sets": [{"name": "Rain Sweeper"}, {"name": "Choice Scarf"}]},
  "Electrode": {"sets": [{"name": "Pivot"}, {"name": "Rain Setter"}]},
  "Flareon": {"sets": [{"name": "Wish Passer"}]},
  "Articuno": {"sets": [{"name": "Defensive Pivot"}, {"name": "Offensive Pivot"}]},
  "Dragonair": {"sets": [{"name": "Dragon Dance"}]},
  "Ampharos": {"sets": [{"name": "Assault Vest"}]},
  "Murkrow": {"sets": [{"name": "Weather Setter", "description": "<p>Thunder Wave supports teammates that are still rather slow even under rain or sun like Beartic and Scovillain, respectively. Taunt denies entry hazards, recovery, and status moves. Haze neutralizes setup sweepers like Masquerain, Lilligant, and Hisuian Sliggoo.</p> <p>Sample set. Stay tuned for updates!</p> "}]},
  "Misdreavus": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Defensive Misdreavus is the glue that holds PU together because of its ability to deal with many of the strongest physical attacking presences in the metagame, such as Lycanroc-N, Alolan Dugtrio, and Perserkerr. It has a very strong type for this tier, with very few Pokemon able to hit it for super effective damage. It is also the best Rapid Spin blocker in PU because of this. Will-O-Wisp is great for crippling physical attackers like Lycanroc-N, Gabite, and Alolan Dugtrio. Choosing to run Thunder Wave over Will-O-Wisp can make dealing with Alolan Dugtrio and Gabite more difficult. With Misdreavus able to spread status so well, Hex is the best choice for its STAB move. Power Gem is quad effective against Articuno, Masquerain, and Charizard; it also hits other popular Pokemon like Houndoom, Pyroar, and Rotom-F for super effective damage. Thunderbolt can be opted for instead to better hit Water-types like Golduck, Lumineon, Basculin, and Quaxwell. Taunt is also an option over the two attacking moves to disallow setup sweepers such as Gogoat and Carbink from boosting in front of Misdreavus; it also works well at stopping entry hazard setters such as Carbink, Gabite, and Camperupt. The EV spread allows for better recovery with Pain Split by keeping Misdreavus's HP a bit lower than if 252 HP EVs were used while still keeping its overall bulk by adding the EVs taken from HP into both defensive stats. 56 Speed EVs let it out speed neutral natured Honchkrow and Flapple, as well as Timid Glimmet and uninvested Drakloak. Tera Fighting and Tera Fairy both work well to provide a resistance to Dark-type moves from Pokemon like Honchkrow and Alolan Perisan. Although, Tera Fighting leaves Misdreavus vulnerable to Flying-type moves from Articuno, Charizard, and Masquerain and Psychic-type moves from Rabsca and Indeedee-F. On the other hand, Tera Fairy leaves it vulnerable to Steel-type moves from Perrserker and Alolan Dugtrio. Tera Electric is great for boosting Thunderbolt and giving Misdreavus zero weaknesses with its ability. Tera Rock boosts Power Gem, letting it OHKO Charizard and Masquerain.</p> <p>Misdreavus works well on balance teams looking for a catch-all defensive Pokemon to deal with many of the metagame's top threats. It also works great on entry hazard stacking teams since it is not bothered by the top Rapid Spin user, Quaxwell. Misdreavus thrives when given teammates like Carbink, Daschbun, and Tinkatuff to deal with Dark-types such as Alolan Persian, Houndoom, and Skuntank. These same Dark-type threats, Alolan Persian, Houndoom, and Skuntank, can help deal with Ghost-type foes like Banette, Drakloak, and opposing Misdreavus. Specially defensive walls like Articuno, Carbink, and Tinkatuff form a nice core with Misdreavus since it can cover physical Pokemon that give them trouble, like Lycanroc-N, Perrserker, and Alolan Dugtrio. Knock Off absorbers and status absorbers are highly recommended to keep Misdreavus healthy enough to deal with all of these Pokemon. Status absorbers are the likes of RestTalk Gabite, Dragonair, and Zangoose, while Knock Off absorbers are usually Dark-types like Alolan Persian and Skuntank.</p> "
      },
      {
        "name": "Offensive",
        "description": "<p>Misdreavus is capable of becoming a fearsome sweeper while still retaining its defensive and utility properties, which allow it to switch into a wide range of threats and spinblock effectively. Calm Mind can be used with Draining Kiss and Tera Fairy to turn Misdreavus into a bulky wallbreaker that is difficult to wear down due to Misdreavus's great natural bulk, HP recovery from Draining Kiss, and immediate access to status moves. Tera Fairy is notable for preventing threats like Nasty Plot Alolan Persian from immediately threatening it, and its toolset lends it easy setup opportunities against Gabite, one of the best phazers in the metagame, as well as other passive targets like Dachsbun and Carbink. Alternatively, Nasty Plot can be used along with either Draining Kiss or Power Gem to make Misdreavus more immediately threatening, with Power Gem primarily targeting Fire-types like Pyroar and Houndoom that it would otherwise struggle with as well as specially defensive Articuno. Hex benefits greatly from Misdreavus's ability to spread status and can be amplified with additional status spreaders on the team; alternatively, Shadow Ball can be used on Nasty Plot sets for greater immediate damage output. Will-O-Wisp is useful for preventing targets like Skuntank and Honchkrow from revenge killing it before Terastallization as well as increasing its ability to take hits from Quaxwell. Thunder Wave is another option that cripples special walls like Articuno and opposing setup sweepers like Masquerain. Substitute can also be used as the last move to facilitate setup on forced switches and prevent Skuntank and Rotom-F from crippling it with Toxic or Trick, but it usually gets more value from spreading status. An alternative EV spread of 128 HP / 128 SpA / 252 Spe with a Timid nature can be used on Calm Mind variants for easier setup and more reliable spinblocking.</p> <p>Misdreavus's effectiveness at spinblocking naturally makes it a great fit on entry hazard stacking teams alongside setters like Whiscash, Carbink, and Masquerain as well as strong wallbreakers like Basculin and Rotom-F. Ground-types like Whiscash and Gabite can reliably switch into offensive checks like Alolan Dugtrio and Houndoom as well as Pokemon that may cripple Misdreavus with Thunder Wave or Encore, such as Tinkatuff and Raichu. Carbink can reliably switch into and deal with Dark-types like Houndoom and Alolan Persian that Nasty Plot variants in particular struggle with greatly before Terastallization, and it can also absorb Knock Off. Gogoat can form an effective bulky setup core with Misdreavus, as they deal with each other's checks, like Basculin and Gabite, respectively, and they pressure mutual targets like Articuno and Carbink better together. Thunder Wave users like Alolan Persian and Tinkatuff can facilitate sweeping for Misdreavus by powering up its Hex; the former can also bring it in safely with Parting Shot and ease the pressure of handling Perrserker, and the latter can create setup opportunities with Encore. In addition, both of these can situationally switch into Knock Off from Pokemon like Banette and opposing Tinkatuff.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "sleid", "user_id": 601970}, {"username": "rien", "user_id": 474994}], "teams": [{"name": "Quality checked by", "members": [{"username": "uhBella", "user_id": 567483}, {"username": "Hera", "user_id": 414072}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Dunsparce": {"sets": [{"name": "Stealth Rock"}]},
  "Sneasel": {"sets": [{"name": "Swords Dance"}]},
  "Houndoom": {"sets": [{"name": "Nasty Plot"}, {"name": "Choice Scarf"}]},
  "Pupitar": {"sets": [{"name": "Dragon Dance", "description": "<p>The investment in bulk lets Pupitar avoid being OHKOed by Raichu's Surf from full after Stealth Rock and makes Jolly Honchkrow's Night Slash only a 3HKO. 152 Speed EVs allow Pupitar to outrun Raichu at +2. Stone Edge is stronger than Rock Slide but has less PP and lower accuracy. Tera Dragon and Tera Water both patch up Pupitar's Water weakness, but the former also lets it resist Grass- and Electric-type attacks while the latter helps more against Ice-type attacks.</p> <p>Sample set. Stay tuned for updates!</p> "}]},
  "Masquerain": {
    "sets": [
      {
        "name": "Quiver Dance",
        "description": "<p>Masquerain functions as a threatening Quiver Dance sweeper thanks to its high-powered STAB attacks and extensive coverage, including rare access to Hydro Pump, which allow it to pressure opposing teams without being overreliant on Terastallization. Hydro Pump hits Charizard, Pyroar, and Carbink and, together with Hurricane, provides neutral coverage for the entire metagame. Tera Blast Steel lets Masquerain beat targets such as Carbink and Articuno reliably, as well as set up more easily on targets like Gogoat and Misdreavus that can otherwise threaten it with coverage. Alternatively, Tera Water boosts Hydro Pump's damage output further and improves its matchup against Fire-types like Charizard. Other coverage options include Ice Beam, which helps Masquerain reliably beat Gabite, and Bug Buzz, which gives Masquerain a more reliable STAB move that can threaten Dark- and Psychic-types like Alolan Persian and Indeedee-F and deal neutral damage to threats like Raichu.</p> <p>Masquerain appreciates teammates like Raichu, Electrode, Alolan Persian, and Lumineon that can bring it in safely with pivoting moves. Raichu can also notably use Tera Water or Tera Ice to check fast Electric-types like Choice Scarf Rotom-F and generate free switch-in and setup opportunities for Masquerain with Encore. Ground-types like Whiscash, Alolan Dugtrio, and Gabite can reliably switch into and threaten Tinkatuff, which can cripple Masquerain with Thunder Wave or Encore; Whiscash also greatly helps against Choice Scarf Lycanroc-N, which outspeeds and can revenge kill Masquerain after one boost, and facilitates wallbreaking with Spikes, while Masquerain and Alolan Dugtrio can set up on each other's checks. Grass-types like Gogoat can switch into some Electric-types like Electrode and Pokemon like Whiscash that may threaten Masquerain with Rock-type coverage; they also pressure Pokemon like Carbink better alongside Masquerain. In return, Masquerain can pressure targets like Charizard and Articuno depending on its Tera type. Indeedee-F can provide Masquerain with Healing Wish support, allowing it to attempt setup more than once in a game, as well as Psychic Terrain to prevent priority users like Skuntank and Honchkrow from revenge killing Masquerain if it has already Terastallized.</p> "
      },
      {
        "name": "Sticky Web Lead",
        "description": "<p>With its combination of a good Speed tier, Intimidate, and solid offensive capability after setting Sticky Web, Masquerain is PU's premier Sticky Web lead. Hurricane is Masquerain's normal STAB move of choice, allowing it to hit Pokemon such as Gogoat and opposing Masquerain for good damage. However, Bug Buzz can be used instead, hitting mostly the same targets as Hurricane and being more accurate at the cost of power. Hydro Pump is coverage for Fire-types such as Charizard and Carkol, as well as Carbink and Alolan-Dugtrio, although Surf can be used instead of Hydro Pump, trading off power for accuracy. Masquerain's fourth moveslot is very flexible; U-turn can be used to pivot into a partner Pokemon after setting up Sticky Web and Quiver Dance can make Masquerain more offensively threatening after setting up Sticky Web. Ice Beam can OHKO Dartrix and Gabite, but it is hard to fit, as Masquerain normally finds more usage out of U-turn and Quiver Dance. Masquerain can Terastallize into the Ghost type to prevent spinners such as Quaxwell and Carkol from removing its Sticky Web. Masquerain can also run Heavy-Duty Boots to ease Sticky Web setup later in the game at the cost of being a less effective lead, as well as run Tera Steel for easier setup with Quiver Dance if spinblocking is not a concern.</p> <p>Masquerain's most common teammates are ones that take advantage of Sticky Web slowing down their grounded offensive checks, so wallbreakers such as Swords Dance Zangoose, Squawkabilly, and Choice Band Basculin-B are great partners. Ghost-types such as Misdreavus and Banette spinblock for Masquerain to keep Sticky Web on the field, and Sticky Web allows them to spread status more easily to normally faster threats such as opposing Basculin-B. Electric- and Rock-types such as Raichu and Choice Scarf Lycanroc-N help deal with the Flying-types that annoy Masquerain and its teammates, such as Rotom-S, as they are immune to Sticky Web.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "rien", "user_id": 474994}, {"username": "uhBella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "gum", "user_id": 434150}, {"username": "Hera", "user_id": 414072}]}, {"name": "Grammar checked by", "members": [{"username": "asa", "user_id": 400292}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Vigoroth": {"sets": [{"name": "Bulk Up"}]},
  "Swalot": {"sets": [{"name": "Defensive"}]},
  "Camerupt": {"sets": [{"name": "Specially Defensive"}, {"name": "Trick Room Attacker"}]},
  "Grumpig": {"sets": [{"name": "Nasty Plot", "description": "<p>136 Speed EVs let Grumpig outspeed Modest Glaceon. 44 SpA EVs allow unboosted Tera Ground Grumpig to KO offensive Skuntank with Earth Power after Stealth Rock damage.</p> <p>Sample set. Stay tuned for updates!</p> "}]},
  "Zangoose": {
    "sets": [
      {
        "name": "Toxic Boost",
        "description": "<p>Zangoose is a high risk, high reward physical breaker capable of tearing through walls if it predicts correctly, but is punished severely by Toxic damage and entry hazards if it doesn't. Close Combat hits Steel-types like Perserrker and Tinkatuff that could come in on Facade, as well as being its best tool against Carbink. Night Slash catches Ghost-types like Misdreavus and Banette that would otherwise switch into Zangoose safely and punishes Tera Ghost from Pokemon like Gabite and Whiscash. Quick Attack lets Zangoose kill fast Pokemon like Charizard, Raichu, and Choice Scarf Rotom-F. Swords Dance turns Zangoose into an even more powerful breaker, OHKOing foes like Tinkatuff and Dachsbun at +2, at the cost of being unable to deal with faster Pokemon, making it a good choice against bulkier teams that lack faster Pokemon. Protect lets Zangoose scout Choice Scarf users like Lycanroc-N and Rotom-F as well as consistently activate Toxic Orb, but it is much less consistent overall than the other two options. Toxic Orb is the only item that can activate Toxic Boost on Zangoose, which pairs wonderfully with Facade. Tera Normal gives Zangoose a solid boost of power on Facade and Quick Attack, which is especially useful on sets lacking Swords Dance. It also gives Zangoose an easier time KOing frail, faster Pokemon like Pyroar and Houndoom.</p> <p>Zangoose suffers heavily from the chip damage it accrues, so ways to mitigate this are helpful. Dachsbun is useful for its ability to pass Wish to Zangoose, helping it stay alive and break for a longer time; it is also useful for coming in on Pokemon that force Zangoose out like Alolan Persian and Choice Scarf Lycanroc-N. Fast Taunt users like Electrode and Pyroar can prevent entry hazards from foes like Perserrker and Tinkatuff, limiting the amount of chip damage that Zangoose takes. Electrode can also bring Zangoose in on its checks, like Gogoat and Dunsparce, to help it break. Offensive partners like Sawsbuck and Indeedee-F can help Zangoose overwhelm shared checks like Misdreavus and Tinkatuff, and Indeedee-F's Healing Wish is useful for giving Zangoose more chances to break, although Psychic Terrain from Indeedee-F pairs poorly with Zangoose's Quick Attack. Zangoose also benefits heavily from Sticky Web from Pokemon like Spidops and Masquerain, as being able to outspeed Choice Scarf users like Golduck and other fast Pokemon like Alolan Dugtrio is a massive boon for it.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Hera", "user_id": 414072}], "teams": [{"name": "Quality checked by", "members": [{"username": "asa", "user_id": 400292}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Whiscash": {"sets": [{"name": "Defensive"}]},
  "Banette": {"sets": [{"name": "Swords Dance"}]},
  "Vespiquen": {"sets": [{"name": "Spikes"}]},
  "Honchkrow": {"sets": [{"name": "Moxie Sweeper"}, {"name": "Special Attacker"}]},
  "Skuntank": {
    "sets": [
      {
        "name": "Physically Offensive",
        "description": "<p>Skuntank hosts powerful STAB options, priority, and an array of status moves, making it a great offensive threat and support Pokemon. Furthermore, Skuntank's great defensive typing makes it a solid switch-in for foes like Gogoat and Indeedee-F. Crunch is Skuntank's best way to hit targets such as Misdreavus and Indeedee-F, but if instead running only two attacks, Skuntank can use Poison Jab over Gunk Shot for a reliable attack alongside Sucker Punch. Taunt can stop moves from slower foes that may try to abuse or cripple Skuntank such as Tinkatuff's Thunder Wave, Carbink's Iron Defense or Trick Room, as well as entry hazards from both. Toxic is another way to threaten bulky threats like Misdreavus if not running Crunch, Carbink, Gogoat, and Alolan Persian. Toxic Spikes punishes foes that don't hold Heavy-Duty Boots such as Gabite and Choice item Basculin, although it can be less reliable with the abundance of Heavy-Duty Boots in the metagame. If Skuntank is no longer needed, Aftermath allows it to punish contact moves from foes like Honchkrow and Flapple. Tera Dark makes Sucker Punch a more reliable revenge killing option while further boosting Crunch's damage. Tera Ground allows Skuntank to serve as a Volt Switch blocker and pairs well with Tera Blast to hit opposing Skuntank and Tinkatuff. Tera Flying can lure Ground moves like Charizard and Dugtrio's Earthquake to more easily pick them off in addition to removing Skuntank's weakness to Ground.</p> <p>With Skuntank only weak to Ground-types like Whiscash, allies that can absorb Ground-type attacks such as Gogoat, Flapple, and Rotom-F come in handy. Whiscash also makes a good partner to help with threats like Alolan Dugtrio and Tinkatuff, while Skuntank can deal with said Grass-types. Skuntank's Toxic and Toxic Spikes pair well with bulky Pokemon like Dachsbun and Articuno to stall out foes. Dachsbun's Wish also helps with longevity, while Articuno can absorb Ground attacks. Misdreavus is a notably great teammate, as it offers a Ground immunity, can cripple threats such as Gabite and Perrserker with Will-O-Wisp, and can spinblock. Misdreavus can also run Hex to benefit from any poisoned foes. Item removal, such as Banette's Knock Off and Indeedee-F's Trick, can get rid off foes' Heavy-Duty Boots to benefit Toxic Spikes. Indeedee-F can also help with Skuntank's longevity via Healing Wish, although it is notable that its Psychic Surge temporarily hinders Skuntank's Sucker Punch. While being the best Toxic Spikes setter, Skuntank is also the best way to remove Toxic Spikes with the lack of hazard removal in the metagame. This is appreciated by non-Heavy-Duty Boots Pokemon like Gabite and Assault Vest Crabominable.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<p>While Skuntank's Special Attack isn't inherently good, Nasty Plot and a decent special movepool help to make it a potent wallbreaker or sweeper. Skuntank's solid bulk and defensive typing can give it several opportunities to set up on common foes, like Gogoat and Choice-locked Indeedee-F, and give it a notable niche over other Dark-type Nasty Plot users like Houndoom and Alolan Persian. Running a special set also allows Skuntank to lure in physical walls such as Tinkatuff and Will-O-Wisp Misdreavus. Fire Blast rounds out Skuntank's offensive coverage to hit remaining threats like Articuno and the previously mentioned Tinkatuff. Tera Ground with Tera Blast can be run instead to hit foes like Camerupt, Raichu, and opposing Skuntank harder, albeit at the cost of being more reliant on Terastallization. Otherwise, Tera Dark is preferred, as it helps make up for Dark Pulse's sometimes underwhelming power. Terastallizing also removes Skuntank's Ground weakness, giving it an easier time against Whiscash and Gabite. Heavy-Duty Boots and Leftovers both help with Skuntank's longevity, giving it more chances to set up and sweep.</p> <p>Since Skuntank's Speed is average, it appreciates teammates that can lower foes' Speed such as Sticky Web Masquerain and Thunder Wave Tinkatuff and Misdreavus. Masquerain can also give Skuntank chances to set up thanks to Intimidate and U-turn, as well as Tinkatuff with Encore. Other pivots such as Lumineon and Rotom-F can help bring in Skuntank safely for setup opportunities, especially alongside their support moves in Encore, Will-O-Wisp, and Trick. This can also be accomplished by Memento users such as Alolan Dugtrio. Skuntank pairs well with other setup move users such as Bulk Up Gogoat and Dragon Dance Flapple, being able to wallbreak or clean for one another based on the matchup. Skuntank can also absorb Toxic and Will-O-Wisp for them, while, in return, they help against Ground-types such as Whiscash and Gabite, which can stop Skuntank from sweeping. Pokemon like Raichu and Lycanroc-N can also help lure in and wear down opposing Ground-types throughout the match. Psychic-types like Indeedee-F and Rabsca benefit from Skuntank's matchup against foes like Misdreavus and physical Skuntank. Furthermore, Indeedee-F's Healing Wish can give Skuntank a second chance to sweep, while Psychic Surge hinders Honchkrow's Sucker Punch and Spidop's First Impression. Finally, entry hazard setters such as Gabite and Carbink can help wear down foes for Skuntank and appreciate it removing Toxic Spikes.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Skuntank's utility options and above-average Speed make it a solid Choice Scarf user and glue that is very easy to add onto a team. While barely outsped by other Choice Scarf users like Indeedee-F and Rotom-F, Skuntank still outspeeds and revenge kills prominent threats such as Houndoom, Choice Scarf Flapple, and +1 Quiver Dance Masquerain. Gunk Shot helps make up for Skuntank's underwhelming offensive stats and pairs well with Crunch for great neutral coverage. Skuntank can utilize its Speed to Toxic fast bulky foes like Alolan Persian and walls like Whiscash, Misdreavus, and Terastallized Gogoat. Skuntank's Speed can also help it set up Toxic Spikes as soon as possible, although neither Toxic nor Toxic Spikes are optimal moves to be Choice-locked in to. Memento provides momentum if Skuntank is not needed anymore, being able to bring in teammates that are frail or can take advantage of the foe to set up. Foul Play is another option to hit strong physical attackers like Lycanroc-N and Perrserker, even OHKOing Dugtrio. Tera Dark powers up Skuntank's Dark STAB moves, and Tera Flying makes it immune to Ground-type attacks like Alolan Dugtrio's Earthquake.</p> <p>Bulky Water-types like Whiscash and Quaxwell appreciate Skuntank's Grass resistance and are good against its common switch-ins such as Tinkatuff, Gabite, and Carbink. Whiscash can also provide entry hazards, while Quaxwell can remove them while also benefiting from Skuntank removing Toxic Spikes. Due to Skuntank being one of the slower Choice Scarf users, priority move users like Basculin and paralysis spreaders like Tinkatuff provide additional speed control. This is especially helpful due to the presence of common faster sweepers like Rain Dance Golduck and +1 Dragon Dance Charizard. Defensive checks to these sweepers are also recommended such as Lumineon and Gabite, respectively. Setup sweepers like Quiver Dance Masquerain, Nasty Plot Raichu, and Swords Dance Alolan Dugtrio greatly benefit from Skuntank's Memento giving them a chance to set up. Alternatively, they can serve as wallbreakers, while Skuntank cleans up the match afterwards. Frail teammates such as Pyroar and Zangoose also appreciate Memento for a safe switch in. Likewise, pivots such as Raichu and Perrserker can bring in Skuntank more safely.</p> "
      },
      {"name": "Specially Defensive"}
    ],
    "credits": {"writtenBy": [{"username": "UberSkitty", "user_id": 355061}], "teams": [{"name": "Quality checked by", "members": [{"username": "rien", "user_id": 474994}, {"username": "uhBella", "user_id": 567483}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "berry", "user_id": 226455}]}]}
  },
  "Gabite": {
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<p>Gabite's good Eviolite-bolstered bulk and defensive typing make it a premier Stealth Rock user and an effective check to threats like Skuntank, Raichu, and Lycanroc-N. With its decent Attack and STAB Earthquake + Dragon Tail, Gabite is deceptively hard to switch into and exploit, which gives it an easier time setting Stealth Rock and negating offensive pressure. Rough Skin adds to the support Gabite provides, helping it further wear down physical threats like Basculin and Zangoose for its teammates to finish off. Stone Edge nails Charizard and Articuno and also hits Rotom-F. Dragon Tail is useful against setup sweepers like Gogoat and Tera Fighting Carbink, but Gabite can use Swords Dance instead to double as a bulky wallbreaker. The investment in bulk lets Gabite avoid the 2HKO from Lycanroc-N's Play Rough after Stealth Rock and Charizard's Hurricane at full. 28 Speed EVs allow Gabite to outspeed defensive Misdreavus. Tera Ghost helps against Normal-types like Zangoose and Squawkabilly, provides an immunity to Carbink's Body Press, and lets Gabite spinblock. Tera Fairy is another option that staves off Dark- and Dragon-types like Alolan Persian and Flapple. Alternatively, Tera Steel offers useful resistances like Ice, Flying, and Grass and also lets Gabite come in freely on Toxic and Toxic Spikes.</p> <p>Because of its unique blend of offense and defense, Gabite fits well on multiple playstyles. Ice-types like Rotom-F and Articuno are the biggest threat to Gabite and must be accounted for when using it. Charizard, Rotom-F, and Carbink are checks to such Pokemon and appreciate having their switch-ins worn down by Stealth Rock, with Charizard and Carbink also offering Gabite backup against Grass- and Fire-types, respectively. If Carbink runs Spikes, it can even form an entry hazard stacking core with Gabite. Pyroar is another option for checking Ice-types that also pressures Tera Fairy Misdreavus, which is really good at exploiting Gabite, and appreciates Gabite coming to its aid against threats like Alolan Dugtrio and Lycanroc-N. Wallbreakers that struggle against Steel-types, such as Indeedee-F and Honchkrow, benefit from Gabite's presence and can also check Misdreavus for it. Cleaners and revenge killers like Electrode and Choice Scarf Basculin love being paired with Gabite, since its ability to effortlessly spread chip damage can give them an easier time picking foes off.</p> "
      },
      {
        "name": "RestTalk",
        "description": "<p>Gabite can opt to run a RestTalk set due to its great bulk and phazing ability. This set helps give Gabite longevity in its phazing role because of its recovery option, which also helps it handle its checks with greater ease. Dragon Tail helps with removing setup sweepers or passive Pokemon that Gabite can't deal with such as Gogoat, Misdreavus, or Vigoroth. However, its phazing ability is also impactful when there are entry hazards on the opponent's field. Rest gives Gabite recovery, while Sleep Talk keeps it from being too passive. 28 Speed allows it to outspeed non-invested Misdreavus, while 116 Special Defense makes Special Charizard's Hurricane a 3HKO. It still has enough physical bulk for Lycanroc-N's Play Rough to only be a 3HKO after Stealth Rock damage. Gabite has the ability to turn into a spinblocker with Tera Ghost, making it an option to keep its team's hazards stay on the field. Tera Fairy helps cover its Dragon-type weakness, which Dragonair and Flapple can exploit, while also providing it a resistance to the strong Dark-types in PU like Alolan Persian, Skuntank, and Houndoom. Tera Steel turns all of its weaknesses into resistances, but be aware of threats it normally can deal with becoming a problem like Alolan Dugtrio, Lycanroc-N, and opposing Gabite.</p> <p>RestTalk Gabite works best on balance and entry hazard stacking teams. Gabite can also fill the role of status absorber, able to take Misdreavus's or Charizard's Will-O-Wisp, Skuntank's Toxic, and Alolan Persian and Tinkatuff's Thunder Wave. It lacks the ability to be a heavy damage dealer with this set, so Pokemon that can hit it super effectively don't have much trouble coming in on it. The likes of Quaxwell, Mareanie, and Lumineon are appreciated for helping take what would be 4x super effective Ice-type attacks from Whiscash, Golduck, and Crabominable. In return, Gabite helps them with an Electric immunity from the likes of Raichu and Rotom-S. Tinkatuff and Perrserker can also help with these threats as well as covering Gabite's other issues with Flapple and Dragonair. Gabite does well at coming in on the premier Fire-type attackers in the tier: Charizard, Pyroar, and Houndoom. Offensive teammates such as Gogoat, Sawsbuck, and Nasty Plot Rotom-F appreciate its presence on their team as a switch-in for the aforementioned Fire-types, or else they struggle to set up. With many of the tier's top Pokemon having a 4x weakness to Rock, such as Articuno, Charizard, and Masquerain, Gabite can pair well with them, because it walls the likes of Lycanroc-N and Dugtrio which typically carry Rock coverage.</p> "
      },
      {"name": "Swords Dance"}
    ],
    "credits": {"writtenBy": [{"username": "asa", "user_id": 400292}, {"username": "sleid", "user_id": 601970}], "teams": [{"name": "Quality checked by", "members": [{"username": "rien", "user_id": 474994}, {"username": "uhBella", "user_id": 567483}, {"username": "asa", "user_id": 400292}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Lumineon": {"sets": [{"name": "Defensive Pivot"}]},
  "Leafeon": {"sets": [{"name": "Wish", "description": "<p>X-Scissor hits opposing Grass-types like Flapple and Gogoat; if these Pokemon aren't a concern, Leafeon can run Yawn to force switches, Leech Seed for additional recovery, or Swords Dance to make up for its relative passivity.</p> <p>Sample set. Stay tuned for updates!</p> "}]},
  "Glaceon": {"sets": [{"name": "Calm Mind"}, {"name": "Choice Specs"}]},
  "Rotom-Frost": {"sets": [{"name": "Offensive Pivot"}, {"name": "Choice Scarf"}]},
  "Rotom-Fan": {"sets": [{"name": "Pivot"}, {"name": "Choice Scarf"}]},
  "Basculin": {"overview": "<p>Note: Despite the two variants being very similar, Basculin-Blue-Striped is generally considered superior due to having access to two viable abilities (Adaptability and Rock Head), which makes it harder for your opponent to predict which set you're using.</p> ", "sets": [{"name": "Adaptability"}, {"name": "Choice Specs"}]},
  "Sawsbuck": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Scarf"}]},
  "Beartic": {"sets": [{"name": "Rain Sweeper"}]},
  "Quilladin": {"sets": [{"name": "Defensive Spikes", "description": "<p>Stone Edge threatens Fire- and Flying-types like Charizard, Vespiquen, and Honchkrow. Poison Jab prevents Quilladin from being walled by opposing Grass-types, such as Gogoat and Lilligant. Leech Seed offers additional recovery and decreases how often Quilladin needs to use Synthesis. Tera Rock helps against the aforementioned Fire- and Flying-types on top of powering up Stone Edge, but Tera Ghost can be used instead for spinblocking.</p> <p>Sample set. Stay tuned for updates!</p> "}]},
  "Frogadier": {"sets": [{"name": "Choice Scarf"}]},
  "Pyroar": {"sets": [{"name": "Special Attacker"}, {"name": "Choice"}]},
  "Gogoat": {
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Gogoat is a solid defensive wincon, able to boost past special threats like Indeedee-F and Charizard late-game thanks to its great special bulk, usage of Terastallization, and recovery in Horn Leech and Milk Drink. It is also a solid switch-in to Water-types like Whiscash and Basculin, comfortably taking their STAB moves and threatening to OHKO them or set up. Bulk Up is what lets Gogoat become so threatening late-game, letting it take on physical attackers like Perserrker and Sawsbuck after a Bulk Up or two. Rock Slide is optimal coverage alongside Horn Leech, hitting Grass-type checks like Charizard, Honchkrow, and Articuno. Heavy-Duty Boots lets Gogoat ignore entry hazards, namely the otherwise debilitating Toxic Spikes. Water is the premier Tera type due to its overall defensive utility, reversing Gogoat's Fire weakness and making it take Flying- and Bug-type attacks more easily, which lets it set up on various foes it could not before such as Charizard, Rabsca, and Camerupt. However, Tera Rock gives Gogoat STAB on Rock Slide while still having it resist Fire and Flying, but it becomes vulnerable to Ground- and Steel-types like Gabite and Perrserker. Both Tera types keep Gogoat's usefulness as a Grass-type check due to Sap Sipper.</p> <p>Before Terastallizing or setting up, Gogoat is threatened by common offensive Pokemon like Charizard, Pyroar, and Rotom-F, so additional special walls like Carbink and Ampharos are recommended as partners. Carbink can also set entry hazards to wear down Gogoat's checks like Gabite and Tinkatuff, while Ampharos can bring Gogoat in with Volt Switch. Pokemon like Basculin and Alolan Dugtrio appreciate having a Pokemon that can come in on Electric- and Grass-types like Raichu and Leafeon. Misdreavus is particularly annoying for Gogoat, able to cripple it with Will-O-Wisp + Hex and use it at setup bait, so ways to dispose of or significantly weaken Misdreavus are appreciated. Wallbreakers like Nasty Plot Skuntank, special Honchkrow, and Indeedee-F can threaten Misdreavus while not caring about Will-O-Wisp, while paralysis from Tinkatuff and Alolan Persian can help Gogoat brute force its way past Misdreavus.</p> "
      },
      {"name": "Choice Band"},
      {"name": "Assault Vest"}
    ],
    "credits": {"writtenBy": [{"username": "Hera", "user_id": 414072}], "teams": [{"name": "Quality checked by", "members": [{"username": "rien", "user_id": 474994}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Carbink": {
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<p>Carving out a niche for itself as an entry hazard setter with good matchups against common threats such as Charizard and Articuno, Carbink is easily able to exploit the fact that many common offensive Pokemon will struggle to OHKO it, making entry hazards on the opponent's side of the field nearly guaranteed. Body Press further takes advantage of Carbink's naturally high Defense by allowing it to deal modest damage, especially to frail attackers such as Pyroar or Steel-types that may try to switch in, such as Perrserker or Alolan Dugtrio, although its reliance on Body Press to not be immensely passive can invite in opposing Misdreavus or other Pokemon that may choose to utilize Tera Ghost. Power Gem allows for Carbink to target common Pokemon in the tier that have a large Rock weakness, such as Charizard, Articuno, Masquerain, and Vespiquen, while also insuring that it is not entirely helpless against the aforementioned Misdreavus. Spikes allows Carbink to be of greater assistance to more fast-paced offensive teams, further exploiting its natural bulk to apply even more pressure to the opponent in the form of entry hazards. Rest allows for Carbink to somewhat make up for its lack of recovery, which helps it to still be a threat later in the game and to set hazards back up if they are removed. Lastly, Iron Defense allows Carbink to become a threatening sweeper by making it even more difficult to break through while also greatly increasing the damage done by Body Press. Heavy-Duty Boots helps Carbink by making it immune to opposing hazards, greatly increasing its longevity, while Leftovers allows for a small amount of passive recovery. Tera Fighting increases the damage of Body Press even further, while Tera Ghost allows for Carbink to block attempts at using Rapid Spin to clear away hazards. A more physically defensive spread of 248 HP / 252 Def / 8 SpD with a Bold nature is also viable to improve Carbink's matchup against threats such as Gogoat and Dugtrio.</p> <p>Carbink's high success rate when it comes to setting up entry hazards is greatly appreciated by almost all teams, especially those that make use of setup sweepers like Dragon Dance Charizard or powerful breakers like Zangoose, which greatly benefit from the extra chip damage that Carbink provides. In addition, Grass-types such as Gogoat and Thwackey appreciate Carbink's ability to take hits from the multitude of powerful Fire-types in the tier. Thwackey is also one of the few Pokemon in PU with access to Knock Off, which is valuable for removing Heavy-Duty Boots from opponents and making Carbink's hazards much more difficult to manage. Furthermore, Grassy Terrain lessens the damage dealt by Earthquake and provides Carbink with passive recovery, which is especially beneficial should it choose to run Heavy-Duty Boots. In return, these Pokemon are strong answers to Water-types such as Whiscash and Golduck that can solidly threaten Carbink with super effective attacks. Carbink also appreciates strong Ground- and Fire-types, such as Dugtrio, Charizard, and Pyroar, that can handle threatening Steel-types such as Perrserker and Alolan Dugtrio for it. Due to Carbink being extremely slow and vulnerable to moves such as Taunt and Encore, fast teammates such as the aforementioned Dugtrio, as well as Alolan Persian and Raichu, are also appreciated to handle attempts to stifle Carbink alongside providing much-needed speed control.</p> "
      },
      {"name": "Iron Defense"}
    ],
    "credits": {"writtenBy": [{"username": "Melt Gibson", "user_id": 617840}], "teams": [{"name": "Quality checked by", "members": [{"username": "asa", "user_id": 400292}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Dartrix": {"sets": [{"name": "Defog"}]},
  "Crabominable": {"sets": [{"name": "Assault Vest"}, {"name": "Bulk Up"}, {"name": "Trick Room Attacker"}]},
  "Lycanroc-Midnight": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Lycanroc-N makes for a fantastic cleaner and wallbreaker with No Guard + STAB Stone Edge and great coverage. Close Combat hits Steel-types like Perrserker and Alolan Dugtrio and Normal-types like Zangoose and Sawsbuck. Rock Blast is a great way of getting around Substitute from the likes of Articuno and Rotom-F while preventing Focus Sash Masquerain from setting up Sticky Web. Play Rough hits Gabite, which makes for an otherwise great Lycanroc-N check, while Iron Head nails Carbink. With a Choice Scarf, Lycanroc-N outspeeds threats like Alolan Persian and Pyroar. Tera Rock and Tera Fighting both boost Lycanroc-N's most spammable moves. Tera Fighting also allows Lycanroc-N to resist Sucker Punch from the likes of Honchkrow and Skuntank.</p> <p>Lycanroc-N is checked by Pokemon that resist Rock like Gabite, Tinkatuff, and Whiscash, so Pokemon that can weaken these checks like Zangoose and Basculin make for great offensive partners. As a Choice Scarf cleaner, Lycanroc-N appreciates entry hazard support from the likes of Whiscash and Carbink to more easily put foes in range of its moves. When locked into an undesirable move, Lycanroc-N appreciates defensive teammates to fall back on like Articuno and Perrserker, which can also provide momentum with U-turn for Lycanroc-N to safely hit the field.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Togkey", "user_id": 400664}], "teams": [{"name": "Quality checked by", "members": [{"username": "uhBella", "user_id": 567483}, {"username": "gum", "user_id": 434150}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Mareanie": {"sets": [{"name": "Defensive"}]},
  "Thwackey": {"sets": [{"name": "Choice"}]},
  "Carkol": {"sets": [{"name": "Rapid Spin"}]},
  "Flapple": {"sets": [{"name": "Choice Band"}, {"name": "Choice Scarf"}, {"name": "Choice Specs"}, {"name": "Dragon Dance"}]},
  "Perrserker": {
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<p>Perrserker carves a solid niche in PU by being a Stealth Rock setter with solid offensive capability after setting Stealth Rock, being the only setter in the tier that can pivot with U-turn, and having a great ability. Close Combat is good coverage, hitting Pokemon such as Zangoose, Dunsparce, and opposing Perrserker for super effective damage. Perrserker's item slot is interchangeable; Leftovers can be used for consistent recovery, while Heavy-Duty Boots allows Perrserker to switch in more often when entry hazards such as Spikes are on the field. Likewise, Perrserker's Tera type is also flexible. Tera Dragon can be used to gain a resistance to Fire-type attacks that would otherwise scare out Perrserker, letting it better deal with Pokemon such as Charizard, as well as being a generally good defensive type. However, Tera Water does the same, exchanging a bad matchup against Dragon-types such as Gabite for one against Electric- and Grass-types such as Raichu, Electrode, and Flapple.</p> <p>Perrserker's best teammates are ones that appreciate having Stealth Rock set up and being able to enter the game safely. As such, strong sweepers that stuggle to switch in safely otherwise such as Quiver Dance Masquerain, Swords Dance Charizard, and Zangoose are excellent partners. Fire- and Ground-type switch-ins such as Carbink, the aforementioned Charizard, and Gabite are also good partners. Electric-types such as Ampharos, Raichu, and Electrode can create a threatening VoltTurn combination with Perrserker. Pokemon such as Gabite and Pyroar appreciate having Perrserker come in on Pokemon that would normally threaten them out, such as Articuno, Lycanroc-N Choice-locked into Stone Edge, and Daschbun, and force them to switch out while setting Stealth Rock to support the rest of its teammates.</p> "
      },
      {"name": "Offensive"}
    ],
    "credits": {"writtenBy": [{"username": "uhBella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "Hera", "user_id": 414072}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Falinks": {"sets": [{"name": "No Retreat"}, {"name": "Choice"}]},
  "Pincurchin": {"sets": [{"name": "Specially Defensive"}]},
  "Stonjourner": {"sets": [{"name": "Stealth Rock"}, {"name": "Double Dance"}]},
  "Indeedee-F": {
    "sets": [
      {
        "name": "Choice",
        "description": "<p>Indeedee-F's combination of a solid Speed tier with Choice Scarf, synergistic ability in Psychic Surge allowing it to block priotity moves and boosting its Psychic-type attacks, and a strong STAB combination allow it to become one of PU's best revenge killers and wallbreakers. Trick allows Indeedee-F to debilitate walls that would otherwise wall it, such as Tinkatuff and Misdreavus. Psyshock hits Special Walls such as Articuno and Lumineon harder due to their weaker physical bulk, but Psychic can be used instead, as it does more damage to more physically bulky Pokemon such as Perrserker and Gabite. Indeedee-F's last two moveslots are very flexible; Hyper Voice provides a strong alternative STAB move which also allows Indeedee-F to damage Dark-types such as Houndoom. Tera Blast provides a STAB move before Terastallizing and can be used with a Ground or Fairy Tera to allow Indeedee-F to hit Steel-types and Dark-types that would normally check it such as Perrserker, Tinkatuff, and Skuntank; however, it is weaker than Hyper Voice. Healing Wish can sacrificially and allow a partner Pokemon to come back in healthy after it has been damaged, building momentum. Indeedee-F can also viably run Tera Psychic, boosting up its Psychic-type attacks even further. Indeedee-F's preferred item is Choice Scarf, which allows it to act as a solid revenge killer against threats such as Alolan Persian and Zangoose, aswell as outspeeding other Choice Scarf users such as Skuntank, Lycanroc-N, and Honchkrow. Alternatively, Indeedee-F can opt for a Choice Specs set that allows it to be very powerful, enabling to OHKO or 2HKO the majority of the tier.</p> <p>Indeedee-F's main flaws are having issues breaking through common Steel- and Dark-types such as Tinkatuff and Skuntank if it does not want to Terastallize, or a teammate had previously Terastillized and it's difficult to get in safely. As such, Pokemon like Dugtrio, Charizard, and Carbink are excellent partners. Dugtrio in particular is an excellent partner, as with Indeedee's Psychic Terrain it does not fear getting revenged killed from priority from Basculin's Aqua Jet and Zangoose's Quick Attack. U-turn and Volt Switch from Pokemon such as Articuno and Ampharos can give Indeedee-F a free switch in the battle. Sticky Web Masquerain can be used with Choice Specs variants to help with the lackluster speed. Pokemon that struggle against walls, like Golduck, appreciate Choice Specs Indeedee-F breaking through bulkier foes like Articuno and Gogoat. Pokemon normally easily revenged killed by priority such as Pyroar and the aforementioned Dugtrio appreciate having Indeedee-F help keep their HP high with Healing Wish as well as setting up Psychic Terrian.</p> "
      },
      {"name": "Calm Mind"}
    ],
    "credits": {"writtenBy": [{"username": "uhBella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "Hera", "user_id": 414072}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Drakloak": {"sets": [{"name": "RestTalk"}, {"name": "Offensive Pivot"}]},
  "Calyrex": {"sets": [{"name": "Double Dance"}]},
  "Quaxwell": {"sets": [{"name": "Rapid Spin"}]},
  "Spidops": {"sets": [{"name": "Entry Hazard Lead"}, {"name": "Heavy-Duty Boots"}]},
  "Dachsbun": {
    "sets": [
      {
        "name": "Wish",
        "description": "<p>Dachsbun is the best Wish passer in PU. Its great typing and decent overall bulk give it ample opportunity to keep itself and its teammates healthy while checking threats like Gabite and Alolan Persian. Well-Baked Body also lets Dachsbun switch into Fire-types like Charizard and Houndoom as well as absorb Will-O-Wisp from Misdreavus and Charizard, all of which threaten other Wish passers like Leafeon. Body Press prevents Steel-types from walling Dachsbun and also gets stronger if Well-Baked Body has already been triggered. Play Rough is good coverage alongside Body Press and hits Misdreavus, but Roar can be used instead to force setup sweepers like Gogoat and Carbink out as well as rack up chip damage if entry hazards are up. Copycat can be used to copy entry hazards from Pokemon like Whiscash as well as beat certain setup sweepers like Iron Defense Carbink one-on-one. Tera Steel lets Dachsbun absorb Steel- and Poison-type attacks and gives it an edge against Pokemon such as Sludge Bomb Houndoom, Articuno, and Indeedee-F. Dachsbun can run 64 Speed EVs to outspeed neutral-natured Honchkrow at the cost of some bulk. Dachsbun can also opt for a physically defensive spread to better take on Pokemon like Lycanroc-N and, after Terastallizing, Zangoose.</p> <p>Dachsbun fits best on balance teams in need of cleric support and a blanket check to various offensive threats. Pokemon like Gabite, Mareanie, and Tinkatuff can check Steel- and Poison-types like Alolan Dugtrio and Skuntank for Dachsbun, and they appreciate Dachsbun coming to their aid against foes such as Articuno and Pyroar. Charizard is another great partner that switches into Steel-types like Perrserker and non-Rock Slide Alolan Dugtrio and can do so repeatedly thanks to the Wishes Dachsbun passes. Setup sweepers like Rotom-F and Gogoat find it easier to boost multiple times in a game with Dachsbun keeping them healthy. Wish support also gives Gogoat an easier time preserving Milk Drink's limited PP, which allows it to play more recklessly early on against threats that Dachsbun baits in, such as Basculin. In return, these setup sweepers make up for Dachsbun's passivity and can threaten out nuisances like Vespiquen and Whiscash. Misdreavus can spread burns to give Dachsbun an easier time against physical attackers like Crabominable and slow opposing walls down with Taunt. Meanwhile, Dachsbun can stand up to Fire-types like non-Tera Steel Charizard, check Dark-types like Alolan Persian and Honchkrow, and reduce Misdreavus's reliance on Pain Split for recovery.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "asa", "user_id": 400292}], "teams": [{"name": "Quality checked by", "members": [{"username": "uhBella", "user_id": 567483}, {"username": "rien", "user_id": 474994}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Squawkabilly": {"sets": [{"name": "Guts Attacker"}, {"name": "Pivot"}, {"name": "Choice Scarf"}]},
  "Squawkabilly-Blue": {"sets": [{"name": "Guts Attacker"}, {"name": "Pivot"}, {"name": "Choice Scarf"}]},
  "Scovillain": {"sets": [{"name": "Sun Sweeper", "description": "<p>Scovillain should only use a Mild nature with 4 Attack EVs if it's running Stomping Tantrum; otherwise, it should opt for a Modest nature, invest the leftover EVs in Defense, and run 0 Attack IVs.</p> <p>Sample set. Stay tuned for updates!</p> "}]},
  "Rabsca": {
    "sets": [
      {
        "name": "Offensive Trick Room",
        "description": "<p>Rabsca is a fearsome, albeit relatively niche, late-game sweeper that makes use of Trick Room, healthy Special Attack, and good coverage to perform cleaning and wallbreaking duties. Psyshock takes precedence over Psychic, as it allows Rabsca to pressure specially defensive foes like Articuno and setup sweepers like Calm Mind Misdreavus; it also lets Rabsca deal considerably more damage to Crabominable. Earth Power deals considerable damage to Skuntank, Pyroar, Alolan Dugtrio, and Tinkatuff and complements Psyshock by pressuring targets like Iron Defense Carbink. Bug Buzz is Rabsca's best move to pressure foes like Gogoat and Alolan Persian. Recover allows Rabsca to mitigate entry hazard chip damage as well as to play a more active role during early-game as a switch-in to targets like Indeedee-F and Raichu, although forgoing Bug Buzz notably leaves it unable to hit Honchkrow and limits its ability to check Gogoat. Life Orb greatly increases Rabsca's damage output, notably allowing it to OHKO targets like Skuntank and Crabominable before Terastallizing, as well as 2HKO specially defensive Articuno after slight chip damage. Heavy-Duty Boots can be used for easier setup and more reliable checking of targets, like Carbink, should Rabsca choose to run Recover, but it usually prefers the increased damage output. Tera Ground and Tera Bug can be used to boost Earth Power and Bug Buzz's damage output, respectively; they also notably ease its ability to set up on Misdreavus, which otherwise threatens it with Shadow Ball or Hex, as well as prevent Skuntank and Honchkrow's Sucker Punch from prematurely ending its sweep. Tera Psychic is less reliable, as it limits Rabsca's setup opportunities, but it is otherwise effective for beating Articuno. A Quiet nature and 0 Speed IVs allow Rabsca to outspeed the entire metagame, aside from other dedicated Trick Room attackers like Crabominable and Camerupt, while Trick Room is active.</p> <p>Rabsca works best as a late-game sweeper, making it a good fit on offensive teams that can wear opposing Pokemon down throughout the match and take care of Pokemon like Misdreavus and Alolan Persian that can make Rabsca's job of setting up with Trick Room difficult. Pivots like Alolan Persian, Rotom-F, and Articuno can create safe switch-in opportunities for Rabsca if it is needed to check a target early-game or set up late-game. Bulky Alolan Persian can switch into Pokemon that threaten Rabsca out like Lycanroc-N, and it appreciates Rabsca pressuring foes like Dachsbun and Tinkatuff for it. Rotom-F and Articuno appreciate Recover variants of Rabsca, which are able to check Carbink, and in return, they can pressure threats like Masquerain and Misdreavus for it. Raichu, as well as Tinkatuff, can create setup opportunities for Rabsca with Encore; the latter is especially notable for making Rabsca's late-game cleaning easier by accelerating the opposing team being worn down by hazards with Knock Off. Indeedee-F can form an efficient Psychic-type core with Rabsca, and it notably gives Life Orb variants optimal entry with Healing Wish as well as boosting Psyshock and blocking priority from Pokemon like Skuntank and Basculin with Psychic Terrain. Crabominable greatly appreciates Recover variants' ability to check Carbink, and it can make use of leftover Trick Room turns to wallbreak. Hazard removers like Dartrix and Quaxwell can ease Life Orb variants' task of setting up late-game without relying on recovery.</p> "
      },
      {"name": "Bulky Setup"},
      {"name": "Trick Room Setter"}
    ],
    "credits": {"writtenBy": [{"username": "rien", "user_id": 474994}], "teams": [{"name": "Quality checked by", "members": [{"username": "uhBella", "user_id": 567483}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Tinkatuff": {"sets": [{"name": "Stealth Rock"}]},
  "Wugtrio": {"sets": [{"name": "Choice Band"}]},
  "Glimmet": {"sets": [{"name": "Suicide Lead"}, {"name": "Specially Defensive"}]}
}