{
  "Ho-Oh": {"sets": {"Defensive Pivot": {}, "Offensive": {}}},
  "Kyogre": {
    "outdated": true,
    "sets": {
      "Bulky Calm Mind": {},
      "Choice Scarf": {
        "description": "<p>Choice Scarf Kyogre is a decent revenge killer and wallbreaker, most notably on bulky offense teams, that threatens Pokemon such as Ting-Lu, Skeledirge, and most defensive Arceus formes. Ice Beam is Kyogre's best move to hit Koraidon and Miraidon, weakening them to potentially let it clean up late-game. Thunder is used for Toxapex and Arceus-Water. Tera Water boosts Water Spout considerably, allowing it to 2HKO Pokemon such as Eternatus and Tera Poison or Steel Ting-Lu, while Tera Ghost prevents Kyogre from being revenge killed by Extreme Killer Arceus. As Kyogre is slower than other Choice Scarf users such as Calyrex-S, Koraidon, Miraidon, and Extreme Speed Arceus, solid checks to them, such as Ting-Lu, Landorus-T and Toxapex for the latter two, are appreciated. Giratina-O checks Arceus too, and it can remove entry hazards for Kyogre to maintain its powerful Water Spout. Offensive teammates such as Calyrex-S and Miraidon can pressure Kyogre's checks such as Eternatus, Toxapex, and Arceus-Water, and they appreciate Kyogre threatening Ting-Lu for them. Partners such as Miraidon and Koraidon, whose checks are pressured by Kyogre can safely pivot it in with U-turn.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Kyogre is seen on bulky offense and balance teams and threatens common walls like Ting-Lu, Skeledirge, Landorus-T, and defensive Arceus formes with its powerful Drizzle-boosted STAB moves. Thunder is used to hit Toxapex, opposing Kyogre, and Arceus-Water, and Ice Beam is used to hit Koraidon, Miraidon, Giratina-O, and Eternatus. Tera Fairy provides Kyogre with a much-needed immunity to Dragon-type moves from Koraidon and Miraidon and a resistance to Koraidon's Low Kick. Tera Ghost is used so that Kyogre can avoid being revenge killed by Extreme Speed from Extreme Killer Arceus and Low Kick from Koraidon. Tera Water alleviates prediction by letting Origin Pulse 2HKO Giratina-O and letting Water Spout achieve feats such as OHKOing Miraidon and Toxapex, OHKOing Arceus-Water with a layer of Spikes, and 2HKOing Calm Eternatus even if it uses Recover. The HP investment allows Kyogre to be used as a soft check to Koraidon and gives it a high probability of surviving Choice Specs-boosted Grass Knot from Calyrex-S, and the Speed allows it to outspeed uninvested Landorus-T. Kyogre, being slower than the other offensive threats in the metagame like Koraidon, Miraidon, Calyrex-S, and offensive Eternatus, appreciates solid checks to them such as Landorus-T, Toxapex, and Ting-Lu as teammates. Defog Giratina-O is also appreciated for its ability to remove entry hazards, which lets Kyogre preserve its HP to maintain a powerful Water Spout and stay out of KO range of priority moves such as Arceus's Extreme Speed and Giratina-O's Shadow Sneak. Kyogre also appreciates teammates such as Koraidon, Miraidon, and Landorus-T, as they are capable of letting Kyogre enter the battlefield safely with the help of their pivot moves.</p>"
      },
      "Offensive": {
        "description": "<p>Kyogre cements itself as a fantastic offensive presence due to its extraordinary firepower and exceptional bulk. It comes in most often on the metagame's abundant Ground-type Pokemon, most notably Arceus-Ground, Ting-Lu, and Landorus-T, all of which are forced out by Kyogre. Ice Beam is a necessary coverage move, as it deals super effective damage to many of Kyogre's checks such as Miraidon, Koraidon, Giratina-O, Wo-Chien, Eternatus, and Clodsire. Thunder can be used to remove other Pokemon that resist Origin Pulse, those being Toxapex, Arceus-Water, and opposing Kyogre. In addition to coverage, Kyogre has a serviceable selection of utility options. Calm Mind further bolsters Kyogre's fantastic Special Attack, enabling it to 2HKO defensive answers such as Wo-Chien, Clodsire, and Eternatus using Ice Beam. Thunder Wave aims primarily to cripple Koraidon, slowing down Choice Scarf variants enough for teammates such as Zacian-C and Calyrex-S, which appreciate Speed control being neutralized. Paralyzed Koraidon that do not use a Choice Scarf, however, become slower than Kyogre itself. Thunder Wave also slows down Arceus formes enough for Kyogre to outspeed them, improving its matchup against Calm Mind Arcues-Fairy in particular. Substitute is useful for scouting switches, and lets Kyogre avoid status moves such as Toxic from Toxapex, Eternatus, and Clodsire and Leech Seed from Wo-Chien. Leftovers supports Kyogre's longevity, allowing it to continually switch in throughout the game. Alternatively, Mystic Water helps Kyogre break through bulky neutral targets, including various Arceus formes. 12 Speed EVs allow Kyogre to outspeed uninvested Landorus-T. Tera Fairy grants Kyogre a full immunity to Dragon-type attacks from threats like Koraidon and Miraidon, as well as providing a resistance to Koraidon's Fighting-type moves. Tera Poison offers an immunity to Toxic, as well as valuable resistances to Fighting, Fairy, and Grass. These resistances are helpful against Koraidon, Arceus-Fairy, and Calyrex-S, respectively. Tera Poison also allows Kyogre to absorb Toxic Spikes. However, being a Poison-type causes Kyogre to become vulnerable to Calyrex-S's Psychic-type STAB attacks. Finally, Tera Grass flips Kyogre's weaknesses to Calyrex-S's Grass Knot and Miraidon's Electric-type attacks to resistances. Tera Grass also offers a resistance to Ground, halting Dragon Dance Arceus-Ground and making it safer for Kyogre to switch in to Ground-type attacks. It is worth noting that Tera Grass makes Kyogre particularly weak to Koraidon, as U-turn and Flare Blitz become super effective. Kyogre is seen primarily on bulky offense structures that benefit from its ability to put pressure on defensive cores. It appreciates teammates that can switch into and wear down Koraidon, such as Landorus-T and Toxapex. Kyogre also appreciates support from Pokemon with pivot moves like Landorus-T, Koraidon, and Miraidon, which can help it safely get into the game. Additionally, defensive counterplay for Miraidon is neccessary, as it would otherwise threaten to OHKO Kyogre. Some teammates that can fill this niche are Ting-Lu, Wo-Chien, and Arceus-Ground. Offensive partners that can lure in their passive defensive checks, such as Koraidon, Miraidon, Calyrex-S, and Zacian-C, offer Kyogre ample opportunity to switch in. Calyrex-S in particular serves as an excellent offensive teammate. Its Psychic-type STAB moves give it the upper hand against Kyogre's defensive checks in Toxapex, Clodsire, and Eternatus. In turn, Kyogre is able to switch in on and threaten Calyrex-S's passive defensive checks in Ting-Lu and Arceus-Dark. Additionally, Encore variants of Calyrex-S are able to punish Arceus for attempting to revenge kill Kyogre with Extreme Speed.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "PrimalKyogre", "user_id": 541114}, {"username": "Agcl2 Ragib", "user_id": 567295}, {"username": "eavo", "user_id": 609321}], "teams": [{"name": "Quality checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Taka", "user_id": 595062}, {"username": "Adhiraj8202", "user_id": 631210}, {"username": "corvere", "user_id": 306317}, {"username": "Frozoid", "user_id": 532881}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "Tea Guzzler", "user_id": 577920}, {"username": "yoko", "user_id": 617542}]}]}
  },
  "Groudon": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Groudon is a decent pick for bulky offense teams thanks to its ability to check Zacian-C, Extreme Killer Arceus, Dragon Dance Arceus-Ground, and Koraidon due to its solid bulk. Access to moves such as Will-O-Wisp and Spikes differentiate it from Landorus-T. Will-O-Wisp allows Groudon to cripple Pokemon that switch into it such as Koraidon and physical variants of Arceus-Ground. Roar is used to phaze foes such as Swords Dance Zacian-C, Swords Dance Koraidon, Extreme Killer Arceus, and Arceus-Ground that may try to set up on it while also racking up chip damage from entry hazards. Protect is an alternative move that can be used to scout moves from the likes of Choice Specs Miraidon and Kyogre and Choice Scarf Koraidon as well as maximize Leftovers recovery. Tera Water allows Groudon to resist Behemoth Blade from Zacian-C, Flare Blitz from Koraidon, and Water Spout and Ice Beam from Kyogre, whereas Tera Fairy makes it immune or resistant to Scale Shot and Low Kick from Koraidon and Draco Meteor from Miraidon. Offensive teammates that benefit from the hazards set up by Groudon such as Calyrex-S, Calm Mind Arceus formes, Miraidon, Koraidon, Zacian-C, and Extreme Killer Arceus are appreciated. As Groudon lacks recovery, revenge killers such as Choice Scarf Koraidon and other physical walls with access to recovery such as defensive Arceus formes are mandatory partners. As Groudon is unable to check special attackers such as Calyrex-S, Miraidon, and Kyogre, checks to them such as Ting-Lu and Clodsire are appreciated; they can set up hazards as well to form a hazard stacking core with it.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "eavo", "user_id": 609321}], "teams": [{"name": "Quality checked by", "members": [{"username": "Taka", "user_id": 595062}, {"username": "Frozoid", "user_id": 532881}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Deoxys-Attack": {"sets": {"All-Out Attacker": {}}},
  "Giratina-Origin": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Thanks to its bulk, typing, and Levitate ability, defensive Giratina-O checks Pokemon like Arceus, Arceus-Ground, and Choice Scarf Kyogre, and it is the only metagame-relevant Defog user. Will-O-Wisp and Thunder Wave both debilitate physical attackers, but Will-O-Wisp chips away at walls and affects Dragon Dance Arceus-Ground, while Thunder Wave additionally impairs special attackers such as Calm Mind Arceus-Fairy. Poltergeist breaks Arceus-Ground's Substitute, which would otherwise block Will-O-Wisp and Dragon Tail, in one hit; alternatively, running Hex lets Giratina-O hit statused walls harder and makes burn affect it much less. Dragon Tail quickly racks up entry hazard damage on the opposing team and prevents foes from continuously setting up against Giratina-O, which is especially useful against Taunt users. The given EV spread lets Giratina take unboosted Calyrex-S's Astral Barrage and outspeed Taunt Landorus-T. Tera Steel makes Giratina-O immune to poison from foes such as Toxapex and gives it a resistance to moves like Arceus-Fairy's Judgment, Zacian-C's Play Rough and Behemoth Blade, Koraidon's Scale Shot, and Arceus-Ground's Dragon Claw and Ice Beam. Tera Poison similarly removes Giratina-O's Dragon weakness and provides it with an immunity to Toxic and a resistance to Fairy, but it doesn't make Giratina-O weak to Koraidon's Low Kick. Defensive Giratina-O fits best on balance teams that otherwise have trouble dealing with Ground-types such as Dragon Dance Arceus-Ground or need the increased longevity Defog provides. Toxapex and Skeledirge handle Pokemon like Zacian-C and Koraidon for Giratina-O; in return, it handles Ground-types and helps check Arceus. Giratina-O appreciates Ting-Lu and Arceus checking Calyrex-S for it; Ting-Lu also checks Miraidon and helps check Calm Mind Arceus-Ground. Calyrex-S likes Giratina-O being able to deal with its two main switch-ins, Arceus and Ting-Lu, by checking the former and removing the latter's Spikes. Because it lacks recovery, Giratina-O can get overwhelmed by the Pokemon it checks when facing hyper offense teams, so it appreciates revenge killers such as Extreme Killer Arceus and Choice Scarf Koraidon.</p>"
      },
      "Offensive": {
        "description": "<p>Giratina-O has a unique role due to great natural bulk, valuable immunities to Normal-, Ground-, and Fighting-type attacks, and a stellar offensive presence. Dragon Tail is the preferred Dragon-type STAB move due to the utility it gives for checking threats like Dragon Dance Arceus-Ground and Extreme Killer Arceus, as well as racking up extra damage with the Spikes that Giratina-O loves. Will-O-Wisp cripples Ting-Lu—preventing it from accruing HP with Leftovers—and scares away offensive Pokemon like Arceus, Koraidon, and Zacian-C. Alternatively, Outrage provides greater brute force to muscle through Ting-Lu and Arceus, and Thunder Wave can cripple would-be checks like Arceus-Fairy. Tera Steel resists many common attacks aimed at Giratina-O: Ice Beam from Kyogre and Arceus-Ground, Dragon-type moves from Koraidon and Miraidon, Play Rough from Zacian-C, and Judgment from Arceus-Fairy. The given EV spread always lives Calyrex-S's Astral Barrage and +2 Life Orb Arceus's Shadow Claw; 12 Speed EVs outspeeds uninvested Landorus-T to use Will-O-Wisp before Taunt. Giratina-O fits best on bulky offense teams that appreciate it deterring Choice Scarf Koraidon's Low Kick and Flare Blitz and checking Arceus, Arceus-Ground, and Kyogre while still being a powerful attacker. Ting-Lu is a major nuisance for Giratina-O, as it is able to come in quite safely and set Spikes, though it must fear Dragon Tail with multiple layers of Spikes, so teammates that can threaten it like Arceus-Fairy, Zacian-C, and Koraidon are good partners. Entry hazard support from Landorus-T and your own Ting-Lu is greatly appreciated, chipping checks like Ting-Lu and defensive Arceus formesand weakening offensive threats like Koraidon and Arceus-Ground into Shadow Sneak's KO range. Ting-Lu and Landorus-T also support Giratina-O defensively; the former checks Miraidon, Eternatus, and Terastallized Calyrex-S; the latter checks Zacian-C and helps against Arceus and Arceus-Ground. Arceus is a good offensive partner that can overwhelm shared checks with Giratina-O like defensive Arceus formes while taking advantage of Calyrex-S that are forced to Terastallize from the threat of a Shadow Sneak OHKO. Koraidon is another good partner that helps pressure Ting-Lu, check Kyogre, and overwhelm their shared checks. Zacian-C checks Arceus-Fairy and helps handle Arceus while not letting up on offensive pressure.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "TaxFraud", "user_id": 584685}], "teams": [{"name": "Quality checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Frozoid", "user_id": 532881}, {"username": "Taka", "user_id": 595062}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Arceus": {
    "outdated": true,
    "sets": {
      "Offensive Setup": {
        "description": "<p>Arceus is a potent revenge killer, wallbreaker, and setup sweeper thanks to its excellent movepool and powerful Extreme Speed. Swords Dance can be used to break past Pokemon like Landorus-T, Giratina-O, Toxapex, and defensive Arceus formes and limit revenge killers like Koraidon, while Dragon Dance is a more niche option that lets Arceus outspeed Calyrex-S, Zacian-C, and opposing Arceus formes. Shadow Claw hits Ghost-types like Giratina-O, Skeledirge, and Calyrex-S and provides good neutral coverage. Recover can provide Arceus with more opportunities to set up and makes it harder to revenge kill; alternatively, Earthquake hits Skeledirge harder, as well as hitting Toxapex and Zacian-C, and Taunt can deny opposing recovery, status-inducing moves, and Haze from Pokemon like Arceus formes, Skeledirge, and Toxapex, respectively. Silk Scarf has no drawbacks, but unlike Life Orb, it means +2 Extreme Speed needs a layer of Spikes to 2HKO defensive Arceus formes, OHKO Miriadon, and 2HKO Zacian-C. Additionally, Life Orb lets +2 Extreme Speed OHKO Koraidon after a layer of Spikes, +1 Earthquake OHKO Zacian-C, and unboosted Earthquake 2HKO Skeledirge and Toxapex. Tera Normal OHKOes Koraidon with +2 Extreme Speed and enables Silk Scarf Arceus to achieve the damage thresholds Life Orb sets can. Tera Ghost makes Arceus harder to revenge kill by opposing Arceus and Koraidon and lets Life Orb-boosted Shadow Claw OHKO defensive Giratina-O after Stealth Rock at +2, OHKO Zacian-C after some chip damage at +2, and 2HKO Skeledirge. Tera Fire makes Arceus immune to Will-O-Wisp, helping against Skeledirge and opposing Arceus formes, and lets it resist Zacian-C's STAB moves, Arceus-Fairy's Judgment, and Calyrex-S's Grass Knot. Arceus fits well on offense and bulky offense teams, being able to revenge kill dangerous threats and clean up late-game. Thanks to Arceus's Normal typing, it's immune to Calyrex-S's Astral Barrage, which can help against Choice Specs sets, Koraidon and Zacian-C pair well with Arceus, as they help overwhelm shared checks with Arceus like Landorus-T, Toxapex, and defensive Arceus formes. Pokemon such as Calyrex-S, Miraidon, and Kyogre also threaten its checks and make good teammates. On bulky offense teams, Landorus-T and Ting-Lu make good partners, as Landorus-T can switch into Pokemon that can revenge kill Arceus like Zacian-C and Koraidon, chipping them with Rocky Helmet in the process, and Ting-Lu crucially sets Spikes and helps check Calyrex-S, which offensive Arceus does poorly. On hyper offense teams, Pokemon like Grimmsnarl, Glimmora, and Ribombee support Arceus, and Pokemon like Arceus-Fairy and Arceus-Ground can take advantage of Koraidon and Zacian-C for it.</p>"
      },
      "Bulky Extreme Killer": {
        "description": "<p>Extreme Killer Arceus is a stellar revenge killer, wallbreaker, and cleaner that also crucially checks Calyrex-S thanks to its great defensive profile; this phenomenal combination of traits makes Arceus one of the best Pokemon in the AG metagame, and it should be seriously considered on every team. Swords Dance is the preferred setup move to break through checks like Giratina-O and Landorus-T and limit revenge killers like Koraidon and Zacian-C, while Bulk Up is an alternative on hyper offense with dual screens support from Pokemon like Grimmsnarl, making Arceus a brutal sweeper that stifles common forms of counterplay like Koraidon, Zacian-C, and opposing Extreme Killer Arceus. Shadow Claw OHKOes Calyrex-S, hits Giratina-O, and provides good neutral coverage. The longevity Heavy-Duty Boots provides lets Arceus more reliably check Calyrex-S and more safely set up. Leftovers is an alternative to Heavy-Duty Boots, making Arceus harder to stop once set up. Tera Ghost turns the tables on Koraidon, lets Arceus consistently beat opposing Extreme Killer Arceus, and greatly improves Shadow Claw's damage against Giratina-O and Skeledirge, while Tera Normal boosts Arceus's power to ridiculous levels; at +2, Extreme Speed OHKOes Koraidon after Stealth Rock and 2HKOes Zacian-C. Tera Fire and Steel are more defensive options, blocking status and improving the matchup against threats like Arceus-Fairy, Zacian-C, and Calyrex-S as well as opposing Extreme Killer Arceus in the case of Steel. 236 HP EVs always survive a hit from Choice Specs Miraidon. Alternatively, a spread with 124 HP / 252 Atk / 8 Def / 124 Spe and an Adamant nature outspeeds Timid Kyogre and always avoids a 2HKO from Life Orb Calyrex-S's Psyshock. Arceus can struggle to break through Giratina-O, Skeledirge, Toxapex, and defensive Arceus formes, so teammates that can take advantage of them, like Calyrex-S and Calm Mind Arceus-Ground, or weaken them, like Koraidon and Zacian-C, make for good partners. Choice Scarf Koraidon can also revenge kill Pokemon Arceus cannot like Zacian-C and Calyrex-S. Encore Calyrex-S can switch into any of Arceus's moves besides Shadow Claw and use Encore, so Ting-Lu is a great partner to help check it. Koraidon and Zacian-C highly threaten Arceus, so strong counterplay to them, like Landorus-T on offense or Toxapex or Skeledirge on balance, is crucial.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "TaxFraud", "user_id": 584685}, {"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Taka", "user_id": 595062}, {"username": "Frozoid", "user_id": 532881}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "Gangsta Spongebob", "user_id": 535530}]}]}
  },
  "Arceus-Dark": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Arceus-Dark is a decent defensive Pokemon that checks Arceus and soft checks Calyrex-S, Dragon Dance Arceus-Ground, and offensive Giratina-O while being immune to Trick. Will-O-Wisp prevents Pokemon like Koraidon and Zacian-C from safely switching in on Arceus-Dark. Foul Play is the main way of hitting physical attackers. Alternatively, Judgment can be ran to ignore Will-O-Wisp's burn to effectively hit the likes of Skeledirge and Giratina-O, allowing Arceus-Dark to switch into Will-O-Wisp from them. Judgment also does decent damage to Terastallized Calyrex-S and Toxapex. Taunt shuts down Pokemon like Ting-Lu and Toxapex from setting up entry hazards, namely that of Spikes and Toxic Spikes, prevents setup sweepers from setting up, and blocks recovery, which Judgment variants appreciate. Tera Poison gives Arceus-Dark a much-needed resistance to Koraidon's Low Kick, Zacian-C's Play Rough, and Calyrex-S's Grass Knot while also letting it absorb tedious Toxic Spikes. Arceus-Dark fits best on balance and bulky offense teams, which appreciate its ability to check Extreme Killer Arceus and soft check Calyrex-S. Arceus-Dark struggles with physical attackers such as Koraidon and Zacian-C, so checks to them such as Landorus-T, Skeledirge, and Toxapex are appreciated. Since Arceus-Dark can't run Heavy-Duty Boots, it fails to effectively check Calyrex-S in the long run, so Ting-Lu and Arceus help check Calyrex-S more effectively throughout the game, which is appreciated. Arceus-Fairy can use Arceus-Dark as setup fodder with Calm Mind, which makes Zacian-C a good teammate to pair with Arceus-Dark.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Adhiraj8202", "user_id": 631210}], "teams": [{"name": "Quality checked by", "members": [{"username": "Taka", "user_id": 595062}, {"username": "WrathoftheLeopard", "user_id": 511181}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Arceus-Fairy": {
    "outdated": true,
    "sets": {
      "Utility": {
        "description": "<p>Arceus-Fairy provides good utility with Stealth Rock and Taunt while blocking Koraidon from using Scale Shot and also threatening common Pokemon like Ting-Lu, Giratina-O, and Landorus-T. Utility Arceus-Fairy is generally seen on more offense-oriented teams, but it can be ran on balance teams occasionally. Will-O-Wisp prevents Pokemon like Dragon Dance Arceus-Ground, Extreme Killer Arceus, and Zacian-C from safely switching in on Arceus-Fairy. Taunt prevents Pokemon like Ting-Lu and Toxapex from setting up entry hazards and opposing Calm Mind Arceus-Fairy, and Calm Mind Arceus-Ground, and Tera Fire physical attackers such as the aforementioned Will-O-Wisp targets.Both Tera Fire and Tera Water give Arceus-Fairy key resistances to attacks like Koraidon's Flare Blitz and Zacian-C's Behemoth Blade, with Tera Water additionally helping against Kyogre's STAB moves and Tera Fire improving the matchup against opposing Arceus-Fairy. Tera Poison removes Arceus-Fairy's Steel-type weakness, lets it block Toxic from Pokemon like Eternatus and Toxapex, and lets it absorb Toxic Spikes. On hyper offense teams, Arceus-Fairy appreciates Pokemon like Calyrex-S, Arceus-Ground, Swords Dance Koraidon, and Extreme Killer Arceus, which benefit from it countering their checks in Ting-Lu and Landorus-T. On more balance-oriented teams, physical attackers such as Koraidon and Zacian-C can overwhelm Arceus-Fairy, so defensive checks to them in Landorus-T, Toxapex, and Skeledirge are appreciated. Arceus-Fairy also struggles with Calyrex-S, which makes Arceus and Ting-Lu great teammates.</p>"
      },
      "Offensive Calm Mind": {
        "description": "<p>Calm Mind Arceus-Fairy is an excellent, self-sufficient wallbreaker and sweeper that matches up well against Koraidon and Ting-Lu. Earth Power hits foes like Zacian-C, Toxapex, and Skeledirge, as well as Tera Fire Pokemon such as Arceus and Koraidon. Tera Water gives Arceus-Fairy a resistance to attacks like Koraidon's Flare Blitz, Zacian-C's Behemoth Blade, and Choice Scarf Kyogre's Water Spout, making it harder to revenge kill and giving it more opportunities to set up. Tera Poison removes Arceus-Fairy's Steel weakness, provides it with an immunity to Toxic from foes like Toxapex and Eternatus, and lets it absorb bothersome Toxic Spikes. Tera Ground removes Arceus-Fairy's weakness to Behemoth Blade and lets +1 Earth Power OHKO Zacian-C and Toxapex. Calm Mind Arceus-Fairy fits on balance, bulky offense, and hyper offense teams that appreciate its ability to block Koraidon's Scale Shot and be a dangerous setup sweeper. Unlike bulkier Arceus-Fairy sets, Calm Mind Arceus-Fairy is unable to switch into Koraidon, and Pokemon like Zacian-C and Choice Specs Calyrex-S can revenge kill it, so on balance and bulky offense teams, it appreciates teammates such as Toxapex, Skeledirge, Landorus-T, and Ting-Lu checking these foes. On hyper offense teams, teammates like Calyrex-S and Arceus can take advantage of Zacian-C and opposing Calyrex-S for Arceus-Fairy. Hyper offense teams can also run an entry hazard lead like Glimmora or Ribombee to weaken Pokemon for Arceus-Fairy with Spikes or let it outspeed foes such as Choice Specs Calyrex-S, Zacian-C, and Choice Scarf Koraidon via Sticky Web, respectively. On all team playstyles, Calyrex-S appreciates Arceus-Fairy taking advantage of Ting-Lu and Choice Scarf Koraidon.</p>"
      },
      "Defensive": {
        "description": "<p>Arceus-Fairy's typing allows it to reliably check Koraidon and Giratina-O, and its fantastic bulk and access to Will-O-Wisp let it also check several other physical attackers, including Arceus and Dragon Dance Arceus-Ground. Additionally, Arceus-Fairy threatens common defensive staples such as Ting-Lu, Arceus-Dark, and Landorus-T with Judgment. Defensive Arceus-Fairy is particularly difficult to switch into, as Will-O-Wisp can cripple Zacian-C, which would otherwise be able to switch in safely on Arceus-Fairy. Taunt prevents entry hazards from being set and stops Clodsire, Eternatus, and Toxapex from using Toxic; it also prevents recovery, giving Arceus-Fairy the upper hand against other Arceus formes and stopping its checks such as Clodsire and Eternatus from taking advantage of forcing it out. Alternatively, Calm Mind, which can be used against the many Pokemon Arceus-Fairy forces out, turns it into a dangerous setup sweeper and troubles special wallbreakers that could otherwise muscle through it, such as Kyogre, Miraidon, and Calyrex-S. 16 Speed EVs allow for Arceus-Fairy to outrun neutral-natured base 90 Speed Pokemon, such as Kyogre and Giratina-O. Tera Poison complements Calm Mind well, as it allows Arceus-Fairy to set up on Poison-types such as Toxapex, Clodsire, and Eternatus that otherwise check it. Tera Poison also maintains a useful resistance to Koraidon's Fighting-type moves and lets Arceus-Fairy remove Toxic Spikes, but the weaknesses it gives are often exploited by Calyrex-S and Arceus-Ground. Tera Water offers crucial resistances to Zacian-C's Behemoth Blade and Koraidon's Flare Blitz, as well as a resistance to Kyogre's STAB moves, but it creates weaknesses to Miraidon's Electric-type attacks and Kyogre's Thunder. Arceus-Fairy is an outstanding choice on balance and bulky offense teams, which benefit from its defensive utility and remarkable offensive capabilities. Calyrex-S highly appreciates support from Arceus-Fairy, as Arceus-Fairy beats several of its checks in Ting-Lu, Arceus, Wo-Chien, and Arceus-Dark, as well as beating Pokemon that can revenge kill it in Giratina-O and Choice Scarf Koraidon. In turn, Calyrex-S can break through Arceus-Fairy's Poison-type defensive checks. Powerful Ground-type Pokemon, such as Arceus-Ground and Groudon, make great teammates for Calm Mind variants of Arceus-Fairy, since they threaten many of Arceus-Fairy's biggest obstacles in Eternatus, Clodsire, and Toxapex. Landorus-T, defensive variants of Arceus-Ground, Skeledirge, and Groudon can switch in to one of Arceus-Fairy's biggest offensive threats in Zacian-C. Ting-Lu is a valuable defensive teammate for Arceus-Fairy, as it can check powerful special wallbreakers such as Miraidon, Calyrex-S, and Eternatus. Kyogre is an exceptional teammate for Calm Mind variants of Arceus-Fairy, as it helps to wear down the pair's mutual defensive checks in Eternatus, Clodsire, and Toxapex. Kyogre can also switch in easily on Skeledirge, which Arceus-Fairy would otherwise struggle against.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "PrimalKyogre", "user_id": 541114}, {"username": "Adhiraj8202", "user_id": 631210}], "teams": [{"name": "Quality checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Frozoid", "user_id": 532881}, {"username": "Taka", "user_id": 595062}, {"username": "corvere", "user_id": 306317}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Arceus-Ground": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Arceus-Ground's useful utility movepool, bulk, and typing make it a good defensive Pokemon that checks foes like Arceus, Zacian-C, Koraidon, Choice Scarf and Double Dance Miraidon, and Eternatus and pesters common walls. Earthquake hits Calm Mind Arceus formes, Miraidon, and defensive Eternatus harder than Judgment, but running Judgment makes Arceus-Ground less bothered by Will-O-Wisp. Taunt prevents Toxapex and Skeledirge from healing and spreading status, offensive threats such as Arceus from setting up, and Pokemon like Ting-Lu and Landorus-T from setting entry hazards. 16 Speed EVs let Arceus-Ground outspeed Adamant Groudon and Modest Kyogre. Tera Water helps Arceus-Ground tank attacks like Koraidon's Flare Blitz and Zacian-C's Behemoth Blade, as well as removing its Ice- and Water-type weaknesses, helping against Kyogre in a pinch. Tera Poison can be used to patch up Arceus-Ground's weaknesses to Calyrex-S's Grass Knot, Koraidon's Low Kick, Zacian-C's Play Rough, and Arceus-Fairy's Judgment; let it absorb Toxic Spikes; and make it immune to Eternatus's Toxic. Tera Fairy mainly helps against Koraidon, Miraidon, and Eternatus. Arceus-Ground fits best on balance and bulky offense teams that appreciate its ability to check physical attackers such as Koraidon, Zacian-C, and Arceus and hinder walls like Skeledirge and Toxapex. However, Arceus-Ground can get overwhelmed by the aforementioned physical attackers, so on balance teams, a secondary check such as Toxapex makes a good teammate. Since Arceus-Ground can reliably deal with walls, revenge killers like Calyrex-S, Choice Scarf Koraidon, and Arceus make for good teammates. Arceus-Ground is also threatened by Calyrex-S and Kyogre, so checks to them in Ting-Lu and Clodsire are appreciated.</p>"
      },
      "Defensive Calm Mind": {
        "description": "<p>Defensive Calm Mind Arceus-Ground is a good sweeper and wallbreaker that also provides solid defensive utility against foes like Koraidon, Zacian-C, and Arceus. Will-O-Wisp improves Arceus-Ground's ability to check physical attackers. Ice beam hits Landorus-T, Giratina-O, Wo-Chien, and Tera Grass and Tera Flying Pokemon such as Calyrex-S and Skeledirge, respectively. Alternatively, Taunt can be run to prevent Pokemon like Ting-Lu and Toxapex from setting up entry hazards, phazing Arceus-Ground, and spreading status, and it also prevents sweepers like Extreme Killer Arceus and Calm Mind Arceus formes from setting up. 16 Speed EVs let Arceus-Ground outspeed Modest Kyogre and Adamant Groudon. Tera Fairy gives Arceus-Ground a much-needed immunity to Koraidon's Dragon-type moves, Miraidon's Draco Meteor, and Giratina-O's Dragon Tail, as well as a resistance to the former's Low Kick, making it more difficult to revenge kill and phaze. On the other hand, Tera Water lets Arceus-Ground resist Water-type attacks from Arceus-Water and Choice-locked Kyogre, allowing it to set up on them with relative ease, resists Flare Blitz from Koraidon, and Behemoth Blade from Zacian-C. Tera Poison allows Arceus-Ground to resist Judgment from Arceus-Fairy, Low Kick from Koraidon, and Grass Knot from Calyrex-S; absorb tedious Toxic Spikes; and become immune to Toxapex's and Eternatus's Toxic. Defensive Calm Mind Arceus-Ground fits best on balance and bulky offense teams that appreciate its ability to soft check physical attackers while being a potent sweeper itself. Ting-Lu is a great check to Arceus-Ground, which makes Calyrex-S a great teammate as they both wear down Ting-Lu for each other, potentially enabling one to sweep. Calyrex-S and Kyogre revenge kill Arceus-Ground, and the physical attackers it checks may overwhelm Arceus-Ground, so checks to them such as Ting-Lu, Eternatus, Toxapex, and Landorus-T are appreciated. Potent revenge killers like Choice Scarf Koraidon and Extreme Killer Arceus are also appreciated. Arceus-Ground struggles with Grass Knot from Calyrex-S, and also struggles with Giratina-O, so Arceus can check Calyrex-S while also pressurizing Giratina-O with Swords Dance boosted-Shadow Claw, which makes it a great teammate for Arceus-Ground.</p>"
      },
      "Dragon Dance": {
        "description": "<p>Arceus-Ground is a powerful setup sweeper that utilizes its good bulk, useful utility moves, and STAB-boosted Earthquake to pressure common defensive Pokemon such as Toxapex, Skeledirge, Eternatus, and Ting-Lu. Ice Beam smashes Landorus-T, which would otherwise wall Arceus-Ground. Dragon Claw is primarily used to hit Giratina-O and Landorus-T, while Gravity is a similar option to hit them as well. Taunt shuts down Skeledirge and Toxapex while preventing Ting-Lu from phazing Arceus-Ground. Substitute eases prediction versus Terastallization while also blocking status from the aforementioned Pokemon. Recover lets Arceus-Ground set up on Pokemon such as Landorus-T and have a longer term presence throughout the game but is generally outclassed by the prior two options. Tera Fairy lets Arceus-Ground take Koraidon's Low Kick and Dragon-type attacks, take Miraidon's Draco Meteor, and, when paired with Substitute or Taunt, use Giratina-O as setup fodder. At +1, Tera Ground lets Earthquake OHKO Koraidon and 2HKO defensive Arceus formes and Ting-Lu. Tera Steel is another option for resisting Calyrex-S's Grass Knot, Miraidon and Koraidon's Dragon-type attacks, both of Zacian-C's STAB attacks, and Extreme Speed from Arceus. However, Tera Steel leaves Arceus-Ground open to Choice Scarf Koraidon. Arceus-Ground acts as a wincon after wallbreakers such as Koraidon, Zacian-C, and Calyrex-S have broken down its checks in Landorus-T and defensive Arceus formes. Extreme Killer Arceus is another solid partner for forcing damage on Giratina-O, opening up Arceus-Ground late-game. Arceus-Ground can be revenge killed by the likes of Choice Scarf Koraidon, Arceus, and Choice Scarf Calyrex-S, so checks to these such as Landorus-T and Arceus formes are appreciated. Support from Pokemon such as Grimmsnarl, Glimmora, and Ribombee can faciliate Arceus-Ground on hyper offense teams.</p>"
      },
      "Offensive Calm Mind": {
        "description": "<p>Calm Mind Arceus-Ground is a excellent wallbreaker and sweeper that leverages its great natural bulk and near-perfect coverage to become extremely hard to stop. Ice Beam is the preferred coverage to hit Giratina-O, Landorus-T, Wo-Chien, and the occasional Tera Grass or Tera Flying Pokemon, such as Zacian-C. Tera Fairy blocks Miraidon's Draco Meteor and gives Arceus-Ground a resistance to Koraidon's Low Kick, making it more difficult to revenge kill. Tera Water instead provides it with a resistance to Water-type attacks from the likes of Kyogre and Arceus-Water—allowing Arceus-Ground to turn the tables against them—and Koraidon's Flare Blitz and Zacian-C's Behemoth Blade. Tera Ground boosts Arceus-Ground's power greatly; with a layer of Spikes, it 2HKOes Ting-Lu at +1 and OHKOes opposing Arceus formes at +2. An alternative spread of 120 HP / 252 SpA / 136 Spe with a Timid nature outspeeds neutral-natured Arceus formes and always survives an attack from Choice Band Koraidon but no longer outspeeds Adamant Koraidon. Arceus-Ground best fits on hyper offense and bulky offense teams that appreciate its ability to check Miraidon while being a dangerous sweeper itself. Ting-Lu is the most effective check to Arceus-Ground, so Calyrex-S is a very potent teammate, as they both wear down Ting-Lu for the other to take advantage of. Zacian-C, Koraidon, and opposing Calyrex-S can all revenge kill Arceus-Ground, so checks to them like Landorus-T and Ting-Lu on bulky offense or teammates that can take advantage of them like Calyrex-S, Arceus-Fairy, and Extreme Killer Arceus on hyper offense are greatly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "TaxFraud", "user_id": 584685}, {"username": "Taka", "user_id": 595062}, {"username": "LOrd Fernado", "user_id": 629794}, {"username": "Adhiraj8202", "user_id": 631210}], "teams": [{"name": "Quality checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Frozoid", "user_id": 532881}, {"username": "corvere", "user_id": 306317}, {"username": "Fc", "user_id": 511624}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "UT", "user_id": 523866}, {"username": "Gangsta Spongebob", "user_id": 535530}]}]}
  },
  "Arceus-Water": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>A pure Water typing and good Defense make Arceus-Water a decent check to Arceus-Ground, Choice Scarf Koraidon, and Zacian-C. It also acts as a soft check to Kyogre, discouraging Choice Scarf variants from spamming Water Spout. Due to Koraidon's sun weakening Judgment, Arceus-Water is more passive than other Arceus formes. Ice Beam allows Arceus-Water to hit Miraidon and Koraidon for super effective damage, whereas Judgment is used to hit Ting-Lu, Skeledirge, and Arceus-Ground. Taunt is an alternative option that prevents Arceus formes such as Calm Mind Arceus-Fairy and Extreme Killer Arceus from setting up and Ting-Lu and Toxapex from setting up entry hazards. However, losing Judgment in exchange for Taunt can be problematic, as Ice Beam is relatively weak. Will-O-Wisp cripples physical attackers, whereas Thunder Wave punishes switch-ins such as Calm Mind Arceus formes and Calyrex-S. 20 Speed EVs allow Arceus-Water to outspeed Modest Kyogre. Tera Fairy is used to ease the matchup into Choice Band and Swords Dance variants of Koraidon, preventing them from breaking through Arceus-Water with their STAB moves. As Arceus-Water allows Calyrex-S and Miraidon to switch in with relative ease, checks to them such as Arceus and Ting-Lu are appreciated. Offensive teammates include Calyrex-S, Miraidon, and Calm Mind Arceus-Ground, which appreciate Arceus-Water threatening Ting-Lu for them. Similarly, Koraidon, Zacian-C, and Extreme Killer Arceus appreciate Arceus-Water threatening Skeledirge and Landorus-T for them. As Arceus-Water cannot completely prevent Swords Dance Koraidon and Wild Charge Zacian-C from breaking through it, teammates such as Landorus-T and Skeledirge are appreciated. Non-Taunt variants of Arceus-Water can, however, be used as setup fodder by opposing Calm Mind Arceus formes, so teammates that can deal with them—such as Ting-Lu as a defensive check that can phaze them with Whirlwind, revenge killing options such as Zacian-C and Koraidon, and Calyrex-S with Encore—are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "eavo", "user_id": 609321}], "teams": [{"name": "Quality checked by", "members": [{"username": "Taka", "user_id": 595062}, {"username": "Frozoid", "user_id": 532881}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Landorus-Therian": {
    "outdated": true,
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Landorus-T is an excellent physically defensive pivot that checks foes such as Koraidon, Zacian-C, Arceus, and Dragon Dance Arceus-Ground thanks to its rare Spikes immunity, Intimidate, and U-turn. Taunt denies entry hazards and status from Pokemon such as Ting-Lu and Toxapex and prevents foes like Arceus from continuously setting up in front of Landorus-T. Rocky Helmet punishes foes like Koraidon and Zacian-C for attacking by potentially putting them into range of attacks such as +2 Arceus's Extreme Speed, Calyrex-S's Astral Barrage, and Giratina-O's Shadow Sneak. Tera Water grants a resistance to attacks such as Koraidon's Flare Blitz and Zacian-C's Behemoth Blade, while Tera Fairy grants an immunity to Dragon, denying Scale Shot Koraidon a Speed boost and less importantly blocking moves like Miraidon's Draco Meteor. Landorus-T best fits on bulky offense teams, where it can support offensive teammates such as Calyrex-S, Zacian-C, Arceus, and Miraidon by setting Stealth Rock, safely pivoting them in to wallbreak, and checking revenge killers like Zacian-C and Choice Scarf Koraidon. Ting-Lu checks Pokemon like Calyrex-S, Miraidon, and Calm Mind Arceus-Ground for Landorus-T and provides its offensive teammates with Spikes support; Landorus-T checks strong physical attackers for it in return. Landorus-T lacks recovery, so partners like Arceus-Fairy, Arceus-Ground, and Zacian-C can assist it by checking Koraidon, opposing Zacian-C, and Arceus, respectively, with help from Intimidate; Choice Scarf Koraidon can also revenge kill these foes. Teammates like Koraidon, Giratina-O, and Eternatus deter Kyogre from using its STAB moves to an extent, but Kyogre can still force you to predict whether it will use a Water-type move or Ice Beam in the face of Landorus-T.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "WrathoftheLeopard", "user_id": 511181}], "teams": [{"name": "Quality checked by", "members": [{"username": "Taka", "user_id": 595062}, {"username": "TaxFraud", "user_id": 584685}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Ribombee": {
    "outdated": true,
    "sets": {
      "Lead": {
        "description": "<p>Ribombee is a metagame-defining Sticky Web lead found in hyper offense teams due to its impressive Speed tier, notably outpacing maximum Speed invested Arceus formes, avoiding Taunt from them. Moonblast allows Ribombee to discourage Ting-Lu from laying entry hazards, Koraidon and Miraidon from setting up, and Giratina-O from using Defog. Stun Spore is used to cripple Pokemon that can otherwise use Ribombee as setup fodder such as Arceus formes and Zacian-C. Psychic is an option to hit Glimmora for super effective damage, deterring it from using Mortal Spin. Charm is also an alternative move that is used to annoy physical attackers, hindering them from setting up. Tera Ghost allows Ribombee to block Rapid Spin from leads like Great Tusk while also providing it with an immunity to Extreme Speed from Arceus. Tera Steel is an alternative option to block Mortal Spin from Glimmora. Teammates such as Koraidon, Zacian-C, Calyrex-S, Arceus-Ground, Extreme Killer Arceus, Miraidon, and Eternatus benefit heavily from Sticky Web being up, as it makes them much more difficult to revenge kill, with some such as Zacian-C and Eternatus also providing utility by blocking Mortal Spin from Glimmora and setting up Toxic Spikes, respectively. As Ribombee gets shut down by Taunt from Calyrex-S and Miraidon, offensive checks to them such as Extreme Killer Arceus and Arceus-Ground are preferred as teammates. As Ribombee lacks Taunt, another lead such as Arceus-Ground or Glimmora can be used to prevent entry hazards from opposing leads.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "eavo", "user_id": 609321}], "teams": [{"name": "Quality checked by", "members": [{"username": "Taka", "user_id": 595062}, {"username": "Frozoid", "user_id": 532881}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Toxapex": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Toxapex is a solid physical wall that checks Pokemon such as Arceus, Choice Scarf Koraidon, Zacian-C, and Arceus-Fairy and absorbs annoying Toxic Spikes. Haze stops Pokemon like Swords Dance Arceus and Zacian-C from setting up and easily beating Toxapex. Infestation chips away at foes immune to Toxic, like Zacian-C, while Poison Jab hits Taunt Arceus-Fairy for decent damage and threatens to inflict it with poison. Baneful Bunker is a more niche option for the second moveslot that potentially poisons foes like Koraidon and Arceus at the risk of letting them set up. Toxic is more immediately threatening, but Toxic Spikes can potentially aid offensive teammates and annoy teams in the long term. Rocky Helmet punishes Koraidon for spamming U-turn and gives non-Infestation Toxapex a way of damaging Zacian-C. Tera Fairy provides an immunity to Koraidon's Scale Shot and Outrage and removes Toxapex's weakness to Ground-type moves from foes like Dragon Dance Arceus-Ground. Toxapex is primarily useful on balance teams, where Pokemon like Calyrex-S, Arceus, Arceus-Fairy, Miraidon, and Zacian-C benefit from it being able to switch into opposing Arceus, Zacian-C, and Choice Scarf Koraidon. Choice Specs Calyrex-S is an especially good teammate for Toxic Spikes Toxapex, as it threatens foes that can absorb Toxic Spikes, like Eternatus and opposing Toxapex, and can use Trick to remove a Pokemon's Heavy-Duty Boots. Arceus-Ground similarly threatens Poison-types, and it wears down the only relevant Defog user, Giratina-O. Arceus is also worth highlighting for its ability to check Calyrex-S and revenge kill weakened Scale Shot Koraidon. Ting-Lu appreciates Toxapex checking strong physical attackers, and it checks Calyrex-S, Miraidon, and Calm Mind Arceus-Ground for it in return. Choice Scarf Koraidon can revenge kill the Pokemon Ting-Lu checks as well as Wild Charge Zacian-C and Taunt Arceus, which Toxapex loses to.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "WrathoftheLeopard", "user_id": 511181}], "teams": [{"name": "Quality checked by", "members": [{"username": "Taka", "user_id": 595062}, {"username": "Frozoid", "user_id": 532881}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Necrozma-Dusk-Mane": {"sets": {"Bulky Booster": {}, "Offensive": {}}},
  "Grimmsnarl": {
    "outdated": true,
    "sets": {
      "Dual Screens": {
        "description": "<p>Grimmsnarl can reliably set dual screens thanks to Prankster, giving its offensive teammates an easier time setting up and making them harder to revenge kill. Bulkier teams are able to stall for the limited number of turns dual screens are active for, however. Play Rough has a decent chance to 2HKO Ting-Lu, which is immune to Prankster-boosted Taunt, stopping it from freely laying Spikes. Taunt prevents Pokemon such as Arceus formes from using Grimmsnarl as setup fodder; prevents Landorus-T, Glimmora, and Toxapex from setting entry hazards; and prevents Giratina-O from using Defog, while Parting Shot lets a teammate switch in more safely. Tera Ghost makes Grimmsnarl immune to Arceus's Extreme Speed, which has a higher priority than Prankster-boosted moves, and neutral to attacks like Zacian-C's STAB moves. Grimmsnarl is best used on hyper offense teams, where it can block Koraidon's Scale Shot in a pinch, sparingly take hits from Calyrex-S, and—most importantly—support setup sweepers such as Swords Dance Koraidon and setup Arceus formes. Zacian-C and Arceus-Ground can notably switch into Pokemon Grimmsnarl cannot safely stop from setting up such as Arceus-Fairy and opposing Zacian-C, respectively. Additionally, Nasty Plot Calyrex-S and Calm Mind + Agility Miraidon appreciate Grimmsnarl potentially weakening Ting-Lu, their primary defensive check. A hazard lead such as Glimmora can further support Grimmsnarl's offensive teammates by wearing down their checks.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "WrathoftheLeopard", "user_id": 511181}], "teams": [{"name": "Quality checked by", "members": [{"username": "Frozoid", "user_id": 532881}, {"username": "Taka", "user_id": 595062}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Zacian-Crowned": {
    "outdated": true,
    "sets": {
      "Swords Dance": {
        "description": "<p>Zacian-C is a defining sweeper thanks to its superb Attack, ability to naturally outspeed the entire metagame outside of Calyrex-S, and immunity to Dragon-type moves. Wild Charge, when boosted by Swords Dance, breaks through Toxapex, defensive Kyogre, and Arceus-Water. Close Combat OHKOes Arceus, breaks through Tera Steel Giratina-O, and eases prediction versus Tera Fire or Steel Koraidon. Crunch can instead be used to pressure Skeledirge, but this option is generally outclassed by the others. Tera Fire lets Zacian-C resist Koraidon's Flare Blitz and gives it a burn immunity. Tera Flying lets Zacian-C flip the matchup versus Landorus-T, defensive Arceus-Ground, and defensive Groudon, giving it more chances to set up. Tera Steel is another option to power up Zacian-C's Behemoth Blade, giving it favorable odds to OHKO Landorus-T, Arceus-Ground, and defensive Groudon after Swords Dance with a layer of Spikes. Zacian-C fits well on bulky offense and hyper offense builds, where it can act as both a revenge killer and sweeper and take advantage of Arceus-Fairy. Zacian-C can come in on Dragon-type moves from Koraidon, Miraidon, and Eternatus and force them out with its powerful STAB attacks. This is appreciated by offensive teams without a solid defensive core and those with Pokemon such as Ting-Lu and Koraidon. However, Zacian-C has issues breaking through physical walls such as Skeledirge, Landorus-T, and Toxapex without Terastallization. As a result, partners that can overwhelm these walls, such as Koraidon and Arceus, or switch into them, like Kyogre and Giratina-O, are appreciated. Calyrex-S pairs well with Zacian-C by heavily pressuring all of Zacian-C's checks and using them as setup fodder with Nasty Plot. Conversely, Zacian-C checks Arceus for Calyrex-S. Calyrex-S is another issue for Zacian-C, since it outspeeds Zacian-C and threatens to OHKO it when using Choice Specs or with enough chip damage, so partners such as Arceus and Choice Scarf Koraidon on all builds, Ting-Lu on bulky offense and balance, and Kingambit on hyper offense are good for pressuring Calyrex-S. Choice Scarf users such as Koraidon and Miraidon can also revenge Zacian-C, so checks to them such as Landorus-T and Ting-Lu, respectively, are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Taka", "user_id": 595062}], "teams": [{"name": "Quality checked by", "members": [{"username": "Frozoid", "user_id": 532881}, {"username": "WrathoftheLeopard", "user_id": 511181}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Eternatus": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Eternatus is usually seen on bulky offense and balance teams, as it is a decent check to Pokemon such as Arceus-Fairy and Kyogre, and it can set up and absorb Toxic Spikes. Flamethrower is used to hit Zacian-C, which can otherwise take advantage of Eternatus's inability to damage it. Dragon Tail phazes setup sweepers like Arceus and Calm Mind Kyogre, and it can also annoy switch-ins to Eternatus such as Ting-Lu and Clodsire with Toxic Spikes able to poison the former. Toxic is used to immediately put Pokemon such as Calm Mind Arceus formes on a timer, while Toxic Spikes is used to spread status across the opposing team. Tera Fairy makes Eternatus immune to Dragon-type moves from Pokemon such as Miraidon and Koraidon. Tera Water allows Eternatus to resist both Ice Beam from Kyogre as well as Behemoth Blade from Zacian-C. Tera Steel flips the matchup on Zacian-C, Koraidon, and Miraidon while resisting Arceus's Extreme Speed. 176 Speed EVs are used to outspeed Calm Mind Arceus formes that can otherwise take advantage of Eternatus with Taunt. 96 HP EVs allow Eternatus to live Dragon Claw from Jolly Koraidon at full HP. An alternative, bulkier spead spread of 212 HP / 252 SpD / 44 Spe can be run with a Calm nature, with 44 Speed EVs allowing Eternatus to outspeed Timid Kyogre. This spread, however, makes Eternatus vulnerable to Taunt Arceus formes such as Arceus-Fairy, so teammates that can revenge kill them, such as Zacian-C and Koraidon, or deal with then otherwise, such as Encore Calyrex-S, are appreciated. Eternatus is also able to lure in Ting-Lu and weaken it, so teammates that can take advantage of its ability to do so, such as Calyrex-S and Miraidon, are appreciated. Similarly, Pokemon such as Zacian-C, Extreme Killer Arceus, and Koraidon appreciate Eternatus's ability to take advantage of their checks such as Skeledirge and Arceus-Fairy, and they threaten Ting-Lu and Clodsire for it in return. Eternatus also appreciates teammates such as Landorus-T and Ting-Lu, which can set up additional entry hazards, while also providing Eternatus with refuge from the likes of Miraidon, Koraidon, Arceus-Ground, and Calyrex-S. Eternatus is a great fit for balance and bulky offense teams due to its ability to absorb Toxic Spikes, thus enabling offensive teammates such as Koraidon, Calyrex-S, and Arceus formes without Heavy-Duty Boots.</p>"
      },
      "Offensive": {
        "description": "<p>Life Orb Eternatus is a good wallbreaker and most importantly a Toxic Spikes absorber that is usually seen on hyper offense teams. Both Fire Blast and Flamethrower are used for Zacian-C and Tera Steel Pokemon. Fire Blast is preferred because it OHKOes Zacian-C with one layer of Spikes, but Flamethrower is a more reliable, weaker alternative. Recover allows Eternatus to preserve its HP, allowing it to have its presence for longer in the game. After one Agility, Eternatus outspeeds the whole metagame, making it harder to revenge kill and potentially letting it clean up weakened teams. Since Agility makes Eternatus faster than the whole metagame, a Modest nature can be run for more power. Alternatively, Toxic Spikes can be run to rack up poison damage on foes for teammates. Tera Steel gives Eternatus a much-needed resistance to Dragon-type moves from Koraidon and Miraidon, Extreme Speed from Arceus, Psychic-type moves from Calyrex-S, and Steel- and Fairy-type moves from Zacian-C. Tera Fire also helps against Zacian-C, lets Fire Blast OHKO Tera Steel Giratina-O after Stealth Rock, and lets Flamethrower OHKO Zacian-C. Tera Dragon boosts Dynamax Cannon, 2HKOing bulky Arceus formes, 3HKOing Ting-Lu, and 2HKOing bulky Kyogre. Eternatus appreciates teammates that put pressure on Ting-Lu, which include Pokemon like Swords Dance Koraidon, Nasty Plot Calyrex-S, Extreme Killer Arceus, Arceus-Ground, and Arceus-Fairy. Calyrex-S, Eternatus, and Miraidon weaken Ting-Lu for each other, enabling one of them to potentially sweep. This allows Pokemon like Extreme Killer Arceus, Arceus-Fairy, and Arceus-Ground to use Eternatus getting revenge killed as an opportunity. Extreme Killer Arceus can use Choice-locked Calyrex-S as an opportunity to set up Swords Dance, Arceus-Fairy can use Koraidon to set up Calm Mind, and Arceus-Ground can threaten out Zacian-C, enabling it to set up Dragon Dance or Calm Mind. Hyper offense leads such as Ribombee, which lets Eternatus outspeed the entire unboosted metagame, and Glimmora, which sets up entry hazards to weaken checks such as Ting-Lu, are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "eavo", "user_id": 609321}, {"username": "Adhiraj8202", "user_id": 631210}], "teams": [{"name": "Quality checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Taka", "user_id": 595062}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Calyrex-Shadow": {
    "outdated": true,
    "sets": {
      "Nasty Plot": {
        "description": "<p>Nasty Plot Calyrex-S is an astounding, self-sufficient wallbreaker and sweeper that outspeeds all non-Choice Scarf Pokemon, has the potential to snowball out of control, and fits on a variety of teams. Grass Knot 3HKOes Ting-Lu and provides good neutral coverage against foes such as Arceus and Arceus-Dark. Encore punishes Extreme Killer Arceus and Calm Mind Arceus formes for using a Normal-type or status move, while Psyshock hits Pokemon like Eternatus, Clodsire, and Tera Poison Ting-Lu. Tera Blast is a more niche option for the fourth moveslot that OHKOes Pokemon like Arceus and Wo-Chien at +2 with Tera Fighting. Heavy-Duty Boots lets Calyrex-S repeatedly switch in and fire off attacks, likely allowing it to outlast its checks. At +2, Tera Grass-boosted Grass Knot OHKOes Arceus after slight chip damage and OHKOes Ting-Lu; Tera Grass also allows Calyrex-S to take attacks like Arceus's Shadow Claw, Ting-Lu's Payback, and Arceus-Ground's Earthquake. Tera Ghost lets Astral Barrage achieve feats such as OHKOing Koraidon with a layer of Spikes, OHKOing Zacian-C after Rocky Helmet damage from a teammate, OHKOing defensive Arceus formes at +2, and 3HKOing Terastallized Ting-Lu. All Koraidon sets threaten Ting-Lu and Arceus, the primary switch-ins to Calyrex-S, and Choice Scarf Koraidon can use U-turn to safely pivot Calyrex-S in against Pokemon like Skeledirge, while Scale Shot Koraidon appreciates Encore Calyrex-S taking advantage of Arceus aiming to revenge kill it with Extreme Speed. Calyrex-S pairs well with checks to Arceus and Choice Scarf Koraidon, such as Landorus-T, Toxapex, and Skeledirge. It also appreciates Ting-Lu checking other Choice Scarf users such as Miraidon and opposing Calyrex-S; moreover, Ting-Lu, like Landorus-T, can trade entry hazards with opposing Ting-Lu that switch into Calyrex-S. Calyrex-S, Miraidon, and Calm Mind Arceus-Ground can weaken Ting-Lu for each other, potentially enabling one of them to sweep.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Calyrex-S is an incredibly effective wallbreaker with limited defensive counterplay and immense versatility. Trick cripples Calyrex-S's common switch-ins, Ting-Lu and Arceus, and forces Arceus to lock into Shadow Claw. Grass Knot offers good neutral coverage and the ability to hit the omnipresent Ting-Lu. Psyshock is preferred over Psychic because it hits Calm Mind Arceus formes harder, whereas Psychic always 2HKOes Arceus. Tera Ghost boosts Astral Barrage's damage to horrific levels, making it capable of OHKOing defensive Arceus formes after minor chip damage, and the lessened Ghost- and Dark-type weaknesses let Calyrex-S live Arceus's Shadow Claw and Arceus-Dark's Foul Play. Tera Grass instead boosts Grass Knot to be on par with Astral Barrage; it easily 2HKOes Arceus and Arceus-Dark and OHKOes Ting-Lu with two layers of Spikes. Calyrex-S's self sufficiency as a wallbreaker and tendency to overwhelm its checks make it very easy to fit on a variety of teams. Offensive teams appreciate its massive power and the utility provided from it outspeeding and OHKOing most offensive threats and can provide it ample opportunities with U-turn from Pokemon like Landorus-T and Koraidon. Balance teams appreciate its self-sufficient nature while providing it with refuge from revenge killers, like Choice Scarf Koraidon and Giratina-O, with Pokemon like Toxapex and defensive Arceus formes. Koraidon is a great partner that threatens Ting-Lu and Arceus—which would otherwise deter Calyrex-S from using Astral Barrage—and can use U-turn to safely pivot Calyrex-S in against its own counters that Calyrex-S terrifies, like Skeledirge and Toxapex. Miraidon and Calm Mind Arceus-Ground appreciate Calyrex-S beating down Ting-Lu with repeated attacks, making them incredibly difficult for most teams to handle.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Calyrex-S is an amazing revenge killer and late-game cleaner found on balance and bulky offense teams due to it outspeeding the entire metagame, including Scale Shot Koraidon and other Choice Scarf users. Grass Knot deals significant damage to Pokemon like Ting-Lu and Arceus-Ground. Psychic allows Calyrex-S to OHKO Koraidon, unlike Psyshock, while also helping out with Extreme Killer Arceus. Trick is used to cripple switch-ins such as Ting-Lu and Extreme Killer Arceus, providing utility especially in matchups where Speed is less important. Tera Ghost boosts the power of Astral Barrage, allowing Calyrex-S to OHKO Zacian-C after some chip damage and 2HKO defensive Arceus formes, and it lets Calyrex-S survive Shadow Claw from Extreme Killer Arceus and Payback from Ting-Lu due to the reduced weaknesses. Tera Grass is an alternative option to 2HKO Ting-Lu with Grass Knot. Calyrex-S appreciates offensive teammates such as Koraidon, Zacian-C, and Extreme Killer Arceus, which can threaten its checks such as Ting-Lu, opposing Arceus, and Arceus-Dark; in return, it threatens their checks such as Toxapex, Skeledirge, and Landorus-T. Miraidon and Calm Mind Arceus-Ground are also excellent teammates for Calyrex-S, as all three weaken each other's checks, potentially leading to one of them cleaning up late-game. Choice Scarf Calyrex-S also frees up an item slot for Koraidon, allowing it to run Swords Dance or Choice Band sets. Partners that can bring Calyrex-S into the field with U-turn, such as Miraidon, Koraidon, and Landorus-T are preferred. Teammates that are able to check Extreme Killer Arceus for Calyrex-S, which can otherwise revenge kill it, such as Landorus-T, Toxapex, Skeledirge, and defensive Arceus formes, are also appreciated.</p>"
      },
      "Life Orb": {
        "description": "<p>Life Orb Calyrex-S is the single best wallbreaker in AG, boasting an unrivaled Speed tier and unresisted coverage, outside of Wo-Chien. Nasty Plot, when paired with Psychic, lets Calyrex-S OHKO most Arceus formed after a single boost. Encore is an alternative to take advantage of Arceus by locking it into Extreme Speed and setup sweepers such as Calm Mind Arceus formes. Grass Knot primarily pressures Ting-Lu and Arceus formes. Psyshock is an alternative to Psychic that's stronger against Eternatus and Calm Mind Arceus formes. Tera Grass makes Calyrex-S's Grass Knot much more spammable, letting it 2HKO Arceus formes and more easily break past Ting-Lu, lose a weakness to Shadow Claw from Arceus and Payback from Ting-Lu, and resist Ground-type coverage from Arceus-Ground and Ting-Lu. Calyrex-S is a superb wallbreaker, so partners such as Miraidon and Calm Mind Arceus formes appreciate it forcing progress against special walls in Ting-Lu and Arceus. Calyrex-S can be pressured by a surprise Terastallization from Pokemon such as Giratina-O and Arceus, so having a solid defensive core with Arceus formes and Landorus-T or Toxapex is appreciated to check them. Calyrex-S is also forced out by Choice Scarf users such as Koraidon, Miraidon, Kyogre, and other Calyrex-S, so having checks to them such as Landorus-T, Ting-Lu, Eternatus, and Arceus, respectively, are appreciated. Entry hazard support from the aforementioned Pokemon and Glimmora also makes it easier for Calyrex-S to break through defensive structures. Hyper offense leads such as Grimmsnarl and Ribombee can support Calyrex-S by making it harder to revenge kill. Finally, Calyrex-S is completely walled by Wo-Chien, so teammates that can take advantage of it such as Koraidon, Zacian-C, Taunt Miraidon, and Arceus-Fairy are appreciated. Koraidon can pivot in Calyrex-S into Koraidon’s checks, such as Skeledirge, Toxapex, and Landorus-T.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "TaxFraud", "user_id": 584685}, {"username": "Taka", "user_id": 595062}, {"username": "eavo", "user_id": 609321}], "teams": [{"name": "Quality checked by", "members": [{"username": "Frozoid", "user_id": 532881}, {"username": "Taka", "user_id": 595062}, {"username": "Adhiraj8202", "user_id": 631210}, {"username": "WrathoftheLeopard", "user_id": 511181}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Gangsta Spongebob", "user_id": 535530}]}]}
  },
  "Skeledirge": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Skeledirge is a good physical wall, acting as an important check to Koraidon, Zacian-C, and Extreme Killer Arceus. It can switch into these powerful Swords Dance sweepers, beating them or halting their sweep. Torch Song allows it to potentially sweep a weakened team late-game. Earth Power is an option that chips Miraidon and Eternatus as well as giving it a super effective hit against Tera Fire Zacian-C and Koraidon. Fairy is the ideal Tera type, giving Skeledirge an immunity to Koraidon's Dragon-type attacks and removing its weaknesses to Ground- and Ghost-type attacks from foes like Arceus-Ground, Calyrex-S, and Giratina-O. Tera Flying is a niche option that further improves its matchup against Arceus-Ground while avoiding super effective Behemoth Blade from Zacian-C. Skeledirge is a good fit on balance teams that appreciate it checking common setup threats and carrying teammates that make up for its shortcomings and bad matchups. Skeledirge is very vulnerable to Miraidon, Kyogre, Calyrex-S, and Arceus-Ground, so it appreciates teammates like Ting-Lu, Eternatus, Wo-Chien, and Giratina-O to handle these powerful attackers. Likewise, Skeledirge pairs well with fast attackers and priority users such as Calyrex-S, Choice Scarf Koraidon, and Extreme Killer Arceus, which can threaten the foes that force Skeledirge out and revenge kill Pokemon it checks if it is overwhelmed.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}], "teams": [{"name": "Quality checked by", "members": [{"username": "TaxFraud", "user_id": 584685}, {"username": "WrathoftheLeopard", "user_id": 511181}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Glimmora": {
    "outdated": true,
    "sets": {
      "Entry Hazard Lead": {
        "description": "<p>Glimmora is an excellent entry hazard lead due to its ability Toxic Debris and access to Mortal Spin, which helps it prevent hazards from opposing leads such as Ribombee while also inflicting poison on opposing Pokemon. Dazzling Gleam is used to OHKO Koraidon, which may otherwise use Glimmora as setup fodder, and significantly dent Defog Giratina-O. Memento is used to remove any boosts obtained by Pokemon trying to set up on Glimmora while also gaining momentum. Mud Shot is used to deter setup from the likes of Zacian-C, Calyrex-S, and Calm Mind Arceus formes. Tera Steel enables Glimmora to spinblock opposing Glimmora. Tera Fairy grants an immunity to Scale Shot from Koraidon, which may otherwise break through Glimmora's Focus Sash. Tera Ghost is an alternative option to prevent Rapid Spin from opposing leads such as Great Tusk. A bulky EV spread of 80 Def / 224 SpA / 204 Spe with a Bold nature can be used to prevent Scale Shot Koraidon from OHKOing non-Terastallized Glimmora. Alternatively, maximum Speed investment allows Glimmora to outpace Taunt defensive Arceus formes. As Glimmora fits best on hyper offense teams, teammates that benefit from the hazards set by it such as Calyrex-S, Calm Mind Arceus-Ground, Miraidon, Koraidon, Extreme Killer Arceus, and Zacian-C are appreciated. Grimmsnarl is also a good partner for Glimmora, with Grimmsnarl being able to set dual screens after Glimmora has set up entry hazards.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "eavo", "user_id": 609321}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "Taka", "user_id": 595062}, {"username": "Frozoid", "user_id": 532881}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Clodsire": {
    "outdated": true,
    "sets": {
      "Specially Defensive": {
        "description": "<p>Clodsire's solid special bulk, access to entry hazards, and ability to absorb Toxic Spikes give it a niche in checking Miraidon, Arceus-Fairy, and some variants of Calyrex-S. However, it faces competition from Ting-Lu, which similarly checks Miraidon and Calyrex-S, has more offensive pressure, and gets Spikes up more easily. Spikes and Toxic Spikes give Clodsire a way to exert offensive pressure, alongside Earthquake which punishes Miraidon and Zacian-C on switch-in. Poison Jab can be used over Toxic or Toxic Spikes to potentially punish Taunt variants of Arceus-Fairy, but it is generally outclassed by the other options. Water Absorb makes Clodsire a more solid check to Miraidon, since Unaware ignores Draco Meteor's Special Attack drop, and lets Clodsire check Arceus-Water and variants of Kyogre without Substitute. Unaware is an alternative checks Calyrex-S more consistently. Tera Steel flips Clodsire's weakness to Ice- and Psychic-type attacks such as Kyogre's Ice Beam and Calyrex-S's Psyshock, while making Clodsire more reliable into Miraidon's Draco Meteor. Tera Dark makes Clodsire weaker to Arceus-Fairy and Miraidon, but checks Calyrex-S without a Fighting- or Fairy-type move, as well as Calm Mind Arceus-Ground. Clodsire's ability to both absorb Toxic Spikes and check various special attackers gives it a niche on balance and stall teams. Clodsire pairs well with physical walls such as Gliscor, Toxapex, Dondozo, and Skeledirge, as they can check Koraidon, physical variants of Arceus formes, and Zacian-C. Secondary special walls such as Blissey are appreciated to ease the burden on Clodsire against Calyrex-S, Calm Mind Arceus-Ground, and Kyogre. Wo-Chien also checks these threats and helps against Dragon Dance variants of Arceus-Ground. Arceus is another partner for Clodsire that can pivot into Calyrex-S on balance teams, and appreciates Clodsire setting Spikes and clearing Toxic Spikes for it.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Taka", "user_id": 595062}], "teams": [{"name": "Quality checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "corvere", "user_id": 306317}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Kingambit": {
    "outdated": true,
    "sets": {
      "Swords Dance": {
        "description": "<p>Thanks to Supreme Overlord, STAB-boosted Sucker Punch acting as vital priority, and its high Attack, Kingambit cements itself as a good late-game cleaner and revenge killer, that offensively checks Arceus and Calyrex-S. Swords Dance-boosted Kowtow Cleave allows Kingambit to 2HKO Toxapex and Landorus-T. Iron head hits Arceus-Fairy and other Tera Fairy Pokemon such as Toxapex and Skeledirge. Dread Plate is the preferred item of choice because it boosts Kingambit's Dark-type moves, allowing Sucker Punch to more effectively clean up late-game. Alternatively, Leftovers provides Kingambit with more longevity throughout the game, allowing it to potentially outlast its checks. 132 Speed EVs allow Kingambit to outspeed Skeledirge. Tera Dark boosts Kingambit's Dark-type moves to horrifying levels, allowing it to OHKO Landorus-T, Eternatus, offensive Arceus-Ground, and Miraidon at +2, and OHKO Toxapex with 1 layer of Spikes at +2. +2 Tera Dark Sucker Punch with 5 allies fainted allows Kingambit to achieve amazing feats, such as OHKOing Extreme Killer Arceus and offensive Arceus-Ground, as well as 2HKOing Koraidon and Zacian-C after 1 layer of Spikes. On the other hand, Tera Flying lets Kingambit set-up against Pokemon such as Ting-Lu, Arceus-Ground, Landorus-T, and Koraidon. Tera Fire makes Kingambit immune to Will-O-Wisp from Skeledirge, Giratina-O, and defensive Arceus formes and gives it a much-needed resistance to attacks like Koraidon's Flare Blitz and Zacian-C's STAB moves. Kingambit struggles with Toxapex, Landorus-T, and defensive Arceus formes, so offensive checks to them such as Arceus-Ground, Calyrex-S, and Miraidon are appreciated. Kingambit also struggles with Koraidon and Arceus-Ground, so checks to them such as Toxapex, Landorus-T, and Ting-Lu are appreciated. Teammates such as Arceus, Koraidon, and Zacian-C weaken physical walls like Skeledirge, Toxapex, and Landorus-T for Kingambit. Arceus in particular shares the burden of checking Calyrex-S alongwith Kingambit. Glimmora as a suicide lead can set up entry hazards, which Kingambit appreciates to break through defensive Arceus formes.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Adhiraj8202", "user_id": 631210}], "teams": [{"name": "Quality checked by", "members": [{"username": "corvere", "user_id": 306317}, {"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Taka", "user_id": 595062}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Wo-Chien": {
    "outdated": true,
    "sets": {
      "Specially Defensive": {
        "description": "<p>Wo-Chien's unique typing and movepool backed by its high, Tablets of Ruin-boosted bulk grants it a solid place in the metagame, checking threats such as Calyrex-S, Arceus-Ground, and Kyogre. Leech Seed reduces Wo-Chien's passivity while allowing teammates to heal after switching in. Ruination hits foes like Arceus-Fairy, Ting-Lu, and Giratina-O. Foul Play is a stronger alternative against physical attackers like Arceus and Dragon Dance Arceus-Ground that also does a decent chunk of damage to Koraidon and Zacian-C and allows Wo-Chien to punish physical attackers that have Taunt. Knock Off gives Wo-Chien more of a niche due relevant Pokemon that learn it being rare, and it is useful against foes like Ting-Lu and Landorus-T. However, Arceus formes, which can absorb Knock Off without losing their items, are quite omnipresent. Protect lets Wo-Chien safely rack up Leftovers and Leech Seed recovery. Alternatively, Taunt shuts down setup and entry hazard Pokemon such as Arceus formes and Ting-Lu on the switch. Tera Poison gives Wo-Chien key resistances to attacks like Koraidon's Low Kick, Zacian-C's Play Rough, Double Dance Miraidon's Dazzling Gleam, and the omnipresent U-turn from foes like Landorus-T, Koraidon, and Miraidon while also offering an immunity to Toxic and letting Wo-Chien absorb Toxic Spikes. However, Tera Poison also makes Wo-Chien weak to Ground-type moves from Arceus-Ground and Psychic-type moves from Calyrex-S, respectively. Wo-Chien fits best on balance and bulky offense teams that appreciate its ability to check Calyrex-S and Arceus-Ground while offering good recovery via Leech Seed to teammates. Wo-Chien benefits from teammates such as Skeledirge, Toxapex, and Landorus-T, which check Koraidon and Zacian-C for it. Special attackers in Arceus-Fairy, Substitute Kyogre, and Eternatus trouble Wo-Chien, so offensive checks to them such as Zacian-C, Choice Scarf Koraidon, Arceus, and Calyrex-S are appreciated. Water Absorb Closdire as a defensive teammate checks Arceus-Fairy, Kyogre, and Eternatus while setting up hazards.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Adhiraj8202", "user_id": 631210}], "teams": [{"name": "Quality checked by", "members": [{"username": "TaxFraud", "user_id": 584685}, {"username": "corvere", "user_id": 306317}, {"username": "Taka", "user_id": 595062}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Ting-Lu": {
    "outdated": true,
    "sets": {
      "Hazard Support": {
        "description": "<p>Ting-Lu, or more accurately the Spikes that it effortlessly stacks, defines the AG metagame like little else due to the scarcity of relevant Defog and Rapid Spin users or airborne Pokemon. An incredible defensive profile allows Ting-Lu to be a consistent, valuable check to Calyrex-S, Miraidon, and Calm Mind Arceus-Ground. Taunt prevents Arceus formes from setting up or healing and shuts down Toxapex. Ruination reduces Ting-Lu's passivity and hits Giratina-O and Landorus-T. Earthquake hits Miraidon and prevents Zacian-C from safely switching in, while Payback OHKOes Calyrex-S and—with Ting-Lu's low Speed—consistently has 100 Base Power. Whirlwind can be used over Taunt or Ruination on teams that are more vulnerable to setup sweepers like Calm Mind Arceus-Ground. Fissure is a niche alternative over Ruination that helps with Taunt Arceus formes and is more of a threat to setup Pokemon. Tera Grass, Poison, and Steel all allow it to resist Calyrex-S's Grass Knot and offer varying defensive utility, with Tera Grass helping with Kyogre and Arceus-Ground, Tera Poison helping with Koraidon and Toxic Spikes, and Tera Steel helping with Arceus and Miraidon. Ting-Lu's defensive utility and the pressure brought by its entry hazards are appreciated by nearly every team bar hyper offense. Ting-Lu is vulnerable to strong physical attackers like Zacian-C and Koraidon, so teammates that can check them, like Landorus-T on bulky offense teams and Toxapex and Skeledirge on balance teams, make for natural partners. Extreme Killer Arceus is a great partner that helps check Calyrex-S and appreciates Ting-Lu's Spikes bringing opposing Pokemon into Extreme Speed range. Zacian-C is another attacker that loves Spikes weakening its targets and checks Arceus-Fairy in return.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "TaxFraud", "user_id": 584685}], "teams": [{"name": "Quality checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Taka", "user_id": 595062}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Koraidon": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Koraidon is one of the best revenge killers in the metagame. Flare Blitz hits Arceus-Fairy, Calyrex-S, and Zacian-C. Low Kick threatens Arceus and Ting-Lu and is Koraidon's preferred STAB move for its 120 Base Power against the majority of the metagame without Close Combat's downside. Outrage and Dragon Claw both OHKO Miraidon and opposing Koraidon, but Outrage is preferred for its ability to 2HKO Toxapex and Skeledirge, though it lets any remaining Fairy-types easily revenge kill Koraidon. An Adamant nature allows Choice Scarf Koraidon to 2HKO Arceus-Fairy after Stealth Rock and always OHKO Calyrex-S. Tera Fire boosts Flare Blitz's power to insane levels, gives Koraidon a Will-O-Wisp immunity, and allows it to resist attacks from Arceus-Fairy and Zacian-C. Tera Ghost makes Koraidon immune to Extreme Speed, letting it more effectively serve as an Extreme Killer Arceus check. Koraidon can use U-turn to safely pivot in Pokemon like Calyrex-S and Calm Mind Arceus-Ground, which threaten its checks such as Toxapex and Skeledirge. Teammates like Calm Mind Arceus-Fairy, Zacian-C, and Arceus can weaken Koraidon's checks and potentially bait out Terastallization, enabling Koraidon to clean up late-game. Defensive teammates like Ting-Lu and Landorus-T are appreciated. Ting-Lu checks Choice Scarf users faster than Koraidon, such as Calyrex-S and Miraidon, and provides entry hazard support. Landorus-T offers immense utility via U-turn, bringing pokemon like Calm Mind Arceus-Ground and Calyrex-S in to threaten Koraidon's checks. Rocky Helmet also helps to chip opposing Koraidon, Zacian-C, and Extreme Killer Arceus to bring them into Low Kick range.</p>"
      },
      "Swords Dance": {
        "description": "<p>Koraidon is one of the best setup sweepers thanks to its perfect coverage and good Speed tier. Scale Shot, when paired with Loaded Dice, gives Koraidon an incredibly strong Dragon-type STAB attack that lets it outspeed Zacian-C and Calyrex-S and break Eternatus, Giratina-O, Skeledirge, and Toxapex. Flare Blitz is Koraidon's best way of hitting Arceus-Fairy, Zacian-C, and Calyrex-S. Low Kick is Koraidon's most spammable move, being 120 Base Power against most of the metagame without the drawback of Close Combat, and it threatens Arceus. Tera Fire gives Koraidon a Fairy-type resistance, letting it beat both Arceus-Fairy and Zacian-C, gives Koraidon a Will-O-Wisp immunity, and increases Flare Blitz's damage output. Tera Ghost gives Koraidon an immunity to Extreme Speed. Koraidon fits best on offensive teams, where it can break through physical walls for its teammates. Teammates like Zacian-C and Arceus can bait out Terastallization, making it easier for Koraidon to sweep. In return, Koraidon can break through physical walls such as Skeledirge, Toxapex, and Landorus-T for them, as it 2HKOes all three with Scale Shot. Koraidon is reliant on Scale Shot's Speed boost to avoid being revenge killed by Calyrex-S, Zacian-C, and Choice Scarf Koraidon, so having teammates that can take advantage of Fairy-types that switch into Koraidon, such as Landorus-T and Skeledirge for Zacian-C and Zacian-C and Toxapex for Arceus-Fairy, are appreciated. Finally, Scale Shot's Defense drop means that Koraidon is susceptible to priority such as Arceus's Extreme Speed. As such, Pokemon that can switch into Arceus, such as Landorus-T and Zacian-C, and Pokemon that can break through it, such as Life Orb Calyrex-S, are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Taka", "user_id": 595062}, {"username": "Adhiraj8202", "user_id": 631210}], "teams": [{"name": "Quality checked by", "members": [{"username": "Frozoid", "user_id": 532881}, {"username": "TaxFraud", "user_id": 584685}, {"username": "WrathoftheLeopard", "user_id": 511181}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Miraidon": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Miraidon is a decent speed control option, wallbreaker, and pivot found on balance and bulky offense teams. Overheat is used to OHKO Zacian-C and is also a midground into Fairy- and Ground-types. Tera Electric boosts the power of Miraidon's Electro Drift, allowing it to OHKO Calyrex-S, OHKO Zacian-C without needing Overheat while preventing foes like Arceus from setting up, and deal significant damage to Arceus formes, and it also lets Miraidon take neutral damage from attacks like Arceus-Fairy's Judgment. Tera Dragon boosts the damage of Draco Meteor, allowing it to OHKO Calyrex-S, potentially break past Ting-Lu, and, after a layer of Spikes, OHKO uninvested Arceus formes and Kyogre; Tera Dragon also removes Miraidon's weakness to Ground-type moves from Arceus-Ground and Ting-Lu. Tera Ghost provides Miraidon with a much-needed immunity to Arceus's Extreme Speed and Koraidon's Low Kick and a neutrality against all previously super effective attacks. Physical attackers like Swords Dance Koraidon, Zacian-C, and Arceus are great teammates, as Miraidon can switch in on their checks such as Toxapex and Skeledirge and pivot them in on its checks like Ting-Lu in return. Other offensive teammates such as Calm Mind Arceus-Ground and Calyrex-S are also notable partners for Miraidon, as the three of them wear down Ting-Lu for each other, enabling one of them to sweep late-game. Teammates such as Ting-Lu, Skeledirge, Toxapex, Landorus-T, and defensive Arceus formes are appreciated, as they provide Miraidon with refuge from the likes of Choice Scarf Calyrex-S and Extreme Killer Arceus.</p>"
      },
      "Calm Mind": {
        "description": "<p>Calm Mind Miraidon is able to fit on balance and bulky offense teams as a potent wallbreaker due to the raw power provided to it by its ability, Hadron Engine, and great Special Attack. Overheat is used as a midground into teams with both Ground- and Fairy-types. Solar Beam when paired with sun or Power Herb allows Miraidon to hit Ting-Lu super effectively while avoiding the drawbacks of Draco Meteor. Tera Dragon boosts Draco Meteor's damage to horrifying levels, allowing Life Orb Miraidon to OHKO Ting-Lu after one Calm Mind boost and OHKO Arceus-Ground unboosted, both after one layer of Spikes, and it removes Miraidon's Ground-type weakness. Tera Grass allows Life Orb Miraidon to OHKO Ting-Lu with a little bit of chip damage and resist Ground-type moves from Ting-Lu and Arceus-Ground. Life Orb is the preferred item due to it letting Miraidon more easily KO foes such as Ting-Lu and Arceus formes. Alternatively, Heavy-Duty Boots provides Miraidon with greater longevity, letting it come in more freely and potentially outlast its checks. Power Herb is also an option to remove the need of setting sun for Miraidon, allowing it to use Solar Beam freely once. Koraidon is an absolutely mandatory partner for Miraidon running Solar Beam without Power Herb, as it sets up sun for Miraidon and can also pivot it in. Teammates such as Calm Mind Arceus-Ground and Calyrex-S are highly appreciated, as after Miraidon gets rid of Ting-Lu for them, they can potentially sweep. Zacian-C, Koraidon, and Arceus are also highly valuable teammates for Miraidon, as it is able to switch into their checks such as Skeledirge and Toxapex with ease, set up Calm Mind, and heavily damage or potentially KO switch-ins such as Ting-Lu. As Miraidon is easily revenge killed by Pokemon such as Choice Scarf Calyrex-S, Choice Scarf Koraidon, Extreme Killer Arceus, and Zacian-C, checks to them such as Ting-Lu, defensive Arceus formes, Landorus-T, and Toxapex are greatly appreciated.</p>"
      },
      "Pivot": {
        "description": "<p>Miraidon is a good wallbreaker and pivot found on a variety of balance and bulky offense teams due to its excellent Speed and power. Taunt provides utility by preventing opposing Ting-Lu, utility Arceus formes, and leads such as Glimmora and Ribombee from setting up entry hazards, and it also prevents Pokemon such as Arceus formes from setting up on Miraidon and stops Arceus and Clodsire from using Recover. U-turn enables Miraidon to allow offensive partners to come in against its checks such as Ting-Lu and Arceus-Ground, providing momentum. Tera Dragon boosts Draco Meteor to be able to break through Ting-Lu while also making Miraidon neutral to its Earthquake. Tera Electric boosts Electro Drift, allowing it to OHKO Arceus-Fairy after one layer of Spikes, OHKO Zacian-C, and OHKO Calyrex-S while also taking neutral damage from attacks like Zacian-C's Play Rough and Arceus-Fairy's Judgment. Tera Ghost prevents Extreme Killer Arceus from revenge killing Miraidon while also making it neutral to all previously super effective attacks. Heavy-Duty Boots provides longevity to Miraidon, allowing it to outlast its checks and repeatedly pivot in its offensive teammates. Calm Mind Arceus-Ground and Calyrex-S are also notable partners for Miraidon, as the three of them wear down Ting-Lu for each other. Teammates such as Zacian-C, Extreme Killer Arceus, and Koraidon are beneficial for Miraidon, as they threaten Ting-Lu for it. In return, Miraidon is also able to switch into their checks such as Toxapex and Skeledirge and force them out. Defensive Pokemon such as Ting-Lu, Landorus-T, and defensive Arceus formes are appreciated as well, as Miraidon gets forced out by Calyrex-S, Choice Scarf Koraidon, Zacian-C, and Extreme Killer Arceus. As Miraidon is not able to check faster threats by itself, some form of Speed control such as Extreme Killer Arceus or Choice Scarf Koraidon is necessary.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Miraidon is an excellent wallbreaker found on balance and bulky offense teams due to the raw power Hadron Engine gives it. Overheat is used as a midground into teams with both Ground- and Fairy-types. Solar Beam under sun allows Miraidon to 2HKO Ting-Lu and hit Arceus-Ground without the drawbacks of Draco Meteor. Tera Dragon boosts Draco Meteor to insane levels, enabling it to 2HKO Ting-Lu. Tera Grass lets Solar Beam OHKO Ting-Lu after a single layer of Spikes and lets Miraidon resist Ground-type attacks from Ting-Lu and Arceus-Ground. Koraidon is an excellent teammate for Miraidon due to its sun allowing Miraidon to use Solar Beam and boosting the damage of Overheat. Other good offensive teammates include Calyrex-S and Calm Mind Arceus formes, which appreciate Miraidon weakening Ting-Lu and Clodsire for them, potentially enabling them to sweep. Additionally, physically offensive teammates such as Zacian-C, Extreme Killer Arceus, and Koraidon benefit from Miraidon being able to switch into their checks such as Skeledirge with ease in order to threaten them. In return, they take advantage of Ting-Lu for Miraidon, potentially setting up on it. As Pokemon such as Zacian-C, Choice Scarf Koraidon, and Calyrex-S can revenge kill Miraidon, checks to them such as Skeledirge, Landorus-T, Toxapex, defensive Arceus formes, and Ting-Lu are appreciated.</p>"
      },
      "Double Dance": {
        "description": "<p>Double Dance Miraidon is an excellent sweeper thanks to its great ability, movepool, and Special Attack and Speed stats. Agility lets Miraidon outspeed all Pokemon in the metagame, including Choice Scarf users such as Calyrex-S and Koraidon. Parabolic Charge lets Miraidon heal itself, making it harder to revenge kill. Dazzling Gleam and Dragon Pulse both hit Dragon-types such as Koraidon, opposing Miraidon, and Giratina-O, but Dazzling Gleam should be used with Tera Fairy and hits Ting-Lu harder, while Dragon Pulse should be used with Tera Dragon and is less reliant on Terastallizing to beat other Ground-types and Eternatus. Leftovers increases Miraidon's overall longevity, while Electric Seed improves its matchup against physical attackers such as Arceus, Zacian-C, and Koraidon, but is single-use. Tera Fairy is great defensively, letting Miraidon set up on Pokemon such as Koraidon, Giratina-O, Arceus-Ground, and opposing Miraidon; it also lets Dazzling Gleam 2HKO Ting-Lu with a layer of Spikes and Arceus-Ground at +1. Tera Dragon is used to remove Miraidon's Ground weakness and boost Dragon Pulse's damage, letting it 2HKO Clodsire and Ting-Lu and OHKO offensive Arceus-Ground at +1 after a layer of Spikes. 92 Speed EVs let Miraidon outpace Choice Scarf Calyrex-S after Agility. Miraidon fits best on bulky offense and hyper offense teams, which try to overwhelm the opposing team. Dual screens let Miraidon set up more easily and make it harder to revenge kill, so Grimmsnarl is a great teammate on hyper offense teams. Miraidon also appreciates entry hazards from Pokemon such as Landorus-T and Glimmora, which can put Pokemon into its KO range. Miraidon can struggle to break through walls such as Clodsire and Ting-Lu, so it pairs well with other offensive Pokemon such as Calyrex-S, Calm Mind Arceus-Ground, and Calm Mind Arceus-Fairy, which can pressure the aforementioned walls for Miraidon. In return, Miraidon can weaken the same walls for these teammates to pick up on. Koraidon and Zacian-C threaten Ting-Lu and lure in physically defensive walls such as Toxapex and Skeledirge for Miraidon to set up against; Miraidon, Koraidon, and Zacian-C can also weaken defensive Arceus-Ground for each other.</p>"
      },
      "Agility": {
        "description": "<p>Agility Miraidon is a potent wallbreaker and late-game cleaner thanks to its incredible Special Attack and decent natural bulk. Dragon Pulse is chosen over Draco Meteor because of Draco Meteor's Special Attack drop, which would end a sweep haphazardly. Solar Beam, when paired with Koraidon's sun, hits Ting-Lu and Arceus-Ground. Tera Grass powers up Solar Beam enough to OHKO Ting-Lu after one layer of Spikes while resisting Ground-type moves from both Ting-Lu and Arceus-Ground. The given EV spread outspeeds Choice Scarf Calyrex-S after an Agility, lives Zacian-C's Play Rough without Intrepid Sword active, and lives Choice Specs Calyrex-S's Astral Barrage. Miraidon fits well on offensive teams as a strong wallbreaker and cleaner; partners like Calyrex-S, Calm Mind Arceus-Ground, and offensive Eternatus appreciate Miraidon luring Ting-Lu or at least forcing it to Terastallize. Pokemon that can Terastallize to beat Miraidon—such as Ting-Lu, Tera Grass Calyrex-S, and Tera Ground Zacian-C—are issues for it. Therefore, Miraidon pairs well with Pokemon that can take advantage of these, such as Extreme Killer Arceus and the aforementioned Calyrex-S. Extreme Killer Arceus can revenge kill Miraidon, so partners such as Landorus-T, Zacian-C, and Encore Calyrex-S are appreciated for maintaining offensive momentum. Koraidon is a mandatory partner for setting sun and easily pivoting Miraidon in on its checks such as Landorus-T, Skeledirge, and Toxapex.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Taka", "user_id": 595062}, {"username": "eavo", "user_id": 609321}, {"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Frozoid", "user_id": 532881}, {"username": "Adhiraj8202", "user_id": 631210}, {"username": "corvere", "user_id": 306317}, {"username": "Taka", "user_id": 595062}, {"username": "TaxFraud", "user_id": 584685}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}, {"username": "autumn", "user_id": 384270}, {"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Tea Guzzler", "user_id": 577920}, {"username": "Gangsta Spongebob", "user_id": 535530}]}]}
  }
}