{
  "Charizard": {
    "sets": {
      "Special Attacker": {},
      "Setup Sweeper": {
        "outdated": true,
        "description": "<p>With its excellent typing, coverage for nearly everything in PU, and a great Speed tier, Charizard is one of PU's most threatening sweepers. Dragon Dance gives a solid damage boost and also allows Charizard to outspeed common Scarf users after a boost, such as Flapple and Basculin; however, Swords Dance can be used instead, trading away extra Speed for more firepower. While Flare Blitz is the normal STAB move of choice for Charizard, Flame Charge can be used on Swords Dance sets, as it boosts Charizard's Speed and removes the recoil from Flare Blitz, although at the cost of being much weaker. Earthquake is valuable coverage, hitting Pokemon such as Carbink, Skuntank, and Lycanroc-N for super effective damage. Dragon Claw hits opposing Dragon-types such as Gabite and Tera Dragon Articuno for good damage, and Thunder Punch can deal solid damage into Water- and Flying-types such as Lumineon, Golduck, and opposing Charizard. Charizard's Tera Type is very adjustable; Tera Ground is normally preferred to resist Rock-type attacks from Pokemon such as Lycanroc-N, boost the power of Earthquake, and remove Charizard's weakness to the Electric-Type, while Tera Dragon allows for resistances to Water and Electric and should be used with Dragon Claw. Finally, Tera Electric should be used with Thunder Punch.</p> <p>Charizard's best partners are ones that can beat its offensive and defensive checks to open it up to set up and sweep easier. Wallbreakers such as Choice Band Basculin can help with the Ground-types that Charizard can struggle with. Grass-types such as Gogoat can threaten out Water- and Rock-types that would stop Charizard from setting up such as Basculin and Carbink. Articuno can U-turn to get Charizard in safely and checks the Dragon-types that would otherwise beat Charizard without Dragon Claw such as Gabite. In return, Charizard threatens out Steel-types that check Articuno. On Swords Dance sets, Sticky Web Masquerain can be a good partner, as it allows Charizard to beat the Choice Scarfers that normally outspeed and KO Swords Dance Charizard otherwise, such as Lycanroc-N.</p>"
      },
      "Mixed Dragon Dance": {"outdated": true}
    }
  },
  "Raichu": {
    "outdated": true,
    "sets": {
      "Encore Pivot": {
        "description": "<p>Raichu's good coverage, blazing Speed tier, and access to Encore make it one of the best offensive pivots available in the tier; it is able to outspeed common Pokemon like Pyroar and Basculin and hit them with powerful super effective moves. Encore can halt setup attempts from the likes of Bulk Up Gogoat, Nasty Plot Misdreavus, and opposing Nasty Plot Raichu while also potentially giving Raichu setup opportunities with Nasty Plot against Pokemon locked into recovery moves, such as Gogoat, Dachsbun, Chansey, and Articuno. Surf threatens Rock- and Ground-types like Carbink, Gabite, and Camerupt. Thunderbolt gives Raichu an Electric-type STAB move that doesn't force it to switch out. Tera Blast with either Tera Ice or Tera Ground gives Raichu crucial coverage against the likes of Gogoat, Flapple, and Dartrix or Electrode and opposing Raichu, respectively. Tera Water boosts Raichu's Surf, letting it 2HKO physically defensive Carbink while also improving Raichu's ability to check the likes of Rotom-F, Basculin, Tera Ice Electrode, and opposing Raichu. Tera Grass gives Raichu resistances to Ground and Grass, greatly improving its matchup against Alolan Dugtrio and Whiscash. Additionally, it boosts the power of Grass Knot, letting it do more chip damage to Whiscash, potentially 2HKOing it. Lightning Rod lets Raichu more easily take advantage of Electric-types such as Rotom-F, Electrode, Rotom-S, and opposing Raichu.</p> <p>Raichu's Electric immunity means that Water- and Flying-type Pokemon like Basculin, Golduck, Charizard, and Honchkrow make for good partners. The former two can more capably take out Pokemon like Carbink, Dugtrio, and Gabite while the latter two can deal with Grass-types like Gogoat, Flapple, and Dartrix, which Raichu would otherwise be forced to Terastallize against. Other offensive pivots such as Alolan Persian, Perrseker, Squawkabilly, and Drakloak can create powerful VoltTurn cores with Raichu, wearing down foes until they are weakened to the point where Raichu can efficiently clean them up. Additionally, these offensive pivots are able to compensate for Raichu's fragility thanks their ability to pivot it in. Setup Pokemon like Bulk Up Gogoat, Nasty Plot Haunter, Quiver Dance Masquerain, and Swords Dance Sawsbuck appreciate Raichu being able to lock Pokemon like Gogoat, Dachsbun, and Articuno into recovery moves and being able to chip down Pokemon with Volt Switch.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Raichu is a premier special wallbreaker in PU thanks to its excellent Speed and coverage, bolstered further by Nasty Plot and Terastallization. Surf makes for naturally great coverage with Thunderbolt, hitting Ground-types like Camerupt and Alolan Dugtrio and the myriad of Fire-types roaming PU, like Charizard, Houndoom, and Pyroar. Grass Knot can be used instead to hit Whiscash much harder, but Surf makes for generally better coverage outside of this. Tera Blast Flying gives Raichu coverage to hit Grass-types like Gogoat and Flapple, which can otherwise effortlessly take its other attacks. Tera Flying inverts Raichu's Ground weakness while only having two weaknesses thanks to Lightning Rod. Lightning Rod also makes Tera Water a great defensive option that also boosts Surf's power. Tera Blast Ice offers a comfortable midground between both Ground- and Grass-types, although this creates a worse defensive typing than that of Water or Flying, and many Ground-types are neutral to Ice, such as Camerupt and Whiscash. Encore locks Pokemon that can take on Raichu with their natural bulk, such as Carbink, Klawf, and Misdreavus, into setup moves or entry hazards, allowing it to set up more easily.</p> <p>Raichu appreciates the support of Grass-types like Gogoat, Leafeon, and Quilladin taking on Ground-types like Dugtrio, Gabite, and Whiscash until they're worn into range of Raichu's +2 attacks. In return, Raichu assists its Grass-type teammates by offensively threatening Flying-types like Charizard and Honchkrow. Although Raichu's Speed tier is quite excellent, its poor bulk leaves it vulnerable to the few faster Pokemon faster than it, like Dugtrio, Alolan Persian, and Choice Scarf Lycanroc-N, so defensive pivots like Lumineon and Perrserker work in tandem to help Raichu safely come in and out of battle. Indeedee's Psychic Surge assists Raichu by shielding it from priority attacks that expose its poor bulk, such as Sucker Punch from Alolan Dugtrio, Honchkrow, and Houndoom, as well as Aqua Jet from Basculin and Quick Attack from Zangoose.</p>"
      },
      "Choice": {}
    },
    "credits": {"writtenBy": [{"username": "Togkey", "user_id": 400664}, {"username": "BT89", "user_id": 487308}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bella", "user_id": 567483}, {"username": "Melt Gibson", "user_id": 617840}]}, {"name": "Grammar checked by", "members": [{"username": "Dawn of Ares", "user_id": 467437}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Raichu-Alola": {"sets": {"Pivot": {}, "Choice Scarf": {}}},
  "Sandslash-Alola": {"sets": {"Defensive Spinner": {}}},
  "Vileplume": {"sets": {"Physically Defensive": {}}},
  "Dugtrio": {"outdated": true, "sets": {"Swords Dance": {}}},
  "Dugtrio-Alola": {
    "outdated": true,
    "sets": {
      "Wallbreaker": {
        "description": "<p>While slower than its Kantonian cousin, Alolan Dugtrio still serves as one of the PU metagame's strongest wallbreakers thanks to its uncommon Steel typing, high power, and great coverage. This access to a rare STAB typing, as well as a still excellent Speed tier, cement its niche alongside other powerful Ground-types such as Dugtrio and Gabite. Earthquake and Iron Head allow Alolan Dugtrio to threaten commonplace Pokemon such as Carbink, Pyroar, Dachsbun, and Lycanroc-N. Stone Edge allows Alolan Dugtrio to hit Charizard for meaningful damage while also providing extra power against targets such as Masquerain and Vespiquen. Substitute, on the other hand, allows Alolan Dugtrio to take advantage of slower, more passive Pokemon, such as Vespiquen, Tinkatuff, and Carbink, in order to buffer a hit, gain momentum from a forced switch, or safely set up with Swords Dance. Sucker Punch provides insurance against Choice Scarf users and Pokemon that are naturally faster than Alolan Dugtrio, such as Basculin and Dugtrio, respectively. Swords Dance allows Alolan Dugtrio to take advantage of passive opponents and forced switches as well as break through naturally bulky Pokemon it may not have coverage for, such as Whiscash. Heavy-Duty Boots helps to provide more opportunities for Alolan Dugtrio to come in by negating entry hazards, while Life Orb provides a damage boost, which can be especially helpful if Alolan Dugtrio chooses not to run Swords Dance. Air Balloon is also a choice, making Alolan Dugtrio immune to Ground-type moves, like Dugtrio or Gabite's Earthquake, as well as providing a temporary immunity to Sticky Web and Spikes. Tera Ground allows for Alolan Dugtrio's Earthquake to deal even more damage, which is especially helpful against neutral targets like Gabite. Tera Steel is also an option, as it provides key resistances against moves such as Gogoat's Horn Leech and Choice Scarf Rotom-F's Blizzard while also boosting the power of Iron Head.</p> <p>Alolan Dugtrio serves as an excellent wallbreaker for fast-paced offensive teams that need a combination of speed and power to deal with threats such as Carbink, Pyroar, and Dachsbun. Due to being one of the few Steel-types available in the tier, Alolan Dugtrio's access to a strong, fast Iron Head is a quality greatly appreciated by common Fire-type wallbreakers such as Charizard, Pyroar, and Houndoom, which struggle against common Rock-types such as Carbink and Lycanroc-N. In return, Alolan Dugtrio greatly appreciates the Fire-types' ability to deal with Grass-types such as Gogoat and Thwackey, as these Grass-types resist Earthquake and also often have good matchups against the entry hazard setters it is paired with. This especially applies to Thwackey, which further reduces the damage of Alolan Dugtrio's Earthquake by setting Grassy Terrain. A teammate that can deal with Misdreavus, such as Haunter or Houndoom, is also imperative, as Misdreavus can easily cripple Alolan Dugtrio with Will-O-Wisp.</p>"
      },
      "Choice Item": {
        "description": "<p>Alongside Alolan Dugtrio's amazing typing, great Speed, and decent Attack, Choice items make it a more immediate offensive threat compared to support items such as Heavy-Duty Boots. Stone Edge is Alolan Dugtrio's best coverage option, hitting the few Pokemon that resist its STAB combination like Rotom-S and Charizard. Sucker Punch can also situationally be used alongside Choice Scarf to move before foes like Aqua Jet Basculin. Memento is good late-game, allowing Alolan Dugtrio to provide momentum and offer potential setup opportunities for teammates. Stealth Rock is a niche option on Choice Scarf sets if a team has no space for it otherwise, and, although it is a bad move to be locked into, it can also be used to fake being non-Choice Scarf. Jolly is by far the preferred nature to outspeed threats such as Basculin and Pyroar, but Adamant can be used with Choice Band to further Alolan Dugtrio's wallbreaking capabilities. Tangling Hair is situational but can punish moves such as Skuntank's Sucker Punch and Choice Scarf Sawsbuck's Horn Leech. Tera Ground and Steel power up Alolan Dugtrio's STAB moves to harder hit select targets, such as Earthquake against Whiscash and Lumineon and Iron Head against Gogoat and Misdreavus. They also offer defensive perks, such as Tera Ground making Alolan Dugtrio lose the weakness to Gabite's Earthquake and Tera Steel the weakness to Basculin's Aqua Jet. Choice Band makes Alolan Dugtrio a threatening wallbreaker, and Choice Scarf provides speed control for fast threats such as Alolan Persian, Dugtrio, and +1 Quiver Dance Masquerain. Alolan Dugtrio is notably one of the fastest Choice Scarf users, outspeeding not only other Choice Scarf users such as Rotom-F and Haunter but also Speed-boosting setup move users such as Dragon Dance Charizard and Agility Wyrdeer. This also means that even without the extra Speed, Choice Band Dugtrio still makes for solid Speed control, especially alongside Sucker Punch.</p> <p>Alolan Dugtrio makes for great glue on balance and offensive teams, being flexibly able to swap Choice items based on the team's need of either a wallbreaker or speed control while also being a last resort option for roles such as Stealth Rock setter and Volt Switch immunity if need be. Due to being Choice-locked, Alolan Dugtrio is very prediction reliant, which means an incorrect prediction could allow common threats such as Dragon Dance Charizard and Bulk Up Gogoat to use it as setup fodder. Bulky teammates with utility moves can stop this from getting out of hand, such as Haze Mareanie, Thunder Wave or Will-O-Wisp Misdreavus, and Roar Dachsbun. Being Choice-locked will inevitably also lead to a lot of switches, and while Alolan Dugtrio's typing allows it to switch into a handful of moves such as Lycanroc's Stone Edge and Rotom-F's Volt Switch or Discharge, its common weaknesses and frailty leave it at risk of being OHKOed by attacks such as Close Combat and Blizzard. Pivots such as Alolan Persian, Raichu, and Lumineon can help take away this risk and increase Alolan Dugtrio's overall longevity. Alolan Persian and Raichu can also run Nasty Plot sets, which benefit from Alolan Dugtrio's Memento making setting up easier. Alolan Dugtrio can be paired with other Choice item users like Haunter and Basculin to create mind games as to which the wallbreaker and Choice Scarf user are while also helping one another weaken foes and clean up the match, respectively. An alternative option to Alolan Dugtrio is its Kantonian form, Dugtrio. Dugtrio's higher Speed allows it to naturally outspeed Alolan Persian and Raichu, although lack of secondary STAB makes it worse with Choice items and is overall better used as a setup sweeper or wallbreaker. Alolan Dugtrio should be used if seeking immediate power as a wallbreaker with Choice Band or reliable speed control with Choice Scarf.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "UberSkitty", "user_id": 355061}, {"username": "Melt Gibson", "user_id": 617840}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bella", "user_id": 567483}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Persian-Alola": {
    "sets": {
      "Nasty Plot": {"description": "<p>Tera Fairy and Tera Poison let Alolan Persian set up on foes like Hariyama and Muk, respectively. Tera Blast Fairy also lets Alolan Persian break through Fighting-types like Virizion and the aforementioned Hariyama. Tera Electric powers up Thunderbolt and improves Alolan Persian's matchup against Electric-types like Rotom and Alolan Raichu. Tera Blast Ground deals with Skuntank, Rhydon, and Morpeko.</p> <p>Sample set. Stay tuned for updates!</p>"},
      "Defensive Pivot": {},
      "Pivot": {
        "outdated": true,
        "description": "<p>Alolan Persian's useful utility options along with its incredible Speed tier and Fur Coat allow it to function as one of PU's best pivots. Foul Play threatens physical attackers such as Alolan Dugtrio and Basculin with good damage. Parting Shot allows Alolan Persian to weaken the foe by lowering its offensive stats, allowing teammates an easier time coming in safely, but U-turn can be used to deal slight chip damage and notably also allows Alolan Persian to pivot out from Carbink. Thunder Wave can cripple foes such as Quiver Dance Masquerain, Dragon Dance Charizard, and opposing Alolan Persian. Taunt can prevent Pokemon such as Tinkatuff and Misdreavus from attempting to set entry hazards or spread status and can also prevent setup sweepers from setting up safely. Tera Ghost allows Alolan Persian to deal with Fighting-types such as Crabominable and Falinks as well as block Carbink's Body Press. Alolan Persian opts to run Defense EVs over HP EVs due to Fur Coat making Alolan Persian bulkier on the defensive side.</p> <p>Wallbreakers and setup sweepers such as Crabominable, Choice Specs Indeedee, and Swords Dance Alolan Dugtrio appreciate Alolan Persian being able to get them safe entry onto the battlefield. In return, these wallbreakers can muscle through threats Alolan Persian struggles with such as Skuntank and Tinkatuff. U-turn and Volt Switch users such as Perrserker, Flapple, and Raichu can form a VoltTurn combination with Alolan Persian. Chansey makes an excellent partner, as Chansey covers the special attackers such as Houndoom that Alolan Persian struggles with while Alolan Persian deals with the physical threats such as Honchkrow that can cause Chansey problems. Revenge killers and late-game cleaners such as Choice Scarf Basculin and Pyroar appreciate Alolan Persian helping them come in safely, spreading paralysis for them, and being a fallback against threats such as Alolan Dugtrio. Pokemon such as Alolan Dugtrio, Whiscash, and Gogoat are useful partners, as they pressure Carbink, allowing Alolan Persian to be able to use Parting Shot more safely.</p>"
      }
    }
  },
  "Golduck": {"outdated": true, "sets": {"Rain Sweeper": {}, "Choice Scarf": {}}},
  "Poliwrath": {"sets": {"Bulk Up": {}}},
  "Victreebel": {
    "outdated": true,
    "sets": {
      "Sun Sweeper": {"description": "<p>Giga Drain offsets Life Orb damage and doesn’t require sun, but Solar Beam is significantly stronger. Using a Modest nature maximizes Victreebel’s damage output, but opting for a Timid nature lets it outspeed foes like +1 Morpeko, +2 Adamant Veluza, and Choice Scarf Swanna under sun. Tera Fire makes Weather Ball even stronger, while Tera Grass does the same for Giga Drain or Solar Beam.</p> <p>Sample set. Stay tuned for updates!</p>"},
      "Swords Dance": {"description": "<p>Trailblaze boosts Victreebel’s Speed in exchange for not being as immediately strong as Power Whip. Sucker Punch is useful against revenge killers like Rotom and Alolan Raichu. Poison Jab applies more pressure to opposing Grass-types like Arboliva and Appletun than Victreebel’s other moves. Strength Sap can turn foes like Orthworm into setup fodder as well as let Victreebel stay healthy and use its resistances throughout the game.</p> <p>Sample set. Stay tuned for updates!</p>"},
      "Special Attacker": {"description": "<p>Tera Blast Fire shreds Steel-types like Orthworm and Perrserker and hits Articuno harder than Sludge Bomb. Tera Blast Ground breaks through Muk, Skuntank, and Hisuian Sneasel. Knock Off makes it harder for foes like Articuno, Poison Touch Muk, and Ursaring to repeatedly take Victreebel’s hits. Eject Pack forces Victreebel out after it uses Leaf Storm, instantly giving a teammate momentum. Rocky Helmet punishes weaker contact moves, notably Passimian’s U-turn, Muk’s Knock Off, and Floatzel’s Flip Turn. Tera Ghost gives Victreebel an immunity to Fighting and Normal, which helps it take on Hisuian Sneasel and Tauros.</p> <p>Sample set. Stay tuned for updates!</p>"}
    }
  },
  "Golem": {"outdated": true, "sets": {"Stealth Rock": {"description": "<p>44 Speed EVs allow Golem to outspeed uninvested base 50s, notably Muk. Specially defensive spreads let Golem more easily take hits from foes like Rotom, Charizard, and Pyroar. Tera Grass and Tera Water both eliminate many of Golem’s weaknesses, though the former helps more against Grass-types like Arboliva and Appletun while the latter is better against Ice-types like Rotom-F.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Golem-Alola": {"outdated": true, "sets": {"Tank": {"description": "<p>Galvanize-boosted Explosion is incredibly strong, even against bulky and Electric-resistant foes like Orthworm, Weezing, and Arboliva, but Volt Switch offers more overall utility. If Alolan Golem’s team already has a Stealth Rock user, it can run Stone Edge to threaten Grass-types like Appletun. Double-Edge hits significantly harder than Body Slam but comes with recoil damage, which hurts Alolan Golem’s longevity. Maximum Speed investment can be used to let Alolan Golem outrun more threats, though this takes away from its ability to take resisted or weaker neutral attacks.</p> <p>Tera Electric gives Alolan Golem the strength to OHKO most non-Electric-immune targets with Explosion, but Tera Grass covers it against Ground- and Water-types like Alolan Dugtrio and Floatzel.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Dodrio": {"sets": {"Swords Dance": {}, "Choice": {}}},
  "Muk": {
    "outdated": true,
    "sets": {
      "Curse": {},
      "Utility": {
        "description": "<p>Poison Jab is a reliable STAB option that can poison foes even if Muk doesn’t run Poison Touch. Toxic discourages bulky foes like Houndstone and Whiscash from switching into or staying in on Muk. Toxic Spikes puts grounded Pokemon like Passimian and Samurott on a timer and synergizes well with Knock Off. Protect lets Muk scout for moves, gain extra Leftovers recovery, and rack up additional poison damage. Haze prevents setup sweepers like Hisuian Sneasel from exploiting Muk.</p> <p>Sticky Hold prevents Knock Off from removing Muk’s Leftovers and blocks Trick and Switcheroo, but Poison Touch can help Muk more quickly wear foes like Golem and Whiscash down. Tera Dark makes Muk immune to Psychic-type moves from the likes of Alolan Raichu and Indeedee and helps against Ghost- and physical Dark-types like Rotom and Morpeko. Tera Water offers Muk a generally good defensive typing that also lets it better stomach Fire- and Water-type moves from Charizard and Floatzel.</p> <p>Sample set. Stay tuned for updates!</p>"
      }
    }
  },
  "Haunter": {
    "sets": {
      "Choice Scarf": {},
      "Choice Specs": {
        "description": "<p>Choice Specs Haunter is a powerful wallbreaker in a tier with few Ghost-type checks, spamming strong Shadow Balls supplemented by its great coverage moves. Focus Blast is useful for hitting Dark- and Normal-types such as Alolan Persian, Pyroar, and Komala that would switch into a Shadow Ball. Trick cripples checks it cannot immediately break through such as Chansey and Skuntank, while Energy Ball is specifically used for Whiscash, an otherwise solid midground option to scout whatever Haunter uses. Tera Ghost is the preferred option in order to boost Shadow Ball's power, lessening the need to predict against Pokemon like Assault Vest Crabominable; however, Tera Blast Ground can remove Skuntank, one of Haunter's most efficient checks.</p> <p>Despite its strong power, Haunter is slower than common wallbreakers such as Basculin, Charizard, and Alolan Dugtrio as well as being extremely fragile to anything it isn't immune to, so pivot support is necessary in order to bring it in safely. Alolan Persian is a top tier pivot that can easily bring Haunter in with Parting Shot and can switch into physical wallbreakers that threaten Haunter out like Dugtrio and Basculin. Rotom-F is also a strong pivot that synergizes well with Haunter, pivoting it in on Pokemon like Misdreavus while wearing down shared checks like Chansey and Whiscash. Ground-types like Camerupt and Whiscash can switch into the fast Electric-types that threaten Haunter out like Electrode and Raichu and set entry hazards that wear down Haunter's checks that do not run Heavy-Duty Boots like Tinkatuff and Hisuian Sliggoo.</p>"
      },
      "Nasty Plot": {}
    },
    "credits": {"writtenBy": [{"username": "Hera", "user_id": 414072}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Electrode": {
    "outdated": true,
    "sets": {
      "Pivot": {
        "description": "<p>Electrode's blazing Speed tier and ability to take advantage of Terastallization cement it a niche as an effective pivot and late-game cleaner. Taunt shuts down recovery attempts from checks like Gogoat, setup attempts from Pokemon like Rotom-F, and entry hazards from foes like Carbink and Tinkatuff. The move pairs well with Electrode's nature as a pivot, giving partners an easier time setting up without dealing with annoying status. Due to Electrode's relative fragility and the prevalence of entry hazards, Aftermath is more effective at punishing priority users like Alolan Dugtrio and Basculin, as they are much more afraid of the guaranteed chip damage when revenge killing Electrode than the potential paralysis that Static provides. Tera Blast Fighting is an solid option that lets Electrode revenge kill Alolan Dugtrio, Houndoom, and Rotom-F as well as dent walls like Hisuian Sliggoo and Dunsparce. Tera Blast Ice is very useful for hitting Ground- and Grass-types like Gabite and Gogoat, although its inability to OHKO Whiscash does hinder its viability. Tera Water increases Electrode's revenge killing capability against Fire-types like Charizard and Pyroar, as well as Alolan Dugtrio; however, it also leaves it susceptible to Electric-types like Raichu and opposing Electrode in the one-on-one matchup. Lastly, Tera Grass is useful for hitting Whiscash, Carbink, and Klawf all in the same slot, something no other Tera type allows Electrode to do, while Tera Ground is also an option to specifically hit Raichu.</p> <p>Electrode fits best with strong mid-game wallbreakers that struggle to get in, such as Zangoose and Basculin. Not only do they enjoy the free turn on Pokemon such as Gogoat and Carbink, they can also break down shared checks such as Gabite, making it easier for Electrode to win late-game. Whiscash is a major annoyance for Electrode, as it is immune to Taunt and is the only viable Ground-type to not take super effective damage from either of Electrode's common Tera types; thus, a strong Grass-type like Gogoat or Sawsbuck is recommended as a partner. They can also potentially force Whiscash to Terastallize, removing its Electric immunity for Electrode. Other fast Pokemon like Alolan Persian and Rotom-F can form a VoltTurn core with Electrode, utilizing entry hazards and a good Speed tier to pivot into each other's checks, such as Flapple, Skuntank, and Misdreavus, racking up chip damage. Entry hazards from Pokemon like Whiscash and Tinkatuff also benefit Electrode, as it can constantly force in Pokemon like Gabite and Dunsparce, which do not use Heavy-Duty Boots, and wear them down faster.</p>"
      },
      "Rain Dance": {
        "description": "<p>Electrode's phenomenal Speed, which allows it to outrun the entire unboosted metagame, good utility options, and ability to quickly pivot out after setting up Rain Dance allows it to be PU's best lead for rain teams. Taunt can prevent opposing leads such as Sticky Web Masquerain, and Stealth Rock Alolan Dugtrio from setting up entry hazards and block Gogoat from attempting to set up to break the team in the early-game. Thunder is gives Electrode a powerful, accurate STAB move in rain. Explosion is normally used in the last slot, as it gives Electrode a nuclear option and gives a guaranteed free switch to a partner, but Volt Switch allows Electrode to pivot into a teammate after setting up Rain Dance to set up Rain Dance again.</p> <p>Swift Swim sweepers like Golduck and Beartic are necessary teammates to exploit Rain Dance. Other Water-types such as Basculin and Wugtrio enjoy having their Water-moves boosted as well. Masquerain is a particularly notable partner, as it has its Hurricane made 100% accurate, it can set up on foes it could normally not set up on outside of rain, such as Pyroar and Camerupt and has its Water-type coverage boosted as well, letting it chip foes like Carbink harder. Electric-types such as Raichu and Rotom-F enjoy being able to use a 100% accurate Thunder and can offensively check the opposing Water-types that would want to take advantage of rain, such as Basculin. Other Rain Dance setters such as Murkrow and Golduck are helpful for Electrode to not have to exclusively set Rain Dance for its team.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Hera", "user_id": 414072}, {"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "asa", "user_id": 400292}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "UT", "user_id": 523866}, {"username": "Tranquility", "user_id": 475288}]}]}
  },
  "Electrode-Hisui": {"sets": {"Pivot": {}}},
  "Weezing": {"sets": {"Physically Defensive": {}}},
  "Tauros": {"sets": {"Wallbreaker": {"description": "<p>Close Combat hits Porygon2 and Rhydon harder than any of Tauros's other moves. Earthquake still hits Rhydon super effectively while also breaking through Skuntank without triggering Aftermath. Tera Blast Ghost reliably OHKOes Rotom and 2HKOes Palossand and Houndstone, but Throat Chop can be used to hit these foes without Terastallizing. Fire Blast covers both Orthworm and Houndstone and should be used with a Naive nature.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Articuno": {"sets": {"Defensive": {"description": "<p>48 Speed EVs lets Articuno outspeed Modest Clawitzer. If slow pivoting is more desirable, though, Articuno can forgo Speed investment and instead bolster its bulk. Tera Dragon gives Articuno key resistances to Fire, Electric, and Water, thus allowing it to take on threats like Charizard, Rotom, and Floatzel. Tera Steel gives Farigiraf a much harder time overwhelming Articuno. Tera Fairy can also be used to check Fighting- and Dark-types like Passimian and Morpeko.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Offensive": {}}},
  "Lanturn": {"sets": {"Defensive Pivot": {"description": "<p>36 Speed EVs allow Lanturn to outspeed Sandaconda. While Volt Absorb is generally the better ability, Water Absorb is viable on teams that are particularly weak to Water-types like Floatzel.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Ampharos": {"outdated": true, "sets": {"Assault Vest": {}}},
  "Misdreavus": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Defensive Misdreavus is the glue that holds PU together because of its ability to deal with many of the strongest physical attacking presences in the metagame, such as Lycanroc-N, Alolan Dugtrio, and Perrserker. It has a very strong type for this tier, with very few Pokemon able to hit it for super effective damage. It is also the best Rapid Spin blocker in PU because of this. Will-O-Wisp is great for crippling physical attackers like Lycanroc-N, Gabite, and Alolan Dugtrio. Choosing to run Thunder Wave over Will-O-Wisp can make dealing with Alolan Dugtrio and Gabite more difficult. With Misdreavus able to spread status so well, Hex is the best choice for its STAB move. Power Gem is quad effective against Articuno, Masquerain, and Charizard; it also hits other popular Pokemon like Houndoom, Pyroar, and Rotom-F for super effective damage. Thunderbolt can be opted for instead to better hit Water-types like Golduck, Lumineon, Basculin, and Quaxwell. Taunt is also an option over the two attacking moves to disallow setup sweepers such as Gogoat and Carbink from boosting in front of Misdreavus; it also works well at stopping entry hazard setters such as Carbink, Gabite, and Camerupt. The EV spread allows for better recovery with Pain Split by keeping Misdreavus's HP a bit lower than if 252 HP EVs were used while still keeping its overall bulk by adding the EVs taken from HP into both defensive stats. 56 Speed EVs let it out speed neutral natured Honchkrow and Flapple, as well as Timid Glimmet and uninvested Drakloak. Tera Fighting and Tera Fairy both work well to provide a resistance to Dark-type moves from Pokemon like Honchkrow and Alolan Persian. Although, Tera Fighting leaves Misdreavus vulnerable to Flying-type moves from Articuno, Charizard, and Masquerain and Psychic-type moves from Rabsca and Indeedee-F. On the other hand, Tera Fairy leaves it vulnerable to Steel-type moves from Perrserker and Alolan Dugtrio. Tera Electric is great for boosting Thunderbolt and giving Misdreavus zero weaknesses with its ability. Tera Rock boosts Power Gem, letting it OHKO Charizard and Masquerain.</p> <p>Misdreavus works well on balance teams looking for a catch-all defensive Pokemon to deal with many of the metagame's top threats. It also works great on entry hazard stacking teams since it is not bothered by the top Rapid Spin user, Quaxwell. Misdreavus thrives when given teammates like Carbink, Dachsbun, and Tinkatuff to deal with Dark-types such as Alolan Persian, Houndoom, and Skuntank. These same Dark-type threats, Alolan Persian, Houndoom, and Skuntank, can help deal with Ghost-type foes like Banette, Drakloak, and opposing Misdreavus. Specially defensive walls like Articuno, Carbink, and Tinkatuff form a nice core with Misdreavus since it can cover physical Pokemon that give them trouble, like Lycanroc-N, Perrserker, and Alolan Dugtrio. Knock Off absorbers and status absorbers are highly recommended to keep Misdreavus healthy enough to deal with all of these Pokemon. Status absorbers are the likes of RestTalk Gabite, Dragonair, and Zangoose, while Knock Off absorbers are usually Dark-types like Alolan Persian and Skuntank.</p>"
      },
      "Offensive": {
        "description": "<p>Misdreavus is capable of becoming a fearsome sweeper while still retaining its defensive and utility properties, which allow it to switch into a wide range of threats and spinblock effectively. Calm Mind can be used with Draining Kiss and Tera Fairy to turn Misdreavus into a bulky wallbreaker that is difficult to wear down due to Misdreavus's great natural bulk, HP recovery from Draining Kiss, and immediate access to status moves. Tera Fairy is notable for preventing threats like Nasty Plot Alolan Persian from immediately threatening it, and its toolset lends it easy setup opportunities against Gabite, one of the best phazers in the metagame, as well as other passive targets like Dachsbun and Carbink. Alternatively, Nasty Plot can be used along with either Draining Kiss or Power Gem to make Misdreavus more immediately threatening, with Power Gem primarily targeting Fire-types like Pyroar and Houndoom that it would otherwise struggle with as well as specially defensive Articuno. Hex benefits greatly from Misdreavus's ability to spread status and can be amplified with additional status spreaders on the team; alternatively, Shadow Ball can be used on Nasty Plot sets for greater immediate damage output. Will-O-Wisp is useful for preventing targets like Skuntank and Honchkrow from revenge killing it before Terastallization as well as increasing its ability to take hits from Quaxwell. Thunder Wave is another option that cripples special walls like Articuno and opposing setup sweepers like Masquerain. Substitute can also be used as the last move to facilitate setup on forced switches and prevent Skuntank and Rotom-F from crippling it with Toxic or Trick, but it usually gets more value from spreading status. An alternative EV spread of 128 HP / 128 SpA / 252 Spe with a Timid nature can be used on Calm Mind variants for easier setup and more reliable spinblocking.</p> <p>Misdreavus's effectiveness at spinblocking naturally makes it a great fit on entry hazard stacking teams alongside setters like Whiscash, Carbink, and Masquerain as well as strong wallbreakers like Basculin and Rotom-F. Ground-types like Whiscash and Gabite can reliably switch into offensive checks like Alolan Dugtrio and Houndoom as well as Pokemon that may cripple Misdreavus with Thunder Wave or Encore, such as Tinkatuff and Raichu. Carbink can reliably switch into and deal with Dark-types like Houndoom and Alolan Persian that Nasty Plot variants in particular struggle with greatly before Terastallization, and it can also absorb Knock Off. Gogoat can form an effective bulky setup core with Misdreavus, as they deal with each other's checks, like Basculin and Gabite, respectively, and they pressure mutual targets like Articuno and Carbink better together. Thunder Wave users like Alolan Persian and Tinkatuff can facilitate sweeping for Misdreavus by powering up its Hex; the former can also bring it in safely with Parting Shot and ease the pressure of handling Perrserker, and the latter can create setup opportunities with Encore. In addition, both of these can situationally switch into Knock Off from Pokemon like Banette and opposing Tinkatuff.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "rien", "user_id": 474994}, {"username": "sleid", "user_id": 601970}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bella", "user_id": 567483}, {"username": "Hera", "user_id": 414072}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Dunsparce": {"outdated": true, "sets": {"Stealth Rock": {}}},
  "Sneasel": {"outdated": true, "sets": {"Swords Dance": {"description": "<p>Life Orb compensates for Sneasel’s naturally middling damage output and makes taking its hits more difficult. Eviolite augments Sneasel’s bulk, which can translate to setup opportunities against threats like Morpeko. However, both options are generally less consistent than Heavy-Duty Boots, which lets Sneasel freely switch in and out to wear foes down or revenge kill weakened targets like Skuntank and Tauros. Tera Ghost makes Sneasel immune to Fighting-type attacks from the likes of Hisuian Sneasel and Passimian, allowing it to either retaliate with a strong attack or set up on them.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Choice Band": {}}},
  "Sneasel-Hisui": {
    "outdated": true,
    "sets": {
      "Swords Dance": {"description": "<p>Trailblaze lets Hisuian Sneasel outspeed potential revenge killers like Choice Scarf Passimian and Rotom. Substitute is useful for turning Muk and Weezing into setup fodder. Lash Out hits Ghost-types like Rotom, Tera Ghost Orthworm, and Sableye and should be used alongside Tera Dark. Tera Fire protects Hisuian Sneasel from being burned and, when used with Tera Blast, lets it break through Houndstone. In addition to pairing well with Lash Out, Tera Dark also turns the tables on Psychic- and Ghost-types like Choice Scarf Indeedee and Haunter. Tera Blast Psychic is a niche option to more immediately bypass Muk, opposing Hisuian Sneasel, and Weezing. Tera Grass gets rid of Hisuian Sneasel's Ground weakness and also powers up Trailblaze.</p> <p>Sample set. Stay tuned for updates!</p>"},
      "Choice Band": {"description": "<p>Shadow Claw and Lash Out both target Ghost-types like Rotom, though Shadow Claw comes with the added benefit of hitting opposing Hisuian Sneasel neutrally. Tera Dark makes Hisuian Sneasel immune to Psychic-type moves from Alolan Raichu and Indeedee and also powers up Lash Out. Tera Blast with Tera Psychic or Tera Fire offers great coverage against Muk, Tera Poison Arboliva, and Houndstone.</p> <p>Sample set. Stay tuned for updates!</p>"},
      "Choice Scarf": {"description": "<p>Tera Fighting makes Close Combat more reliable for cleaning mid- to late-game, but Tera Ghost can be used instead to OHKO Rotom after Stealth Rock with Shadow Claw.</p> <p>Sample set. Stay tuned for updates!</p>"}
    }
  },
  "Ursaring": {
    "outdated": true,
    "sets": {
      "RestTalk": {"description": "<p>Bulk Up can be used over an attacking move so that Ursaring doubles as a setup sweeper, though this limits its coverage and thus makes it less self-sufficient. Running 88 Speed EVs lets Ursaring outspeed uninvested Weezing. Ursaring can also run specially defensive EV spreads to act as a special wall.</p> <p>Sample set. Stay tuned for updates!</p>"},
      "Flame Orb": {"description": "<p>Shadow Claw threatens Rotom, an otherwise solid offensive check to Ursaring. Earthquake hits Skuntank without triggering Aftermath and deals more damage to Houndstone than Shadow Claw. Protect lets Ursaring immediately activate Flame Orb, but Trailblaze lets it outrun foes like Skuntank, Morpeko, and Pyroar. Tera Normal further powers up Facade but offers nothing defensively. Tera Ghost and Tera Fighting boost Shadow Claw and Close Combat, respectively, and also flip the matchup against Fighting- and Dark-types like Passimian and Skuntank.</p> <p>Sample set. Stay tuned for updates!</p>"}
    }
  },
  "Houndoom": {
    "outdated": true,
    "sets": {
      "Nasty Plot": {
        "description": "<p>Thanks to its strong offensive typing, access to setup moves, and useful coverage, Houndoom establishes itself as a high level offensive threat in the PU metagame. Fire Blast allows Houndoom to have some extra power and can be especially useful in situations where boosting with Nasty Plot is not possible. It also helps Houndoom to muscle through targets that either are extremely bulky or naturally resist Dark Pulse, such as Tinkatuff. Alternatively, Flamethrower provides a less powerful but more consistent Fire-type STAB attack and eliminates the risk of a missed Fire Blast prematurely ending Houndoom's sweep. Sludge Bomb gives Houndoom a strong special coverage move able to hit certain targets for neutral or super effective damage that would otherwise wall Houndoom handily, such as Carbink, Dachsbun, and opposing Houndoom. Sucker Punch gives Houndoom a safe option against faster, weakened targets that threaten to revenge kill it, such as Dugtrio, Alolan Dugtrio, and Basculin, although one must be wary of these Pokemon's access to their own priority. Trailblaze is another option, allowing Houndoom to remedy its underwhelming Speed and become a much more threatening sweeper, either through a well-timed prediction or by finishing off a weakened target. Heavy-Duty Boots is mandatory on this set to offer Houndoom opportunities to use Nasty Plot, since it is already relatively frail. Flash Fire both sets it apart from and allows it to combat fellow Fire-type attackers such as Pyroar, Charizard, and opposing Houndoom, allowing it to safely switch in on their Fire-type STAB moves while also boosting the power of its own. In a similar manner, it can also take advantage of Will-O-Wisp from targets such as Midreavus and Rotom-S. Tera Dark increases the power of Dark Pulse even further while also removing key weaknesses to Rock, Water, and Ground. Tera Grass offers a resistance to the latter two while also increasing the power of Trailblaze and pairing well with Houndoom's natural Fire immunity. Lastly, Tera Poison increases the power of Sludge Bomb, increasing damage against foes such as Carbink and Dachsbun while also providing a resistance to STAB moves from Pokemon such as Skuntank. Also of note, Houndoom should only use a Hasty nature if it is running Sucker Punch; otherwise, it should use a Timid nature and 0 Attack IVs.</p> <p>Houndoom's greatest challenge is its rather disappointing Speed, especially compared to other Fire-type wallbreakers like Charizard and Pyroar, so a Sticky Web setter such as Masquerain is greatly appreciated. Houndoom also greatly appreciates teammates like Perrserker and Skuntank that can handle Dachsbun and Carbink, especially if it opts not to run Sludge Bomb. Similarly, teammates that can handle bulky Water-types such as Lumineon and Whiscash are welcome, as while Houndoom can do relatively good damage to these Pokemon with Dark Pulse, doing so is extremely risky without a Nasty Plot boost or a defensive Tera. Therefore, Grass-types such as Gogoat and Thwackey are natural partners, with Houndoom especially appreciating the latter's ability to set Grassy Terrain, both allowing Houndoom some passive recovery and lessening the damage from opposing Earthquakes. Fast revenge killers, such as Electrode and Raichu, and Choice Scarf users such as Golduck, are also excellent teammates, as they are able to handily dispose of targets that Houndoom has already heavily damaged.</p>"
      },
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"username": "Melt Gibson", "user_id": 617840}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bella", "user_id": 567483}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Sceptile": {"sets": {"Terrain Sweeper": {}, "Special Attacker": {}}},
  "Ludicolo": {"outdated": true, "sets": {"Rain Sweeper": {"description": "<p>Surf is reliable due to its perfect accuracy, Weather Ball is stronger but reliant on rain being up, and Hydro Pump is even stronger but has lower accuracy. Ice Beam nails Appletun and Trevenant, but Focus Blast hits Arboliva harder. Using a Modest nature maximizes Ludicolo’s damage output, but opting for a Timid nature lets it outspeed foes like +1 Morpeko, +2 Adamant Veluza, and Choice Scarf Swanna under rain.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Masquerain": {
    "outdated": true,
    "sets": {
      "Quiver Dance": {
        "description": "<p>Masquerain functions as a threatening Quiver Dance sweeper thanks to its high-powered STAB attacks and extensive coverage, including rare access to Hydro Pump, which allow it to pressure opposing teams without being overreliant on Terastallization. Hydro Pump hits Charizard, Pyroar, and Carbink and, together with Hurricane, provides neutral coverage for the entire metagame. Tera Blast Steel lets Masquerain beat targets such as Carbink and Articuno reliably, as well as set up more easily on targets like Gogoat and Misdreavus that can otherwise threaten it with coverage. Alternatively, Tera Water boosts Hydro Pump's damage output further and improves its matchup against Fire-types like Charizard. Other coverage options include Ice Beam, which helps Masquerain reliably beat Gabite, and Bug Buzz, which gives Masquerain a more reliable STAB move that can threaten Dark- and Psychic-types like Alolan Persian and Indeedee-F and deal neutral damage to threats like Raichu.</p> <p>Masquerain appreciates teammates like Raichu, Electrode, Alolan Persian, and Lumineon that can bring it in safely with pivoting moves. Raichu can also notably use Tera Water or Tera Ice to check fast Electric-types like Choice Scarf Rotom-F and generate free switch-in and setup opportunities for Masquerain with Encore. Ground-types like Whiscash, Alolan Dugtrio, and Gabite can reliably switch into and threaten Tinkatuff, which can cripple Masquerain with Thunder Wave or Encore; Whiscash also greatly helps against Choice Scarf Lycanroc-N, which outspeeds and can revenge kill Masquerain after one boost, and facilitates wallbreaking with Spikes, while Masquerain and Alolan Dugtrio can set up on each other's checks. Grass-types like Gogoat can switch into some Electric-types like Electrode and Pokemon like Whiscash that may threaten Masquerain with Rock-type coverage; they also pressure Pokemon like Carbink better alongside Masquerain. In return, Masquerain can pressure targets like Charizard and Articuno depending on its Tera type. Indeedee-F can provide Masquerain with Healing Wish support, allowing it to attempt setup more than once in a game, as well as Psychic Terrain to prevent priority users like Skuntank and Honchkrow from revenge killing Masquerain if it has already Terastallized.</p>"
      },
      "Sticky Web Lead": {
        "description": "<p>With its combination of a good Speed tier, Intimidate, and solid offensive capability after setting Sticky Web, Masquerain is PU's premier Sticky Web lead. Hurricane is Masquerain's normal STAB move of choice, allowing it to hit Pokemon such as Gogoat and opposing Masquerain for good damage. However, Bug Buzz can be used instead, hitting mostly the same targets as Hurricane and being more accurate at the cost of power. Hydro Pump is coverage for Fire-types such as Charizard and Carkol, as well as Carbink and Alolan-Dugtrio, although Surf can be used instead of Hydro Pump, trading off power for accuracy. Masquerain's fourth moveslot is very flexible; U-turn can be used to pivot into a partner Pokemon after setting up Sticky Web and Quiver Dance can make Masquerain more offensively threatening after setting up Sticky Web. Ice Beam can OHKO Dartrix and Gabite, but it is hard to fit, as Masquerain normally finds more usage out of U-turn and Quiver Dance. Masquerain can Terastallize into the Ghost type to prevent spinners such as Quaxwell and Carkol from removing its Sticky Web. Masquerain can also run Heavy-Duty Boots to ease Sticky Web setup later in the game at the cost of being a less effective lead, as well as run Tera Steel for easier setup with Quiver Dance if spinblocking is not a concern.</p> <p>Masquerain's most common teammates are ones that take advantage of Sticky Web slowing down their grounded offensive checks, so wallbreakers such as Swords Dance Zangoose, Squawkabilly, and Choice Band Basculin-B are great partners. Ghost-types such as Misdreavus and Banette spinblock for Masquerain to keep Sticky Web on the field, and Sticky Web allows them to spread status more easily to normally faster threats such as opposing Basculin-B. Electric- and Rock-types such as Raichu and Choice Scarf Lycanroc-N help deal with the Flying-types that annoy Masquerain and its teammates, such as Rotom-S, as they are immune to Sticky Web.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "rien", "user_id": 474994}, {"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "Hera", "user_id": 414072}, {"username": "gum", "user_id": 434150}]}, {"name": "Grammar checked by", "members": [{"username": "asa", "user_id": 400292}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Vigoroth": {"outdated": true, "sets": {"Bulk Up": {}}},
  "Hariyama": {"sets": {"Bulk Up": {}, "Assault Vest": {}, "Belly Drum": {}}},
  "Swalot": {"outdated": true, "sets": {"Defensive": {}}},
  "Camerupt": {"outdated": true, "sets": {"Specially Defensive": {}, "Trick Room Attacker": {}}},
  "Grumpig": {"sets": {"Nasty Plot": {"description": "<p>Grumpig is not viable in PU, but this is considered its best set.</p> <p>136 Speed EVs let Grumpig outspeed Modest Glaceon. 44 SpA EVs allow unboosted Tera Ground Grumpig to KO offensive Skuntank with Earth Power after Stealth Rock damage.</p>"}}},
  "Zangoose": {
    "outdated": true,
    "sets": {
      "Toxic Boost": {
        "description": "<p>Zangoose is a high risk, high reward physical breaker capable of tearing through walls if it predicts correctly, but is punished severely by Toxic damage and entry hazards if it doesn't. Close Combat hits Steel-types like Perserrker and Tinkatuff that could come in on Facade, as well as being its best tool against Carbink. Night Slash catches Ghost-types like Misdreavus and Banette that would otherwise switch into Zangoose safely and punishes Tera Ghost from Pokemon like Gabite and Whiscash. Quick Attack lets Zangoose kill fast Pokemon like Charizard, Raichu, and Choice Scarf Rotom-F. Swords Dance turns Zangoose into an even more powerful breaker, OHKOing foes like Tinkatuff and Dachsbun at +2, at the cost of being unable to deal with faster Pokemon, making it a good choice against bulkier teams that lack faster Pokemon. Protect lets Zangoose scout Choice Scarf users like Lycanroc-N and Rotom-F as well as consistently activate Toxic Orb, but it is much less consistent overall than the other two options. Toxic Orb is the only item that can activate Toxic Boost on Zangoose, which pairs wonderfully with Facade. Tera Normal gives Zangoose a solid boost of power on Facade and Quick Attack, which is especially useful on sets lacking Swords Dance. It also gives Zangoose an easier time KOing frail, faster Pokemon like Pyroar and Houndoom.</p> <p>Zangoose suffers heavily from the chip damage it accrues, so ways to mitigate this are helpful. Dachsbun is useful for its ability to pass Wish to Zangoose, helping it stay alive and break for a longer time; it is also useful for coming in on Pokemon that force Zangoose out like Alolan Persian and Choice Scarf Lycanroc-N. Fast Taunt users like Electrode and Pyroar can prevent entry hazards from foes like Perserrker and Tinkatuff, limiting the amount of chip damage that Zangoose takes. Electrode can also bring Zangoose in on its checks, like Gogoat and Dunsparce, to help it break. Offensive partners like Sawsbuck and Indeedee-F can help Zangoose overwhelm shared checks like Misdreavus and Tinkatuff, and Indeedee-F's Healing Wish is useful for giving Zangoose more chances to break, although Psychic Terrain from Indeedee-F pairs poorly with Zangoose's Quick Attack. Zangoose also benefits heavily from Sticky Web from Pokemon like Spidops and Masquerain, as being able to outspeed Choice Scarf users like Golduck and other fast Pokemon like Alolan Dugtrio is a massive boon for it.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Hera", "user_id": 414072}], "teams": [{"name": "Quality checked by", "members": [{"username": "asa", "user_id": 400292}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Whiscash": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Whiscash is a defensive entry hazard setter with great typing and solid bulk. Stealth Rock can help chip common foes such as Misdreavus, Choice Scarf Rotom-F, and Haunter. However, even though Spikes don't affect the aforementioned Pokemon, it does better at hitting Rock-resistant threats such as Tinkatuff, Gabite, and Alolan Dugtrio. Earthquake can be used over Earth Power for the slightly higher damage, especially against special setup sweepers like Calm Mind Spiritomb and Wyrdeer, but Earth Power is generally preferred for inflicting better damage on physical walls like Klawf, Perrserker, and Alolan Persian and being unaffected by Grassy Terrain set by Thwackey, a common switch-in to Whiscash. Ice Beam is great for doing a chunk of damage on Grass-types like Gogoat, Flapple, and Dartrix. Surf is an option over Ice Beam, landing better damage on neutral targets instead of the previously mentioned foes. Stone Edge is great in the last slot to cover the likes of Charizard, as well as preventing setup sweepers like Rotom-F and Masquerain from taking advantage of Whiscash's relative passivity. Stealth Rock can be opted for instead to compress both forms of entry hazards into one Pokemon, possibly freeing up another team slot. Protect is used for scouting and gaining a bit more Leftovers recovery, but it is not very useful when running the more popular Heavy-Duty Boots. Oblivious allows Whiscash to set up hazards even against Taunt users like Alolan Persian and Misdreavus. Tera Poison is great for removing Whiscash's 4x weakness to Grass, with the added benefit letting it absorb Toxic Spikes. Tera Ghost turns it into a spinblocker in a pinch. The EV spread focuses on Special Defense over Defense because it makes for a better matchup against Volt Switch users like Rotom-F, as well as other special attackers like Alolan Persian and Fire-types like Charizard.</p> <p>Whiscash appreciates spinblockers like Misdreavus and Spiritomb to keep its entry hazards up against Rapid Spin users like Quaxwell. Whiscash appreciates Charizard and Honchkrow's ability to deal with Grass-types; in return, it can take on the Rock- and Electric-types like Choice Scarf Lycanroc-N and Electrode. Grass-types like Gogoat and Dartrix also make for great teammates, as Whiscash can take on Fire- and Poison-types like Charizard, Houndoom, and Skuntank that threaten them. Its presence as an Electric-immune to help the likes of Masquerain and Honchkrow is superb, as it has the typing and bulk to take hits from the coverage moves that Pokemon like Raichu, Rotom-F, and Electrode carry. Dachsbun, Crabominable, and Carbink all benefit from Whiscash, as it can take Steel-type hits from Perrserker and Alolan Dugtrio for them. With a lot of the tier being weak or neutral to Rock, Whiscash finds itself having the typing to help the likes of Charizard, Masquerain, and Rabsca avoid dealing with Lycanroc-N, Dugtrio, and Gabite. It does find a lot of trouble handling Misdreavus, as it lacks the super effective coverage to get past its bulk. This is why pairing it with a Dark-type like Skuntank or Alolan Persian can be beneficial. Since Whiscash doesn't have recovery, it really doesnt like taking Will-O-Wisp from said Misdreavus, and Charizard or Toxic from Skuntank. As a result, status absorbers like Chansey, Dragonair, and Tinkatuff make for great teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "sleid", "user_id": 601970}], "teams": [{"name": "Quality checked by", "members": [{"username": "asa", "user_id": 400292}, {"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Regirock": {"sets": {"Stealth Rock": {}}},
  "Registeel": {"sets": {"Setup Sweeper": {"description": "<p>Curse should primarily be used with Tera Water, since Tera Ghost Registeel will halve its HP if it uses the move. However, Tera Water can be used without Curse for the resistances to Fire and Water.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Utility": {}}},
  "Floatzel": {"sets": {"Choice Band": {}, "Bulk Up": {}}},
  "Mismagius": {"sets": {"Nasty Plot": {}, "Choice": {}}},
  "Honchkrow": {"outdated": true, "sets": {"Moxie Sweeper": {}, "Special Attacker": {}}},
  "Skuntank": {
    "sets": {
      "Utility": {"description": "<p>Memento can support setup sweepers like Hisuian Sneasel, Farigiraf, and Veluza, which hyper offensive teams especially appreciate. Toxic is an option over Taunt to more quickly wear down walls like Rhydon and Hisuian Avalugg. Toxic Spikes punish teams that are mostly grounded or lack Heavy-Duty Boots, though it can be inconsistent with how common Poison-types, notably opposing Skuntank, are.</p> <p>Sample set. Stay tuned for updates!</p>"},
      "Choice Scarf": {},
      "Nasty Plot": {},
      "Physically Offensive": {
        "outdated": true,
        "description": "<p>Skuntank hosts powerful STAB options, priority, and an array of status moves, making it a great offensive threat and support Pokemon. Furthermore, Skuntank's great defensive typing makes it a solid switch-in for foes like Gogoat and Indeedee-F. Crunch is Skuntank's best way to hit targets such as Misdreavus and Indeedee-F, but if instead running only two attacks, Skuntank can use Poison Jab over Gunk Shot for a reliable attack alongside Sucker Punch. Taunt can stop moves from slower foes that may try to abuse or cripple Skuntank such as Tinkatuff's Thunder Wave, Carbink's Iron Defense or Trick Room, as well as entry hazards from both. Toxic is another way to threaten bulky threats like Misdreavus if not running Crunch, Carbink, Gogoat, and Alolan Persian. Toxic Spikes punishes foes that don't hold Heavy-Duty Boots such as Gabite and Choice item Basculin, although it can be less reliable with the abundance of Heavy-Duty Boots in the metagame. If Skuntank is no longer needed, Aftermath allows it to punish contact moves from foes like Honchkrow and Flapple. Tera Dark makes Sucker Punch a more reliable revenge killing option while further boosting Crunch's damage. Tera Ground allows Skuntank to serve as a Volt Switch blocker and pairs well with Tera Blast to hit opposing Skuntank and Tinkatuff. Tera Flying can lure Ground moves like Charizard and Dugtrio's Earthquake to more easily pick them off in addition to removing Skuntank's weakness to Ground.</p> <p>With Skuntank only weak to Ground-types like Whiscash, allies that can absorb Ground-type attacks such as Gogoat, Flapple, and Rotom-F come in handy. Whiscash also makes a good partner to help with threats like Alolan Dugtrio and Tinkatuff, while Skuntank can deal with said Grass-types. Skuntank's Toxic and Toxic Spikes pair well with bulky Pokemon like Dachsbun and Chansey to stall out foes. Dachsbun's Wish and Chansey's Heal Bell also help with longevity. Misdreavus is a notably great teammate, as it offers a Ground immunity, can cripple threats such as Gabite and Perrserker with Will-O-Wisp, and can spinblock. Misdreavus can also run Hex to benefit from any poisoned foes. Item removal, such as Banette's Knock Off and Indeedee-F's Trick, can get rid off foes' Heavy-Duty Boots to benefit Toxic Spikes. Indeedee-F can also help with Skuntank's longevity via Healing Wish, although it is notable that its Psychic Surge temporarily hinders Skuntank's Sucker Punch. While being the best Toxic Spikes setter, Skuntank is also the best way to remove Toxic Spikes with the lack of hazard removal in the metagame. This is appreciated by non-Heavy-Duty Boots Pokemon like Gabite and Assault Vest Crabominable.</p>"
      },
      "Specially Defensive": {"outdated": true}
    }
  },
  "Bronzong": {"sets": {"Utility": {}, "Bulky Setup Sweeper": {}}},
  "Spiritomb": {"sets": {"Offensive Trick Room": {"description": "<p>Tera Blast Fairy breaks through opposing Fighting-types like Virizion and Hariyama as well as Dark-types like Wo-Chien. Psyshock covers Fighting-types without requiring Spiritomb to Terastallize and also hits Tera Poison Wo-Chien. Tera Steel offers Spiritomb several key resistances as well as an immunity to poison, which can translate to additional setup opportunities. Tera Blast can be used alongside Tera Steel to beat Articuno, Cryogonal, and Tera Fairy users, though it doesn't have many other practical applications.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Calm Mind": {"outdated": true}, "Nasty Plot": {"outdated": true}, "Utility": {"outdated": true}}},
  "Gabite": {
    "outdated": true,
    "sets": {
      "Stealth Rock": {
        "description": "<p>Gabite's good Eviolite-bolstered bulk and defensive typing make it a premier Stealth Rock user and an effective check to threats like Skuntank, Raichu, and Lycanroc-N. With its decent Attack and STAB Earthquake + Dragon Tail, Gabite is deceptively hard to switch into and exploit, which gives it an easier time setting Stealth Rock and negating offensive pressure. Rough Skin adds to the support Gabite provides, helping it further wear down physical threats like Basculin and Zangoose for its teammates to finish off. Stone Edge nails Charizard and Articuno and also hits Rotom-F. Dragon Tail is useful against setup sweepers like Gogoat and Tera Fighting Carbink, but Gabite can use Swords Dance instead to double as a bulky wallbreaker. The investment in bulk lets Gabite avoid the 2HKO from Lycanroc-N's Play Rough after Stealth Rock and Charizard's Hurricane at full. 28 Speed EVs allow Gabite to outspeed defensive Misdreavus. Tera Ghost helps against Normal-types like Zangoose and Squawkabilly, provides an immunity to Carbink's Body Press, and lets Gabite spinblock. Tera Fairy is another option that staves off Dark- and Dragon-types like Alolan Persian and Flapple. Alternatively, Tera Steel offers useful resistances like Ice, Flying, and Grass and also lets Gabite come in freely on Toxic and Toxic Spikes.</p> <p>Because of its unique blend of offense and defense, Gabite fits well on multiple playstyles. Ice-types like Rotom-F and Articuno are the biggest threat to Gabite and must be accounted for when using it. Charizard, Rotom-F, and Carbink are checks to such Pokemon and appreciate having their switch-ins worn down by Stealth Rock, with Charizard and Carbink also offering Gabite backup against Grass- and Fire-types, respectively. If Carbink runs Spikes, it can even form an entry hazard stacking core with Gabite. Pyroar is another option for checking Ice-types that also pressures Tera Fairy Misdreavus, which is really good at exploiting Gabite, and appreciates Gabite coming to its aid against threats like Alolan Dugtrio and Lycanroc-N. Wallbreakers that struggle against Steel-types, such as Indeedee-F and Honchkrow, benefit from Gabite's presence and can also check Misdreavus for it. Cleaners and revenge killers like Electrode and Choice Scarf Basculin love being paired with Gabite, since its ability to effortlessly spread chip damage can give them an easier time picking foes off.</p>"
      },
      "RestTalk": {
        "description": "<p>Gabite can opt to run a RestTalk set due to its great bulk and phazing ability. This set helps give Gabite longevity in its phazing role because of its recovery option, which also helps it handle its checks with greater ease. Dragon Tail helps with removing setup sweepers or passive Pokemon that Gabite can't deal with such as Gogoat, Misdreavus, or Vigoroth. However, its phazing ability is also impactful when there are entry hazards on the opponent's field. Rest gives Gabite recovery, while Sleep Talk keeps it from being too passive. 28 Speed allows it to outspeed non-invested Misdreavus, while 116 Special Defense makes Special Charizard's Hurricane a 3HKO. It still has enough physical bulk for Lycanroc-N's Play Rough to only be a 3HKO after Stealth Rock damage. Gabite has the ability to turn into a spinblocker with Tera Ghost, making it an option to keep its team's hazards stay on the field. Tera Fairy helps cover its Dragon-type weakness, which Dragonair and Flapple can exploit, while also providing it a resistance to the strong Dark-types in PU like Alolan Persian, Skuntank, and Houndoom. Tera Steel turns all of its weaknesses into resistances, but be aware of threats it normally can deal with becoming a problem like Alolan Dugtrio, Lycanroc-N, and opposing Gabite.</p> <p>RestTalk Gabite works best on balance and entry hazard stacking teams. Gabite can also fill the role of status absorber, able to take Misdreavus's or Charizard's Will-O-Wisp, Skuntank's Toxic, and Alolan Persian and Tinkatuff's Thunder Wave. It lacks the ability to be a heavy damage dealer with this set, so Pokemon that can hit it super effectively don't have much trouble coming in on it. The likes of Quaxwell, Mareanie, and Lumineon are appreciated for helping take what would be 4x super effective Ice-type attacks from Whiscash, Golduck, and Crabominable. In return, Gabite helps them with an Electric immunity from the likes of Raichu and Rotom-S. Tinkatuff and Perrserker can also help with these threats as well as covering Gabite's other issues with Flapple and Dragonair. Gabite does well at coming in on the premier Fire-type attackers in the tier: Charizard, Pyroar, and Houndoom. Offensive teammates such as Gogoat, Sawsbuck, and Nasty Plot Rotom-F appreciate its presence on their team as a switch-in for the aforementioned Fire-types, or else they struggle to set up. With many of the tier's top Pokemon having a 4x weakness to Rock, such as Articuno, Charizard, and Masquerain, Gabite can pair well with them, because it walls the likes of Lycanroc-N and Dugtrio which typically carry Rock coverage.</p>"
      },
      "Swords Dance": {}
    },
    "credits": {"writtenBy": [{"username": "asa", "user_id": 400292}, {"username": "sleid", "user_id": 601970}], "teams": [{"name": "Quality checked by", "members": [{"username": "rien", "user_id": 474994}, {"username": "Bella", "user_id": 567483}, {"username": "asa", "user_id": 400292}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Lumineon": {
    "outdated": true,
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Lumineon's combination of an excellent defensive typing, handy utility options with U-turn and Encore, good Speed tier for a pivot, and nifty ability to check special attackers such as Pyroar and Spiritomb allows it to become a decent pivot. Ice Beam is valuable coverage, hitting foes such as Gabite and Dartrix for super effective damage. U-turn allows Lumineon to tank a hit for teammates to get them in safely. This pairs well with Encore impairing Pokemon such as Whiscash or Masquerain attempting to set up entry hazards or boost their stats. Storm Drain allows Lumineon to blanket check some Water-type attackers such as Choice-locked Basculin and Golduck. Tera Grass is normally preferred, giving Lumineon a resistance to Grass- and Electric-type attacks that it would otherwise fear from Pokemon such as Gogoat and Raichu. Alternatively, Tera Dragon can give the same resistances as well as an added resistance to Fire-type attacks in exchange for a resistance to Ground-type attacks. Tera Ghost is an option to wall Quaxwell and check offensive Normal-types such as Zangoose and Pyroar better. Lumineon normally uses a specially defensive EV spread with a Calm nature to take on threats such as Pyroar, Houndoom, and Alolan Persian well, but a more physically defensive EV spread of 252 HP / 252 Def / 4 SpD with a Bold nature allows Lumineon to take on physically offensive foes such as Dragon Dance Charizard, Basculin, and Perrserker better.</p> <p>Lumineon's best partners are ones that appreciate having a pivot to tank hits for them and allow them in safely as well as ones that enjoy Lumineon's ability to tank Water-type attacks. Setup sweepers such as Nasty Plot Haunter, Gogoat, and Quiver Dance Masquerain enjoy Lumineon's ability to help them come in safely to set up and sweep. Fire-types like Charizard and Pyroar form a strong core with Lumineon, with Lumineon absorbing the Water-type attacks from Pokemon such as Basculin they fear, and in return they break Grass-type threats like Gogoat and Sawsbuck that Lumineon would struggle against. Other Pokemon with pivoting moves such as Alolan Persian, Perrserker, and Electrode can form a VoltTurn core with Lumineon, with Alolan Persian in particular completing a powerful defensive core with by tanking physical hits Lumineon can normally struggle with. Ground-types like Alolan Dugtrio and Gabite can be useful switch-ins to Electric-types like Raichu, allowing Lumineon to be a more powerful pivot.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}, {"username": "asa", "user_id": 400292}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Leafeon": {"outdated": true, "sets": {"Wish": {"description": "<p>X-Scissor hits opposing Grass-types like Flapple and Gogoat; if these Pokemon aren't a concern, Leafeon can run Yawn to force switches, Leech Seed for additional recovery, or Swords Dance to make up for its relative passivity.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Glaceon": {"outdated": true, "sets": {"Calm Mind": {}, "Choice Specs": {}}},
  "Froslass": {"sets": {"Spikes Lead": {}, "Utility": {}, "Choice Band": {}}},
  "Rotom": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {"description": "<p>Thunderbolt is stronger than Volt Switch and doesn’t force Rotom out. Nasty Plot lets Rotom bolster its offensive presence after using Trick. Will-O-Wisp punishes foes like Arboliva and Morpeko for trying to switch in on Rotom and also slows down physical attackers like Hisuian Sneasel. Tera Electric and Tera Ghost both boost Rotom’s STAB moves, but Tera Fairy helps out against Dark-types like Morpeko and Skuntank.</p> <p>Sample set. Stay tuned for updates!</p>"},
      "Utility": {"description": "<p>Tera Steel offers Rotom several useful resistances, including to Stealth Rock, and makes it neutral to Dark and immune to Poison, which lets it trade with threats like Passimian and +2 Hisuian Sneasel.</p> <p>Sample set. Stay tuned for updates!</p>"},
      "Nasty Plot": {"description": "<p>Discharge is weaker than Thunderbolt but has a higher chance of paralyzing foes, which can support both Rotom and slower teammates. Volt Switch lets Rotom wear down its checks while also generating momentum for its team. Substitute shuts down passive foes like Naclstack. Protect lets Rotom scout for moves and gain extra Leftovers recovery. Tera Electric and Tera Ghost both boost Rotom’s STAB moves, but Tera Fairy helps out against Dark-types like Morpeko and Skuntank.</p> <p>Sample set. Stay tuned for updates!</p>"}
    }
  },
  "Rotom-Frost": {
    "outdated": true,
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Rotom-F is a premier wallbreaker in the PU tier thanks to its decent Speed and great offensive and utility options, allowing it to become a great nuisance for most teams. Its unresisted STAB combination hits the entire tier for at least neutral damage, and its typing in conjunction with Levitate allows it to come in on weaker Pokemon such as defensive Misdreavus, Whiscash, and Gogoat. Will-O-Wisp cripples defensive Pokemon such as Tinkatuff and Perrserker, though Discharge is another option that trades Thunderbolt's damage output for a 30% paralysis chance, which can support a late-game cleaner such as Alolan Persian. Lastly, Volt Switch grants Rotom-F the ability to pivot out of unfavorable matchups such as against Carbink and Crabominable. Substitute can be utilized instead since Rotom-Frost is normally able to force out switch-ins rather efficiently due to its great offensive typing, becoming a terrifying sweeper with the addition of Terastallization. Tera Electric grants Rotom-F an even higher damage output on its main STAB move. Tera Ghost and Tera Water remove its weaknesses to Fighting and Fire-types such as Crabominable and Charizard, respectively.</p> <p>Thanks to its multitude of options and offensive potential, Rotom-F functions best on offensive and balance teams that appreciate a wallbreaker that’s able to cripple special walls for a late-game cleaner. Alolan Persian and Haunter appreciate Rotom-F’s ability to break through, weaken, or cripple walls such as Gogoat and Carbink. Whiscash is a great defensive teammate for Rotom-F, able to switch in on threats such as Pyroar, Charizard, and Alolan Dugtrio. In return, Rotom-F threatens Grass-types such as Gogoat and Leafeon. Frail wallbreakers such as Basculin and Dugtrio appreciate being brought in safely through Rotom-F's Volt Switch. VoltTurn cores with Perrserker and Honchkrow should also be considered due to the great offensive synergy these Pokemon provide against common defensive cores.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Rotom-F's good Speed stat allows it to outspeed common threats and Choice Scarf users such as +1 Masquerain and Lycanroc-N. Its coveted BoltBeam STAB combination, fast Volt Switch, and Spikes immunity make it one of the most potent revenge killers in the tier. Trick allows Rotom-F to cripple specially defensive walls that would otherwise check it such as Tinkatuff, as well as Pokemon that rely on Heavy-Duty Boots to be effective, such as Masquerain. Rotom-F has many options for its third moveslot. Discharge can be used as an Electric-type STAB without needing to switch out while also being able to fish for paralysis, Will-O-Wisp can spread burn to physical attackers such as Gogoat and Skuntank, and Nasty Plot can allow Rotom-F to become a terrifying setup sweeper after using Trick. Rotom-F also has many viable Tera type options, with Electric being the most common, to boost its power while shedding Ice-type's annoying weaknesses to common Rock, Fire, and Fighting moves. However, Tera Ghost can be used to be immune to common Fighting-type attacks such as Carbink's Body Press and Crabominable's Close Combat, while Tera Water gives a valuable resistance to Fire-type attacks while generally being a good defensive typing.</p> <p>Rotom-F's weakness to Stealth Rock can be an issue, so entry hazard control from Pokemon such as Dartrix and Quaxwell can be useful. Water- and Ground-types such as Whiscash, Gabite, and Camerupt can switch into the Fire- and Rock-types such as Charizard and Carbink that can otherwise threaten out Rotom-F. Pokemon such as Carbink and Tinkatuff can switch into foes that Rotom-F would otherwise have a hard time breaking through on its own, such as Tera Steel Dachsbun, opposing Tinkatuff, and Ampharos. Wish users such as Leafeon and Dachsbun can use Wish before switcihing to Rotom-F, allowing it to alleviate Stealth Rock damage. Dachsbun can also dissuade Fire-types from clicking Fire-type moves thanks to Well-Baked Body and can check Carbink depending on Carbink's moveset. Gogoat can check Whiscash and Raichu, allowing Rotom-F to use Volt Switch more easily while Rotom-F can pressure or cripple Gogoat's checks, such as Misdreavus. U-turn users such as Alolan Persian, Perrserker, and Flapple can form a VoltTurn combination with Rotom-F. Perrserker can also provide entry hazards with Stealth Rock, making it harder for Rotom-F's checks to switch in safely, and can threaten out Pokemon such as Carbink and Tinkatuff that would otherwise annoy Rotom-F.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "ishtar", "user_id": 471436}, {"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "Hera", "user_id": 414072}, {"username": "rien", "user_id": 474994}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}, {"username": "UT", "user_id": 523866}, {"username": "Lumii", "user_id": 493772}]}]}
  },
  "Rotom-Fan": {"outdated": true, "sets": {"Pivot": {}, "Choice Scarf": {}}},
  "Rotom-Mow": {"sets": {"Choice Scarf": {}, "Utility": {}}},
  "Mesprit": {"sets": {"Setup Sweeper": {"description": "<p>Substitute allows for easier setup against passive foes like Sandaconda. Thunderbolt offers strong neutral coverage and stops Steel-types like Registeel and Alolan Sandslash from walling Mesprit. Shadow Ball is weaker than Thunderbolt but hits Bronzong super effectively. Mesprit should only use Grassy Seed if it's being paired with Thwackey.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Choice Scarf": {}, "Choice Specs": {}, "Utility": {}}},
  "Shaymin": {"sets": {"Life Orb": {}, "Choice": {}}},
  "Leavanny": {"outdated": true, "sets": {"Sticky Web": {}}},
  "Swanna": {"sets": {"Offensive Defog": {}, "Offensive Pivot": {}}},
  "Sawsbuck": {
    "outdated": true,
    "sets": {
      "Swords Dance": {},
      "Choice Scarf": {
        "description": "<p>With Sawsbuck's niche combination of Headbutt and Serene Grace, it can utilize Choice Scarf to outspeed and attempt to shut down the entire unboosted metagame through flinches and potentially turn the tides on a match. Sawsbuck's great Speed also makes for decent speed control, getting the jump on many other Choice Scarf users such as Rotom-F and Indeedee-F and setup sweepers such as Quiver Dance Masquerain. However, Sawsbuck can also be unreliable at times, only Speed tying with threats like Choice Scarf Haunter and Trailblaze Houndoom and being outsped by Choice Scarf Alolan Dugtrio and Dragon Dance Charizard. When not wanting to rely on Headbutt flinches, Double-Edge gives Sawsbuck a much stronger Normal STAB move that also helps make up for its average Attack and makes it a more reliable revenge killer. Tera Normal further strengthens Double-Edge, helps make up for Headbutt's low power, and allows Sawsbuck to better take attacks such as Haunter's Sludge Bomb and Pyroar's Fire Blast. Horn Leech gives Sawsbuck a secondary STAB move, hitting threats like Klawf, Whiscash, and Misdreavus harder while providing some longevity. Zen Headbutt OHKOes Haunter while also benefiting from Serene Grace and Stomping Tantrum is Sawsbuck's best coverage move for Steel-types such as Tinkatuff and Perrserker. However the last slot is somewhat flexible, with other options including Megahorn for Gogoat, Play Rough for Spiritomb, and Thunder Wave to benefit Headbutt later on.</p> <p>Alolan Persian and Tinkatuff both help to facilitate Sawsbuck as a late-game cleaner; the two of them can reliably spread paralysis with Thunder Wave, while the former can use Parting Shot to grant Sawsbuck safer field entry, and the latter can remove items with Knock Off to hinder the longevity of walls that rely on Heavy-Duty Boots and Leftovers as well as slow down faster Choice Scarf users like Basculin and Alolan Dugtrio. Dark-types like Skuntank and the previously mentioned Alolan Persian help with Ghost-types, making Sawsbuck's Headbutt much easier to spam. Skuntank's Toxic and Toxic Spikes also pair well with Sawsbuck's Headbutt flinches to wear down foes, with Skuntank also offering extra speed control in Sucker Punch and helping against Grass-types like Gogoat while Sawsbuck helps against Ground-types like Whiscash and Dugtrio. Normal-type teammates like Indeedee-F and Pyroar can also help against Ghost-types and other Normal checks, being able to overwhelm them and make them easier for Sawsbuck to pick off. Furthermore, special wallbreakers such as Choice Specs Basculin and Flapple can help break through defensive threats such as Hisuian Avalugg and Spiritomb. Finally, when deciding on coverage moves, teammates that can pick up sacrificed coverage are greatly appreciated, such as Alolan Dugtrio and Whiscash to check Steel-types and Charizard and Rotom-F to check Grass-types.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "UberSkitty", "user_id": 355061}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Eelektross": {"sets": {"Assault Vest": {}, "Coil": {}}},
  "Beartic": {"outdated": true, "sets": {"Rain Sweeper": {}}},
  "Braviary": {"sets": {"Sky Attack": {}, "Bulk Up": {"description": "<p>With the second EV spread and a Careful nature, Braviary outspeeds Modest Clawitzer, avoids having its Substitute broken in one hit by passive foes like Weezing, and isn't 2HKOed by offensive Porygon2.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Choice Scarf": {}}},
  "Virizion": {"sets": {"Swords Dance": {"description": "<p>Stone Edge can be used instead of Zen Headbutt to nail Flying-types like Articuno and Charizard; it also hits foes like Decidueye and Vikavolt harder. However, without Zen Headbutt, Virizion is helpless against defensive Poison-types like Vileplume and Tera Poison users like Wo-Chien.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Calm Mind": {}}},
  "Pyroar": {"sets": {"Special Attacker": {}, "Choice": {"outdated": true}}},
  "Gogoat": {
    "outdated": true,
    "sets": {
      "Bulk Up": {
        "description": "<p>Gogoat is an amazing defensive wincon, able to boost past special threats like Indeedee-F and Charizard late-game thanks to its great special bulk, usage of Terastallization, and recovery in Horn Leech and Milk Drink. It is also a solid switch-in to Water-types like Whiscash and Basculin, comfortably taking their STAB moves and threatening to OHKO them or set up. Bulk Up is what lets Gogoat become so threatening late-game, letting it take on physical attackers like Perserrker and Sawsbuck after a Bulk Up or two. Rock Slide is optimal coverage alongside Horn Leech, hitting Grass-type checks like Charizard, Honchkrow, and Articuno. Heavy-Duty Boots lets Gogoat ignore entry hazards, namely the otherwise debilitating Toxic Spikes. Water is the premier Tera type due to its overall defensive utility, reversing Gogoat's Fire weakness and making it take Flying- and Bug-type attacks more easily, which lets it set up on various foes it could not before such as Charizard, Rabsca, and Camerupt. However, Tera Rock gives Gogoat STAB on Rock Slide while still having it resist Fire and Flying, but it becomes vulnerable to Ground- and Steel-types like Gabite and Perrserker. Both Tera types keep Gogoat's usefulness as a Grass-type check due to Sap Sipper.</p> <p>Before Terastallizing or setting up, Gogoat is threatened by common offensive Pokemon like Charizard, Pyroar, and Rotom-F, so additional special walls like Carbink and Ampharos are recommended as partners. Carbink can also set entry hazards to wear down Gogoat's checks like Gabite and Tinkatuff, while Ampharos can bring Gogoat in with Volt Switch. Pokemon like Basculin and Alolan Dugtrio appreciate having a Pokemon that can come in on Electric- and Grass-types like Raichu and Leafeon. Misdreavus is particularly annoying for Gogoat, able to cripple it with Will-O-Wisp + Hex and use it at setup bait, so ways to dispose of or significantly weaken Misdreavus are appreciated. Wallbreakers like Nasty Plot Skuntank, special Honchkrow, and Indeedee-F can threaten Misdreavus while not caring about Will-O-Wisp, while paralysis from Tinkatuff and Alolan Persian can help Gogoat brute force its way past Misdreavus.</p>"
      },
      "Choice Band": {},
      "Assault Vest": {}
    },
    "credits": {"writtenBy": [{"username": "Hera", "user_id": 414072}], "teams": [{"name": "Quality checked by", "members": [{"username": "rien", "user_id": 474994}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Clawitzer": {"outdated": true, "sets": {"Choice Specs": {"description": "<p>Aura Sphere 2HKOes Cryogonal and threatens common Tera Steel users like Poliwrath and Appletun. Dark Pulse hits Pokemon like Farigiraf, Veluza, and Trevenant harder than Clawitzer's other moves while also being decent neutral coverage. A Modest nature is generally preferred to maximize Clawitzer’s damage output, but a Timid nature can be used to outspeed threats like defensive Articuno. Tera Dragon further powers up Dragon Pulse and helps against Grass- and Electric-types like Arboliva and Rotom.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Carbink": {
    "outdated": true,
    "sets": {
      "Stealth Rock": {
        "description": "<p>Carving out a niche for itself as an entry hazard setter with good matchups against common threats such as Charizard and Articuno, Carbink is easily able to exploit the fact that many common offensive Pokemon will struggle to OHKO it, making entry hazards on the opponent's side of the field nearly guaranteed. Body Press further takes advantage of Carbink's naturally high Defense by allowing it to deal modest damage, especially to frail attackers such as Pyroar or Steel-types that may try to switch in, such as Perrserker or Alolan Dugtrio, although its reliance on Body Press to not be immensely passive can invite in opposing Misdreavus or other Pokemon that may choose to utilize Tera Ghost. Power Gem allows for Carbink to target common Pokemon in the tier that have a large Rock weakness, such as Charizard, Articuno, Masquerain, and Vespiquen, while also insuring that it is not entirely helpless against the aforementioned Misdreavus. Spikes allows Carbink to be of greater assistance to more fast-paced offensive teams, further exploiting its natural bulk to apply even more pressure to the opponent in the form of entry hazards. Rest allows for Carbink to somewhat make up for its lack of recovery, which helps it to still be a threat later in the game and to set hazards back up if they are removed. Lastly, Iron Defense allows Carbink to become a threatening sweeper by making it even more difficult to break through while also greatly increasing the damage done by Body Press. Heavy-Duty Boots helps Carbink by making it immune to opposing hazards, greatly increasing its longevity, while Leftovers allows for a small amount of passive recovery. Tera Fighting increases the damage of Body Press even further, while Tera Ghost allows for Carbink to block attempts at using Rapid Spin to clear away hazards. A more physically defensive spread of 248 HP / 252 Def / 8 SpD with a Bold nature is also viable to improve Carbink's matchup against threats such as Gogoat and Dugtrio.</p> <p>Carbink's high success rate when it comes to setting up entry hazards is greatly appreciated by almost all teams, especially those that make use of setup sweepers like Dragon Dance Charizard or powerful breakers like Zangoose, which greatly benefit from the extra chip damage that Carbink provides. In addition, Grass-types such as Gogoat and Thwackey appreciate Carbink's ability to take hits from the multitude of powerful Fire-types in the tier. Thwackey is also one of the few Pokemon in PU with access to Knock Off, which is valuable for removing Heavy-Duty Boots from opponents and making Carbink's hazards much more difficult to manage. Furthermore, Grassy Terrain lessens the damage dealt by Earthquake and provides Carbink with passive recovery, which is especially beneficial should it choose to run Heavy-Duty Boots. In return, these Pokemon are strong answers to Water-types such as Whiscash and Golduck that can solidly threaten Carbink with super effective attacks. Carbink also appreciates strong Ground- and Fire-types, such as Dugtrio, Charizard, and Pyroar, that can handle threatening Steel-types such as Perrserker and Alolan Dugtrio for it. Due to Carbink being extremely slow and vulnerable to moves such as Taunt and Encore, fast teammates such as the aforementioned Dugtrio, as well as Alolan Persian and Raichu, are also appreciated to handle attempts to stifle Carbink alongside providing much-needed speed control.</p>"
      },
      "Iron Defense": {
        "description": "<p>Iron Defense Carbink is an incredibly terrifying defensive setup sweeper with incredible stats, making really hard to stop even for some of the most threatening physical attackers like Crabominable, and Lycanroc-N, especially after it starts boosting with Iron Defense. Body Press hits most of the tier for neutral or super effective damage, making its switch-ins very limited after a boost. Most of these switch-ins like Charizard and Masquerain also have to be wary of Power Gem. Carbink could choose to run Moonblast instead, hitting the likes of Drakloak and Spiritomb. Rock Polish is an option in the last slot to boost past Pokemon that could normally pick it off at low health like offensive Perrserker, Klawf, and Gabite. Carbink can also opt to run RestTalk alongside Iron Defense and Body Press to function better as a late-game sweeper once opposing Ghost-types and bulky Pokemon that resist its attacks are removed. Clear Body helps with many aspects, like avoiding defensive drops from moves like Misdreavus's Shadow Ball or Quaxwell's Liquidation, blocking Alolan Persian's Parting Shot, and ignoring Sticky Web's Speed drop. Tera Fighting is used to boost Body Press's power, helping Carbink pick up the 2HKO on Gogoat, Skuntank, and Whiscash. A defensive Tera like Ghost or Water also work well with helping Carbink get by various foes. Ghost drops all of its weaknesses, allowing it to tank hits with greater ease, but it makes enemies like Misdreavus, Banette, and Haunter more problematic. Water is a great option for stuffing the likes of Golduck, Basculin, and Lumineon, though Carbink then has to be wary of Rotom-F and Raichu in addition to being a generally good defensive typing that also allows it to shrug off hits from Steel-type moves that would usually obliterate it. Carbink can opt to run a more specially defensive spread of 248 HP / 8 Def / 252 SpD with a Calm nature to better take hits from Whiscash, Lumineon, and Raichu for an easier time setting up on them. However, you do miss out on initial Body Press power.</p> <p>Carbink works great on balance or bulky offensive teams looking for an endgame sweeper. It does great at supporting the likes of Misdreavus, Haunter, and Indeedee-F since it can wall Dark-types like Honchkrow, Alolan Persian, and Spiritomb. Carbink also isn't bothered by the likes of Houndoom, Pyroar, and Charizard which teammates like Gogoat, Rotom-F, and Rabsca really appreciate. It also fits the role of a Knock Off absorber, being able to take the hit when switching in and either immediately deal damage back or start setting up on Banette, Tinkatuff, and Klawf. While Carbink's defensive capabilities make it a great teammate, it also can break through bulky teams that rely on the likes of Hisuian Sliggoo and Chansey, which special attackers such as Haunter, Persian and Rotom-F enjoy having removed. Grass-types such as Gogoat, Dartrix, and Flapple really help Carbink find multiple opportunities to come back in to set up since they can help take hits from the likes of Whiscash, Basculin, and Sawsbuck. Carbink also really appreciates having a partner that can help with its 4x weakness to Steel, specifically against Perrserker and Alolan Dugtrio, like defensive Misdreavus, Lumineon, and RestTalk Gabite.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "sleid", "user_id": 601970}, {"username": "Melt Gibson", "user_id": 617840}], "teams": [{"name": "Quality checked by", "members": [{"username": "asa", "user_id": 400292}, {"username": "Bella", "user_id": 567483}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Sliggoo-Hisui": {"outdated": true, "sets": {"Curse": {}, "Special Tank": {"description": "<p>Acid Spray can be used instead of Dragon Pulse to help Hisuian Sliggoo take on specially bulky foes like Chansey, Gogoat, and Calm Mind Misdreavus. Thunderbolt and Ice Beam are other options that offer Hisuian Sliggoo great coverage and deal more damage to Pokemon like Charizard and Gogoat, respectively.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Special Wall": {}}},
  "Avalugg-Hisui": {"sets": {"Offensive": {}, "Entry Hazard Lead": {}}},
  "Dartrix": {"outdated": true, "sets": {"Defog": {}}},
  "Decidueye": {"sets": {"Defensive Defog": {}, "Physical Attacker": {"description": "<p>Decidueye should use Spirit Shackle if it’s being paired with Knock Off users to increase its reliability. Knock Off punishes bulky foes like Dudunsparce and Braviary on the switch, though STAB coverage in Leaf Blade and pivoting are both generally more useful.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Swords Dance": {"description": "<p>Decidueye should use Spirit Shackle if it’s being paired with Knock Off users to increase its reliability. Knock Off punishes bulky foes like Dudunsparce and Braviary on the switch, though STAB coverage in Leaf Blade and pivoting are both generally more useful.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Crabominable": {
    "outdated": true,
    "sets": {
      "Assault Vest": {
        "description": "<p>With Assault Vest bolstering its naturally good bulk, Crabominable becomes a solid tank that forces advantageous trades against several Pokemon, including Rotom-F, Alolan Persian, and even Charizard if need be. Thanks to Iron Fist and its strong STAB moves, Crabominable excels at pressuring walls like Misdreavus on the switch, Gogoat, and Whiscash, which can make it awkward for balance teams to play around. Earthquake hits Skuntank without triggering Aftermath and, after some chip damage, 2HKOes specially defensive Carbink, physically defensive Tinkatuff, and Mareanie. Close Combat is a secondary Fighting STAB option that's stronger than Drain Punch, but Thunder Punch is more reliable against Flying-types than Ice Hammer due to its higher accuracy. 60 Speed EVs allow Crabominable to outrun uninvested base 50s like Perrserker, Chansey, and Carbink. Tera Water helps against Fire-, Water-, and Steel-types like Pyroar, Basculin, and Alolan Dugtrio, all of which can otherwise overwhelm Crabominable. Tera Electric lets Crabominable take Electric-, Flying-, and Steel-type attacks from Pokemon like Rotom-F, Honchkrow, and Tera Steel Alolan Persian and is best used with Thunder Punch. Tera Ground gives Crabominable an Electric immunity, notably letting it block Volt Switch, and secures the OHKO on Skuntank with Earthquake. On teams with entry hazard control, Tera Fire can be considered to let Crabominable absorb Will-O-Wisp and thus more easily handle Misdreavus as well as Fire-types like Pyroar.</p> <p>Crabominable's main flaw is that its poor longevity can limit its ability to repeatedly handle special attackers; this is made worse with Crabominable being vulnerable to all hazards and tending to attack last. Entry hazard removers like Dartrix and Komala can give Crabominable an easier time switching in, with the latter not removing any hazards set by Crabominable's team. Wish support from the likes of Dachsbun and Leafeon is another way to keep Crabominable healthy, with the former also absorbing Fire-type moves from Pokemon like Misdreavus and Charizard. In return, Crabominable pressures Ice- and Steel-types like Rotom-F and Perrserker. Healing Wish Indeedee-F can similarly give Crabominable another chance to sponge hits or break if it gets worn down too quickly. Physical walls like Alolan Persian and Misdreavus can form a good defensive core with Crabominable and facilitate wallbreaking through moves like Parting Shot, Thunder Wave, and Will-O-Wisp. Fast Pokemon like Electrode, Dugtrio, and Choice Scarf Indeedee-F are good at compensating for Crabominable's bad matchup against offense and benefit from its ability to both tear through balance cores and trade with revenge killers like Choice Scarf Rotom-F. Fire- and Dark-types like Charizard and Skuntank can more reliably pressure Misdreavus for Crabominable and appreciate it wearing down bulky foes like Whiscash, Carbink, and Hisuian Sliggoo.</p>"
      },
      "Bulk Up": {},
      "Trick Room Attacker": {}
    },
    "credits": {"writtenBy": [{"username": "asa", "user_id": 400292}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}, {"username": "Bella", "user_id": 567483}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Lycanroc": {"sets": {"Swords Dance": {}, "Choice Band": {}, "Entry Hazard Lead": {}}},
  "Lycanroc-Midnight": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {
        "description": "<p>Lycanroc-N makes for a fantastic cleaner and wallbreaker with No Guard + STAB Stone Edge and great coverage. Close Combat hits Steel-types like Perrserker and Alolan Dugtrio and Normal-types like Zangoose and Sawsbuck. Rock Blast is a great way of getting around Substitute from the likes of Articuno and Rotom-F while preventing Focus Sash Masquerain from setting up Sticky Web. Play Rough hits Gabite, which makes for an otherwise great Lycanroc-N check, while Iron Head nails Carbink. With a Choice Scarf, Lycanroc-N outspeeds threats like Alolan Persian and Pyroar. Tera Rock and Tera Fighting both boost Lycanroc-N's most spammable moves. Tera Fighting also allows Lycanroc-N to resist Sucker Punch from the likes of Honchkrow and Skuntank.</p> <p>Lycanroc-N is checked by Pokemon that resist Rock like Gabite, Tinkatuff, and Whiscash, so Pokemon that can weaken these checks like Zangoose and Basculin make for great offensive partners. As a Choice Scarf cleaner, Lycanroc-N appreciates entry hazard support from the likes of Whiscash and Carbink to more easily put foes in range of its moves. When locked into an undesirable move, Lycanroc-N appreciates defensive teammates to fall back on like Articuno and Perrserker, which can also provide momentum with U-turn for Lycanroc-N to safely hit the field.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Togkey", "user_id": 400664}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bella", "user_id": 567483}, {"username": "gum", "user_id": 434150}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Mareanie": {"outdated": true, "sets": {"Defensive": {}}},
  "Lurantis": {"sets": {"3 Attacks + Synthesis": {}, "Defog": {}}},
  "Passimian": {"outdated": true, "sets": {"Choice": {}}},
  "Palossand": {"sets": {"Physically Defensive": {"description": "<p>Scorching Sands generally shouldn't be used alongside Sludge Bomb. Doing so makes Palossand more prediction reliant to avoid inducing foes like Porygon2 and Arboliva with the less useful status.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Thwackey": {"outdated": true, "sets": {"Choice": {}}},
  "Flapple": {
    "outdated": true,
    "sets": {
      "Choice Band": {},
      "Choice Scarf": {},
      "Choice Specs": {},
      "Dragon Dance": {
        "description": "<p>Flapple's unique offensive typing, naturally high Attack stat, decent Speed stat, and acess to an amazing boosting move in Dragon Dance allow it to become one of PU's most devastating wallbreakers. Dragon Dance means Flapple is able to boost its damage output while also being able to outspeed common threats such as Charizard, Dachsbun, and Rotom-F. Sucker Punch can gives Flapple priority to finish off weakened foes. Tera Blast can be used with Tera Ground to threaten Steel-types such as Perrserker and Tinkatuff, which would otherwise counter Flapple. On Ripen sets, Flapple can opt for Arcobatics, giving it strong coverage into foes such as Gogoat, Crabominable, and Rabsca. Ripen is normally the preferred ability and should be ran with Sitrus Berry, as it allows Flapple to set up and regain HP on Pokemon such as Carbink and Raichu. However, Heavy-Duty Boots can be ran instead with Hustle for more immediate power. Flapple most commonly runs Tera Dragon, boosting its Outrage to incredible amounts of power, allowing it to OHKO or 2HKO the majority of the tier. Tera Ground gives Flapple a solid defensive typing, allowing it to block Volt Switch from Pokemon like Electrode and Raichu and should be ran with Tera Blast. Finally, Tera Steel gives Flapple a great defensive typing that can allow it to set up on foes it otherwise could not on such as Skuntank and Masquerain.</p> <p>Flapple's primary struggles are often having issues with setting up safely and Steel-types walling Flapple sets without Tera Blast. Pivots such as Alolan Persian and Rotom-F can help get Flapple in safely to sweep. Alolan Persian is a particularly notable partner, as it can cripple threats that would normally be faster than Flapple even after a boost with Thunder Wave, such as Choice Scarf Skuntank and Lycanroc-N. Fire- and Ground-types such as Charizard and Alolan Dugtrio can check the Steel-types that otherwise give Flapple issues, such as Perrserker and Tinkatuff. In return, Flapple threatens out the defensive Water-types the Fire- and Ground-types would struggle with, such as Whiscash. Poison-types such as Skuntank and Swalot can absorb Toxic Spikes and check opposing Poison-types that cause issues for Flapple. Indeedee-F is also a notable partner, as it can use Healing Wish to heal Flapple back to max health and allow Flapple to be able to set up twice in the game. Spikes from Pokemon such as Carbink and Whiscash help wear down Steel-types for Flapple.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "avarice", "user_id": 346653}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Sandaconda": {"sets": {"Stealth Rock": {}}},
  "Cramorant": {"sets": {"Defog": {"description": "<p>Tera Ground lets Cramorant turn the tables on Electric-types like Eelektross and Rotom, block Volt Switch, and potentially tank coverage moves like Hisuian Sneasel's Gunk Shot in a pinch. Tera Fairy is another option to deal with Tera Dragon Clawitzer as well as check Dark-types like Spiritomb. EV spreads with more physical bulk are also valid to improve Cramorant's matchup against foes like Floatzel, Tera Fighting Passimian, and Poliwrath.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Hattrem": {"outdated": true, "sets": {"Defensive": {"description": "<p>Mystical Fire threatens Steel-types like Orthworm and Alolan Dugtrio, whereas Draining Kiss hits Dark-types like Morpeko and Spiritomb. Eviolite gives Hattrem an easier time taking hits from foes like Hisuian Sneasel and entry hazard setters like Orthworm and Whiscash. Eject Button is an alternative for offensive teams, which don’t always need to preserve Hattrem and benefit a lot from immediate momentum. The Speed investment lets Hattrem outrun uninvested base 50s such as Muk and Perrserker.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Perrserker": {
    "outdated": true,
    "sets": {
      "Stealth Rock": {
        "description": "<p>Perrserker carves a solid niche in PU by being a Stealth Rock setter with solid offensive capability after setting Stealth Rock, being the only setter in the tier that can pivot with U-turn, and having a great ability. Close Combat is good coverage, hitting Pokemon such as Zangoose, Dunsparce, and opposing Perrserker for super effective damage. Perrserker's item slot is interchangeable; Leftovers can be used for consistent recovery, while Heavy-Duty Boots allows Perrserker to switch in more often when entry hazards such as Spikes are on the field. Likewise, Perrserker's Tera type is also flexible. Tera Dragon can be used to gain a resistance to Fire-type attacks that would otherwise scare out Perrserker, letting it better deal with Pokemon such as Charizard, as well as being a generally good defensive type. However, Tera Water does the same, exchanging a bad matchup against Dragon-types such as Gabite for one against Electric- and Grass-types such as Raichu, Electrode, and Flapple.</p> <p>Perrserker's best teammates are ones that appreciate having Stealth Rock set up and being able to enter the game safely. As such, strong sweepers that struggle to switch in safely otherwise such as Quiver Dance Masquerain, Swords Dance Charizard, and Zangoose are excellent partners. Fire- and Ground-type switch-ins such as Carbink, the aforementioned Charizard, and Gabite are also good partners. Electric-types such as Ampharos, Raichu, and Electrode can create a threatening VoltTurn combination with Perrserker. Pokemon such as Gabite and Pyroar appreciate having Perrserker come in on Pokemon that would normally threaten them out, such as Articuno, Lycanroc-N Choice-locked into Stone Edge, and Dachsbun, and force them to switch out while setting Stealth Rock to support the rest of its teammates.</p>"
      },
      "Offensive": {}
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "Hera", "user_id": 414072}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Falinks": {"outdated": true, "sets": {"No Retreat": {}, "Choice": {}}},
  "Indeedee-F": {
    "outdated": true,
    "sets": {
      "Choice": {
        "description": "<p>Indeedee-F's combination of a solid Speed tier with Choice Scarf, synergistic ability in Psychic Surge allowing it to block priotity moves and boosting its Psychic-type attacks, and a strong STAB combination allow it to become one of PU's best revenge killers and wallbreakers. Trick allows Indeedee-F to debilitate walls that would otherwise wall it, such as Tinkatuff and Misdreavus. Psyshock hits Special Walls such as Articuno and Lumineon harder due to their weaker physical bulk, but Psychic can be used instead, as it does more damage to more physically bulky Pokemon such as Perrserker and Gabite. Indeedee-F's last two moveslots are very flexible; Hyper Voice provides a strong alternative STAB move which also allows Indeedee-F to damage Dark-types such as Houndoom. Tera Blast provides a STAB move before Terastallizing and can be used with a Ground or Fairy Tera to allow Indeedee-F to hit Steel-types and Dark-types that would normally check it such as Perrserker, Tinkatuff, and Skuntank; however, it is weaker than Hyper Voice. Healing Wish can sacrificially and allow a partner Pokemon to come back in healthy after it has been damaged, building momentum. Indeedee-F can also viably run Tera Psychic, boosting up its Psychic-type attacks even further. Indeedee-F's preferred item is Choice Scarf, which allows it to act as a solid revenge killer against threats such as Alolan Persian and Zangoose, aswell as outspeeding other Choice Scarf users such as Skuntank, Lycanroc-N, and Honchkrow. Alternatively, Indeedee-F can opt for a Choice Specs set that allows it to be very powerful, enabling to OHKO or 2HKO the majority of the tier.</p> <p>Indeedee-F's main flaws are having issues breaking through common Steel- and Dark-types such as Tinkatuff and Skuntank if it does not want to Terastallize, or a teammate had previously Terastillized and it's difficult to get in safely. As such, Pokemon like Dugtrio, Charizard, and Carbink are excellent partners. Dugtrio in particular is an excellent partner, as with Indeedee's Psychic Terrain it does not fear getting revenged killed from priority from Basculin's Aqua Jet and Zangoose's Quick Attack. U-turn and Volt Switch from Pokemon such as Articuno and Ampharos can give Indeedee-F a free switch in the battle. Sticky Web Masquerain can be used with Choice Specs variants to help with the lackluster speed. Pokemon that struggle against walls, like Golduck, appreciate Choice Specs Indeedee-F breaking through bulkier foes like Articuno and Gogoat. Pokemon normally easily revenged killed by priority such as Pyroar and the aforementioned Dugtrio appreciate having Indeedee-F help keep their HP high with Healing Wish as well as setting up Psychic Terrian.</p>"
      },
      "Calm Mind": {}
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "Hera", "user_id": 414072}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Morpeko": {"sets": {"Utility": {}, "Choice": {}}},
  "Glastrier": {"sets": {"Swords Dance": {"description": "<p>Running more bulk investment is an option to make Glastrier harder to take down, which can be especially annoying for opponents if it opts for Substitute.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Calyrex": {"sets": {"Double Dance": {"description": "<p>Calyrex is not viable in PU, but this is considered its best set.</p> <p>The Speed investment lets +2 Calyrex outspeed Choice Scarf Alolan Dugtrio.</p>"}}},
  "Wyrdeer": {"outdated": true, "sets": {"Double Dance": {"description": "<p>Grassy Seed should only be used alongside Thwackey, which is the only reliable Grassy Terrain setter. 216 Speed EVs let Wyrdeer outspeed Electrode after using Agility, and the investment in bulk ensures it isn't 2HKOed by Choice Scarf Basculin's Wave Crash. Wyrdeer's EV spread is rather flexible, though, meaning it can be customized to suit a particular team's needs.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Choice Specs": {}}},
  "Quaxwell": {"outdated": true, "sets": {"Rapid Spin": {}}},
  "Spidops": {"outdated": true, "sets": {"Entry Hazard Lead": {}, "Heavy-Duty Boots": {}}},
  "Dachsbun": {
    "outdated": true,
    "sets": {
      "Wish": {
        "description": "<p>Dachsbun is the best Wish passer in PU. Its great typing and decent overall bulk give it ample opportunity to keep itself and its teammates healthy while checking threats like Gabite and Alolan Persian. Well-Baked Body also lets Dachsbun switch into Fire-types like Charizard and Houndoom as well as absorb Will-O-Wisp from Misdreavus and Charizard, all of which threaten other Wish passers like Leafeon. Body Press prevents Steel-types from walling Dachsbun and also gets stronger if Well-Baked Body has already been triggered. Play Rough is good coverage alongside Body Press and hits Misdreavus, but Roar can be used instead to force setup sweepers like Gogoat and Carbink out as well as rack up chip damage if entry hazards are up. Copycat can be used to copy entry hazards from Pokemon like Whiscash as well as beat certain setup sweepers like Iron Defense Carbink one-on-one. Tera Steel lets Dachsbun absorb Steel- and Poison-type attacks and gives it an edge against Pokemon such as Sludge Bomb Houndoom, Articuno, and Indeedee-F. Dachsbun can run 64 Speed EVs to outspeed neutral-natured Honchkrow at the cost of some bulk. Dachsbun can also opt for a physically defensive spread to better take on Pokemon like Lycanroc-N and, after Terastallizing, Zangoose.</p> <p>Dachsbun fits best on balance teams in need of cleric support and a blanket check to various offensive threats. Pokemon like Gabite, Mareanie, and Tinkatuff can check Steel- and Poison-types like Alolan Dugtrio and Skuntank for Dachsbun, and they appreciate Dachsbun coming to their aid against foes such as Articuno and Pyroar. Charizard is another great partner that switches into Steel-types like Perrserker and non-Rock Slide Alolan Dugtrio and can do so repeatedly thanks to the Wishes Dachsbun passes. Setup sweepers like Rotom-F and Gogoat find it easier to boost multiple times in a game with Dachsbun keeping them healthy. Wish support also gives Gogoat an easier time preserving Milk Drink's limited PP, which allows it to play more recklessly early on against threats that Dachsbun baits in, such as Basculin. In return, these setup sweepers make up for Dachsbun's passivity and can threaten out nuisances like Vespiquen and Whiscash. Misdreavus can spread burns to give Dachsbun an easier time against physical attackers like Crabominable and slow opposing walls down with Taunt. Meanwhile, Dachsbun can stand up to Fire-types like non-Tera Steel Charizard, check Dark-types like Alolan Persian and Honchkrow, and reduce Misdreavus's reliance on Pain Split for recovery.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "asa", "user_id": 400292}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bella", "user_id": 567483}, {"username": "rien", "user_id": 474994}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Arboliva": {
    "outdated": true,
    "sets": {
      "Choice Specs": {"description": "<p>Giga Drain is a backup Grass STAB move that also keeps Arboliva healthy, but Dazzling Gleam 2HKOes specially defensive Appletun and also hits Trevenant for neutral damage. 92 Speed EVs allow Arboliva to outrun uninvested base 50s like Muk and Perrserker. Tera Poison offers key resistances to Poison and Fighting, letting Arboliva more easily trade with Hisuian Sneasel, Passimian, and Muk. Tera Ground still lets Arboliva resist Poison while also strengthening Earth Power and letting it block Volt Switch. Tera Normal allows Hyper Voice to 2HKO Muk and Articuno and also eliminates almost all of Arboliva’s weaknesses.</p> <p>Sample set. Stay tuned for updates!</p>"},
      "Defensive": {"description": "<p>Earth Power targets Poison-, Steel-, and Fire-types like Skuntank, Tera Steel Appletun, and Pyroar. Giga Drain can be used instead to improve Arboliva’s longevity and also hit Rotom. Protect lets Arboliva scout moves and gives it free recovery from Leftovers, Leech Seed, or Grassy Terrain. Substitute protects Arboliva from status conditions and lets it exploit passive Pokemon like Whiscash and Naclstack. Alternatively, a specially defensive set with a Calm nature can be used to improve Arboliva’s matchup against threats like Trick Room Spiritomb.</p> <p>Tera Poison lets Arboliva beat Poison- and Fighting-types like Weezing, Hisuian Sneasel, and Passimian one-on-one. Seed Sower summoning Grassy Terrain also mitigates the added Ground weakness that comes with this choice. Tera Water is an alternative that especially helps against Fire- and Ice-type attacks from the likes of Charizard and Rotom-F.</p> <p>Sample set. Stay tuned for updates!</p>"}
    }
  },
  "Squawkabilly": {"outdated": true, "sets": {"Guts Attacker": {}, "Pivot": {}, "Choice Scarf": {}}},
  "Squawkabilly-Blue": {"outdated": true, "sets": {"Guts Attacker": {}, "Pivot": {}, "Choice Scarf": {}}},
  "Naclstack": {"sets": {"Stealth Rock": {}}},
  "Klawf": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Klawf is an amazing defensive wall, offering utility through Stealth Rock and Knock Off, being very hard to wear down thanks to Regenerator, and using it's solid bulk and typing to check common threats such as Skuntank and Charizard. When compared to other Rock-type walls like Carbink and Hisuian Avalugg, which offer higher bulk and hazard control like Spikes and Rapid Spin, Klawf's Knock Off, Regenerator, and overall versatility are what make it the preferred option on many teams. Furthermore, Klawf's Regenerator and Heavy-Duty Boots give it more longevity than other Knock Off users like Tinkatuff and Thwackey. Klawf's STAB move of choice isn't overly important and can be chosen between Stone Edge for more power and Rock Slide for more reliability. Swords Dance helps with the lack of Attack investment and makes Klawf a larger offensive threat. High Horsepower provides coverage for Steel-types like Perrserker and Tinkatuff and various other targets like Skuntank and Raichu. Klawf's naturally high Defense allows it to invest into Special Defense, making it a mixed wall and improving its ability to check special threats like Pyroar and Haunter. 232 HP EVs maximize Klawf's recovery from Regenerator while lessening damage from Skuntank and Electrode's Aftermath and hazards if Heavy-Duty Boots is removed. 56 Speed EVs alongside Jolly nature allow Klawf to outspeed 252 Speed Cacturne and uninvested Lumineon. That being said, Klawf's EV spread and nature are very flexible, and you can choose to invest into Defense to make it a dedicated physical wall, running Careful nature to further improve its special bulk while still outspeeding Tinkatuff and max Speed Perrserker, or go down a more offensive route with max Attack. Dragon is Klawf's preferred Tera type, losing its weaknesses to Water- and Grass types like Basculin and Thwackey while being a great defensive typing overall. But its Tera type is also flexible, such as Tera Ground for a Volt Switch immunity and STAB High Horsepower, Tera Ghost to spinblock and gain a Fighting immunity, and Tera Flying to gain resistance to moves like like Alolan Dugtrio's Earthquake, Cacturne's Giga Drain, and Charizard's Focus Blast.</p> <p>Klawf's utility and versatility make it viable on virtually any archetype. With Klawf being the best Knock Off user in a metagame full of Heavy Duty-Boots users and not much of hazard removal, it pairs greatly with other hazard setters. Spikes Whiscash is a common partner for Klawf because of this while also forming a great defensive core with Klawf to check threats like Perrserker and Gabite. Swalot, Mareanie, and Skuntank can set Toxic Spikes to slowly stall foes out while checking Grass-types like Gogoat and offering other utility like Toxic, Encore, Taunt, and Haze. Mareanie is also notable, since it forms a Regenerator core with Klawf. Finally, in terms of hazards, Knock Off paired with Masquerain's Sticky Web makes it easier for setup sweepers like double dance Wyrdeer and Nasty Plot Haunter to sweep. Fast teammates like Pyroar, support Alolan Persian, and the previously mentioned setup sweepers also appreciate Knock Off removing any Choice Scarfs, making them harder to revenge kill. The former two also offer support with Will-O-Wisp, Taunt, and Thunder Wave. Alolan Persian's Parting Shot and other pivots like Rotom-F and Electrode give Klawf more opportunities to come in and switch out to activate Regenerator. Grass-types like Gogoat and Leafeon check Water-types like Basculin and Golduck, while Klawf checks Flying- and Fire-types like Charizard and Pyroar for them. Leafeon's Wish also improves Klawf's longevity, as do other clerics like Heal Bell Chansey and Wish Komala.</p>"
      },
      "Offensive": {"description": "<p>224 Speed EVs let +1 Klawf outspeed Alolan Persian. The bulk investment prevents Alolan Persian from OHKOing Klawf with +2 Dark Pulse from full. Klawf can viably run both Knock Off and High Horsepower, giving up the ability to boost its Speed in exchange for hitting Steel-types much harder. Using Anger Shell and the spread 252 Atk / 4 SpD / 252 Spe can turn Klawf into a more immediately threatening sweeper even if it doesn’t manually boost, but this limits its longevity and consistency.</p> <p>Sample set. Stay tuned for updates!</p>"}
    },
    "credits": {"writtenBy": [{"username": "UberSkitty", "user_id": 355061}], "teams": [{"name": "Quality checked by", "members": [{"username": "Melt Gibson", "user_id": 617840}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Scovillain": {"outdated": true, "sets": {"Sun Sweeper": {"description": "<p>Scovillain should only use a Mild nature with 4 Attack EVs if it's running Stomping Tantrum; otherwise, it should opt for a Modest nature, invest the leftover EVs in Defense, and run 0 Attack IVs.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Rabsca": {
    "outdated": true,
    "sets": {
      "Offensive Trick Room": {
        "description": "<p>Rabsca is a fearsome, albeit relatively niche, late-game sweeper that makes use of Trick Room, healthy Special Attack, and good coverage to perform cleaning and wallbreaking duties. Psyshock takes precedence over Psychic, as it allows Rabsca to pressure specially defensive foes like Articuno and setup sweepers like Calm Mind Misdreavus; it also lets Rabsca deal considerably more damage to Crabominable. Earth Power deals considerable damage to Skuntank, Pyroar, Alolan Dugtrio, and Tinkatuff and complements Psyshock by pressuring targets like Iron Defense Carbink. Bug Buzz is Rabsca's best move to pressure foes like Gogoat and Alolan Persian. Recover allows Rabsca to mitigate entry hazard chip damage as well as to play a more active role during early-game as a switch-in to targets like Indeedee-F and Raichu, although forgoing Bug Buzz notably leaves it unable to hit Honchkrow and limits its ability to check Gogoat. Life Orb greatly increases Rabsca's damage output, notably allowing it to OHKO targets like Skuntank and Crabominable before Terastallizing, as well as 2HKO specially defensive Articuno after slight chip damage. Heavy-Duty Boots can be used for easier setup and more reliable checking of targets, like Carbink, should Rabsca choose to run Recover, but it usually prefers the increased damage output. Tera Ground and Tera Bug can be used to boost Earth Power and Bug Buzz's damage output, respectively; they also notably ease its ability to set up on Misdreavus, which otherwise threatens it with Shadow Ball or Hex, as well as prevent Skuntank and Honchkrow's Sucker Punch from prematurely ending its sweep. Tera Psychic is less reliable, as it limits Rabsca's setup opportunities, but it is otherwise effective for beating Articuno. A Quiet nature and 0 Speed IVs allow Rabsca to outspeed the entire metagame, aside from other dedicated Trick Room attackers like Crabominable and Camerupt, while Trick Room is active.</p> <p>Rabsca works best as a late-game sweeper, making it a good fit on offensive teams that can wear opposing Pokemon down throughout the match and take care of Pokemon like Misdreavus and Alolan Persian that can make Rabsca's job of setting up with Trick Room difficult. Pivots like Alolan Persian, Rotom-F, and Articuno can create safe switch-in opportunities for Rabsca if it is needed to check a target early-game or set up late-game. Bulky Alolan Persian can switch into Pokemon that threaten Rabsca out like Lycanroc-N, and it appreciates Rabsca pressuring foes like Dachsbun and Tinkatuff for it. Rotom-F and Articuno appreciate Recover variants of Rabsca, which are able to check Carbink, and in return, they can pressure threats like Masquerain and Misdreavus for it. Raichu, as well as Tinkatuff, can create setup opportunities for Rabsca with Encore; the latter is especially notable for making Rabsca's late-game cleaning easier by accelerating the opposing team being worn down by hazards with Knock Off. Indeedee-F can form an efficient Psychic-type core with Rabsca, and it notably gives Life Orb variants optimal entry with Healing Wish as well as boosting Psyshock and blocking priority from Pokemon like Skuntank and Basculin with Psychic Terrain. Crabominable greatly appreciates Recover variants' ability to check Carbink, and it can make use of leftover Trick Room turns to wallbreak. Hazard removers like Dartrix and Quaxwell can ease Life Orb variants' task of setting up late-game without relying on recovery.</p>"
      },
      "Bulky Setup": {},
      "Trick Room Setter": {}
    },
    "credits": {"writtenBy": [{"username": "rien", "user_id": 474994}], "teams": [{"name": "Quality checked by", "members": [{"username": "Bella", "user_id": 567483}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Tinkatuff": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Tinkatuff's unique typing, great utility movepool, and solid bulk make a good defensive Pokemon. acting as one of the tier's few reliable Dark-type switch-ins while removing items and spreading paralysis. However, it can be passive at times, is unable to cripple Electric-type Pokemon such as Raichu and Electrode, and is heavily reliant on Eviolite for its bulk. Tinkatuff's abilities as a Stealth Rock setter are complemented by Knock Off removing Heavy-Duty Boots of common switch-ins to it like Charizard and Pyroar, greatly hindering their longevity. Knock Off can also cripple the most common hazard removers, Dartrix and Quaxwell, both of which greatly rely on their Eviolite. Encore is used to halt setup sweepers like Gogoat, Carbink, and Masquerain, letting a teammate threaten them out. Rest can also be run to ensure that Tinkatuff is a long-term switch-in to Pokemon like Indeedee-F, Alolan Persian, and Skuntank; however, this forces Tinkatuff to remain immobile for multiple turns, compounding its issues with passivity. Mold Breaker is used for two niche applications: removing items from Sticky Hold Swalot and paralyzing a Terastallized Raichu with Thunder Wave. A specially defensive spread makes Tinkatuff a better switch-in to Pokemon like Nasty Plot Skuntank, Haunter, and Alolan Persian. However, a physically defensive spread of 252 HP/ 252 Def / 4 SpD with an Impish nature is also an option to switch into threats like Lycanroc-N and Daschbun more consistently. Tera Water allows Tinkatuff to check the various Fire- and Water-types in the tier such as Charizard, Pyroar, and Golduck more reliably; Tera Dragon does the same but trades a weakness towards Electric-types like Electrode and Raichu for one against Dragon-types like Drakloak and Flapple.</p> <p>Tinkatuff struggles heavily with strong physical attackers like Basculin and Crabominable, so Pokemon that can cover for them are necessary. Mareanie is adept at switching into both of these threats as well as others that threaten Tinkatuff, like Perrserker and Falinks; in return, Tinkatuff can switch into threatening Psychic- and Electric-types like Indeedee-F and Electrode. Misdreavus is also a solid choice, switching into many annoying Ground-types like Dugtrio and Gabite while checking Fire-types like Charizard and Pyroar in a pinch. It also heavily benefits from Tinkatuff spreading paralysis, powering up its Hex. Rock- and Water-types like Carbink and Whiscash are sturdier switch-ins to the Fire-types that threaten out Tinkatuff, which it appreciates. Gabite is also a strong partner for Tinkatuff, checking strong Fire-types like Houndoom and Camerupt for Tinkatuff while appreciating Tinkatuff running Stealth Rock and removing opposing Heavy-Duty Boots with Knock Off so it can rack up chip damage on the opposing team quickly with Dragon Tail sets.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Hera", "user_id": 414072}], "teams": [{"name": "Quality checked by", "members": [{"username": "Togkey", "user_id": 400664}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Wugtrio": {"outdated": true, "sets": {"Choice Band": {}}},
  "Bombirdier": {"sets": {"Offensive Pivot": {"description": "<p>Rocky Payload and Tera Rock should only be used if Bombirdier runs Stone Edge. Tera Ground lets Bombirdier lure and KO threats like Rotom, Alolan Raichu, and Haunter as well as block Volt Switch. An EV spread of 248 HP / 180 SpD / 80 Spe with a Careful nature lets Bombirdier outspeed and potentially beat Modest Clawitzer one-on-one. This spread also improves Bombirdier’s matchup against special attackers in general, which can help its team better pivot around threats like Arboliva.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Choice": {}, "Entry Hazard Lead": {"description": "<p>U-turn can be used over Memento to generate momentum without immediately sacrificing Bombirdier, and it also hits Morpeko. However, Memento is generally more useful, especially on the hyper offensive teams that commonly use Bombirdier.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Orthworm": {
    "outdated": true,
    "sets": {
      "Coil": {"description": "<p>Iron Tail is stronger than Heavy Slam but less accurate before Orthworm uses Coil. Substitute is an option to protect Orthworm from status and weaker attackers as it sets up. The Speed investment lets Orthworm outrun Modest Clawitzer, but more Defense investment can be used if Clawitzer isn’t a concern. Tera Ghost helps against Fighting-types like Passimian and Hisuian Sneasel, but Tera Electric gives Orthworm no weaknesses due to Earth Eater.</p> <p>Sample set. Stay tuned for updates!</p>"},
      "Utility": {"description": "<p>Protect lets Orthworm scout and gain extra Leftovers recovery, while Coil reduces its passivity and also lets it serve as a wincon. Spikes is an option if Orthworm's team wants to set as many entry hazards as possible or already has a Stealth Rock user. Iron Defense boosts Body Press faster than Coil and also lets Orthworm more easily trade with physical attackers like Passimian and Floatzel. The Speed investment lets Orthworm outrun Modest Clawitzer, but more Defense investment can be used if Clawitzer isn’t a concern.</p> <p>Sample set. Stay tuned for updates!</p>"}
    }
  },
  "Glimmet": {"outdated": true, "sets": {"Suicide Lead": {}, "Specially Defensive": {}}},
  "Houndstone": {"sets": {"Defensive": {"description": "<p>Rest and Sleep Talk should almost always be used alongside one another. While Houndstone can forgo Sleep Talk and gain an extra moveslot, this leaves it completely helpless while it's asleep. Poltergeist makes Houndstone less passive against foes like Lurantis but is generally less consistent than Night Shade due to its lower PP and accuracy. If Houndstone does use Poltergeist, though, it should run an Impish nature and maximum Attack IVs. Roar prevents bulky setup sweepers like Braviary, Poliwrath, and Farigiraf from exploiting Houndstone.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Offensive": {}}},
  "Veluza": {"sets": {"Physical Sweeper": {"description": "<p>Slash breaks through Cacturne, which walls Veluza's STAB combination. Recover helps Veluza stay healthy and potentially find extra setup opportunties. Tera Blast Fire bypasses Tera Steel Poliwrath, which otherwise walls Veluza. Aqua Jet is useful for picking off Choice Scarf Alolan Raichu and Hisuian Sneasel—some of the only Pokemon that outspeed +2 Veluza—and playing around Sucker Punch.</p> <p>Sample set. Stay tuned for updates!</p>"}}},
  "Farigiraf": {"sets": {"Offensive Trick Room": {}, "Double Dance": {}, "Wish": {}}},
  "Dudunsparce": {"sets": {"Utility": {}, "Calm Mind": {"description": "<p>Serene Grace can be used to give Dudunsparce better odds of breaking through walls via Special Defense drops or status. Rattled is more consistent, though, and punishes the use of moves like U-turn and Knock Off, the latter being easier to bait if Dudunsparce runs Tera Ghost.</p> <p>Sample set. Stay tuned for updates!</p>"}, "Coil": {}}},
  "Wo-Chien": {"sets": {"RestTalk": {}, "Leech Seed": {}}}
}