{
  "Venusaur": {"sets": {"Sun Sweeper": {}}},
  "Sandslash": {"sets": {"Sand Wallbreaker": {}, "Physical Wall": {}}},
  "Ninetales": {"sets": {"Sun Setter": {}}},
  "Vileplume": {"sets": {"Physical Wall": {}}},
  "Primeape": {"sets": {"Bulky Setup": {}, "Lead": {}, "Offensive Setup": {}}},
  "Arcanine": {"sets": {"Offensive": {}}},
  "Victreebel": {"sets": {"Sun Sweeper": {}}},
  "Tentacruel": {"sets": {"Utility": {}}},
  "Golem-Alola": {"sets": {"Magnet Pull Trapper": {"description": "<p>The given speed allows Golem-Alola to outrun max Speed Copperajah and effectively 1v1 it with Iron Defense + Body Press.</p>"}}},
  "Slowbro": {
    "overview": "<p>Slowbro is the most versatile physical wall in the tier, checking most of the tier with its great defensive typing, access to Regenerator, and deep movepool. Its typing alone lets it check some of NU's best physical wallbreakers and sweepers like Lycanroc-D, Mienshao, and Cloyster, using them as an opportunity to set up with Calm Mind or Future Sight. Slowbro is also a fantastic user of Tera, luring in Dark-types like Alolan Muk and Brute Bonnet before it uses Tera Poison or Fairy, which make them useless against it. Slowbro has a lot of move versatility, too: Future Sight enables Fighting-type teammates to break each other's checks; Psychic Noise cripples opposing walls and bulky setup sweepers; Thunder Wave punishes switch-ins; and Calm Mind pairs well with Slowbro's high physical bulk, making it hard to KO both physically and specially and boosting its own damage output in the process. Regenerator keeps Slowbro alive longer, letting it switch in to any physical move whenever it wants without worrying too much about residual damage. Slowbro also has a wide range of items it can use; Covert Cloak to ignore Scald's burn and Psychic Noise's heal blocking, Rocky Helmet to further punish physical wallbreakers and pivots, and Leftovers to keep it healthy. Pressuring Slowbro isn't easy, but some strong special wallbreakers like Chandelure, Thundurus, and Choice Specs Noivern are able to force it out, even after a boost or two. Entry hazards are also a thorn in Slowbro's side, detracting from the HP restored by Regenerator. Slowbro also doesn't enjoy status, as it is a common target of Toxic, which sometimes forces it to Terastallize, while being burned forces it to use Slack Off more often.</p>",
    "comments": "<h3>Other Options</h3> <p>Slowbro can take on a more standard defensive set, swapping out Calm Mind for Thunder Wave to punish anything that tries to stay in against it. Defensive Slowbro can also use Foul Play to punish setup sweepers like Flygon, Feraligatr, and Gallade, which it otherwise struggles to KO. Future Sight enables wallbreakers like Mienshao, Lycanroc-D, and Gallade to get an early- or mid-game KO on Dark- and Steel-types trying to absorb Future Sight or the Poison- and Ground-types switching into those wallbreakers, often creating a lot of progress. Flamethrower can be used instead of a Psychic-type attack to hit Steel- and Grass-types like Registeel, Klefki, and Tsareena, but it lacks power when unboosted, and Slowbro generally doesn't like facing Grass-types. Nasty Plot pairs well with Future Sight, boosting Slowbro's Special Attack more than Calm Mind does, but it isn't reliable because Slowbro enjoys the boost to its Special Defense that Calm Mind gives. Heavy-Duty Boots ensures Slowbro doesn't take any entry hazard damage while switching in and gives it an immunity to Toxic Spikes, letting it switch in more often and support its team with Scald. Colbur Berry lets Slowbro take any Dark-type attack, such as Lycanroc-D's Crunch, Incineroar's Knock Off, and Krookodile's Knock Off, giving it the opportunity to retaliate with Scald. Assault Vest lets Slowbro tank more hits from special wallbreakers like Noivern, Mew, and Venusaur, but it makes Slowbro lose out on Slack Off's recovery and rely too heavily on Regenerator. Eject Button turns Slowbro into a one-time pivot, safely letting frail teammates like Lycanroc-D, Mienshao, and Thundurus in for free. Lastly, Slowbro can opt for Tera Water to retain part of its original typing while getting rid of its weakness to Ghost- and Dark-type attacks and boosting Scald's damage, but it isn't often used due to the defensive merits of Tera Poison and Fairy.</p> <h3>Checks and Counters</h3> <p><strong>Special Walls</strong>: Alolan Muk, Assault Vest Brute Bonnet, and Calm Mind Sylveon are able to keep up with Slowbro's pace to beat it in a matchup, often forcing it to Terastallize. Alolan Muk, especially, matches up well into Slowbro, removing its item with Knock Off and threatening it with poison if it has not used Tera Poison.</p> <p><strong>Special Wallbreakers</strong>: Strong special wallbreakers such as Chandelure and Choice Specs variants of Noivern and Sylveon can all force Slowbro out due to their unboosted power, but if it has already set up with Calm Mind, then they aren't guaranteed to KO. Other sweepers like Nasty Plot Lucario and Scope Lens Kingdra can bait in Slowbro, but they can be exploited by Slowbro's teammates as well.</p> <p><strong>Dark-types</strong>: Alolan Muk, Krookodile, and Incineroar all pressure Slowbro with their powerful Dark-type attacks. However, they risk getting hit by Scald, and the former two don't want to get burned. Users of Tera Dark like Feraligatr and Lycanroc-D are able to KO Slowbro after a boost with super effective coverage, while Tera Dark Vaporeon is able to wall it thanks to Water Absorb and its new Psychic-type immunity.</p> <p><strong>Electric-types</strong>: Thundurus, Oricorio-E, and Raikou can all set up against Slowbro due to their threatening Electric-type attacks; Oricorio-E is also able to use Taunt to stop Slowbro's setup attempts, but it fears Psychic Noise stopping it from using Roost. Choice Specs users like Magnezone and Toxtricity also threaten an OHKO, but they can lose if Slowbro has set up and Terastallized.</p>",
    "sets": {
      "Calm Mind": {
        "description": "<h4>Set Details</h4> <p>Calm Mind pairs well with Slowbro's great physical bulk, making it hard to KO after a boost. Psychic Noise is the STAB move of choice thanks to its matchup against bulky setup sweepers like Reuniclus, Mew, and especially opposing Slowbro without Covert Cloak, letting it win the matchup every time. Psychic Noise also helps against Unaware Quagsire, which can stall out Slowbro. Psyshock is a stronger option that lets Slowbro sweep easier, making it more of a threat early- and mid-game; Psyshock is also able to beat Tera Poison Slowbro reliably, even if the opposing Slowbro has Psychic Noise. Covert Cloak is Slowbro's go-to item because it gives it a winning matchup against opposing Slowbro, ignoring Scald's burn and Psychic Noise's heal blocking. Rocky Helmet punishes physical attackers and pivots such as Mienshao, Lycanroc-D, and Talonflame, forcing damage on them as Slowbro switches in. Leftovers lessens the need to use Slack Off. Tera Poison retains Slowbro's Fighting-type resistance, removes its weakness to Knock Off, and gives it an immunity to Toxic while simultaneously helping it in the matchup against Alolan Muk, letting Slowbro use it as setup fodder; however, Tera Poison comes with the downside of losing the matchup to other Psychic-types such as Mew, Reuniclus, and most notably other Slowbro. Tera Fairy also retains Slowbro's Fighting-type resistance and allows it to resist Dark-type attacks, but it opens up space to be KOed by Alolan Muk, Gunk Shot Krookodile, and Meteor Mash Lucario.</p> <p>Thanks to its great defensive typing paired with its physical bulk, Slowbro pairs well with Alolan Muk. Slowbro switches into strong physical wallbreakers that target Alolan Muk such as Krookodile, Mienshao, and Flygon while Alolan Muk can switch into special wallbreakers like Chandelure, Thundurus, and Calm Mind Reuniclus. Slowbro also enjoys having Mienshao as a partner to form a Regenerator core, as Slowbro helps deal with revenge killers like Choice Scarf Infernape and Talonflame as well as Poison-types like Vileplume that punish Mienshao. In return, Mienshao can KO Dark-type Pokemon like Incineroar, Brute Bonnet, and Krookodile that try to KO Slowbro. Variants of Slowbro not running Heavy-Duty Boots appreciate entry hazard removal from the likes of Tsareena, Brambleghast, and Talonflame or a grounded Poison-type like Alolan Muk or Vileplume. Ground-types that can switch into Electric-type attacks like Krookodile, Flygon, and Rhyperior aid Slowbro, giving it the opportunity to set up later in battle. Other physical wallbreakers like Lycanroc-D, Gallade, and Incineroar help beat bulky setup sweepers like Mew, Reuniclus, and opposing Slowbro, which Slowbro has a hard time fighting. Slowbro is able to take advantage of passive Pokemon like Talonflame, Klefki, and Registeel, making it easier for Pokemon like Mienshao, Choice Specs Dragalge, and Porygon-Z to sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 189361, "username": "Lucario"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 583607, "username": "PowerOfMemes"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Slowbro-Galar": {"sets": {"Defensive": {}}},
  "Magneton": {
    "outdated": true,
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Magneton distinguishes itself as a good offensive pivot through its Steel typing, which lets it check Pokemon such as Bruxish, Jolteon, and Scyther, and the fact that it is difficult to switch into due to the combination of its high Special Attack stat and Analytic. Volt Switch allows Magneton to bring in frail teammates such as Zoroark, Medicham, and Bruxish safely. Flash Cannon is able to threaten Sandaconda, which blocks Magneton's Volt Switch, and Tera Fairy Drifblim, Umbreon, and Vaporeon. Magnet Rise is notable to wall Sandaconda, preventing it from forcing Magneton out. Tera Blast lets Tera Fairy Magneton threaten Dark- and Dragon-types that check it such as Umbreon and Appletun, or it hits Ground-types that cause Magneton trouble like Whiscash and Sandaconda if it is Tera Grass. Tera Fairy flips the script on Fighting-types, like Passimian and Paldean Tauros, while Tera Grass comes with the added benefit of giving Magneton resistances to Ground- and Water-type moves, which can be useful against Sandaconda and Bruxish.</p> <p>Magneton fits well in VoltTurn cores with Pokemon such as Passimian, Scyther, and Bombirdier. Magneton can struggle against special walls such as Eelektross, Chansey, and Appletun, so Magneton appreciates teammates that can break these Pokemon, such as Passimian, Bruxish, and Mabosstiff. Magneton is liable to be chipped down over time by entry hazards due to its lack of recovery, so it appreciates Defoggers such as Drifblim, Lurantis, and Scyther. Additionally, Magneton does not like its Eviolite being removed by Knock Off, which makes Pokemon such as Umbreon and Qwilfish that can absorb Knock Off great partners. Magneton can also struggle versus Ground-types not threatened by Flash Cannon, like Camerupt and Whiscash, so Water- and Grass-types such as Vaporeon and Appletun make for helpful teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595639, "username": "plznostep"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 509790, "username": "Pokeslice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Muk": {
    "outdated": true,
    "sets": {
      "Utility": {
        "description": "<p>Muk serves as a great tank and Haze user in SV NU, checking various special attackers such as Vivillon and Zoroark and threatening them with Poison Jab and Drain Punch respectively. Poison Touch and Poison Jab let Muk effortlessly spread poison, even on Pokemon immune to Toxic Spikes such as Drifblim and Eelektross. Drain Punch hits Steel-types such as Copperajah and Terastallized Appletun that would otherwise wall Muk. Haze stops setup sweepers such as Vivillon and Calm Mind Vaporeon from setting up. Toxic Spikes lets Muk take advantage of free turns and cripple the opposing team with poison. Tera Dark allows Muk to beat threats like Bruxish and Zoroark after baiting them into their powerful Dark- and Psychic-type attacks and retaliate back while also being able to use Haze against boosted Stored Power users like Veluza and Farigiraf. Alternatively, Tera Water provides an overall better defensive typing, more specifically easing the matchup against offensive Water-types like Calm Mind Vaporeon and Choice Specs Clawitzer. Muk struggles with Pokemon such as Sandaconda, which does not fear its poison due to Shed Skin and can threaten it back with Earthquake. As a result, Muk appreciates teammates such as Rotom, Eelektross, and Cacturne, which can switch into Sandaconda and force it out. Muk is physically frail, making physical walls such as Sandaconda and Drifblim great partners, with the latter also getting rid of entry hazards, which chip Muk down throughout a game.</p>"
      },
      "Curse": {
        "description": "<p>Curse Muk checks specially offensive threats while having the additional benefit of acting as a wincon. Curse boosts Muk's above-average Attack and below-average Defense, complementing its good Special Defense. Drain Punch not only hits special attackers like Zoroark, Rotom-F, and Dudunsparce but also gives Muk longevity, solidifiying its sweeping potential. Shadow Sneak provides Muk with a form of priority, allowing it to revenge kill Ghost-types like Haunter and Rotom or faster threats like Bruxish and Veluza. Poison Touch in combination with Poison Jab gives Muk a 51% chance to poison foes, wearing them down in the process. Sticky Hold prevents Muk from being crippled by Trick from Rotom or Knock Off from Passimian. Tera Water serves as a strong defensive typing, while Tera Dark can be used to help Muk combat Pokemon like Bruxish and Farigiraf. Lurantis pairs well with this particular Muk set, removing Pokemon like Sandaconda, Haze Vaporeon, and Taunt Qwilfish. Zoroark and Passimian can scare away Psychic-types like Bruxish, Indeedee-F, and Medicham that hinder Muk's ability to set up and sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595639, "username": "plznostep"}, {"user_id": 298730, "username": "poh"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Muk-Alola": {
    "overview": "<p>Alolan Muk's useful defensive typing and high Special Defense allow it to be one of the top threats in the metagame. Common special attackers like Chandelure, Munkidori, and Reuniclus are stopped in their tracks and forced out by it. On top of this, Alolan Muk isn't useless against bulkier Pokemon either; thanks to its access to Knock Off in combination with Poison Touch, it can slowly beat Sylveon, Talonflame, and Gastrodon. Poison Touch along with Poison Jab allow it to spread poison nearly uninhibited, letting it chip away at opposing teams quite easily. However, Alolan Muk is quite frail physically, often being forced out by pivots like Mienshao and Flygon and losing momentum. It is also weak to fairly common Ground-types like Flygon, Krookodile, and Rhyperior, which then get free turns to set entry hazards or boost their offensive stats. Also, its reliance on unreliable and passive forms of recovery can let it be overwhelmed and taken advantage of.</p>",
    "comments": "<h3>Other Options</h3> <p>A more offensive Alolan Muk with an Assault Vest and a moveset of Knock Off / Poison Jab / Drain Punch / and one of Ice Punch, Rock Slide, Giga Drain, or Shadow Sneak can be used to take special hits while also pressuring foes, but, in doing so, it sacrifices a lot of longevity.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Ground-type Pokemon like Krookodile, Flygon, and Rhyperior easily OHKO Alolan Muk with a super effective Earthquake, and they can capitalize on a forced switch by setting Stealth Rock or boosting.</p> <p><strong>Fighting-types</strong>: Fighting-types like Mienshao, Gallade, and Lucario, while not having a way to hit Alolan Muk super effectively, overwhelm it, taking advantage of its low Defense with their powerful Fighting-type attacks.</p> <p><strong>Poison-types</strong>: Poison-types like Vileplume and Tera Poison Slowbro can wall Alolan Muk due to their immunity to poison. On top of that, Vileplume is able to set up Leech Seed or use Growth, while Slowbro freely sets up with Calm Mind and threatens it with a burn.</p> <p><strong>Physical Wallbreakers</strong>: Physical wallbreakers like Lycanroc-D and Feraligatr easily overwhelm Alolan Muk with their Choice Band- and Life Orb-boosted attacks due to its low Defense.</p> <p><strong>Setup Pokemon</strong>: With how passive Alolan Muk can be, especially with Rest, it can be setup fodder for Pokemon like Cloyster, Gallade, and Flygon.</p>",
    "sets": {
      "Special Wall": {
        "description": "<h4>Set Details</h4> <p>Poison Jab is preferred for damage, but Poison Fang can be used to spread poison more easily. Rest + Sleep Talk offers recovery but is sometimes unreliable; alternatively, Drain Punch + Protect allows Alolan Muk to regain health while threatening Steel-types like Magnezone and Lucario. Tera Water can be used to better take Fire-type attacks from Hisuian Typhlosion and Chandelure, and it gifts Alolan Muk a strong defensive Tera type that can take on tons of Pokemon well. However, Tera Dragon improves the sun matchup, retains a good rain matchup, and helps Alolan Muk check other special attackers like Thundurus and Rotom-H better than Tera Water does. Both Tera Water and Dragon help Alolan Muk when facing Ground-types, but they tend to leave it more susceptible to other physical wallbreakers like Tsareena and Brambleghast.</p> <p>Alolan Muk fails against physical attackers, especially Ground- and Fighting-types such as Krookodile, Flygon, Lucario, and Mienshao. So, Pokemon like Slowbro, Swampert, and Talonflame help to form a strong defensive core for the team. After using Knock Off, Alolan Muk is almost helpless against Steel-types like Registeel and Klefki as they set entry hazards or boost; its Drain Punch is just too weak. To counter this, teammates that can handle these foes such as Infernape, Krookodile, and Flygon pair well with Alolan Muk. Since it can deal with Psychic- and Ghost-types easily, Pokemon such as Mienshao, Mew, and Munkidori greatly appreciate Alolan Muk's presence. Because of how easily Alolan Muk can remove items, hazard setters like Klefki, Rhyperior, and Quagsire have great synergy with it. On the flip side, with how many times Alolan Muk is forced to switch into an attack, hazards become an issue for it, jeopardizing its ability to take on Chandelure and Munkidori. To clear these hazards, Pokemon like Talonflame, Noivern, and Tsareena pair perfectly.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Cloyster": {
    "overview": "<p>Cloyster is one of the most powerful late-game sweepers in the tier. Its high Defense stat allows it to take a hit before boosting with Shell Smash, and once boosted, it is incredibly difficult to wall or outspeed. Physical attackers, particularly Choice Scarf users like Flygon and Basculegion, provide ample opportunity for Cloyster to set up. Skill Link only increases Cloyster's offensive capability, making Icicle Spear and Rock Blast more consistent and dangerous. Cloyster also has a wide variety of natural coverage options with Icicle Spear, Rock Blast, and Drill Run and often carries Tera Blast to effectively choose its counters. Heavy-Duty Boots, Focus Sash, and entry hazard control can all help give it clear opportunities to boost. However, its low Special Defense, relatively low Speed, and weakness to Stealth Rock can make setting up difficult. Revenge killing Cloyster can be difficult after a Shell Smash boost, as +2 Jolly Cloyster outspeeds all common Choice Scarf users, but priority moves, such as Vacuum Wave or Sucker Punch, can take it out. Checks to Cloyster depend largely on the coverage and Tera type it uses. Bulky Water-types, such as Slowbro, Vaporeon, and Unaware Quagsire, tend to do well but can be blown up by Tera Blast Electric and Grass. Steel-types like Registeel or Magnezone can resist many of Cloyster's attacks but struggle with Drill Run and Tera Ground.</p>",
    "comments": "<h3>Other Options</h3> <p>Cloyster can choose to run Liquidation as an alternate STAB move option, and it can also choose to run Ice Shard, primarily on Adamant sets, to hit the few Pokemon that outspeed and threaten it. Hydro Pump is niche but lets Cloyster always beat Avalugg after a Shell Smash boost. Tera Ghost is another option, particularly on slower Adamant sets, to gain an immunity against Fighting-type moves like Close Combat from revenge killers like Choice Scarf Mienshao. Tera Steel is potentially useful to resist Accelerock and give Cloyster additional resistances as it sets up.</p> <h3>Checks and Counters</h3> <p><strong>Water-types</strong>: Bulky Water-types can be extremely difficult for Cloyster to break without the use of Tera Blast Grass or Electric. Slowbro and Vaporeon both comfortably take hits from Cloyster, while Unaware Quagsire counters its gameplan entirely. Vileplume also baits Icicle Spear and can use Tera Water to resist it.</p> <p><strong>Steel-types</strong>: Without Drill Run or Tera Blast Ground, Cloyster struggles to break through Steel-types. Registeel and Magnezone, particularly if they have the opportunity to use Iron Defense, are serious checks to a potential sweep. Klefki also threatens to cripple Cloyster with priority Thunder Wave. Thundurus and Tsareena both have the potential to bait Icicle Spear, use Tera Steel to survive a hit, and KO Cloyster in return.</p> <p><strong>Revenge Killers</strong>: +2 Jolly Cloyster outspeeds every Choice Scarf user in the tier, so priority moves are the main source of revenge killing against it. Lycanroc-D's Accelerock, Brute Bonnet's Sucker Punch, and Mew and Lucario's Vacuum Wave can threaten to end a Cloyster sweep. Boosted Adamant Cloyster can be outsped by several Choice Scarf users, notably Munkidori, Mienshao, and Flygon. Chlorophyll Venusaur can also revenge kill a boosted Cloyster, but it requires a Timid nature to outspeed Jolly Cloyster.</p>",
    "sets": {
      "Shell Smash": {
        "description": "<h4>Set Details</h4> <p>Rock Blast is a useful coverage move that OHKOes Talonflame without a boost and 2HKOes Avalugg after a boost. Tera Blast gives Cloyster the coverage to break through the Water-types that would otherwise counter it entirely. At +2, Tera Blast Grass and Electric can OHKO Vaporeon and 2HKO Slowbro. Tera Blast Grass also notably has a chance to OHKO Unaware Quagsire. Drill Run provides super effective damage against the Steel-types that would otherwise wall Cloyster, and at +2, it OHKOes Magnezone and 2HKOes Registeel. Tera Electric and Ground also provide an immunity to the threat of Prankster Thunder Wave. Focus Sash guarantees an opportunity to use Shell Smash but requires support to keep entry hazards off the field. White Herb restores Cloyster's defenses after a Shell Smash, bolstering it against revenge kills. Heavy-Duty Boots protects Cloyster from its Stealth Rock weakness and preserves health to let it take a hit before boosting. Cloyster requires a Jolly nature to outspeed common Choice Scarf users, notably outspeeding Mienshao and Munkidori. An Adamant nature can hit a few additional breakpoints, giving Cloyster a chance to OHKO Registeel with +2 Tera Ground-boosted Drill Run and guaranteeing it an OHKO on specially bulky Diancie with +2 Tera Blast Grass.</p> <p>Cloyster works best on hyper offense teams that provide opportunities to sweep and wear down its checks. It benefits heavily from teammates that can chip or seriously damage the Water- and Steel-types that can wall it. Options like Tsareena and Brambleghast can threaten defensive Water-types like Slowbro and Quagsire while keeping entry hazards off the field, preserving Cloyster's health and Focus Sash. Ground- and Fighting-types like Krookodile, Mienshao, and Gallade can put a serious dent in Steel-types, and Gallade and Krookodile in particular threaten Slowbro with Leaf Blade and Knock Off, respectively. Hazard setters like Klefki, Flygon, and Mew can also support Cloyster's sweeping, wearing down foes that it cannot OHKO. Galvantula serves a similar role, setting up Sticky Web to allow Cloyster to run an Adamant nature and outrun Choice Scarf Infernape, Mienshao, and Munkidori after a boost. Other late-game cleaners like Mienshao or a Shell Smash Torterra benefit from Cloyster's damage output and can storm through teams whose physical walls have already taken multiple hits.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641404, "username": "hammer798"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Haunter": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {
        "description": "<p>Haunter is a great Choice Scarf user and late-game cleaner in NU because it outspeeds other notable Choice Scarf users such as Rotom, Passimian, and Bruxish and has perfect coverage for the tier. Shadow Ball threatens Ghost- and Psychic-types such as Drifblim, Rotom, and Medicham, while Focus Blast threatens Normal- and Dark-types such as Dudunsparce, Ursaring, and Umbreon that can comfortably switch into Shadow Ball. Trick lets Haunter punish walls such as Chansey, Poison Touch Muk, and Umbreon by crippling them with a Choice Scarf. Sludge Bomb threatens Pokemon such as Appletun and Cacturne and can inflict poison on special walls like Eelektross, which pressures them throughout the match. It can also threaten various Pokemon such as Tera Fairy Umbreon and Drifblim. Nasty Plot can be run instead to give Haunter a boosting option after it has gotten rid of its Choice Scarf via Trick, threatening Pokemon such as Umbreon much more effectively. Destiny Bond can be used as a last resort to neutralize dangerous setup sweepers such as Coil Eelektross, Coil Sandaconda, and Bulk Up Ursaring as well as punish offensive threats such as Passimian, Zoroark, and Scyther that may attempt to revenge kill Haunter after it has lost its Choice Scarf. Tera Ghost is able to increase Haunter's cleaning potential by powering up Shadow Ball. Tera Fighting can be used to assist Haunter versus Pokemon such as Cacturne and Lycanroc by granting resistances to Sucker Punch and Accelerock, and it also powers up Focus Blast. Haunter has horrible bulk and cannot take even resisted hits well, so it is advised that you pair it with pivots such as Eelektross, Passimian, and Scyther. Furthermore, Haunter struggles with special walls such as Chansey, Umbreon, and Muk, so powerful physical attackers such as Passimian and Medicham can assist in solving this issue.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595639, "username": "plznostep"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 509790, "username": "Pokeslice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Electrode-Hisui": {"sets": {"Offensive Pivot": {"description": "<p>20 Defense EVs allow Electrode-Hisui to avoid a 2HKO from Choice Scarf Bruxish Wave Crash. Fairy Tera Blast hits Dragon-types like Goodra and Tatsugiri. The given Speed outruns Jolteon.</p>"}}},
  "Hitmonlee": {"sets": {"Terrain Sweeper": {}}},
  "Weezing": {"sets": {"Physical Wall": {}}},
  "Chansey": {"sets": {"Utility Wall": {}}},
  "Scyther": {
    "sets": {
      "Pivot": {
        "description": "<p>Armed with excellent Speed and STAB U-turn, Scyther is an elite pivot in NU. Dual Wingbeat targets opposing Scyther and the plethora of Grass- and Fighting-types found in the tier, such as Shaymin, Toxicroak, and Paldean Tauros-F. Close Combat strikes Steel-types like Orthworm and Copperajah as well as Coalossal. Alternatively, if your team needs extra late-game potential, Swords Dance helps Scyther sweep once its checks are weakened or removed. Tera Ground blocks Volt Switch from foes like Rotom-C and Jolteon while providing a resistance to Lycanroc's Accelrock, whereas Tera Flying greatly improves Dual Wingbeat's power, making it far easier to break physical walls such as Qwilfish and Sandaconda.</p> <p>Scyther is an excellent facilitator for VoltTurn teams, pairing well with specially offensive pivots like Rotom-C, Galarian Articuno, and Magneton. These pivots can threaten physical walls like Sandaconda, Qwilfish, and Orthworm; in return, Scyther can pressure special walls like Goodra and Assault Vest Hariyama. Entry hazard setters like Sandaconda, Bronzong, and Qwilfish can rack up residual damage against the aforementioned physical walls, making them easier to wear down over the course of a game.</p>"
      },
      "Swords Dance": {
        "description": "<p>Scyther is a terrific Swords Dance sweeper, courtesy of its fantastic Speed, good power, and variety of Technician-boosted moves. Dual Wingbeat scares off slower Grass- and Fighting-types, like Shaymin, Arboliva, Toxicroak, and Hariyama. Close Combat hits Steel- and Rock-types like Orthworm and Coalossal for super effective damage. Alternatively, U-turn lets Scyther pivot against physical walls like Sandaconda and Gligar, as well as Pokemon that resist Dual Wingbeat like Orthworm and Copperajah. Quick Attack lets Scyther OHKO faster foes like Jolteon and Salazzle after it Terastallizes and boosts with Swords Dance. Tera Grass removes Scyther’s 4x weakness to Stealth Rock and allows Scyther to 2HKO Sandaconda with +2 Trailblaze, while Tera Flying strengthens its Dual Wingbeat to frightening levels and makes non-resistant foes easy to get by.</p> <p>Swords Dance Scyther is best used mid- to late-game, where it has a better chance of picking off sufficiently weakened physical walls like Gligar and Sandaconda. If U-turn is selected, VoltTurn pivots like Rotom-C, Jolteon, and Mesprit are excellent teammates, threatening out walls like Sandaconda and Qwilfish while providing additional utility or coverage. Revenge killers like Tauros and Choice Scarf Rotom-C can preemptively cause Scyther to Terastalize or stop its sweep altogether, so specific checks to them like Sandaconda and Goodra, respectively, can help preserve Scyther's longevity. Special wallbreakers like Goodra, Hoopa, and Salazzle can remove physical walls so Scyther can find better chances to sweep late-game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 189361, "username": "Lucario"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Tauros": {
    "outdated": true,
    "sets": {
      "Wallbreaker": {
        "description": "<p>Tauros is a great wallbreaker and late-game sweeper thanks to its combination of Sheer Force + Life Orb attacks, good coverage, and solid Speed tier. Rock Slide hits Flying-types like Oricorio-F, Articuno, and Scyther. While both Earthquake and Close Combat hit Steel-types that otherwise come in safely, the former gives Tauros an advantageous matchup against Poison-types such as Qwilfish and Muk, whereas the latter hits Steel-types harder while also nuking Ice-types like Abomasnow and Glaceon. Tera Ghost makes Tauros immune to Fighting-type attacks from Medicham and Hisuian Sneasel, and Tera Blast lets it hit Psychic- and Ghost-types in Hattrem and Rotom for greater damage than its other attacks. Tera Fairy is another option that helps against Fighting-types, and Tera Blast Fairy lets it beat Sableye and Spiritomb, which can otherwise wall it. Assurance can be used instead in combination with Stealth Rock from a teammate to OHKO Rotom on the switch. Tera Normal with Body Slam can also be used to take care of checks like Sandaconda, which gets 2HKOed after Stealth Rock.</p> <p>Qwilfish and Froslass are good partners for Tauros, as it usually can’t KO its checks off the bat, so Spikes support is greatly appreciated—along with having a switch-in to Fighting-type attacks. Jolteon and Rotom are also amazing partners, as they can, together with Tauros, overwhelm Sandaconda with their Tera Blast Ice or Trick, respectively. A pivot such as Mesprit or Assault Vest Eelektross can use U-turn to draw in switch-ins like Appletun, Blissey, and Bombirdier, which Tauros can take advantage of.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Tauros-Paldea-Combat": {
    "outdated": true,
    "sets": {
      "Bulk Up": {
        "description": "<p>Paldean Tauros is a terrific Bulk Up sweeper with its great Speed and wide offensive movepool. After using Trailblaze, Paldean Tauros outspeeds Choice Scarf users like Passimian and Rotom. Stone Edge is great coverage for common Fighting-resistant foes like Haunter, Scyther, and Drifblim, while Tera Electric lets Paldean Tauros hit the aforementioned Flying-types and Vaporeon with Tera Blast and offers an immunity to paralysis. Tera Rock Stone Edge and Tera Electric Tera Blast both allow Paldean Tauros to OHKO Drifblim. Leftovers aids its general longevity, while Lum Berry allows it to set up safely once against status users like Rotom and Drifblim. Offensive Pokemon like Choice Scarf Rotom and Zoroark appreciate Paldean Tauros forcing out foes like Umbreon and Chansey; in return, they can check Ghost-types like opposing Rotom and Drifblim. Defensive teammates like Vaporeon and Chansey can sponge special attacks and either help its longevity with Wish or its offensive capabilities with Thunder Wave.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Tauros-Paldea-Blaze": {"sets": {"Bulk Up": {}, "Choice Item": {}}},
  "Tauros-Paldea-Aqua": {"sets": {"Bulk Up": {}, "Choice Item": {}}},
  "Vaporeon": {"sets": {"Defensive": {}}},
  "Jolteon": {
    "sets": {
      "Calm Mind Sweeper": {
        "description": "<p>The fastest Pokemon available in the tier, Jolteon is an amazing setup sweeper thanks to Calm Mind and its great coverage found through Terastallization. Volt Switch whittles down special walls like Copperajah and Goodra while safely bringing in a teammate better suited to taking them on such as Paldean Tauros-F or Bronzong. Tera Blast Fairy hits Goodra hard and makes Jolteon more resistant to Choice Scarf Fighting-types like Heracross and Passimian. Alternatively, Tera Blast Ice gives Jolteon a move to hit Ground- and Grass-types like Gligar, Sandaconda, and Arboliva super effectively.</p> <p>Jolteon is quite frail, making it vulnerable to revenge killing from Choice Scarf users like Passimian, Bruxish, and Heracross. Physical walls like Gligar and Altaria help check them while also supplying Jolteon's team with utility like entry hazards and Defog. Jolteon also needs help with special walls like Copperajah, Goodra, and Bronzong, which require chip damage to be defeated. Use wallbreakers like Shaymin and Tatsugiri to weaken such foes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 399621, "username": "Wadley"}, {"user_id": 336073, "username": "Rabia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Articuno": {
    "outdated": true,
    "sets": {
      "Special Wall": {
        "description": "<p>Articuno solidifies itself as a top tier special wall in NU, thanks to its ability to take on scary wallbreakers such as Abomasnow, Clawitzer, and Appletun that can tear through slower teams. Haze helps stop setup sweepers like Farigiraf, Mesprit, and Lilligant, but Hurricane can be used to hit Pokemon like Appletun, Abomasnow, and Cryogonal harder while also helping against Fighting-types such as Hiusian Sneasel and Toxicroak in a pinch. U-turn lets Articuno pivot on incoming Ice-resistant foes like Magneton and Cryogonal while also generating momentum for offensive teammates on the switches Articuno can force against the bevy of Grass-, Water-, and Fighting-types in the tier. The given EV spread allows Articuno to outspeed maximum Speed Cacturne and Ursaring while maintaining as much special bulk as possible. Tera Ground gifts an Electric-type immunity, letting Articuno easily handle Rotom and Eelektross, and it gets a Stealth Rock resistance, which helps Articuno if it gets hit by a Knock Off; Tera Steel helps against setup sweepers such as Mesprit, Lilligant, and Farigiraf so that Articuno can use Haze without fear of being OHKOed; and Tera Fairy can be used to take care of Fighting-types which overwhelm it otherwise with their powerful STAB moves.</p> <p>Articuno easily falters in the face of physical wallbreakers like Mabosstiff, Medicham, and Tauros, so Pokemon like Sandaconda, Sableye, and Mesprit to check them pair well with Articuno as they love a partner to tank special attacks. Electric-types like Magneton, Eelektross, and Rotom tend to overpower Articuno; therefore, partners like Appletun, Lurantis, and Eelektross pair well alongside it. Item displacement from Knock Off or Trick is very detrimental for Articuno’s longevity. To combat this, Knock Off absorbers like Sandaconda and Sticky Hold Muk work well to help it. Entry hazard support from Hattrem, Drifblim, and Lurantis also helps Articuno if it happens to lose its item. Wallbreakers such as Samurott, Bruxish, and Pyroar work well alongside Articuno, as it can take care of their checks like Cacturne, Appletun, and Qwilfish. Because Articuno beats Ground- and Grass-types, Electric-types pair well as partners, as they can create a VoltTurn core and whittle down each other’s checks.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 475288, "username": "Tranquility"}]}]}
  },
  "Articuno-Galar": {"sets": {"Stored Power Sweeper": {}, "Future Sight Pivot": {}}},
  "Mew": {
    "overview": "<p>Mew is the most versatile offensive threat NU has to offer. It can function in any capacity, from wallbreaker to sweeper, and does so at the highest degree possible. This is in large part thanks to its movepool; it has incredible coverage, almost every setup option possible, and very balanced stats that lend it to different archetypes. Because Mew can be any of a physical, special, or bulky setup sweeper, its checks are somewhat inconsistent because there's not a ton of overlap between the sets. Mew's biggest issue, though, comes as a result of its equal stat distribution: its power is at times lacking even after a boost, which makes beating checks like Alolan Muk, Krookodile, Registeel, and Assault Vest Reuniclus very context dependent. Also, despite its bulk being quite solid, Mew's quite reliant on Terastallizing to avoid being revenge killed by checks like First Impression Flygon, Choice Scarf Krookodile, and Brute Bonnet.</p>",
    "comments": "<h3>Other Options</h3> <p>Swords Dance alongside Scale Shot and Loaded Dice gives Mew a nice blend of early- and mid-game wallbreaking and late-game sweeping, although it is quite susceptible to status ailments. Mew can run a utility set with Spikes, Knock Off, and U-turn that's quite good at wearing down Dark- and Steel-types like Alolan Muk, Incineroar, Registeel, and Copperajah long term. Its typing isn't particularly amazing, though, for such a set, and its longevity is even worse. Mew's also capable of a different lead set that focuses entirely on getting as many entry hazards as possible; Stealth Rock / Spikes / Taunt / Misty Explosion is reliable at preventing any hazard remover from getting rid of Mew's Stealth Rock. Flamethrower on specially offensive sets gives stronger coverage for Brute Bonnet and targets the rare Bronzong, but it's otherwise outclassed by Earth Power.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: Incineroar is the best all-around check to Mew, as it's not OHKOed by any set and has a strong Knock Off to threaten Mew with; getting hit by Meteor Beam on the switch isn't good, though. Alolan Muk is similarly potent at handling special boosting sets, although it must be wary of physical lure variants and even specially offensive sets boosting as it switches in. Assault Vest Brute Bonnet is hard for Mew to get by without Terastallizing and easily beats it one-on-one, but Leech Life easily KOes it. Choice Scarf Krookodile is a good revenge killer to offensive Mew variants but cannot beat defensive Mew if it's used Iron Defense.</p> <p><strong>Steel-types</strong>: Whirlwind Copperajah is fairly good at preventing Mew from running down its team, but boosted offensive Mew can consistently OHKO it with entry hazard support. Registeel is harder to immediately take down and commonly carries Thunder Wave to neuter Mew, but it cannot threaten meaningful damage back, and if needed, Mew can Terastallize into a Ground-type to block Thunder Wave. Klefki is a weird midground that cannot tank Mew's hits but potentially can cripple any offensive variant with Switcheroo + Toxic Orb.</p> <p><strong>Certain Special Walls</strong>: Although the rarer physical Mew can get by special walls, Pokemon like Reuniclus, Assault Vest + Tera Steel Gallade, Haze Milotic, and Clear Smog Gastrodon can inhibit Mew to varying degrees of success.</p>",
    "sets": {
      "Nasty Plot": {
        "description": "<h4>Set Details</h4> <p>Nasty Plot Mew is a great wallbreaker with some late-game potential thanks to its great coverage, decent longevity, and solid bulk. Mew's fantastic at drawing in and weakening foes like Alolan Muk, Registeel, and Incineroar with boosted Earth Power. Tera Fairy is necessary to make Draining Kiss a reliable source of damage, but it also complicates things for Dark-types aiming to beat Mew one-on-one or revenge kill it.</p> <p>Mew forces immediate defensive response in the form of Steel- and Dark-types like Copperajah, Registeel, and Alolan Muk. Its boosted coverage severely dents them, so you should pair it with teammates like Calm Mind Sylveon, Thundurus, and Noivern that want them gone. Physical pivots like Flygon, Mienshao, and Talonflame are also great teammates, as they position Mew against foes it can easily set up on. On hyper offense teams, Mew can be paired with several other setup sweepers like Torterra, Cloyster, and Lycanroc-D that appreciate Mew's set variance and ability to take down physical walls for them. If you want to use Mew more like a sweeper, then you should use Pokemon like Dragalge, Chandelure, and Toxtricity that weaken its checks.</p>"
      },
      "Lead": {"description": "<h4>Set Details</h4> <p>Mew's strength as a hyper offense lead is it beats essentially every entry hazard remover NU has to offer. Talonflame and Noivern get popped by Meteor Beam, Avalugg simply loses one-on-one very badly, and Tsareena is inconsistent in the matchup at best because of how strong Mew is. Otherwise, Mew remains a pretty capable wallbreaker after using Meteor Beam, especially with Tera Ground guaranteeing 2HKOs on switch-ins like Alolan Muk, Registeel, and Incineroar. Tera Ghost can be considered to spinblock, but it's usually unnecessary.</p> <p>This Mew is only used on hyper offense teams to quickly set Stealth Rock and then wallbreak for its team. Pokemon like Shift Gear Toxtricity and Power Herb Diancie appreciate Mew weakening their checks, whereas physical attackers like Bulk Up Krookodile, Lycanroc-D, and Lucario benefit from Mew drawing in special walls that they can easily take on.</p>"},
      "Bulky Setup": {
        "description": "<h4>Set Details</h4> <p>Mew's unique in that it's the only bulky setup sweeper in NU capable of effectively using both Body Press and Stored Power on the same set. Its combination of Iron Defense and Calm Mind makes it almost impossible to take down with direct attacks and makes it insanely strong if it's given enough turns to accrue boosts. You can drop Body Press for Draining Kiss to give Mew extra longevity and a better Slowbro matchup, although this makes Mew almost deadweight against Steel-types unless Mew can boost uninhibited several times and severely dampens its early- and mid-game usefulness. Tera Steel is great for the Toxic immunity it provides and is preferred to Tera Poison because it's better against other bulky setup sweepers like Reuniclus and Slowbro. If you opt for Draining Kiss, then Tera Fairy is recommended to boost its damage output, and it makes Mew immune to Rhyperior's and Dragalge's Dragon Tail.</p> <p>Mew requires a lot of setup before it can successfully sweep. Pairing it with wallbreakers like Mienshao, Krookodile, and Flygon that apply pressure to bulky Psychic-types such as Slowbro and Reuniclus is crucial. Inconveniently, Mew is a pretty awful switch-in to Fighting-type Pokemon because it lacks the longevity needed to keep up with their strong STAB attacks and super effective coverage, and NU's best Fighting-types have Knock Off to neuter this set's long-term potency. So, it's helpful to bring another Fighting-type check like Vileplume, Talonflame, or Dragalge. Mew takes many turns to set up and get going, so you'll have to play the long game with it. This makes entry hazards from teammates like Klefki, Registeel, and Rhyperior a practical way to come out on top.</p>"
      },
      "Dragon Dance": {
        "description": "<h4>Set Details</h4> <p>Physical Mew's biggest appeal is as a lure; checks to its specially offensive sets like Alolan Muk and Brute Bonnet get obliterated by its boosted coverage for them. Earthquake and Close Combat both target Steel-types as well as Incineroar, but the former gives you super effective coverage for Alolan Muk. Leech Life targets opposing Psychic-types like Slowbro and Reuniclus and retains coverage for Brute Bonnet when you opt for Earthquake over Close Combat, but Knock Off still hits Psychic-types hard and gives Mew more presence early- and mid-game. Lum Berry prevents status from checks like Slowbro, Terastallized Vileplume, and Talonflame from ruining your sweep, whereas Life Orb is a huge power boost that makes overwhelming these Pokemon easier. Tera Ground provides a great boost to Earthquake's damage, helping beat Steel-types and Incineroar, and makes Mew immune to paralysis attempts from Thundurus and Slowbro. Alternatively, Tera Dark gives Mew useful resistances to Chandelure's Shadow Ball and Krookodile's Knock Off while boosting Mew's Knock Off.</p> <p>The main appeal to this set is surprise factor: special walls like Alolan Muk, Registeel, and Assault Vest Reuniclus may try and check Mew thinking it's a special attacker. This makes Mew adept at both getting free setup on forced switches and turns to fire off boosted attacks afterwards. Teammates that benefit from Mew beating these special walls, like Thundurus, Raikou, and offensive Diancie, are good to have. Mew is a rare offensive setup option that beats most Slowbro with ease; Pokemon like Choice Scarf Mienshao, Lycanroc-D, and Infernape are great beneficiaries of its support.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 336073, "username": "Rabia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 126266, "username": "Kiyo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Typhlosion": {"sets": {"Choice Item": {}}},
  "Typhlosion-Hisui": {"sets": {"Status Spreader": {}, "Choice Item": {}}},
  "Feraligatr": {"sets": {"Dragon Dance": {}}},
  "Quagsire": {"sets": {"Defensive": {}}},
  "Espeon": {"sets": {"Choice Specs": {}, "Sun Support": {}}},
  "Umbreon": {"sets": {"Utility": {}}},
  "Gligar": {"sets": {"Physical Wall": {}}},
  "Qwilfish": {
    "sets": {
      "Physical Wall": {
        "description": "<p>Qwilfish is a premier physical wall in the tier owing to its great defensive typing and abilities, as well as a bevy of amazing utility moves including the highly coveted Spikes and Toxic. Qwilfish can wear down the opposition with its combination of Spikes and Toxic and even prevent Defog and recovery moves with Taunt. Waterfall is used over Liquidation to potentially cause flinching, which works wonders in conjunction with Toxic, although Surf can be used for a 2HKO on Sandaconda and more damage on other physically bulky Pokemon like Drifblim and Klawf. Despite Intimidate being such a high-value ability, Qwilfish typically prefers Poison Point to punish U-turn from the likes of Passimian and Scyther while not activating Passimian's Defiant in the process. Protect can be used with Leftovers for some extra recovery and also to scout moves from Choice item users like Rotom, Bruxish, and Zoroark. Upon scouting these Pokemon, Qwilfish can invert its weakness to Electric- or Psychic-type moves with a timely Terastallization to a respective Ground or Dark typing, letting it spread more poison and set more Spikes. Umbreon is a great defensive partner, sponging general special attacks while boasting an immunity to Psychic. In return, Qwilfish heavily punishes Fighting-type attacks and U-turn, while also resisting Fairy. Phasers like Dragon Tail Dudunsparce and Eelektross make great use of the Spikes Qwilfish sets up, racking up damage for a faster Pokemon to more easily sweep. Choice Scarf Passimian takes advantage of hazard damage while also punishing Defog with its Defiant ability.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400664, "username": "Stories"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Qwilfish-Hisui": {
    "sets": {
      "Defensive": {
        "description": "<p>With access to a deep utility movepool, great defensive abilities, and Eviolite, Hisuian Qwilfish can take on many offensive threats. Intimidate is useful to weaken physical attackers, allowing it to tank strong neutral attacks from the likes of Ursaring and Tauros. Hisuian Qwilfish can also make use of Poison Point to punish contact moves, even generally commitment-free moves like Scyther's and Mesprit's U-turn. Barb Barrage is preferred over stronger options like Poison Jab and Gunk Shot thanks to its high chance to poison, as well as dealing double damage to a poisoned target. Taunt dismantles setup sweepers such as Eelektross while also preventing Defog. Haze is an option over Taunt to prevent setup sweepers like Tera Steel Mesprit and Eelektross from exploiting Hisuian Qwilfish's passivity. Toxic can also be run over Taunt to take advantage of Defog users removing your Spikes and cripple opposing walls like Appletun, Articuno, and Eelektross. Crunch is an extra STAB option that beats Ghost- and Psychic-types like Froslass, Rotom, and Bruxish. Alternatively, Crunch punishes teams that have no grounded Poison-type or entry hazard control. Tera Grass enables Hisuian Qwilfish to set more Spikes against Sandaconda and gives Hisuian Qwilfish a resistance to Volt Switch, allowing it to more easily beat Rotom and Eelektross. Alternatively, Tera Ghost lets it spinblock Cryogonal and Avalugg. 56 Speed EVs allow Hisuian Qwilfish to outspeed maximum Speed Cacturne as well as neutral-nature Abomasnow and Farigiraf; Jolly allows Hisuian Qwilfish to always outspeed the latter two.</p> <p>Wallbreakers like Tauros and Mesprit benefit from Spikes weakening checks like Sandaconda and Hisuian Qwilfish that are somewhat easy to put in 2HKO range. To maximize the effect of Spikes and keep them up as long as possible, Hisuian Qwilfish appreciates help from Rotom, Cryogonal, and Articuno, which all put pressure onto Defog users like Braviary and Lurantis. Without Terastallizing, Hisuian Qwilfish folds to Sandaconda and other strong physical attackers that can switch into it like Toxicroak, Hisuian Sneasel, and both Tauros formes. To help solve this issue, Pokemon such as your own Sandaconda, Hattrem, and Drifblim can pivot into their attacks and threaten them with paralysis or burn. Hisuian Qwilfish is hindered by losing its Eviolite via Knock Off or Trick; pair it with Pokemon that can afford to lose their item such as Sandaconda, Sableye, and Sticky Hold Muk.</p>"
      },
      "Swords Dance": {
        "description": "<p>Hisuian Qwilfish is a potent rain sweeper. It has neutral coverage for every foe in NU bar Toxicroak and outspeeds every relevant revenge killer under rain. Even outside of rain, it's still a good option for late-game sweeping because its coverage and Eviolite-boosted bulk give it good leverage against most countermeasures the opponent could have. The major selling point to this set is Liquidation, as it always OHKOes Sandaconda after Hisuian Qwilfish uses Swords Dance and Terastallizes.</p> <p>If you're using Hisuian Qwilfish on a rain team, pairing it with rain setters like Sableye, Electrode, and Whiscash is a must. Additionally, you'll want Floatzel, which is great at weakening potential checks like Tera Water Sandaconda, Qwilfish, and Avalugg. Golduck is also a staple of NU rain teams and benefits from Hisuian Qwilfish weakening Toxicroak. If you're not using a rain team, simply pair Hisuian Qwilfish with wallbreakers like Medicham, Hisuian Sneasel, and Bruxish. Spikes support from options like Froslass and Cacturne helps too to weaken checks like Terastallized Sandaconda and Toxicroak.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 189361, "username": "Lucario"}, {"user_id": 336073, "username": "Rabia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Heracross": {"sets": {"Wallbreaker": {}, "Choice Scarf": {}}},
  "Sneasel": {"sets": {"Swords Dance": {}}},
  "Sneasel-Hisui": {
    "outdated": true,
    "sets": {
      "Choice Item": {
        "description": "<p>Hisuian Sneasel is one of NU's premier revenge killers, regardless of the item it holds. Choice Scarf sets are wonderful because they reliably beat Calm Mind Jolteon, a feat most other Choice Scarf users fail to do because they're specially offensive. On the flipside, Choice Band sets retain great revenge killing potential because Hisuian Sneasel is so naturally fast, and they're very effective wallbreakers to boot thanks to their solid coverage. For the Pokemon Hisuian Sneasel can't consistently defeat like Tera Ghost Sandaconda, Qwilfish, and Sableye, Switcheroo provides a good means of limiting their defensive capabilities. Picking its Tera type is fairly arbitrary, though Tera Fighting lets Choice Band Hisuian Sneasel 2HKO Sandaconda with Close Combat and Choice Scarf Hisuian Sneasel 2HKO Toxicroak after Stealth Rock; alternatively, Tera Dark provides defensive utility against Mesprit, ensures Night Slash OHKOes Rotom after Stealth Rock, and denies Sableye's Prankster Will-O-Wisp.</p> <p>Despite Choice Scarf and Choice Band Hisuian Sneasel being somewhat different in function, their teammates are pretty similar. Both benefit from teammates like Clawitzer, Rotom, and Mesprit that can take advantage of Sandaconda so they feel less inclined to Terastallize and deal with it themselves. Where they differ is that Choice Scarf Sneasel is far more suited as a late-game cleaner and, as a result, is more reliant on wallbreakers like Guts Ursaring, Magneton, and offensive Appletun to weaken its checks. On the other hand, Choice Band Sneasel prioritizes its role as a wallbreaker and supports late-game sweepers like Dudunsparce and Trailblaze Scyther.</p>"
      },
      "Swords Dance": {
        "description": "<p>Hisuian Sneasel is one of NU's most dangerous setup sweepers; with Swords Dance and Trailblaze, very little can stop it if it obtains both boosts. Even some of its sturdiest checks in Sandaconda, Qwilfish, and Tera Poison Appletun can struggle to keep up, and offensive answers like Choice Scarf Mesprit and Rotom become unreliable because they're slower after a single Trailblaze. Tera Grass is fantastic for turning non-Glare Sandaconda into setup fodder and giving Trailblaze the extra power needed to beat Rotom, but Tera Dark enables Hisuian Sneasel to run Night Slash, giving it a better matchup against Ghost-types in Eviolite Haunter, Drifblim, Sableye, and Terastallized Sandaconda while also making it harder for Choice Scarf Mesprit to revenge kill it.</p> <p>Hisuian Sneasel's Eviolite-boosted bulk, although not stellar, is enough to let it set up on resisted attacks. So, pairing it with pivots like Bombirdier, Rotom, and Braviary that can bring it in against foes like non-Thunder Wave Qwilfish, Muk, and non-Glare Sandaconda if you're using Tera Grass is recommended. Keep in mind, though, that the Sandaconda matchup can be difficult with Terastallization available to your opponent; teammates like Tera Ice Jolteon, Swords Dance Scyther, and Guts Ursaring that can force it to take damage or Terastallize early-game make it far less threatening.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 336073, "username": "Rabia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Ursaring": {
    "outdated": true,
    "overview": "<p>Ursaring is an amazing wallbreaker in NU. Eviolite + Bulk Up Ursaring makes for a fantastic sweeper, while Flame Orb sets make great use of Trailblaze, which makes Ursaring more difficult to revenge kill, and makes for a great status absorber for its teammates. However, Bulk Up Ursaring only has room for one attack, leaving it lacking in coverage, and Flame Orb Ursaring's poor defenses and Speed leave it subject to easy revenge killing.</p>",
    "comments": "<h4>Other Options</h4> <p>Ursaring can use Toxic Orb to benefit from Quick Feet, but this set often falls short in both Speed and power. Bulk Up Ursaring can forgo Sleep Talk in favor of another coverage move, but this leaves it quite vulnerable after Rest. Crunch can be used over Play Rough for overall better coverage, but Tera Fairy's defensive attributes and STAB Play Rough are better in most situations. Ursaring can drop a setup move altogether on the RestTalk set, making for a great special tank with a little extra coverage, typically using Body Slam for STAB and Play Rough or Crunch to hit Ghost-types.</p> <h4>Checks and Counters</h4> <p><strong>Anti-setup Pokemon</strong>: Bulk Up Ursaring is quite hard to get going against common anti-setup Pokemon like Haze Vaporeon, Strength Sap Drifblim, and Trick Rotom. Tera Fairy at least allows Ursaring an immunity to Dragon Tail, but there are plenty of Encore, Haze, and similar utility move users available that can make it difficult for Ursaring to sweep.</p> <p><strong>Fighting-types and Coverage</strong>: NU is teeming with Fighting-types ready to punch Ursaring in the face; Medicham, Toxicroak, Passimian, and Paldean Tauros pressure Ursaring to switch out or Terastallize for fear of being KOed. Pokemon with Fighting-type coverage like Scyther and Eelektross can chunk Ursaring enough to force it to use Rest before it can accumulate enough boosts to be a threat.</p>",
    "sets": {
      "Bulk Up": {
        "description": "<h5>Set Details</h5> <p>Ursaring only gets to pick one offensive move, so Play Rough is preferred for its great offensive coverage and lack of immunities, but Body Slam has more immediate damage and can spread paralysis. With Tera Fairy, Ursaring inverts its weakness to Fighting and gains STAB on Play Rough. Tera Ghost takes subverting its weakness to the extreme, turning the tables on the many Fighting-types in the tier. 88 Speed EVs outspeed Vaporeon and Umbreon, which hamper Ursaring with Haze or Foul Play. The remaining EVs are put into Special Defense to allow Ursaring to wall special attackers while boosting Defense with Bulk Up.</p> <p>Although its bulk often prevents it from being outright overpowered, Ursaring's setup attempts can be thwarted by utility Pokemon such as Haze Muk and Vaporeon and Encore Cacturne and Zoroark. Wallbreakers like Medicham and Zoroark and entry hazard setters like Qwilfish and Sandaconda assist in breaking through and wearing them down. Knock Off users like Bombirdier, Klawf, and Passimian can leave Eviolite Ursaring vulnerable to following attacks. Knock Off absorbers like Sandaconda and Umbreon make for great teammates. Because it lacks Heavy-Duty Boots or Leftovers to offset hazard damage, Ursaring appreciates hazard control from the likes of Drifblim and Lurantis. Pokemon vulnerable to status infliction like Toxicroak and Vaporeon appreciate the fact that Ursaring punishes the use of status moves like Will-O-Wisp from Drifblim and Glare from Sandaconda.</p>"
      },
      "Trailblaze Sweeper": {
        "description": "<h5>Set Details</h5> <p>Trailblaze lets Ursaring take advantage of passive Pokemon like Chansey and Vaporeon to outspeed faster threats like Scyther and Zoroark after one use and Choice Scarf Passimian after two. Guts Facade easily 2HKOes physically bulky Pokemon like Sandaconda and Dudunsparce. Tera Ghost allows Ursaring to effectively bait Fighting-type moves and boosts Shadow Claw, which can be used to hit Ghost-types like Drifblim and Rotom. Swords Dance allows Ursaring to muscle past setup sweepers like Coil Sandaconda, Eelektross, and Curse Muk while also giving Facade enough power to defeat Steel-types like Perrserker and Tera Steel Eelektross. Alternatively, Close Combat immediately threatens Steel-types like Perrserker and Tera Steel users like Appletun and Eelektross. Tera Fighting and Tera Grass are alternative options used to boost Ursaring's other moves. Tera Grass notably improves Ursaring's matchup against physically bulky Pokemon like Sandaconda and Vaporeon.</p> <p>Slow pivots like Eelektross and Perrserker help Ursaring enter the battlefield safely, mitigating its frailty and burn-induced timer. Healing Wish from Chansey or Indeedee-F can allow Ursaring another opportunity to shred through the opposition. Oricorio-F and Drifblim can ease the matchup against Fighting-types and use Defog to ensure Ursaring takes minimal damage when hitting the field, and Oricorio-F also has U-turn to bring in Ursaring more often.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400664, "username": "Stories"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 509790, "username": "Pokeslice"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Kingdra": {"sets": {"Rain Sweeper": {}}},
  "Smeargle": {"sets": {"Lead": {}}},
  "Hitmontop": {"sets": {"Rapid Spin": {}}},
  "Raikou": {"sets": {"Calm Mind": {}}},
  "Swampert": {"sets": {"Defensive": {}}},
  "Ludicolo": {"sets": {"Rain Dance Sweeper": {}}},
  "Hariyama": {"sets": {"Belly Drum": {}, "Assault Vest": {}, "Guts Wallbreaker": {}, "Bulk Up": {}}},
  "Sableye": {
    "sets": {
      "Prankster Wall": {
        "description": "<p>Sableye stands out as a good physical wall in the tier thanks to its amazing ability in Prankster and defensive typing, giving it great matchups into the tier's Fighting-, Normal-, and Psychic-type attackers like Hisuian Sneasel, Medicham, Tauros, Paldean Tauros, and Bruxish, immediately threatening them with a burn from Will-O-Wisp. Sableye also blanket checks many setup sweepers in the tier as well, such as Dudunsparce, Ursaring, Coil Sandaconda, and Coil Eelektross, with Encore. Knock Off allows Sableye to punish Pokemon that may rely on their items for their bulk or longevity on a switch such as Hisuian Qwilfish, Eelektross, Ursaring, and Bombirdier. Foul Play is a reliable source of damage against physical setup sweepers, such as Scyther and Bruxish, over options such as Knock Off or Will-O-Wisp. Tera Poison gives Sableye an immunity to Toxic and a resistance to Fairy while retaining its positive matchup into Fighting-types. Tera Steel has a similar function but instead retains Sableye's favorable matchup into Psychic-types while giving it some additional resistances to common attacking types such as Ice from Pokemon like Abomasnow. Tera Dark is notable for letting Sableye OHKO Pokemon such as Rotom and Bruxish with Knock Off while providing Sableye with a Ghost resistance.</p> <p>Sableye struggles with the tier's myriad of Dark-types such as Cacturne and Bombirdier, which all ignore Prankster, while Tera Dark users such as Toxicroak, Hisuian Sneasel, and Bruxish can also Terastallize to completely ignore Sableye and use it as setup fodder. To help alleviate this issue, Pokemon like Hisuian Qwilfish, Carbink, Articuno, and Appletun can all help answer these threats. In addition, Sableye is fairly passive in nature with horrible special bulk, which means it can invite special wallbreakers such as Clawitzer and Glaceon. Pairing Sableye with special walls such as Blissey, Eelektross, and Muk can help make up for these faults.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595639, "username": "plznostep"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Medicham": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Medicham is a solid revenge killer and late-game cleaner. Pure Power gives Medicham an edge over Passimian, one of its main sources of competition, by allowing its Close Combat to 2HKO bulky foes like Vaporeon before Terastallization. Zen Headbutt's Base Power is good against foes like Tera Fairy Chansey, but Psycho Cut is an alternative that doesn't make contact, which helps against Rocky Helmet users, Drifblim, and Poison Point Qwilfish. Thunder Punch and Ice Punch hit Bruxish and Sandaconda respectively, and Flying-types like Drifblim and Oricorio-F. Trick punishes defensive switch-ins like Sandaconda and is especially beneficial to use against bulky teams, since they are generally slower than Medicham anyway. Tera Fighting enhances Medicham's wallbreaking and cleaning potential by powering up Close Combat, and it lets Medicham resist Toxicroak and Bombirdier's Sucker Punch. Partners that commonly run Choice Scarf, such as Zoroark and Rotom, can revenge kill foes instead of Medicham early-on, keeping its set a mystery. Zoroark can also use Illusion to lure in and eliminate Ghost-types, which reduces how many predictions Medicham needs to make, while Rotom checks Flying-types and blanks Sandaconda and Choice Scarf Toxicroak.</p>"
      },
      "Wallbreaker": {
        "description": "<p>Medicham's damage output is unrivaled thanks to Pure Power in tandem with Life Orb or a Choice Band. Zen Headbutt is a powerful STAB option that hits Poison-types like Qwilfish and Muk, as they can easily take a Close Combat. Psycho Cut is a weaker alternative that avoids contact effects like Poison Point and Rocky Helmet from the likes of Qwilfish and Sandaconda. Trailblaze allows Medicham to pull off sweeps and patch up its offensive shortcoming in its middling Speed. Trick is used with Choice Band to cripple walls such as Drifblim and Tera Fairy users like Chansey and Umbreon. Ice Punch is great neutral coverage for walls like Drifblim and Sandaconda. Tera Fighting gives Choice Band sets a favorable roll to KO Sandaconda after minimal chip or a single layer of Spikes. Tera Steel allows Medicham to defensively check fast revenge killers like Scyther and Zangoose on top of boosting Bullet Punch's damage output. Medicham struggles against bulky Ghost-types like Drifblim and Rotom, which makes Zoroark, Choice Scarf Rotom, and Haunter great offensive partners. Special sweepers like Dudunsparce, Oricorio, and Jolteon appreciate Medicham's ability to break past Chansey, Umbreon, and Vaporeon. Medicham also enjoys pivots like Scyther, Rotom, and Eelektross; it especially likes the latter two, which threaten out Sandaconda, Qwilfish, and Drifblim.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 189361, "username": "Lucario"}, {"user_id": 400292, "username": "asa"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Camerupt": {"sets": {"Defensive Utility": {"description": "<p>Fire Spin and Grass Tera Blast can effectively lure otherwise undesirable matchups like Sandaconda and Vaporeon. 88 Speed allows Camerupt to outspeed the likes of Muk, Crocalor, and Perrserker</p>"}}},
  "Flygon": {
    "overview": "<p>Flygon's great set versatility makes it an elite Pokemon and one of the best Ground-types in NU. Choice Scarf Flygon fits on many teams, outspeeding and limiting many wallbreakers such as non-Choice Scarf Mienshao and Lycanroc-D. Choice Band gives Flygon an incredibly spammable Earthquake and makes it a lot harder to switch into. Flygon can also pivot out with U-turn, allowing it to maintain offensive pressure and momentum. Dragon Dance Flygon can use Loaded Dice, which makes it a great late-game sweeper, and it also threatens lead entry hazard setters like Lycanroc-D, Galvantula, and Smeargle; it also resists Lycanroc-D's Accelerock, so it's hard to revenge kill. However, as a Choice Scarf user, it faces competition from Mienshao and Infernape, both of which are faster than it and can revenge kill it with Close Combat. Additionally, Flygon's average Attack stat leaves it struggling when facing physical walls like Slowbro, Vileplume, and Avalugg, as they can still take its attacks even after a Dragon Dance boost. Choice Scarf Flygon can be very easy to play around due to both of its STAB options having common immunities and resistances.</p>",
    "comments": "<h3>Other Options</h3> <p>Flygon can run a mixed set with Draco Meteor and Fire Blast, allowing it to hit physically defensive Pokemon like Avalugg, Slowbro, and Vileplume. It can also run a Choice Specs set with Tera Normal, which gives it a powerful Boomburst. However, both of these sets are not common due to Flygon's low Special Attack. Flygon can also run a utility set with Stealth Rock / Earthquake / Dragon Tail / U-turn with a bulkier EV spread. This set allows it to set entry hazards for its teammates and check foes like Copperajah, Lycanroc-D, and Infernape. Sadly, Flygon lacks any recovery, making it very easy for it to get worn down by chip damage.</p> <h3>Checks and Counters</h3> <p><strong>Fairy-types</strong>: Sylveon and Florges are able to tank hits from Choice Scarf Flygon and KO it back with their STAB Fairy-type attacks; however, neither of them can handle Choice Band sets, and they are complete setup fodder against Tera Steel Dragon Dance Flygon.</p> <p><strong>Physically Defensive Pokemon</strong>: Physically defensive Pokemon such as Avalugg, Slowbro, and Vileplume have enough bulk to win against any of Flygon's sets, but Vileplume has to be careful directly switching into +1 Flygon if entry hazards are present. Bulky Water-types like Vaporeon, Swampert, and Quagsire are bulky enough to tank a boosted attack and threaten Flygon back with status and Knock Off.</p> <p><strong>Priority Users and Faster Attackers</strong>: Infernape, Lucario, Brute Bonnet, and Feraligatr can revenge kill Flygon after it has been weakened a bit. Choice Scarf users like Mienshao and Infernape can outspeed even Choice Scarf Flygon and destroy it with Close Combat.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<h4>Set Details</h4> <p>Outrage is one of Flygon's strongest STAB attacks for late-game cleaning, and it can 2HKO foes like Tsareena and Mew on a switch. Dragon Claw is a safer option to avoid getting locked into Outrage, but it's significantly weaker and is harder to revenge kill foes with. U-turn allows Flygon to maintain momentum and provide free switches to teammates. Flygon's last move is commonly Stone Edge, which allows it to hit Flying-types like Talonflame, Noivern, and Thundurus. Alternatively, Stealth Rock allows it to set entry hazards for its teammates. Flygon can run Dragon Claw alongside Outrage so that it can still revenge kill foes like Thundurus and Tsareena without getting immediately destroyed by Fairy-types. First Impression can be used over Stone Edge, allowing Flygon to revenge kill weakened boosted and faster threats like Cloyster and Choice Scarf Munkidori. Tera Steel gives Flygon a resistance to Fairy- and Dragon-type attacks from Pokemon like Sylveon, Florges, and Noivern. This also allows it to check some special wallbreakers like Mew, Dragalge, and Porygon-Z.</p> <p>Wallbreakers like Magnezone, Mienshao, and Lycanroc-D appreciate Choice Scarf Flygon for giving them free entry with U-turn. Flygon can form a VoltTurn core with special attackers like Magnezone, Thundurus, and Toxtricity. They can threaten physical walls like Slowbro, Avalugg, and Vileplume; in return, Flygon can pressure special walls like Alolan Muk and Assault Vest Gallade. Choice Scarf Flygon struggles to break past bulky Water-types like Slowbro, Swampert, and Quagsire, which tank its attacks and punish it with Scald, Toxic, Knock Off, and slow Flip Turn. Grass-types like Brambleghast, Brute Bonnet, and Vileplume similarly appreciate Flygon's U-turn giving them free entry to handle the aforementioned bulky Water-types. Steel-types like Copperajah, Registeel, and Magnezone appreciate Flygon for checking Fire-types like Chandelure, Infernape, and Incineroar; in return, they can check Fairy-types like Sylveon, Florges, and Tera Fairy Slowbro. Choice Scarf Flygon appreciates entry hazard support from Copperajah, Diancie, and Swampert, as it can wear down foes to help with Choice Scarf Flygon's low damage output.</p>"
      },
      "Choice Band": {
        "description": "<h4>Set Details</h4> <p>Choice Band gives Flygon more immediate power, allowing it to always 2HKO Vileplume and Quagsire after Spikes damage with Earthquake. Outrage is still an option to allow Flygon to 2HKO Calm Mind Reuniclus and Quagsire, but Dragon Claw is preferred so Flygon isn't easily revenge killed by Fairy-types. First Impression revenge kills weakened foes like Porygon-Z, Feraligatr, and Torterra. Tera Bug gives First Impression a power boost, allowing Flygon to KO Mew and do major damage to defensive Reuniclus. Tera Steel can sometimes be preferred over Tera Bug, since it's better defensively and allows Flygon to pivot without getting chipped heavily by Stealth Rock.</p> <p>Choice Band Flygon likes having entry hazard support from teammates like Klefki, Copperajah, and Diancie to wear down foes that can repeatedly switch into it. Many Pokemon that tend to struggle against bulky Water-types like Vaporeon and Milotic, such as Registeel, Infernape, and Basculegion, appreciate Choice Band Flygon's ability to 2HKO them on the switch. However, while it can 2HKO most bulky Water-types, it can't always beat them one-on-one, so it pairs well with Grass-types like Tsareena, Brambleghast, and Vileplume. Physically defensive Pokemon like Avalugg, Reuniclus, and Slowbro can take Flygon's attacks with ease, so it pairs best with Pokemon like Magnezone, Alolan Muk, and Slowbro that can handle these physical walls. Future Sight Slowbro and Reuniclus can be great partners for Choice Band Flygon, allowing it to weaken physical walls like Milotic, Avalugg, and Vileplume.</p>"
      },
      "Dragon Dance": {
        "description": "<h4>Set Details</h4> <p>Dragon Dance with a Scale Shot boost allows Flygon to outspeed the entire tier, including common Choice Scarf users like Mienshao and Infernape. An Adamant nature is preferred over a Jolly nature for the extra power boost, but the latter is still useful to avoid always being outsped by opposing Choice Scarf Flygon at +1. Outrage can be used over Scale Shot to allow Flygon to be a late-game cleaner. Alternatively, Dragon Claw can be used to avoid getting locked into Outrage, which would otherwise make it easily revenge killed by Fairy-types. Fire Punch allows Flygon to hit Grass-types like Tsareena, Vileplume, and Brute Bonnet as well as opposing Tera Steel Flygon. Thunder Punch is able to hit Water- and Flying-types like Vaporeon, Talonflame, and Milotic; lastly, U-turn allows Flygon to pivot out from a bad matchup, and it's also pretty common to see on non-Scale Shot Dragon Dance Flygon sets. Tera Steel allows it to be immune to Umbreon and Quagsire's Toxic. Tera Fire gives Fire Punch a much-needed power boost and retains the resistance to Fairy-type attacks that Tera Steel gives. Leftovers can be used over Loaded Dice, giving Flygon needed recovery. Alternately, Soft Sand gives it a boost to Earthquake, which allows it to 2HKO Vileplume and Vaporeon after a Dragon Dance.</p> <p>Dragon Dance Flygon appreciates entry hazard support from Klefki and Rhyperior to guarantee a 2HKO on Pokemon like Vileplume and Rhyperior. Toxic Spikes in particular is helpful, since it makes it a lot easier to break through physical walls like Slowbro, Swampert, and Rhyperior that would usually tank many hits from a Dragon Dance boost. Flygon is a perfect pick for hyper offense teams due to its Sticky Web immunity and because it can sweep opposing hyper offense teams. It can also punish lead hazard setters like Galvantula, Smeargle, and Lycanroc-D by setting up a Dragon Dance and breaking their Focus Sashes with Scale Shot. Other sweepers like Lucario, Cloyster, and Lycanroc-D appreciate Dragon Dance Flygon's ability to weaken teams so they can win late-game. Choice Scarf users like Mienshao, Munkidori, and Infernape can force Flygon to switch out even if it's at +1 because they can still outspeed it. Thus, slow pivots like Magnezone, Swampert, and Eject Button Slowbro can help by bringing Flygon in safely.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 609709, "username": "Pika134"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 189361, "username": "Lucario"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Cacturne": {
    "outdated": true,
    "sets": {
      "Offensive Spikes": {
        "description": "<p>Cacturne is an amazing offensive Spiker in NU. Due to its strength and typing, it finds many opportunities to switch in on and threaten tier staples like Sandaconda, Qwilfish, and Drifblim. Cacturne is also good at taking advantage of Water-types like Bruxish and Floatzel thanks to Water Absorb, giving it more chances to set up Spikes and dish out heavy damage. Dark Pulse reliably pressures Defoggers like Drifblim and Lurantis as well as Magic Bounce Hattrem. A Naive nature lets Cacturne outspeed Modest Clawitzer without sacrificing any power. Braviary is an excellent teammate for Cacturne, since it dissuades Defog attempts with Defiant and reliably pressures special walls. In return, Cacturne offers Braviary safety from Bruxish, offensively checks Ghost-types, and can facilitate late-game cleaning with Spikes. Setup sweepers like Hisuian Sneasel and Vivillon become much harder to stop when backed by Spikes and also match up well against Defoggers like Braviary and Lurantis.</p>"
      },
      "Swords Dance Sweeper": {}
    },
    "credits": {"writtenBy": [{"user_id": 400292, "username": "asa"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Altaria": {"sets": {"Utility": {}, "Trapper": {}}},
  "Zangoose": {"sets": {"Swords Dance": {}}},
  "Milotic": {"sets": {"Physical Wall": {}}},
  "Registeel": {"sets": {"Defensive": {}}},
  "Torterra": {"sets": {"Shell Smash": {}}},
  "Infernape": {"sets": {"Choice Scarf": {}, "Choice Band": {}, "Nasty Plot": {}}},
  "Staraptor": {"sets": {"Choice Item": {}}},
  "Vespiquen": {"sets": {"Pivot": {}}},
  "Floatzel": {"sets": {"Rain Wallbreaker": {}}},
  "Gastrodon": {"sets": {"Defensive": {}}},
  "Ambipom": {"sets": {"Wallbreaker": {}}},
  "Drifblim": {
    "sets": {
      "Defog": {
        "description": "<p>Drifblim is one of the best Defoggers in SV NU, with reliable recovery in Strength Sap and a great defensive typing allowing it to check many of the tier's best physical attackers like Toxicroak, Zangoose, and Sandaconda. Hex is a great STAB option to hit Psychic- and Ghost-types such as Bruxish, Medicham, and Rotom, and it has great synergy with Drifblim's status moves. Air Slash allows Drifblim to hit Normal-types and Dark-types neutrally while also potentially wearing down defensive Pokemon like Umbreon and Chansey with a combination of flinches and paralysis. Will-O-Wisp can help discourage physical attackers from switching in, such as Bombirdier and Lycanroc, and is useful to burn dangerous setup sweepers such as Coil Eelektross and Curse Muk. Thunder Wave is another status option, notably improving Drifblim's matchup into Pokemon such as Pyroar and Oricorio. Defog allows Drifblim to keep hazards off the field from Pokemon such as Qwilfish and Sandaconda, and with maximum Defense investment, Drifblim can even take a Defiant-boosted Knock Off from Passimian. Tera Fairy can improve Drifblim's matchup against Dark-types like Mabosstiff and Zoroark while retaining its matchup versus Fighting-types; it can also be useful for getting rid of Drifblim's Stealth Rock weakness if it has lost its Heavy-Duty Boots. However, this makes Drifblim's matchup into Poison-types such as Toxicroak much worse. Tera Ground can block a Volt Switch and allow Drifblim to hit Rotom and Eelektross hard before forcing them to switch out.</p> <p>Drifblim can struggle with powerful special attackers such as Eelektross, Pyroar, and Zoroark, which can switch in thanks to Drifblim's passivity and threaten it. As a result, special walls such as Chansey, Muk, and Umbreon can be great partners. Sticky Hold Muk can also absorb Knock Off for Drifblim from physical attackers such as Passimian.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595639, "username": "plznostep"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}]}
  },
  "Mismagius": {"sets": {"Choice Scarf": {}, "Substitute + Draining Kiss": {}}},
  "Bronzong": {"sets": {"Utility": {}, "IronPress": {}}},
  "Spiritomb": {"sets": {"Calm Mind": {}}},
  "Lucario": {"sets": {"Swords Dance": {}, "Nasty Plot": {}}},
  "Hippopotas": {"sets": {"Sand Setter": {}}},
  "Toxicroak": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Toxicroak stands out as a very potent late-game sweeper thanks to Swords Dance and Dry Skin, which allow it to switch in and set up on common Water-types like Vaporeon and Qwilfish. Its access to Sucker Punch allows it to revenge kill threats like Choice Scarf Medicham, Bruxish, and Rotom, though it has to be aware of the former two's Tera types and the latter's Will-O-Wisp. Tera Dark gives it a useful Psychic immunity to better the odds versus opposing Bruxish while increasing the power of Sucker Punch. Alternatively, Tera Fighting Toxicroak is able to OHKO Sandaconda, which usually checks it, after a Swords Dance. Toxicroak struggles against the aforementioned Drifblim and Rotom and, without Tera Fighting, Sandaconda. Teammates such as Vaporeon, Eelektross, and Rotom can switch in on its checks and bring it into battle safely. Pokemon that appreciate Toxicroak's presence include Oricorio, Clawitzer, and Bruxish, as they struggle against bulky Pokemon that lose to Toxicroak like Vaporeon, Umbreon, and Chansey.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Thanks to its access to Nasty Plot, Toxicroak can threaten Pokemon like Sandaconda and Drifblim that beat physical variations of it. Dark Pulse enables it to get around Pokemon that resist its STAB combination, including Ghost-types like Drifblim, Rotom, and Spiritomb as well as Poison-types like Muk and Qwilfish. Alternatively, Vacuum Wave is a solid STAB move with priority to help it revenge kill faster threats like Zoroark, Lycanroc, and Tera Ice Jolteon. Tera Fighting heavily increases Focus Blast's already high damage output, allowing Toxicroak to rip through bulkier teams. Tera Fighting Toxicroak can run a Modest nature to give it a favorable chance to 2HKO Muk at +2 with Focus Blast; however, it becomes noticeably slower, getting outpaced by Mabosstiff, Bombirdier, and Braviary. Tera Dark Toxicroak better checks Bruxish while also boosting Dark Pulse's power.</p> <p>Without the use of its Tera type, Toxicroak struggles against bulkier teams that often include Muk or Crocalor, so Pokemon that put pressure on them like Sandaconda and Bruxish pair well with it. Bruxish, as well as other Water-types like Clawitzer, appreciate Toxicroak checking bulky Water-types like Vaporeon and Qwilfish. Toxicroak often relies on Spikes from users such as Qwilfish, Vespiquen, and Cacturne to chip away at foes that it can't handle on its own. Since Toxicroak can lure in and remove Ghost-types like Rotom and Drifblim, Pokemon like Scyther and Coil Eelektross appreciate its support.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Toxicroak differentiates itself from other Choice Scarf users, such as Passimian, by virtue of its defensive utility, being immune to Water-type attacks and absorbing Toxic Spikes. It also doesn't Speed tie with other common Choice Scarf attackers, namely Passimian and Medicham. Close Combat and Gunk Shot can sweep through even remotely weakened teams, especially with a Tera-Fighting Close Combat. Gunk Shot hits Fairy-types that resist Close Combat such as Dachsbun, Florges, and Tera Fairy Drifblim. Earthquake threatens Poison-types such as Muk and Qwilifish. Rock Slide hits Pokemon such as Drifblim and Vespiquen, which may otherwise be troublesome for Toxicroak to deal with. Despite its low-Base Power, Ice Punch is a relatively safe midground option that lacks the type immunities Toxicroak's other moves have while hitting common checks like Sandaconda, Drifblim, and Scyther for decent damage.</p> <p>Toxicroak struggles with Pokemon that are not threatened by its STAB combination, such as Rotom, Drifblim, and other physical walls such as Sandaconda. Powerful special attackers like Eelektross, Zoroark, and Pyroar can alleviate this issue.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 189361, "username": "Lucario"}, {"user_id": 595639, "username": "plznostep"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 509790, "username": "Pokeslice"}, {"user_id": 336073, "username": "Rabia"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 493772, "username": "Lumii"}, {"user_id": 336073, "username": "Rabia"}, {"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Abomasnow": {
    "sets": {
      "Special Attacker": {
        "description": "<p>Abomasnow is an amazing bulky wallbreaker thanks to its nearly unresisted STAB moves, coverage, and Aurora Veil alongside Snow boosting its defenses. Giga Drain is used for longevity, but Leaf Storm in tandem with Eject Pack works well to pivot and bring in a setup sweeper that can take advantage of its Aurora Veil. Earth Power takes care of Steel-types that can easily switch into Abomasnow safely like Magneton and Tera Steel Appletun. Ice Shard can be used to finish off Pokemon like Scyther and Mesprit, but it can be a wasted moveslot at times because you give up coverage or Aurora Veil. Leech Seed can be used to trade hits more easily with Blissey, which walls Abomasnow otherwise. A Timid nature is key to outspeed Modest Magneton and neutral-nature Samurott. A Choice Specs set can be run, but being locked into one move can be somewhat detrimental due to its Stealth Rock weakness and loss of bulk. Tera Ground helps with boosting Earth Power damage output and gives Abomasnow an Electric immunity for Magneton and Rotom, which use it to gain momentum otherwise.</p> <p>Great partners for Abomasnow are ones that can take care of its Fighting- and Flying-type weaknesses like Scyther, Qwilfish, and Rotom. Hattrem and Drifblim are also exceptional partners that, along with tanking Fighting-type attacks, deny entry hazards for non-Heavy-Duty Boots Abomasnow's longevity. Swords Dance Bruxish and Nasty Plot Mesprit are two good offensive partners that can take advantage of Abomasnow's Aurora Veil once Abomasnow takes care of their checks in Cacturne and Magneton. Tauros and Alolan Raichu also appreciate Abomasnow taking care of their checks like Lurantis and Sandaconda and, in turn, can help with breaking through Steel-types.</p>"
      },
      "Swords Dance": {
        "description": "<p>Thanks to its decent Attack stat in combination with Swords Dance and priority Ice Shard, Abomasnow can be a dangerous setup sweeper that takes advantage of the surprise factor that comes with the set, as it usually uses Swords Dance as a special wall like Blissey, Cryogonal, and Eelektross switches in. While Wood Hammer is more powerful, Seed Bomb can be used over it to still threaten Blissey without recoil. Ice Shard picks off weakened, faster threats like Scyther, Hisuian Sneasel, and Lilligant. Earthquake hits the Steel-types that resist Abomasnow’s STAB moves like Magneton and Tera Steel Appletun. Tera Fire allows Abomasnow to resist hits from Scyther, Pyroar, Magneton, and opposing Abomasnow, giving it a free turn to setup or attack while also granting an immunity to Will-O-Wisp from the likes of Drifblim and Rotom. Tera Ground can be used instead to boost the power of Earthquake, give Abomasnow a Stealth Rock resistance, and surprise Electric-types using Volt Switch.</p> <p>Ice Shard allows Abomasnow to take out offensive checks like Hisuian Sneasel and Scyther after a Swords Dance boost with minimal chip. To get this chip, Rocky Helmet Pokemon like Qwilfish and Sandaconda work well with Abomasnow, enabling it to facilitate a sweep. Flying- and Fighting-types like Scyther and Toxicroak threaten Abomasnow out, so checks like Rotom, Sableye, and Sandaconda pair well alongside it. Choice Scarf Mesprit pairs well with Abomasnow, threatening Fighting-types out and giving Abomasnow a second chance to sweep with the aid of Healing Wish. Articuno acts as a hard wall for Abomasnow, as it gets a Defense boost in snow and access to Haze. Pokemon like Magneton and Rotom can take advantage of Articuno by threatening it with Volt Switch to obtain momentum and crippling it with Trick, respectively. Pyroar also deals with Articuno quite well with Taunt, blocking Articuno’s Roost, in combination with Will-O Wisp, which lets Pyroar chip away at it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 262594, "username": "Milak"}, {"user_id": 192841, "username": "antemortem"}, {"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Magnezone": {"sets": {"Choice Specs": {}}},
  "Rhyperior": {"sets": {"Defensive": {}, "Swords Dance": {"description": "<p>The given speed EVs allow Rhyperior to outspeed Water-types like Slowbro and Vaporeon, while the Attack investment for the alternative EV spread lets it OHKO Slowbro with Megahorn after a Swords Dance.</p>"}}},
  "Porygon-Z": {"sets": {"Choice Item": {}, "Agility": {}}},
  "Gallade": {"sets": {"Swords Dance": {}}},
  "Froslass": {
    "sets": {
      "Spikes Utility": {
        "description": "<p>With excellent Speed, a diverse utility movepool, and Spikes, Froslass is an elite Spikes setter and spinblocker. Taunt shuts down opposing entry hazard setters like Qwilfish, Blissey, and Sandaconda while also preventing Defog from the likes of Braviary and Lurantis. Ice Beam puts additional pressure on the aforementioned Defoggers and targets other walls like Sandaconda and Appletun. Shadow Ball provides higher damage on targets like Mesprit and Ghost-types like Rotom and opposing Froslass. Will-O-Wisp cripples physical attackers like Coil Dudunsparce, Hisuian Sneasel, and Scyther. While Tera Dark is situational, it can become a Knock Off sponge and wall Sableye while inverting its Dark and Ghost weaknesses.</p> <p>Stealth Rock setters like Bombirdier and Sandaconda contribute to the hazard stacking Froslass provides, with the former removing opposing Heavy-Duty Boots with Knock Off. Wallbreakers like Bruxish and Pyroar can put foes into KO range faster thanks to the extra chip damage. VoltTurn users such as Scyther, Jolteon, and Magneton can not only help bring Froslass in safely, but also wear down other walls like Muk, Appletun, and Umbreon. Defensive walls like Blissey and Sandaconda can circumvent Froslass's low bulk with their reliable recovery and can sponge status moves.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Rotom": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {
        "description": "<p>Rotom stands out as a fantastic user of Choice Scarf thanks to its nearly unresisted STAB combination, high Speed tier, and three immunities. Will-O-Wisp lets Rotom cripple opposing physical sweepers such as Passimian, Medicham, and Scyther on top of Toxicroak using Sucker Punch. Trick is very useful to dismantle walls that rely on their item like Sandaconda, Eelektross, and Chansey. Tera Electric and Tera Ghost boost Rotom's STAB attacks even further with no drawbacks, though note that Tera Ghost exposes Rotom to Sandaconda's Glare. Tera Dark is useful for beating Sucker Punch Toxicroak and making Rotom a good lure for Zoroark. Thanks to Rotom's ease switching into opposing Sandaconda, teammates weak to it like Toxicroak, Lycanroc, Perrserker, and Scyther make for great partners; the latter two can even form a VoltTurn core with it. Bruxish, Medicham, and Mabosstiff help Rotom get around common special walls like Umbreon, Muk, and Chansey. Some walls that Rotom benefits from teaming up with include Umbreon, Vaporeon, and Muk thanks to their ability to take on common wallbreakers that can revenge kill Rotom such as Mabosstiff, Bruxish, and Pyroar.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Rotom takes advantage of common Pokemon such as Sandaconda and Chansey that typically can't threaten it to set up. Will-O-Wisp eases setup and helps weaken checks such as Eelektross and Appletun. Tera Ghost helps Rotom get by Eelektross and Muk while retaining its Fighting immunity, whereas Tera Fairy can catch Dark-type revenge killers like Zoroark and Choice Scarf Mabosstiff off guard.</p> <p>Rotom's quite customizable: Substitute / Nasty Plot / Thunderbolt or Discharge / Shadow Ball limits revenge killers and makes it easier to choose an offensive Tera type. Protect can be used instead of Will-O-Wisp to scout Choice item revenge killers like Zoroark, Passimian, and Bruxish. These options lack the same consistency as the listed set, though.</p> <p>Pivots like Passimian, Scyther, and Oricorio formes are great to bring Rotom in against Sandaconda and Chansey, affording it easy setup opportunities. If Rotom is running Volt Switch, pair it with physical wallbreakers such as Bruxish and Toxicroak that can take on blanket special walls like Muk and Umbreon that commonly try to check it.</p>"
      },
      "Utility": {
        "description": "<p>Rotom is an excellent bulky pivot, forcing out common staples like Scyther and Qwilfish with Volt Switch while having a positive matchup against Sandaconda, the most common Volt Switch absorber in the tier. Will-O-Wisp neuters physical attackers such as Passimian and Toxicroak and powers up Hex to chunk special walls like Eelektross and Muk. Protect racks up Leftovers recovery and burn damage while scouting moves from Choice item users such as Zoroark, Bruxish, and Passimian. Tera Electric powers up Volt Switch and removes Rotom's weaknesses to Dark and Ghost, improving its matchup against Mabosstiff, Umbreon, Haunter, and opposing Rotom. Tera Steel gives Rotom a great defensive typing with Levitate, which allows it to shrug off Sandaconda's Ground- and Rock-type coverage as well as take resisted damage from common moves like Lurantis's Leaf Storm and Lycanroc's Stone Edge. Because of Rotom's vulnerability to chip damage, it benefits greatly from reliable entry hazard removal from Pokemon such as Scyther and Lurantis. Powerful wallbreakers such as Ursaring and Medicham appreciate Rotom pivoting them safely into play. Rotom is quite vulnerable to faster attackers such as Zoroark and Bruxish, so it appreciates being paired with defensive stops to these threats, such as Muk and Umbreon. Passimian is a fantastic partner that forms a VoltTurn core with Rotom and revenge kills its offensive checks; it also appreciates Rotom weakening Sandaconda.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 189361, "username": "Lucario"}, {"user_id": 336073, "username": "Rabia"}, {"user_id": 537558, "username": "memesketch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 298730, "username": "poh"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}, {"user_id": 583793, "username": "Sabelette"}, {"user_id": 297659, "username": "deetah"}]}]}
  },
  "Rotom-Heat": {"sets": {"Choice Scarf": {}, "Nasty Plot": {}}},
  "Rotom-Mow": {"sets": {"Choice Scarf": {}, "Utility": {}, "Nasty Plot": {}}},
  "Uxie": {"sets": {"Utility": {}}},
  "Mesprit": {
    "outdated": true,
    "sets": {
      "Offensive Setup": {
        "description": "<p>Mesprit is an amazing setup sweeper because it has great coverage and Substitute to shield it from crippling utility moves like Toxic, Thunder Wave, and Trick. Nasty Plot allows Mesprit to be more immediately threatening, while Calm Mind lets it tank more special attacks and take advantage of Substitute and Stored Power more. Even though Dazzling Gleam is stronger than Draining Kiss, the latter is preferred for longevity, but Dazzling Gleam 2HKOes Appletun, Umbreon, and, with Tera Fairy, Hisuian Qwilfish at +2 after Stealth Rock. Stored Power lets Mesprit be even more threatening over time as you amass more boosts, but Mystical Power gives it a decent attacking move right off the bat that can help you steamroll teams by just attacking. Psyshock helps beat special walls like Articuno, Blissey, and Muk more easily as well as setup sweepers like Vivillon and Lilligant that can boost Special Defense. Tera Fairy lets Mesprit turn would-be checks in Dark-types such as Umbreon and Bombirdier into setup fodder, even letting it use Substitute on their attacks.</p> <p>Mesprit is checked by special walls and Dark-types alike, so checks such as Bombirdier, Toxicroak, and Scyther pair greatly alongside it. Because faster physical attackers like Bruxish and Scyther easily threaten Mesprit out, physical walls like Lurantis, Avalugg, and Sandaconda work as amazing partners. Encore from Sableye, Cacturne, or Alolan Raichu can be quite annoying for Mesprit to deal with, as these Pokemon can lock Mesprit into a non-damaging move and then whittle it down. To combat this, Dark-types to beat them like Bombirdier and Hisuian Qwilfish are good teammates that can also cripple the opposing team with Knock Off, entry hazards, and status conditions.</p>"
      },
      "Defensive Setup": {},
      "Choice Scarf": {
        "description": "<p>After donning a Choice Scarf, Mesprit becomes an excellent revenge killer that beats common threats like Samurott, Toxicroak, and Hisuian Sneasel. Psyshock 2HKOes Cryogonal while also letting Mesprit beat down special walls that love to come in on it, while Psychic can be used instead to let you take care of Pokemon like Sandaconda and Avalugg. Mystical Power with Choice Scarf is a powerful combination on Mesprit, letting it become a revenge killer that can easily spiral out of control and beat weakened teams. Trick helps with crippling walls like Blissey and Articuno that Mesprit draws in and helps it check bulky setup sweepers like Ursaring and Eelektross. Healing Wish can be used instead to help bring a teammate that has longevity issues back to full or give a setup sweeper another chance like Assault Vest Eelektross, Tauros, or Bruxish. Tera Fairy helps Mesprit revenge kill Toxicroak and Cacturne more safely, as it then resists Sucker Punch. Also, STAB Dazzling Gleam lets Mesprit muscle past Dark-types far more consistently.</p> <p>Hisuian Qwilfish is the best Mesprit answer in the tier, so Pokemon like Bruxish, Froslass, and Appletun that can draw it in and force meaningful damage onto it are important teammates to have. Choice Scarf Mesprit pairs nicely with Choice Band wallbreakers like Hisuian Sneasel and Medicham because, with U-turn, Mesprit can pivot them in versus special walls and Dark-types. All of Mesprit's checks heavily rely on their items, like Blissey, Hisuian Qwilfish, and Eelektross, so Knock Off from teammates such as Samurott, Bombirdier, and Sableye especially helps it to clean late-game. Healing Wish pairs well with Life Orb Samurott, Tauros, and Choice Band Bruxish, as they tend to have poor longevity—a second chance for a setup sweepers like Eelektross and Swords Dance Hisuian Sneasel is also highly appreciated.</p>"
      },
      "Choice Specs": {}
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Shaymin": {"sets": {"Healing Wish": {}, "Offensive": {}}},
  "Emboar": {"sets": {"Wallbreaker": {}}},
  "Samurott": {"sets": {"Mixed Wallbreaker": {}, "Swords Dance": {}}},
  "Leavanny": {"sets": {"Sticky Web Support": {}}},
  "Lilligant": {
    "sets": {
      "Quiver Dance Sweeper": {
        "description": "<p>Lilligant is a fearsome setup sweeper in NU thanks to the infamously potent combination of Quiver Dance + Terastallization. Tera patches up two of Lilligant's main weaknesses, being poor coverage and a poor defensive typing. Pollen Puff allows Lilligant to hit Grass-types like Appletun and Lurantis without having to rely on Tera Blast. It also doubles as nice coverage for Pokemon such as Umbreon and Mesprit, which pack the bulk and utility options to hinder a Lilligant sweep. Because Lilligant has Pollen Puff for Grass-types, it uses a Tera Blast type capable of threatening Flying-types, commonly Rock or Electric. Tera Rock has the added benefit of resisting Poison, letting Lilligant more easily deal with Muk or take a Poison-type attack from Hisuian Sneasel or Toxicroak in a pinch. Lilligant can opt to run Encore last in tandem with Tera Electric to take advantage of careless Thunder Wave users like Blissey and Umbreon, locking them into the move and granting Lilligant free setup opportunities. Sleep Powder can be used to grant even more setup opportunities, but without the added coverage, these setup opportunities are often moot. Life Orb is great for Lilligant, as Giga Drain can offset the recoil, and the added damage to special walls like Appletun and Bombirdier is greatly beneficial.</p> <p>Lilligant is often found on more offensive teams, both creating and using openings and momentum for and by its teammates. Dedicated leads like Bombirdier and Froslass are the forefront of generating early momentum for offensive Pokemon; the entry hazards and utility options like a respective Memento or Destiny Bond create ample opportunities for Lilligant and other offensive teammates like Hisuian Sneasel, Veluza, and Vivillon. Choice Scarf Mesprit and Rotom can invite in special walls like Blissey, Cryogonal, and Umbreon and Trick them, completely impairing their ability to check Lilligant effectively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400664, "username": "Stories"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}]}
  },
  "Krookodile": {"sets": {"Choice Scarf": {}, "Bulk Up": {}, "Stealth Rock": {}}},
  "Scrafty": {"sets": {"Bulk Up": {}, "Dragon Dance": {}}},
  "Reuniclus": {
    "overview": "<p>Reuniclus can serve as both a solid special wall and a dangerous set up sweeper. With Assault Vest, it can take hits from common special attackers like Munkidori, Magnezone, and Dragalge, while its offensive set can set up with Calm Mind and even blow through checks. Its staying power is further bolstered by a combination of Regenerator, Magic Guard, and Recover. Psyshock and Focus Blast hit most of the tier for at least neutral damage, and Knock Off and Future Sight are useful utility. Psychic Noise allows Reuniclus to beat bulkier foes that would otherwise out-heal its damage. Energy Ball can also be a useful option, hitting several Psychic-resistant foes in the tier, including Slowbro and Krookodile. Dark-types like Alolan Muk and Krookodile can be problematic, however, due to their ability to hit Reuniclus hard with Knock Off. Psychic types like Slowbro and Mew can also be difficult, as they resist both of Reuniclus's main attacking options. Ghost-types, particularly strong attackers like Chandelure and Brambleghast seriously threaten Reuniclus as well. Additionally, Reuniclus's very low Speed stat also makes it vulnerable to being overwhelmed and revenge killed by many physical attackers, including Lycanroc-D, Mienshao, and Feraligatr.</p>",
    "comments": "<h3>Other Options</h3> <p>Trick Room is a reasonable option on offensive sets to take advantage of Reuniclus's very low Speed. Tera Blast Fighting is occasionally used as an accurate substitute for Focus Blast, but does require Terastallization to be useful.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: Several Dark-types in NU easily switch into Reuniclus's STAB moves and threaten back with Knock Off. In particular, Alolan Muk, Incineroar, and Krookodile outspeed and deal significant damage to Reuniclus.</p> <p><strong>Psychic-types</strong>: Psychic-types resist both Reuniclus's Psychic-type STAB moves and Focus Blast, making them potent defensive answers. Slowbro and Mew can set up alongside or against Reuniclus and regularly carry coverage that hits for at least neutral damage.</p> <p><strong>Ghost-types</strong>: While they don't switch well into Reuniclus's attacks besides Focus Blast, common Ghost-type attackers like Chandelure, Brambleghast, and Hisuian Typhlosion can outspeed and KO Reuniclus.</p> <p><strong>Strong Physical Attackers</strong>: Reuniclus's low Speed leaves it vulnerable to being revenge killed and overwhelmed by strong physical attackers, particularly those with U-turn. Lycanroc-D, Feraligatr, Mienshao, and Infernape can all deal serious damage to Reuniclus, and the latter two can pivot on it.</p>",
    "sets": {
      "Assault Vest": {
        "description": "<h4>Set Details</h4> <p>Psychic Noise prevents foes from healing, allowing Reuniclus to actually wear down bulky foes like Slowbro and Quagsire. Future Sight can hit potential threats to Reuniclus after it has already switched out, which can be particularly overwhelming when combined with powerful physical wallbreakers like Choice Band Krookodile and Lycanroc-Dusk. Focus Blast 2HKOes the Steel- and Dark-types like Magnezone and Krookodile that might otherwise try to switch into Reuniclus's Psychic-type attacks,and it can nearly OHKO the latter. Energy Ball hits several bulky Pokemon that might switch into Reuniclus — most notably Slowbro, which is almost always 2HKOed — but outside of hitting Krookodile, makes Reuniclus's matchups against Dark and Steel-types like Incineroar and Registeel much worse. Knock Off provides excellent utility in removing the items of potential switch-ins like Incineroar and Mew. The given EV spread helps Reuniclus outspeed Quagsire and Slowbro, so it can beat them one-on-one with Psychic Noise. The rest is poured into Special Defense to maximize bulk. Tera Dark and Tera Fairy both allow Reuniclus to resist types normally super effective against it, such as Ghost and Dark. Tera Steel and Tera Dragon both work to resist strong neutral attacks from common special attackers, including Boomburst from Toxtricity as well as Grass- and Fire-type attacks from sun sweepers like Venusaur, Scovillain, and Typhlosion.</p> <p>Reuniclus benefits from teammates that can switch into dangerous Dark-types like Alolan Muk and Krookodile. Vileplume does well into both, threatening Effect Spore activations on Knock Off while not fearing poison from Alolan Muk. Offensively, Reuniclus benefits from Fighting-types like Mienshao and Gallade that can eliminate Steel- and Dark-types that would switch into Future Sight, like Copperajah, Magnezone, Krookodile, and Brute Bonnet. Gallade also seriously threatens Slowbro with Leaf Blade, which can try to pivot through Reuniclus's attacks as well. Pivots like Thundurus that can bait in foes like Alolan Muk and Krookodile and chip them down can also make Reuniclus's life much easier. Ghost-types like Brambleghast and Chandelure seriously threaten Reuniclus, so answers like Alolan Muk and Incineroar support it well.</p>"
      },
      "Calm Mind": {
        "description": "<h4>Set Details</h4> <p>Psychic Noise gives Reuniclus the ability to beat bulky foes like Quagsire and Slowbro, preventing them from healing off damage Reuniclus deals to them. Psyshock is able to challenge boosted foes like Calm Mind Slowbro and Sylveon. Focus Blast hits the Dark- and Steel-types that might otherwise wall Reuniclus, OHKOing Krookodile and — with Tera Fighting — 2HKOing Registeel. Magic Guard allows Reuniclus to avoid being worn down by entry hazards, take advantage of Life Orb, and ignore status like poison and burn. Colbur Berry can help Reuniclus take a Knock Off from Krookodile and Incineroar and respond with a free Focus Blast. The given EV spread allows Reuniclus to outspeed and beat Unaware Quagsire while having as much Defense as possible. Tera Fighting boosts the power of Focus Blast and grants Reuniclus important resistances to Dark-type moves and U-turn. Tera Steel and Tera Fairy work primarily defensively, allowing Reuniclus to take powerful Dark-, Ghost-, or Bug-type attacks that might otherwise threaten or KO it.</p> <p>Reuniclus benefits from the support of strong physical attackers, such as Flygon, Krookodile, and Mienshao, that can wear down special walls like Alolan Muk and opposing Reuniclus to open the way for Reuniclus to set up. Teammates such as Diancie and Vileplume that can switch into Knock Off from Incineorar and Krookodile, respectively, also work well. The latter in particular can threaten physical attackers that may try to wear down Reuniclus with a super effective U-turn, forcing them to risk activating Effect Spore. Other Pokemon that resist Dark-type attacks such as Fairy-types like Klefki and Sylveon can also be helpful. Ghost-types like Chandelure and Brambleghast can also easily knock out Reuniclus, so Pokemon that resist Ghost like Incineroar, Alolan Muk, and Krookodile pair well with it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641404, "username": "hammer798"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 327515, "username": "Zrp200"}, {"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Galvantula": {"sets": {"Lead": {}}},
  "Eelektross": {
    "outdated": true,
    "sets": {
      "Coil": {
        "description": "<p>Eelektross makes for one of the most potent bulky setup sweepers in the tier due to its lack of weaknesses and access to the highly coveted Coil. Eelektross' defensive profile, notably boasting a paralysis and Ground immunity, grants it safe entry against tier staples like Sandaconda, Chansey, and Jolteon, and it can even set up Coil in front of them. Drain Punch allows Eelektross to maintain its health while boosting. Dragon Tail lets Eelektross beat opposing setup sweepers like Coil Sandaconda, Bulk Up Ursaring, and Curse Muk. Instead of Dragon Tail, Eelektross can use a move like Substitute or Rest to greatly help against status inducers such as Rotom, Drifblim, and Qwilfish. The former two can otherwise easily outspeed and burn Eelektross and eventually beat it down with boosted Hex. Tera Steel prevents Toxic from Muk, Qwilfish, and Vespiquen and retains an amazing defensive profile thanks to Levitate. Entry hazards set by the likes of Qwilfish and Sandaconda allow Eelektross to rack up damage against incoming checks like Rotom and Lurantis with Dragon Tail. Drifblim and the aforementioned Qwilfish also appreciate Eelektross's Electric resistance.</p>"
      },
      "Assault Vest": {
        "description": "<p>Assault Vest Eelektross is a premier defensive pivot. Its lack of weaknesses, immunity to Spikes and Toxic Spikes, and excellent Assault Vest-boosted special bulk allow it to check common special attackers like Jolteon, Zoroark, and Oricorio. Its low Speed tier paired with 0 Speed IVs allows it to take hits and then safely bring in frailer teammates like Haunter, Zoroark, and Bruxish with U-turn. As such, it fits well on VoltTurn cores with the likes of Bombirdier, Passimian, and Scyther, wearing down the opposing team with pivot moves. Discharge is prefered over Thunderbolt due to the increased paralysis chance. Giga Drain threatens Sandaconda while providing some recovery. Dragon Tail phazes foes, pairing well with Spikes support from the likes of Qwilfish and Cacturne, and keeps Tera Ground Quiver Dance users such as Oricorio and Vivillon in check despite their Discharge immunity. Drain Punch is an alternative that still allows Eelektross to defeat Tera Ground Quiver Dance users while hitting common special attackers like Zoroark and Pyroar super effectively. Acid Spray is a viable alternative that lets Eelektross defeat setup sweepers even when they are the only remaining opposing Pokemon. Tera Steel is preferred, as it improves Eelektross's matchup against common special attackers like Indeedee-F and non-Tera Fire Vivillon while gaining an immunity to Qwilfish's Toxic.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400664, "username": "Stories"}, {"user_id": 369076, "username": "Tuthur"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}, {"user_id": 298730, "username": "poh"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Chandelure": {"sets": {"Choice Item": {}, "Calm Mind": {}}},
  "Mienshao": {
    "overview": "<p>Mienshao is the best offensive pivot in NU thanks to its high Attack stat, great Speed tier, and good coverage. Mienshao is able to threaten most of the tier with its STAB Close Combat, which enables it as a late-game sweeper. Its great Speed paired with Choice Scarf lets it outspeed unboosted Pokemon like Lycanroc-D and Talonflame as well as boosted sweepers like Shell Smash Torterra and Dragon Dance Feraligatr. Knock Off punishes Mienshao's switch-ins like Slowbro, Reuniclus, and Talonflame as well as Ghost-types that are immune to Close Combat like Chandelure and Brambleghast, while other coverage options like Stone Edge, Ice Spinner, and Poison Jab hit Flying- and Fairy-type switch-ins with super effective damage. On top of that, Regenerator pushes Mienshao above the competition, effectively letting it ignore entry hazards on the switch. Mienshao often plays into high-risk, high-reward scenarios; the threat of using Close Combat is high, as Fighting-resistant Pokemon like Talonflame, Slowbro, and Vileplume can all switch in and punish it with Flame Body, Rocky Helmet, and Effect Spore, respectively. Even with the risk of Rocky Helmet, Mienshao can still pivot with U-turn on predicted switches, giving it the upper hand. Mienshao's poor bulk is heavily expressed when facing priority users like Lucario and Feraligatr as well as faster Choice Scarf users like Infernape and Munkidori.</p>",
    "comments": "<h3>Other Options</h3> <p>Mienshao can use Choice Band to take advantage of its high Attack stat; however, it opens up more opportunities for your opponent to revenge kill Mienshao. Fake Out is an option for Life Orb Mienshao to revenge kill faster, weaker threats like Thundurus, Agility Gallade, and Chlorophyll Venusaur, but it loses out on the power of Swords Dance and momentum of U-turn. Lastly, Triple Axel can be used over Ice Spinner for a stronger Ice-type move, but it is less reliable. Assault Vest is another option on the wallbreaker set, giving Mienshao more longevity against special wallbreakers and revenge killers like Noivern and Infernape.</p> <h3>Checks and Counters</h3> <p><strong>Flying-types</strong>: Pokemon like Talonflame and Noivern outspeed non-Choice Scarf Mienshao, can switch into Close Combat, and threaten an OHKO with Brave Bird and Hurricane, respectively. Talonflame is also able to punish Mienshao thanks to Flame Body having a chance to burn. Oricorio-E is freely able to set up against a Choice-locked Mienshao, but it is 2HKOed by Tera Fighting Close Combat unless it runs a very bulky EV spread.</p> <p><strong>Ghost-types</strong>: Chandelure, Basculegion, and Brambleghast can safely switch in against Choice Scarf Mienshao that is locked into Close Combat and threaten it with an OHKO, but they all have to take caution against Knock Off and the possibility of Mienshao not running Choice Scarf, except Choice Scarf Chandelure and Basculegion.</p> <p><strong>Poison-types</strong>: Vileplume walls Mienshao thanks to adverse damage over time through Rocky Helmet, Toxic, and Leech Seed; it can also restore all of its HP while simultaneously making Mienshao weaker with Strength Sap. Munkidori resists Close Combat and is naturally faster than Mienshao, often forcing it out by bluffing Choice Scarf.</p> <p><strong>Psychic-types</strong>: Slowbro, Reuniclus, and bulky Mew resist Mienshao's Close Combat and can force awkward predictions even while they are not on the field. They are all weak to Knock Off but can take the hit with Tera Fairy or Tera Poison and then use Mienshao as setup fodder.</p> <p><strong>Physical Walls</strong>: Blanket physical walls such as Slowbro, Avalugg, and Quagsire can make it hard for Mienshao to break through bulkier teams, as they can recover their HP easily and Terastallize if needed. Bulky Fairy-types like Sylveon and Florges resist most of Mienshao's moves, being able to exploit non-Poison Jab variants.</p> <p><strong>Priority Users</strong>: Tera Normal Lucario and Arcanine as well as Aqua Jet Feraligatr and Basculegion all possess strong priority to revenge kill Mienshao, often forcing it to switch out or Terastallize in situations it wouldn't want to. If Mienshao loses its Fighting typing because of Tera, it can become susceptible to Lycanroc-D's Accelerock, too.</p> <p><strong>Faster Pokemon</strong>: Choice Scarf Mienshao doesn't have this issue as much as the wallbreaker set, but Choice Scarf users like Munkidori and Infernape as well as Venusaur under sun will always outspeed Mienshao, giving them the opportunity to revenge kill it. Life Orb Mienshao is also outsped by Espeon, Lycanroc-D, Thundurus, and Noivern, all of which threaten it with a KO.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<h4>Set Details</h4> <p>Choice Scarf boosts Mienshao's Speed to become a premier revenge killer, outspeeding the faster threats in the tier like Lycanroc-D, Noivern, and Thundurus. With passable bulk paired with Regenerator, Choice Scarf Mienshao is a great lead, achieving an OHKO or 2HKO against most entry hazard setters and Choice Scarf leads like Flygon and Krookodile. Knock Off punishes Ghost- and Psychic-types like Basculegion, Chandelure, Slowbro, and Mew that try to switch in on Close Combat, while U-turn gives Mienshao momentum through pivoting and hits Mew and Slowbro with super effective damage. Stone Edge hits Flying-types like Talonflame and bulky Noivern that want to punish Mienshao using Close Combat. Ice Spinner hits the previously mentioned Noivern as well as Grass- and Dragon-types like Brambleghast, Tsareena, and Dragalge, but it's usually best to use U-turn against them to bring in a better check or generally keep up momentum and weaken them at the same time. Poison Jab can be used for Fairy-types like Sylveon, Florges, and Tera Fairy Slowbro; this is not preferred because it isn't strong and can be exploited by Steel-types like Registeel, Lucario, and Magnezone as well as other Poison-resistant Pokemon like Rhyperior, Krookodile, and Dragalge. Regenerator gives Mienshao a lot of longevity that it normally wouldn't have with its other abilities, letting it switch in on weaker attacks and hazards without worrying about losing HP. Tera Fighting gives Mienshao's Close Combat a lot of extra power, allowing it to 2HKO Quagsire, Noivern, and Rhyperior, as well as having a roll to 2HKO Swampert. Tera Dark boosts Knock Off's damage and defensively helps Mienshao against Psychic-types like Slowbro, Reuniclus, and Mew while gaining an immunity to Klefki's Thunder Wave; however, it loses its resistance to Lycanroc-D's Accelerock.</p> <p>Mienshao appreciates being able to pivot into Pokemon that can take strong hits from Ghost-, Psychic-, and Fairy-types like Incineroar, Swampert, Dragalge, and Munkidori, all of which can pivot back into Mienshao if needed. Munkidori is most noteworthy because of its Toxic Chain ability, spreading Toxic on its U-turns to cripple Mienshao's Fairy- and Psychic-type checks like Sylveon, Slowbro, and bulky Mew. This interaction can weaken the Close Combat switch-ins enough to enable Mienshao to freely click Close Combat later in the battle. Offensive threats that lure in Fairy-types like Choice Specs Noivern, Mew, Tera Poison Krookodile, and Tera Steel Flygon help at eliminating Mienshao's checks without weakening it or wasting Close Combat's PP. Choice Scarf variants of Munkidori and Infernape are often what will be used to revenge kill Mienshao; as such Slowbro is a good partner, resisting Munkidori's Psychic and both of Infernape's STAB attacks. Slowbro and Reuniclus have natural synergy with Mienshao thanks to Regenerator; they can use Future Sight and pivot into Mienshao to threaten Poison-type switch-ins like Vileplume and Dragalge, while Mienshao threatens the Dark-types that try to absorb Future Sight, like Krookodile and Alolan Muk. Mienshao isn't weak to entry hazards thanks to Regenerator, but it is weak to teams that take advantage of it being Choice locked. With that in mind, having a grounded Poison-type like Vileplume or Alolan Muk and a Defog user like Talonflame or Noivern really helps Mienshao stick around for longer, not having to rely so heavily on Regenerator. Pokemon that can take hits from Mienshao's hard switch-ins like Slowbro, Talonflame, and Vileplume are needed for its longevity, so Pokemon like Alolan Muk, Mew, Swampert, and Magnezone all pair nicely with it. Due to Mienshao's main role as a pivot, it pairs well with fast wallbreakers like Lycanroc-D, Munkidori, and Thundurus, which threaten Mienshao's checks. Mienshao can't do much to physical walls like Slowbro, Vileplume, and Tera Poison Avalugg, so it enjoys partnering with strong special wallbreakers like Chandelure, Mew, and Toxtricity. These wallbreakers aren't known for their speed and appreciate Mienshao KOing fast Pokemon like Lycanroc-D, Thundurus, and Noivern. Chandelure and Mew can also switch into Choice Scarf Infernape's Close Combat, preserving some momentum.</p>"
      },
      "Wallbreaker": {
        "description": "<h4>Set Details</h4> <p>Life Orb boosts Mienshao's power a lot with little drawback thanks to Regenerator, giving it the opportunity to 2HKO Quagsire as well as OHKO Mew and Tsareena after some prior damage. Close Combat and Knock Off make a nearly unresisted combination; the latter enables Mienshao to hit Ghost- and Psychic-types that switch in on Close Combat like Chandelure, Brambleghast, Slowbro, and Mew. Close Combat and Knock Off synergize better with Life Orb than Choice Scarf thanks to Mienshao not being locked into one move, giving it a better fighting chance against Psychic- and Ghost-type switch-ins. Poison Jab hits Fairy-types like Sylveon and Florges as well as Tera Fairy users like Slowbro and Rhyperior. Swords Dance boosts Mienshao's already high Attack, giving it more of a chance to break past physical walls like Slowbro, Swampert, and Vileplume. U-turn retains Mienshao's strong pivoting capability without forcing it to lock into a single move, but it causes Mienshao to lose out on the power of Swords Dance. Regenerator gives Mienshao more opportunities to wallbreak while not caring too much about damage from entry hazards, Rocky Helmet, and Life Orb. Tera Poison boosts Poison Jab's damage, allowing it to OHKO Tsareena and Tera Fairy Slowbro after a Swords Dance boost. Tera Ghost gives Mienshao many immunities to moves to revenge killers like Close Combat from Lycanroc-D and Infernape, Vacuum Wave from Lucario and Mew, and Extreme Speed from Lucario; however, it becomes weak to Brute Bonnet's Sucker Punch and no longer resists Lycanroc-D's Accelerock.</p> <p>Swords Dance Mienshao appreciates entry hazard support from Swampert, Rhyperior, Klefki, and Dragalge to guarantee some KOs it otherwise would not obtain. Toxic Spikes in particular help to break through physical walls like Swampert, Rhyperior, and Sylveon, which cannot afford to run Heavy-Duty Boots. Future Sight support from Slowbro and Reuniclus can punish Poison-types and Tera Poison users that try to wall Mienshao like Vileplume, Quagsire, and Avalugg, while Mienshao punishes Dark-types like Incineroar, Alolan Muk, and Krookodile that try to absorb Future Sight. Faster Pokemon like Talonflame, Noivern, and Raikou can revenge kill Mienshao, which opens up room for various different walls like Diancie, Slowbro, Registeel, and Alolan Muk to be paired alongside it. Choice Scarf users like Krookodile, Flygon, and Basculegion can all work to KO Pokemon that try to use their higher Speed to force Mienshao to switch. Slow pivots like Dragalge, Swampert, and Eject Button Slowbro can all safely bring in Mienshao. If running U-turn, Dark-types like Krookodile, Alolan Muk, and Incineroar can all be brought in safely on a predicted Psychic-type move from Slowbro, Reuniclus, or Mew. A status absorber, especially one that can absorb burns, is very useful to keep Mienshao healthy enough to wallbreak at any time; thus, it naturally pairs well with Milotic, Rest Alolan Muk, and Magic Guard Reuniclus.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 189361, "username": "Lucario"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 126266, "username": "Kiyo"}, {"user_id": 295647, "username": "etern"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Golurk": {"sets": {"Choice Band": {}}},
  "Braviary": {
    "outdated": true,
    "sets": {
      "Bulk Up": {
        "description": "<p>Braviary stands out as a good setup sweeper thanks to its fantastic Fighting-type coverage to threaten Flying-type answers and physical walls such as Magneton, Avalugg, and various other Tera Steel users such as Appletun, as well as recovery alongside great bulk that is boosted even further with Bulk Up. Roost gives Braviary reliable recovery and helps it heal off recoil it takes from using Brave Bird as well as giving it more opportunities to use Substitute. Substitute can take advantage of Pokemon such as Appletun and Lurantis while also allowing Braviary to avoid status from Pokemon such as Qwilfish, Sandaconda, and Umbreon. Tera Dark allows Braviary to stop Prankster from Sableye, allowing it to take advantage of it via a Substitute or Bulk Up. Alternatively, Tera Ground gives Braviary a more favorable matchup versus Electric-type Pokemon like Rotom and Eelektross as well as a Rock resistance; (SC) however, the resulting Grass weakness means it can no longer switch in on Lurantis and Appletun as freely. Tera Fighting can be used with Close Combat over Substitute for more overall power and the ability to take down Flying-type answers like Magneton while also gaining a resistance to Rock-type moves, but doing so makes Braviary vulnerable to status moves.</p> <p>Braviary struggles with faster threats with super effective coverage, often forcing it to Terastalize. As a result, specially defensive walls such as Blissey, Eelektross, and Umbreon pair well with it, with the former being notable for supporting Braviary with Wish, as Braviary will not be able to Roost easily due to its average Speed and large number of checks. Physically defensive walls such as Sandaconda and Sableye can also be useful to check Pokemon such as Tauros, Paldean Tauros, and Bombirdier. Pokemon with access to status moves such as Sableye if you are not running Tera Dark and Qwilfish if you are not running Substitute can also be troublesome for Braviary, so status absorbers such as Blissey and Hisuian Qwilfish can help with this problem. Braviary also dislikes Rocky Helmet users such as Sandaconda and Qwilfish, as the recoil can add up with Brave Bird over time. To deal with this, item disruption from Trick and Knock Off on Pokemon like Rotom, Sableye, and Samurott is ideal.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 595639, "username": "plznostep"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Thundurus": {"sets": {"Nasty Plot": {}, "Mixed Utility": {}, "Physical Attacker": {}}},
  "Meloetta": {"sets": {"Choice Item": {}, "Relic Song": {}}},
  "Delphox": {"sets": {"Nasty Plot": {}}},
  "Talonflame": {
    "overview": "<p>In a tier with a number of powerful entry hazard setters, Talonflame soars to the top as a premier pivot with U-turn, spreading burns everywhere it goes with Will-O-Wisp while also being able to remove hazards with Defog. However, Talonflame is not only reserved as a utility option; it can act as a physical wall in a pinch thanks to its ability Flame Body and can invest in its bulk without losing out on Speed or power thanks to its high-Base Power STAB attacks like Brave Bird and Flare Blitz. Talonflame can force out Stealth Rock and Spikes setters like Krookodile, Registeel, Brambleghast, and Klefki by threatening them with Will-O-Wisp and using Defog to remove their hazards. Thanks to its high Speed, it can revenge kill fast threats like non-Choice Scarf variants of Mienshao, Krookodile, and Infernape. However, its flight can be cut short due to tier king Slowbro's positive matchup against it. Not only that, but its low offenses really stand out when trying to revenge kill bulkier wallbreakers and Pokemon that resist its STAB moves like Mew, Chandelure, and Oricorio-E, all of which can shrug off its attacks and don't care about being burned. Talonflame's reliance on Heavy-Duty Boots is made apparent when it commonly switches into Knock Off users like Krookodile, Mienshao, Copperajah, and Infernape, forcing it to take hazard damage every time it wants to switch in again. Talonflame's poor typing allows most other hazard setters to set up against it for free, like Rhyperior, Diancie, and Lycanroc-D.</p>",
    "comments": "<h3>Other Options</h3> <p>Talonflame can opt for Taunt over Will-O-Wisp, stopping any setup attempts from the likes of bulky Mew, Registeel, and Reuniclus, but it makes Talonflame a little more passive, especially since it isn't dealing much damage to those Pokemon regardless. Overheat or Flamethrower can be used instead of the other two STAB attacks to hit Vileplume without worrying about Rocky Helmet and Effect Spore, but Overheat's poor accuracy paired with Talonflame's really low Special Attack stat makes it undesirable against most of the tier. Talonflame can boost its Attack with Swords Dance and Bulk Up, which allows it to use Gale Wings's priority boost; however, even after a boost, it is still weak and relies on less-than-ideal moves to sweep with.</p> <h3>Checks and Counters</h3> <p><strong>Electric-types</strong>: Thundurus, Oricorio-E, and Toxtricity have a positive matchup against Talonflame, as they can take a hit from its STAB attacks at any time and threaten to OHKO it or set up. Rotom-H is especially tricky for Talonflame, as it resists both of its STAB attacks, is immune to burn, and can give it a Choice Scarf with Trick, acting as a hard wall to it.</p> <p><strong>Item Removal</strong>: Common Knock Off users, like Krookodile, Alolan Muk, and Reuniclus, and Trick users, like Porygon-Z, Rotom-H, and Florges can remove Talonflame's Heavy-Duty Boots, forcing it to take Stealth Rock damage every time it switches in.</p> <p><strong>Rock-types</strong>: Rhyperior and Diancie are both entry hazard setters that beat Talonflame thanks to their Rock-type STAB attacks OHKOing it, freely letting them switch in and set up hazards any time Talonflame is on the field. Lycanroc-D is also noteworthy thanks to its strong priority move Accelerock, although it has to worry about being burned.</p> <p><strong>Water-types</strong>: Vaporeon and Milotic can tank hits from Talonflame, heal the damage off with ease, and retaliate with Scald. Offensive Water-types like Feraligatr and Basculegion can also threaten Talonflame, but neither like to be burned. Slowbro is a much bigger check to Talonflame, as Talonflame is too passive versus it, letting it set up with Calm Mind for free.</p>",
    "sets": {
      "Utility": {
        "description": "<h4>Set Details</h4> <p>Brave Bird and Flare Blitz have the same Base Power, accuracy, and recoil and can both hit Grass-types like Tsareena, Venusaur, and Brambleghast for super effective damage, so the option for which one you choose is mostly personal preference. Brave Bird additionally hits Fighting-types and Fire-resistant Pokemon like Mienshao, Chandelure, and Noivern. Flare Blitz is better against entry hazard setters; enables Talonflame to hit Steel-types and Flying-resistant Pokemon like Copperajah, Klefki, and Thundurus for more damage; and has a small chance to burn. Will-O-Wisp is a more reliable way of burning foes than Flame Body, letting Talonflame burn common switch-ins like Slowbro, Vaporeon, and Raikou and threaten hazard setters that often come in like Rhyperior, Diancie, and Dragalge. 232 Speed EVs allow Talonflame to outspeed Noivern, and the remaining EVs are used to maximize its bulk. Tera Steel gives Talonflame a much-needed resistance to Lycanroc-D's Accelerock and Lucario's Extreme Speed, letting it check them more safely, while also granting a resistance to Stealth Rock should it lose its item; Talonflame can also become a pseudo-check to some special wallbreakers like Mew, Noivern, and Dragalge with Tera Steel.</p> <p>Talonflame's main role is to pivot, and thanks to it drawing in Electric- and Rock-type Pokemon, it pairs well with Ground- and Grass-types like Krookodile, Flygon, Vileplume, and Brute Bonnet, which can all exploit its switch-ins. Pokemon that appreciate entry hazard removal like Alolan Muk, Mew, and Gallade also pair well with it. Talonflame also enjoys tanking Fighting-type moves from Mienshao, Infernape, and Lucario, so teammates like Lycanroc-D, Krookodile, and Registeel appreciate its presence in battle. Due to its passivity, Talonflame draws in Water-types like Slowbro Vaporeon, which leverages room for Electric- and Grass-type Pokemon like Magnezone, Rotom-C, and Tsareena to switch in. Bulky offense teams appreciate Talonflame's ability to lure in Electric- and Rock-types due to their passivity in certain matchups, so pivoting into Torterra, Flygon, and Swampert can help create momentum. On balanced structures, Talonflame enjoys having switch-ins for Pokemon like Noivern and Dragalge, so Steel- and Fairy-types like Registeel, Copperajah, Klefki, and Sylveon synergize well with it. Diancie, Rhyperior, and Gastrodon can set up hazards in front of Talonflame without trouble, so Water- and Grass-types like Feraligatr, Basculegion, Brute Bonnet, and Vileplume can help by safely switching into and threatening to KO these foes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 189361, "username": "Lucario"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 583607, "username": "PowerOfMemes"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Vivillon": {
    "sets": {
      "Quiver Dance": {
        "description": "<p>Vivillon is a good choice for hyper offense teams, as the combination of Sleep Powder and Quiver Dance can easily wrest momentum from the opponent and potentially sweep outright, giving Vivillon a niche in NU as a dangerous setup sweeper. Sleep Powder enables Vivillon to cripple opposing Pokemon that may otherwise check it, such as Eelektross and Drifblim, and give it the free turn needed to set up a Quiver Dance. Substitute is an option to ease setup by helping Vivillon play around the uncertainty of sleep turns and dodge status. Bug Buzz targets Pokemon such as Umbreon and Hattrem, which can otherwise cut Vivillon's sweep short with Thunder Wave or Nuzzle. Finally, Tera Blast with Tera Ground does heavy damage to Muk and outright OHKOes Magneton. Vivillon's very poor overall bulk makes Focus Sash a good option, as it guarantees a Quiver Dance boost or the ability to put a foe to sleep. However, if your team lacks multiple forms of entry hazard removal, Heavy-Duty Boots is preferred. Compound Eyes boosts the otherwise shaky accuracy of Sleep Powder and Hurricane, making them far more reliable. A Timid nature is preferred over a Modest nature to outspeed Choice Scarf users such as Indeedee-F, Passimian, and Medicham after a Quiver Dance and outspeed and threaten an OHKO on offensive threats like Toxicroak and Mabosstiff unboosted. Tera Ground allows Vivillon to turn the tables on Volt Switch users such as Jolteon and Rotom and also helps it survive Accelerock from Lycanroc. Alternatively, Tera Ghost along with Substitute allows Vivillon to set up against Chansey, which would normally wall it, and Tera Flying can be used to power up Vivillon's Hurricane.</p> <p>If Vivillon is running Focus Sash over Heavy-Duty Boots, strong hazard control is key, so Hattrem, which prevents opposing hazards through Magic Bounce, and other hazard removal options such as Drifblim and Lurantis are mandatory. Special walls such as Chansey and Eelektross are a serious obstacle for Vivillon to overcome, with the former's Natural Cure negating the effect of Sleep Powder, so physical wallbreakers that can take advantage of them like Toxicroak, Paldean Tauros, and Ursaring make for great partners. Trick users, such as Rotom and Zoroark, can also bait in these foes and cripple them by giving them a Choice item, with Rotom deserving special mention for inviting in Lurantis and Appletun, which gives a Vivillon relatively free setup opportunity. Spikes support from the likes of Qwilfish and Cacturne is also appreciated to help wear down answers to Vivillon over time. Strong setup sweepers like Veluza, Dudunsparce, and Lycanroc, which all appreciate foes being put to sleep, also make for powerful partners in conjunction with Vivillon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272785, "username": "nimzowitsch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 509790, "username": "Pokeslice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 383911, "username": "YashGreninja"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Pyroar": {
    "outdated": true,
    "sets": {
      "Taunt Wallbreaker": {
        "description": "<p>Pyroar's excellent Speed and solid movepool make it a great wallbreaker that checks setup sweepers. Taunt allows Pyroar to prevent bulky Pokemon like Blissey, Muk, and Ursaring from getting free switch-in to use their utility moves while also stopping setup sweepers such as Bulk Up Braviary, Coil Eelektross, and Nasty Plot Mesprit. Will-O-Wisp threatens Pyroar switch-ins like Samurott, Muk, and Assault Vest Eelektross. Tera Blast is most commonly run with Tera Grass, allowing Pyroar to destroy threats like Floatzel, Sandaconda, and Veluza. Endeavor can be used over Will-O-Wisp to severely weaken special walls like Blissey, Appletun, and Ursaring if they attempt to trade damage after Pyroar uses Taunt versus them. Tera Ghost allows Pyroar to turn the tables against common Fighting-types such as Toxicroak, Medicham, and Hisuian Sneasel that would usually destroy it. Alternatively, Tera Grass allows Pyroar to tank powerful Water- and Ground-type attacks from Bruxish, Floatzel, and Sandaconda.</p> <p>Pyroar can't reliably defeat walls such as Blissey, Umbreon, and Appletun; it best pairs with physical wallbreakers like Toxicroak, Scyther, and Samurott that can deal with these threats. If Pyroar loses its Heavy-Duty Boots, it becomes susceptible to entry hazards, so hazard removers such as Avalugg, Drifblim, and Lurantis or a hazard deterrent like Hattrem are great partners. Grass-types like Cacturne, Appletun, and Lurantis appreciate Pyroar for checking threats such as Scyther, Avalugg, and Vivillon; in return, they check Water-types like Bruxish, Clawitzer, and Samurott. Fighting-types like Hisuian Sneasel and Choice Scarf Medicham can threaten out Pyroar, so it pairs best with Psychic- and Ghost-types such as Mesprit, Bruxish, and Drifblim.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 609709, "username": "Pika134"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Florges": {"sets": {"Wish + Calm Mind": {}}},
  "Dragalge": {
    "overview": "<p>Dragalge is a staple in NU thanks to its great typing, utility movepool, and access to Adaptability, which let it successfully fulfill both offensive and defensive roles. Bulkier sets can come in on walls like Vileplume and take advantage of them by setting Toxic Spikes, causing the rest of their team to suffer. On the other hand, Choice Specs sets provide a ton of nuking power with Adaptability, allowing Dragalge to break through former counters like Umbreon and Registeel. However, Dragalge lacks good Speed, meaning it often can't retaliate before strong attackers overwhelm it. Bulkier sets are also held back due to a lack of access to recovery moves and Dragalge’s below-average HP. Dragalge’s typing too, at times, can be somewhat limiting, since Ground- and Steel-types are fairly common in NU.</p>",
    "comments": "<h3>Other Options</h3> <p>Scald can be used on bulkier Dragalge sets to try to burn checks like Copperajah and Klefki, but this causes Dragalge to lose out on pressure in Toxic Spikes or momentum in Flip Turn. A moveset consisting of Substitute / Sludge Bomb / Dragon Pulse / Focus Blast or Tera Blast Ground can be used with Leftovers to significantly capitalize on forced switches and take advantage of more passive Pokemon. But this can hurt Dragalge's longevity quite a bit, and, in general, opportunities aren’t too common.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Ground-types like Flygon and Krookodile are difficult to handle for Dragalge, as they’re always faster and can land a strong Earthquake that almost always OHKOes it.</p> <p><strong>Steel-types</strong>: Steel-types like Registeel and Tera Steel Sylveon wall Dragalge's STAB moves, meaning they can come in and take advantage of it often and only fear Focus Blast. Also, Klefki loves to come in on any of Dragalge’s attacks and spread status or set Spikes.</p> <p><strong>Psychic-types</strong>: Dragalge struggles against the plethora of Psychic-types, ranging from more defensive ones like Reuniclus to offensive threats like Gallade, Mew, and Munkidori. All of these Pokemon easily scare out Dragalge with their Psychic-type STAB moves and also tend to be able to take a hit from it.</p> <p><strong>Special Walls</strong>: Special walls like Alolan Muk, Assault Vest Gallade, Reuniclus, and Diancie take on Dragalge’s attacks easily and can threaten it with Knock Off or a physical attack. All of these Pokemon don’t have a very reliable source of healing, though, so they tend to be whittled down over the course of a battle.</p>",
    "sets": {
      "Bulky Pivot": {
        "description": "<h4>Set Details</h4> <p>Toxic Spikes allows Dragalge to chip away at walls, while Dragon Tail can phaze Dragalge’s checks as well as setup sweepers. Flip Turn works amazingly on Dragalge, letting it act as a bulky pivot that can bring in powerful wallbreakers. The given EV spread allows Dragalge to outspeed Vileplume while giving it some physical bulk to aid with Fighting-types like Mienshao and Infernape. Tera Steel allows Dragalge to take Psychic-, Fairy-, and Dragon-type attacks from foes like Munkidori, Sylveon, and Noivern. On the other hand, Tera Water alleviates its weakness to Ground-type attacks while giving it an overall strong defensive typing.</p> <p>Toxic Spikes lowers switch rates when your opponent tries to play around them, so Pokemon that can scare out Poison-types and cause switches like Krookodile and Future Sight Reuniclus can overwhelm your opponents. Partners that can bring in physically defensive Pokemon such as Mienshao and Infernape gift Dragalge with chances to set Toxic Spikes. In the face of Steel-types like Klefki and Copperajah, Dragalge fails to do much, so partners that can take advantage of its Flip Turn and deal with these pests, like Gallade, Mienshao, and Flare Blitz Talonflame, work well. Opposing Dragon- and Fairy-type Pokemon also cause issues for Dragalge, as they’re usually faster and can severely damage or KO Dragalge before it can react. Teammates that help alleviate this weakness such as Magnezone, Registeel, and Sylveon are appreciated. Dragalge’s limited HP also hinders it; to ensure its survival for longer, entry hazard removers or Wish users like Talonflame, Brambleghast, and Vaporeon can be used. Pokemon like Slowbro and Tsareena that can handle more offensive Ground-types such as Flygon and Krookodile can help out Dragalge.</p>"
      },
      "Choice Specs": {
        "description": "<h4>Set Details</h4> <p>Sludge Wave is preferred for damage output, but Sludge Bomb can more reliably poison specially defensive Pokemon like Gastrodon, Vaporeon, and Umbreon. Focus Blast can heavily dent many Steel-types on the switch-in like Registeel, Klefki, and Magnezone. Tera Blast Ground can be used instead to hit these targets more accurately and powerfully along with Alolan Muk; however, this comes at the cost of Terastallizing, making it not as favored of an option overall. For the last move, a way to pivot in Flip Turn is preferred to bring a partner in on a wall it would otherwise have trouble with. The given EV spread gives Dragalge enough Speed to outrun uninvested Sylveon while having the rest dumped into HP. Tera Poison grants Dragalge a resistance to Fairy while also powering Sludge Wave to preposterous levels; however, a more defensive Tera type like Tera Steel could be used to help Dragalge retaliate after surviving Psychic- and Dragon-type attacks.</p> <p>Dragalge’s low Speed tends to hinder it a lot, but this can be negated with pivot cores. Dragalge draws in Steel-types, but it can use Flip Turn to let Mienshao or Flygon handle them. On the other hand, Mienshao and Flygon themselves can use U-turn after drawing in a physical wall like Slowbro or Quagsire, which Dragalge preys on. Dragalge can also whittle down Steel-types like Copperajah and Registeel over time with a strong Focus Blast, so Pokemon that can take advantage of this such as Munkidori, Reuniclus, and Calm Mind Sylveon enjoy its presence. Special walls like Alolan Muk and Assault Vest Reuniclus love to come in on Dragalge, so strong physical wallbreakers like Gallade, Incineroar, and Krookodile work well to deal with these checks.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Clawitzer": {
    "outdated": true,
    "sets": {
      "Choice Specs": {
        "description": "<p>With Choice Specs and the unique Mega Launcher ability, Clawitzer uses its exceptional coverage to be one of the most devastating wallbreakers in NU. Tera Dragon not only maintains Clawitzer's Water and Fire resistances, but it also turns Clawitzer's Grass and Electric weaknesses into resistances. Further, it gives Clawitzer a more powerful STAB move in Dragon Pulse, which guarantees a 2HKO on common special walls like Umbreon and Assault Vest Eelektross after Stealth Rock. Aura Sphere hits Chansey and Steel-types like Perrserker and Tera Steel Eelektross. U-turn can be used in the fourth moveslot to bring in teammates like Passimian and Toxicroak, which better deal with healthy special walls like Chansey and Umbreon or Tera Fairy threats, allowing Clawitzer to use Dragon Pulse more freely. Flash Cannon can also be used to hit Tera Fairy Pokemon like Chansey, Umbreon, and Vaporeon, which are immune to Dragon Pulse and Water Pulse, in Vaporeon's case. Without Terastallizing, Electric-types like Rotom, Jolteon, and Magneton pose a threat to Clawitzer. Appletun and Electric immunities like Sandaconda and Jolteon work as partners to eat up their moves and restore any HP they lose.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 83980, "username": "Oathkeeper"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Sylveon": {"sets": {"Wish + Calm Mind": {}, "Choice Specs": {}}},
  "Klefki": {"sets": {"Special Wall": {}}},
  "Avalugg": {"sets": {"Physically Defensive": {}}},
  "Avalugg-Hisui": {"sets": {"Physically Defensive": {}}},
  "Noivern": {"sets": {"Utility": {}, "Choice Specs": {}}},
  "Diancie": {"sets": {"Special Wall": {}, "Trick Room": {}, "Rock Polish": {}}},
  "Decidueye": {"sets": {"Swords Dance": {}, "Utility": {}}},
  "Incineroar": {"sets": {"Defensive Pivot": {}}},
  "Oricorio-Pom-Pom": {"sets": {"Quiver Dance": {}}},
  "Lycanroc": {"sets": {"Sand Wallbreaker": {}, "Lead": {}}},
  "Lycanroc-Dusk": {
    "overview": "<p>Lycanroc-D is one of the most effective revenge killers and wallbreakers that NU has to offer. It boasts one of the best base Speed stats in the tier and carries strong STAB priority in Accelerock for faster foes. Its strong, Tough Claws-boosted attacks, often boosted further by Swords Dance, deal immense damage even to neutral targets. It also has fantastic coverage, with Close Combat to burst through physical walls like Avalugg and Registeel, Crunch to break Slowbro and Reuniclus, and Psychic Fangs to crack Vileplume or Dragalge. The sheer variety of coverage available to it, including options like Sucker Punch and Stone Edge, makes predicting and countering Lycanroc-D incredibly difficult. Lycanroc-D's poor bulk is its main weakness; it can struggle to cleanly switch in, and finding time to set up a Swords Dance can be difficult. Life Orb recoil and entry hazards can further wear it down, limiting Lycanroc-D's staying power. Lycanroc-D can also be revenge killed by several of the Choice Scarf users in the tier, notably Mienshao, Flygon, and Krookodile. Walls like Swampert and Vileplume can also take a few hits if Lycanroc-D cannot set up with Swords Dance.</p>",
    "comments": "<h3>Other Options</h3> <p>Lycanroc-D can use Tera Ghost defensively in order to avoid Close Combat from revenge killing threats like Mienshao, but offensive Tera types are preferred to maximize damage output. A Focus Sash lead set with Stealth Rock / Accelerock / Close Combat / Taunt is a great enabler of hyper offense teams, as Lycanroc-D is still quite strong without a boosting move or item and is fast enough to reliably set its entry hazard.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Vileplume switches into most of Lycanroc-D's moves well, with the exception of Psychic Fangs. Rocky Helmet chip damage helps further wear Lycanroc-D down, and Effect Spore has the potential to activate on every one of Lycanroc-D's attacking options besides Stone Edge. Bulky Tsareena can take Close Combat, is immune to Accelerock, and can threaten Lycanroc-D with Rapid Spin or an OHKO with Power Whip. Venusaur in sun can also outspeed and threaten Lycanroc-D.</p> <p><strong>Water-types</strong>: Slowbro, Swampert, and Quagsire all take at least one hit from Lycanroc-D and threaten it back with super effective damage. Feraligatr and Basculegion can also threaten it offensively with Aqua Jet.</p> <p><strong>Ground-types</strong>: Swampert and Quagsire tank unboosted Close Combat adequately, while Flygon and Krookodile are capable of switching into anything but Close Combat while often using Choice Scarf to outspeed and potentially OHKO Lycanroc-D with Earthquake.</p> <p><strong>Revenge Killers</strong>: Very few threats in the tier can naturally outspeed Lycanroc-D, but for those that do, Lycanroc-D is forced to use a relatively weak priority move in Accelerock. Raikou, along with Choice Scarf users like Mienshao and Flygon, can take an Accelerock and threaten Lycanroc-D back with super effective attacks.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<h4>Set Details</h4> <p>Lycanroc-D has significant power and Speed without any boosts, but Swords Dance pushes it even further. Accelerock is a strong priority STAB move that hits faster Pokemon like Talonflame, Noivern, and Thundurus for super effective damage. Close Combat is an excellent coverage move that hits large portions of the tier for neutral or super effective damage. Notably, it hits walls such as Avalugg and Registeel, almost always OHKOing Avalugg at +2. Pokemon resistant to Accelerock, such as Swampert and Rhyperior, also dislike switching into Close Combat, particularly after a Swords Dance boost. The addition of Tera Fighting allows an unboosted Lycanroc-D to 2HKO Swampert and Quagsire. Sucker Punch can replace Close Combat for an even stronger priority move on Tera Dark variants, letting Lycanroc-D OHKO Choice Scarf Mienshao. Crunch, often in combination with Tera Dark, allows Lycanroc-D to OHKO Slowbro at +2 after Stealth Rock, and always OHKOes Reuniclus. Alternatively, Psychic Fangs beats Poison-types like Vileplume, defensive Dragalge, and Tera Poison Slowbro with ease. Life Orb provides some immediate power without the boost of Swords Dance, giving it solid revenge killing potential upon entering the field.</p> <p>One of Lycanroc-D's primary weaknesses is its bulk, which makes it difficult to switch in, particularly when it also takes entry hazard damage. As a result, Lycanroc-D benefits greatly from pivoting teammates to bring it in without taking a hit. Slow pivots, such as Magnezone and Swampert, can take the hit themselves, safely bringing Lycanroc-D in, while fast, strong pivots like Noivern can scare out opposing Pokemon to bring Lycanroc-D in for free. Special attackers such as Dragalge, Magnezone, and Thundurus appreciate Lycanroc-D's ability to blow holes in special walls like Alolan Muk, and in return they can wear down common physical walls like Slowbro and Quagsire. On hyper offense teams, particularly those using Galvantula to set up Sticky Web, Lycanroc-D's threat potential is only increased, allowing it to outspeed dangerous Choice Scarf users like Mienshao and Infernape. Grass-types, primarily Rapid Spin users like Tsareena and Brambleghast, also pair well with Lycanroc-D, threatening common Ground-type checks like Swampert and Quagsire and removing the hazards that would otherwise chip away at Lycanroc-D's HP. Teammates like Slowbro and Talonflame can switch in on threatening revenge killers like Mienshao and Krookodile, and Slowbro can also help check opposing Talonflame, which threatens to cripple Lycanroc-D with Flame Body burns.</p>"
      },
      "All-out Attacker": {
        "description": "<h4>Set Details</h4> <p>Accelerock provides priority that's useful against the few threats in the tier that outspeed Lycanroc-D, dealing super effective damage to Noivern, Talonflame, and Thundurus. It also provides an option to pick off Shell Smash sweepers like Cloyster and some weakened Choice Scarf users, such as Chandelure and Hisuian Typhlosion. Close Combat can OHKO specially defensive Registeel, 2HKO Avalugg, and serve as a strong neutral coverage move in response to many other threats. Tera Fighting Close Combat can also guarantee 2HKOs on Swampert and Quagsire. Crunch cleanly 2HKOes Slowbro and Reuniclus, and Psychic Fangs 2HKOes Vileplume and OHKOes all but the most physically bulky Dragalge. Sucker Punch provides Lycanroc-D with a stronger priority move than Accelerock that's not resisted by the Choice Scarf Ground-types that try to revenge kill it. Stone Edge is a stronger STAB move than Accelerock, and unlike the rest of Lycanroc-D's options, it does not risk activating contact-based abilities like Effect Spore and Flame Body. With Choice Band, Stone Edge cleanly 2HKOes Vileplume. Life Orb provides less immediate power but more flexibility at the cost of some HP, while Choice Band provides maximum immediate damage at the cost of locking Lycanroc-D into a move.</p> <p>Slow pivots like Magnezone, Swampert, and Incineroar can take a hit and cleanly switch into Lycanroc-D, getting it onto the field without taking damage. Teammates like Tsareena, Brambleghast, and Feraligatr can break through bulky Water- and Ground-types that could otherwise tank multiple hits, such as Slowbro and Swampert. Strong special attackers, such as Magnezone, Thundurus, and Porygon-Z, support Lycanroc-D by breaking through the physical walls, like Slowbro and Quagsire, that can check it. Rapid Spin users like Tsareena and Brambleghast, as well as Defog users like Talonflame, pair well with Lycanroc-D, removing entry hazards that hurt its already limited longevity. Galvantula, as the premier Sticky Web setter in the tier, also pairs well with Lycanroc-D, allowing it to outspeed and OHKO Choice Scarf users like Mienshao and Infernape that would otherwise pose a threat to it. Defensively, teammates like Slowbro and Talonflame can take Close Combat and Earthquake from potential revenge killers like Mienshao and Krookodile, and Slowbro further checks Talonflame, which potentially threatens Lycanroc-D with a Flame Body burn on every attack except Stone Edge.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641404, "username": "hammer798"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 633500, "username": "StupidFlandrs48"}, {"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Mudsdale": {"sets": {"Defensive": {}}},
  "Lurantis": {
    "outdated": true,
    "sets": {
      "Defog": {
        "description": "<p>Not only is Lurantis one of the few Pokemon with access to Defog, but it also has solid bulk, reliable recovery, and a typing that fares well into many top threats like Bruxish, Eelektross, and Sandaconda. Contrary + Leaf Storm lets Lurantis accrue boosts very quickly, and Tera Blast can patch up any holes in its coverage; Tera Electric hits Flying-types like Drifblim and Oricorio-F, and Tera Fire hits Steel-types like Perrserker and Tera Steel Eelektross. Pollen Puff is an option to hit Grass-types like Appletun and Lurantis without relying on Terastallization. Lurantis is hampered by its weaknesses to U-turn and Poison-types like Muk and Toxicroak, making physical walls like Sandaconda and Drifblim great teammates. Lurantis also works excellently with entry hazard setters, as Contrary can punish Defog. Special walls like Chansey, Bombirdier, and Muk can take consecutive boosted Leaf Storms, so powerful physical attackers like Passimian and Bruxish pair well with Lurantis. 48 Speed EVs let it outspeed Chansey and Muk, giving Lurantis an edge against them should they be weakened.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400664, "username": "Stories"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 509790, "username": "Pokeslice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Salazzle": {"sets": {"Utility": {}, "Nasty Plot": {}}},
  "Tsareena": {
    "overview": "<p>Tsareena is NU's best entry hazard remover, and for good reason: it easily beats the plethora of Grass-weak hazard setters like Rhyperior, Swampert, and Diancie, and even Steel-types such as Klefki and Registeel are inconsistent at beating it one-on-one. While offensive Tsareena profiles as a solid wallbreaker that can take over games thanks to Rapid Spin's Speed boost, defensive sets are fantastic at checking the swathes of offensive Ground-types in NU, especially Krookodile and Flygon, and its access to Synthesis is a huge factor in it outclassing Brambleghast, its primary competition. Tsareena faces some very real struggles defensively, though, as almost every Ground-type it aims to check carries super effective coverage, like Gunk Shot from Krookodile and Megahorn from Rhyperior, that threatens to KO it with minimal chip damage required. Offensive sets aren't very fast without a Speed boost and easily pressured by other wallbreakers like Chandelure and Munkidori as well as fast utility options in Noivern and Talonflame. Meanwhile, defensive sets are quite easy to exploit due to their reliance on Knock Off with Pokemon like RestTalk Alolan Muk, Vileplume, and Dragalge.</p>",
    "comments": "<h3>Other Options</h3> <p>Tsareena has other usable Tera types than the ones listed, but they lack consistency across teams. Tera Dark is good for teams that lack a Ghost resistance and amps up Knock Off's damage, but it offers little else. Tera Ghost is a harder answer to Fighting-types than Tera Poison, but it's just as bad into Krookodile and gives Tsareena a horrible Alolan Muk matchup. Tera Fire is similar to Tera Dragon in helping Tsareena against Fire-types, although Tsareena gains a Water weakness. Choice Scarf sets are good at revenge killing priority-reliant setup sweepers like Lycanroc-D and Lucario and don't have to worry about Klefki's Thunder Wave.</p> <h3>Checks and Counters</h3> <p><strong>Flying-types</strong>: All of Talonflame, Noivern, and Acrobatics Thundurus outspeed Tsareena and beat it with relative ease. Talonflame hates losing its item, though, and both Noivern and Thundurus are vulnerable to Triple Axel from offensive sets.</p> <p><strong>Poison-types</strong>: Alolan Muk is a great Tsareena answer, especially if it's RestTalk. Other Poison-types like Dragalge, Vileplume, and Munkidori are good checks but less consistent. The former two cannot survive Knock Off followed by Triple Axel, while the latter is too frail to take Knock Off from either Tsareena set.</p> <p><strong>Fire-types</strong>: Incineroar counters Tsareena with ease, only fearing the rare High Jump Kick. Although Knock Off obliterates Chandelure and Hisuian Typhlosion, they both can spinblock Tsareena, tank its Power Whip, and OHKO it with their Fire-type attacks barring a well-timed Terastallization.</p>",
    "sets": {
      "Offensive": {
        "description": "<h4>Set Details</h4> <p>Tsareena doubles as a source of entry hazard removal and a potent wallbreaker. Knock Off punishes switch-ins such as Talonflame and Magnezone while obliterating Chandelure, and Triple Axel deletes opposing Grass-types like Vileplume, Venusaur, and Rotom-C as well as Noivern. If you wish to tap further into Tsareena's utility movepool, U-turn is optional over Triple Axel, still giving it an out against any of its checks while enabling its stronger teammates. High Jump Kick is another coverage move you can try, as it's Tsareena's best option for hitting Steel-type hazard setters like Copperajah and Registeel and does good damage to Incineroar. Heavy-Duty Boots lets Tsareena bypass hazard damage, which increases its proficiency as a spinner, but Lum Berry helps against Talonflame's Flame Body and Slowbro's Scald. Tsareena usually shouldn't be Terastallizing, but Tera Dragon potentially lets it KO a Chandelure or Hisuian Typhlosion with Knock Off and gives Tsareena a good sun matchup, while Tera Steel blanks Munkidori's STAB moves, potentially lets Tsareena beat Cloyster, and helps it against Alolan Muk.</p> <p>Tsareena is great at luring in and beating certain Poison-types like Dragalge, Vileplume, and Venusaur with Triple Axel; make sure to pair it with teammates like Mienshao, Thundurus, and Sylveon that can take advantage of this. Furthermore, Mienshao especially, as well as other physical attackers like Gallade and Infernape, appreciate Tsareena removing Talonflame's Heavy-Duty Boots and making it easier to overwhelm with Stealth Rock up. Similarly, teammates like Choice Specs Noivern, Chandelure, and Hisuian Typhlosion all appreciate Tsareena's Rapid Spin, and the latter two can beat Steel-type checks like Klefki, Registeel, and Magnezone for Tsareena. Talonflame is perhaps the most common switch-in to Tsareena, so Pokemon like Diancie and Slowbro that easily switch into it are helpful to have.</p>"
      },
      "Defensive": {
        "description": "<h4>Set Details</h4> <p>Bulky Tsareena is one of the tier's few good answers to the plethora of offensive Ground-types in NU, such as Flygon, Krookodile, and Rhyperior. Although they possess super effective coverage moves for it, they can't OHKO it, and Synthesis keeps Tsareena healthy throughout the game so it can stay out of KO range from these threats. The biggest boon to this set, though, is destroying Klefki; it can't do enough damage with Foul Play thanks to the bulk investment, and Power Whip or Trop Kick will slowly beat it down. Trop Kick can be used over Power Whip for its accuracy, but you lose out on useful damage rolls like 2HKOing Diancie, 2HKOing Assault Vest Reuniclus after Stealth Rock, and OHKOing Krookodile. The Speed EVs ensure Tsareena outspeeds Modest Diancie before it can attack with Meteor Beam, but Tsareena can go even faster if it wants, with relevant targets including Modest Magnezone, Torterra, and Adamant Feraligatr. Tsareena will rarely want to Terastallize, but Tera Poison is nice to consistently answer Fighting-types like Mienshao and non-Meteor Mash Lucario and makes Tsareena immune to poison from Alolan Muk at the cost of becoming weak to Earthquake; Tera Dragon aids against Fire-types like Hisuian Typhlosion and retains several resistances to types like Water, Grass, and Electric; and Tera Steel is useful for checking Fairy- and Poison-types such as Sylveon and Munkidori as well as Cloyster.</p> <p>Tsareena creates great defensive cores with common entry hazard setters like Diancie and Rhyperior. They resist Fire and Flying for Tsareena, while it takes on Water- and Ground-type attacks in return. Its Knock Off support is also favored by many offensive Pokemon, specifically Fighting-types like Mienshao, Gallade, and Infernape, since Tsareena so frequently draws in Talonflame and removes its Heavy-Duty Boots. Stealth Rock-weak Pokemon like Choice Specs Chandelure, Choice Specs Noivern, and itemless Thundurus also desire Tsareena for its Rapid Spin.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 336073, "username": "Rabia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 295647, "username": "etern"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Passimian": {"sets": {"Choice Scarf": {}}},
  "Minior": {"sets": {"Shell Smash": {}}},
  "Bruxish": {
    "sets": {
      "Choice Band": {"description": "<p>Bruxish's Speed tier coupled with Strong Jaw-boosted Psychic Fangs lends it great wallbreaking capability. Its high Base Power STAB moves are nearly unresisted, and it has enough coverage moves to get around potential checks like Cacturne and Vaporeon. Poison Fang hits Grass-types like Cacturne and Appletun while also badly poisoning common walls like Vaporeon and Umbreon. Crunch targets Psychic-types like Hattrem and Oricorio-P while also securing the OHKO on Farigiraf. Tera Dark further boosts Strong Jaw-boosted Crunch and helps Bruxish get past the aforementioned Cacturne and Vaporeon. Tera Fairy coupled with Tera Blast helps its matchup versus Cacturne while also resisting Sucker Punch from Pokemon like Toxicroak and Honckrow. Teammates should be pivots that bring Bruxish safely on the field like Eelektross, Passimian, and Rotom. Pokemon like Oricorio and Clawitzer appreciate Bruxish targeting their checks like Chansey and Eelektross.</p>"},
      "Swords Dance": {
        "description": "<p>Strong Jaw-boosted Psychic Fangs and Crunch turn Bruxish into a dominant offensive force in NU. It also has Aqua Jet, which lets it revenge kill weakened faster threats like Zoroark and Choice Scarf Passimian and sweep after boosting with Swords Dance. Bruxish's Speed tier is also great, allowing it to outspeed Rotom, Mabosstiff, and Bombirdier. Tera Blast can be used in the fourth moveslot in conjunction with Tera Fairy to give Bruxish a better defensive typing while also being able to beat common walls to it like Cacturne and Tera Dark Toxicroak and Vaporeon. Tera Dark combined with Strong Jaw, however, gives Crunch a deadly bite with it becoming a third STAB move to nail opposing Bruxish and Veluza. Alternatively, Tera Water makes Aqua Jet even more dangerous for the aforementioned faster threats. If Bruxish is not running Tera Fairy + Tera Blast, having a partner like Toxicroak or Rotom to deal with Tera Dark Toxicroak and Vaporeon is appreciated.</p>"
      },
      "Choice Scarf": {"description": "<p>Choice Scarf Bruxish outspeeds other common Choice Scarf users like Passimian and Rotom-C, making it a very effective late-game cleaner. While it forgoes boosting elements like Choice Band and Swords Dance, Bruxish still boasts a good offensive presence with its powerful STAB moves. Choice Scarf Bruxish can surprise and OHKO common Choice Scarf users like Passimian and Rotom-C that expect to be faster, so teammates that appreciate their removal like Jolteon and Sneasel.</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 83980, "username": "Oathkeeper"}, {"user_id": 298730, "username": "poh"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 493772, "username": "Lumii"}, {"user_id": 589564, "username": "hidin"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Inteleon": {"sets": {"Choice Specs": {}}},
  "Drednaw": {"sets": {"Shell Smash": {}}},
  "Coalossal": {"sets": {"Physically Defensive": {}}},
  "Appletun": {
    "outdated": true,
    "sets": {
      "Specially Defensive": {
        "description": "<p>Appletun acts as one of the tier's premier special walls thanks to its fantastic defensive typing and plethora of utility options, which let it consistently check Pokemon like Lurantis, Jolteon, and Eelektross. Although Appletun might seem passive, Apple Acid prevents special walls like Umbreon and Ursaring from sitting on it because of the Special Defense drops. Leech Seed helps weaken Poison-, Flying-, and Bug-types like Muk, Articuno, and Scyther that are all capable of shrugging off Apple Acid while also allowing Appletun to check powerful setup sweepers like Coil Eelektross and Dudunsparce thanks to the extra health it provides. Dragon Tail adds another option to deal with setup sweepers while forcing Pokemon that want to switch into Appletun to take another round of entry hazards, working wonderfully in tandem with Spikes setters like Qwilfish. Alternatively, Dragon Pulse makes for a powerful STAB coverage option that can hit Grass-resistant foes like Scyther and Drifblim. Heavy-Duty Boots helps Appletun check strong special attackers like Pyroar, Rotom, and boosted Veluza consistently with hazards up, but Leftovers can also be used for the extra recovery. Tera Steel helps Appletun flip the script on Pokemon like Scyther, Muk, and Tera Ice Jolteon that traditionally answer it. Tera Steel also helps Appletun against Pokemon like Ursaring, Indeedee-F, and Clawitzer that all pack super effective coverage for it.</p> <p>Because of Appletun's weakness to Poison-types like Muk and Swalot, Sandaconda and Qwilfish make for fantastic defensive partners, also sporting Rocky Helmet to punish U-turns targeted at Appletun. Additionally, Electric-types like Rotom and Eelektross can threaten Flying-types like Scyther and Articuno.</p>"
      },
      "Choice Specs": {},
      "Eject Pack Pivot": {}
    },
    "credits": {"writtenBy": [{"user_id": 509790, "username": "Pokeslice"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Sandaconda": {
    "outdated": true,
    "sets": {
      "Utility": {
        "description": "<p>Sandaconda is one of the best Pokemon in NU and provides teams with several forms of useful utility, including blocking Volt Switch, setting Stealth Rock, spreading paralysis, and sponging Knock Off. Shed Skin lets Sandaconda absorb status and, in combination with Rest, support its team and take on physical attackers like Toxicroak throughout the game. Stone Edge threatens Defoggers and Flying-types like Drifblim and Vivillon and hits Eelektross and Rotom neutrally. Rocky Helmet wears physical attackers like Passimian and Muk down and discourages the use of moves like U-turn, while Leftovers provides Sandaconda passive recovery and makes it less reliant on Rest. Tera Ghost lets Sandaconda completely wall most Fighting-types and other threats such as Zangoose. Tera Dragon is another option that keeps Water- and Grass-types like Bruxish and Lurantis from immediately overwhelming Sandaconda. 80 Speed EVs allow Sandaconda to outrun Drifblim.</p> <p>Sandaconda can fit well on many different playstyles and will almost always do something for its team. Sandaconda's main flaw is its mediocre special bulk, which, coupled with its weakness to Eelektross's Giga Drain, means it shouldn't be a team's sole response to Electric-types. Pokemon like Chansey, Muk, and Umbreon can serve as backup checks to such foes and also check other special attackers like Cacturne and Zoroark. In addition, Chansey can run Stealth Rock for Sandaconda, thus allowing it to make room for both Glare and EdgeQuake coverage; Muk puts Sandaconda's grounded switch-ins on a timer with Toxic Spikes and annoys setup sweepers like Dudunsparce and Coil Eelektross with Haze; and Umbreon can keep Sandaconda healthy with Wish so it doesn't have to spend as much time asleep. Slower wallbreakers like Medicham and Clawitzer very much appreciate Glare slowing teams down and making them harder to play around.</p>"
      },
      "Coil": {"description": "<p>With rock-solid physical bulk, Shed Skin, and good offensive power, Sandaconda makes for a deadly mid- and late-game Coil sweeper, setting up on Pokemon like Passimian, Muk, and Umbreon. Stone Edge targets Pokemon resistant or immune to Earthquake, like Rotom, Drifblim, and Oricorio. Rest keeps Sandaconda healthy and works well with Shed Skin. Tera Dragon lets Sandaconda set up on Water-types like Vaporeon, Bruxish, and Floatzel as well as Lurantis, while Tera Ghost blanks Fighting-types like Toxicroak and Medicham. Prior to Terastallization, Sandaconda is vulnerable to Water- and Grass-types like Vaporeon, Bruxish, and Cacturne, so checks to them like Toxicroak, your own Cacturne, and Muk can help. Other special attackers like special Dudunsparce and Eelektross can exploit Sandaconda's low special bulk, so special walls like Crabominable and Chansey are good teammates.</p>"}
    },
    "credits": {"writtenBy": [{"user_id": 400292, "username": "asa"}, {"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Toxtricity": {"sets": {"Wallbreaker": {}}},
  "Hattrem": {
    "sets": {
      "Magic Bounce Support": {
        "description": "<p>Hattrem's positive matchup against common entry hazard setters like Sandaconda and Qwilfish makes it a valuable support option for hazard-vulnerable Pokemon like Tauros and Choice Scarf Scyther. It can also use Nuzzle to paralyze and check Pokemon that rely on their speed like Tauros, Hisuian Sneasel, and Mesprit, helping slower teammates such as Toxicroak, Abomasnow, and Samurott dish out powerful attacks without needing to worry about getting outsped and taking a hit. Rest + Sleep Talk gifts Hattrem longevity and lets it continuously check Tauros, Medicham, and Muk. Tera Fairy lets Hattrem check Dark-types like Mabosstiff and Hisuian Qwilfish while still maintaining a Fighting-type resistance.</p> <p>Thanks to Hattrem’s Magic Bounce Pokemon crippled by hazards like Muk, Eelektross, and especially Choice Scarf Scyther can do their job without worrying about being chipped down. When fully invested into physical bulk, Hattrem can fall short against special wallbreakers like Clawitzer, Magneton, and Samurott. Special walls like Blissey, Umbreon, and Articuno compensate for this and also appreciate Hattrem’s Fighting resistance. Hazard setters that can beat Hattrem like Bombirdier and Hisuian Qwilfish are troublesome, so additional hazard control from teammates is appreciated. Hattrem heavily relies on its Eviolite, so Knock Off absorbers like Sandaconda or Sticky Hold Muk are greatly appreciated as partners. Hattrem is best paired with a second physically defensive wall like Avalugg or Sandaconda as it can be easily overpowered if used alone.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Grimmsnarl": {"sets": {"Offensive": {}, "Bulk Up": {}}},
  "Perrserker": {
    "sets": {
      "Assault Vest Pivot": {
        "description": "<p>Perrserker's Steel typing and access to U-turn make it an excellent defensive pivot. With an Assault Vest, Perrserker can sponge a hit from special attackers like Appletun, Jolteon, and Zoroark and retaliate back with Tough Claws-boosted moves. Close Combat hits staples like Chansey and Jolteon, as well as Tera Steel users like Appletun and Eelektross. Seed Bomb hits Sandaconda without worrying about Rocky Helmet, as well as Water-types like Bruxish and Vaporeon. Tough Claws-boosted Fake Out is a great contingency against setup sweepers, allowing Perrserker to get free damage against them by pivoting in and out until Fake Out KOes. Perrserker uses Tera Ghost to turn the tables on Fighting-types like Passimian and Toxicroak, but Tera Fighting or Grass can be used to boost its coverage move. Perrserker's ability to pivot effectively means powerful breakers that appreciate free entry like Bruxish and Clawitzer make for great partners; these two in particular also greatly threaten common Perrserker checks like Sandaconda and Oricorio-F. Perrserker also works effectively with other pivots like Rotom and Scyther to create strong VoltTurn cores.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400664, "username": "Stories"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Copperajah": {"sets": {"Defensive": {}}},
  "Duraludon": {"sets": {"Iron Defense": {}}},
  "Basculegion": {"sets": {"Choice Item": {}, "Assault Vest Pivot": {"description": "<p>The allotted speed EVs allow Basculegion to outspeed base 60 Speed Pokemon such as Magnezone and Incineroar.</p>"}}},
  "Pawmot": {"sets": {"Wallbreaker": {}}},
  "Dachsbun": {"sets": {"Defensive": {}}},
  "Naclstack": {"sets": {"IronPress": {}, "Stealth Rock": {}}},
  "Bellibolt": {"sets": {"Physically Defensive": {}}},
  "Kilowattrel": {"sets": {"Pivot": {}, "Rain Sweeper": {}}},
  "Mabosstiff": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Mabosstiff is fast enough to surprise and revenge kill normally faster threats like Rotom, Haunter, and Choice Scarf Passimian while still being annoying to switch into thanks to Stakeout. Play Rough nails Dark- and Fighting-types like Umbreon, Tera Dark Vaporeon, and Passimian. Psychic Fangs 2HKOes defensive Poison-types like Muk and Qwilfish after some chip and OHKOes Toxicroak. Destiny Bond can remove unsuspecting threats like Scyther as well as setup sweepers like Eelektross, Ursaring, and Jolteon, with Choice Scarf usually letting Mabosstiff act first. Use Destiny Bond carefully, though, as it becomes much easier to play around once it's been revealed. Tera Dark boosts Crunch's power, but Tera Fairy can be used instead to strengthen Play Rough and get rid of Mabosstiff's Fighting and Bug weaknesses. Entry hazard support from Qwilfish and Chansey is very helpful, allowing Mabosstiff to 2HKO walls like Sandaconda on the switch in with Tera Dark Crunch as well as clean with greater ease. Strong wallbreakers like Medicham, Ursaring, and Clawitzer are good at making up for Mabosstiff's low raw damage output. In return, Mabosstiff can potentially create openings for them with Destiny Bond and check nuisances like Indeedee-F and Toxicroak.</p>"
      },
      "Choice Band": {
        "description": "<p>Mabosstiff is an amazing wallbreaker in NU due to its great offensive typing and coverage coupled with Stakeout. Stakeout's boost means even the most reliable Dark-resistant Pokemon like Paldean Tauros and Umbreon struggle to switch in consistently. This often forces Pokemon weak to Crunch like Bruxish, Drifblim, and Farigiraf to Terastallize or give up a KO to a Stakeout boosted attack. Play Rough takes out Dark-resistant foes like Paldean Tauros, Umbreon, and Passimian. Psychic Fangs hits Qwilfish and Fighting-types, like Passimian and Toxicroak, with an added niche of breaking screens. Retaliate is difficult to switch into after a teammate has been KOed. Facade can keep a statused Mabosstiff useable. Tera Dark boosts Crunch's damage output while Tera Fairy powers up Play Rough and grants a resistance to U-Turn and Fighting moves from Passimian. Offensive checks to Mabosstiff, like Scyther and Choice Scarf Passimian, can often gain momentum by forcing it out, so teammates with a Rocky Helmet like Sandaconda and especially Poison Point Qwilfish are helpful. Fast sweepers and late-game cleaners like Choice Scarf Passimian and Quiver Dance Vivillon appreciate Mabosstiff's wallbreaking, as they may otherwise be worn down by the opposing team.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400292, "username": "asa"}, {"user_id": 620268, "username": "skippergamez"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 509790, "username": "Pokeslice"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}]}]}
  },
  "Brambleghast": {"sets": {"Offensive Utility": {}, "Defensive": {}}},
  "Bombirdier": {
    "outdated": true,
    "sets": {
      "Stealth Rock": {
        "description": "<p>Bombirdier is unique in its role compression, offering teams valuable utility in Knock Off, Stealth Rock, and U-turn as well as helping pivot around threats like Zoroark, Rotom, and Appletun thanks to its incredible defensive typing. Knock Off is helpful for keeping Stealth Rock up, punishing Hattrem and Defoggers like Drifblim, Scyther, and Oricorio-F, in addition to pressuring walls like Umbreon and Eelektross. Parting Shot is an alternative to U-turn that gives frailer teammates an easier time switching in, which can be extremely useful on offense teams, though it doesn't deal any damage and unfortunately activates Passimian's Defiant and Lurantis's Contrary. With 72 Speed EVs, Bombirdier outruns and usually beats Modest Clawitzer one-on-one. The Speed investment also allows Bombirdier to outspeed Cacturne and defensive Qwilfish. Tera Ground lets Bombirdier block Volt Switch from Rotom and resist Haunter's Sludge Bomb, which can translate to a surprise OHKO against both foes.</p> <p>Electric-types like Eelektross, Rotom, and Jolteon are among the biggest threats to Bombirdier and should be accounted for when using it. Grass-types like Appletun and Lurantis are very sturdy checks to such Pokemon, while Ground-types like Sandaconda can block Volt Switch. Fighting-types like Toxicroak and Paldean Tauros can easily set up on Bombirdier, so it appreciates having partners like Sandaconda, Drifblim, and Bruxish that can check them. In return, Bombirdier scares out Grass- and Dark-types like Lurantis and Cacturne. Some Pokemon that Bombirdier can check like Mabosstiff, Farigiraf, and Indeedee-F pack super effective coverage for it, so backup checks to them like Qwilfish, Muk, and Chansey are important to have. Additional pivots, such as Passimian and Eelektross, help maintain momentum alongside Bombirdier and love having their switch-ins worn down by Knock Off and Stealth Rock.</p>"
      },
      "Dedicated Lead": {
        "description": "<p>Bombirdier is a great dedicated entry hazard lead due to the incredibly deep utility movepool. Stealth Rock and Taunt are a classic staple for any dedicated lead, quickly setting up hazards while preventing the opponent from removing them or setting up their own. Bombirdier makes great use of its STAB Knock Off to deal a decent chunk of damage before going down while also hindering the longevity of the many Flying-type Defog users like Braviary, Drifblim, and Scyther by removing their Heavy-Duty Boots. Memento is an amazing move for Bombirdier, facilitating the hyper offensive teams it's commonly found on. Memento can block an incoming Defog, but its main purpose is to allow for easy setup of an ally like Lilligant or Hisuian Sneasel against a weakened foe. Rock Blast allows Bombirdier to get the edge on opposing dedicated leads like Bombirdier and Froslass, breaking their Focus Sash and potentially OHKOing them. Tera Ghost simply blocks Rapid Spin, namely from the likes of Cryogonal and Avalugg, both of which also greatly dislike having their Heavy-Duty Boots removed and taking powerful Rock-type attacks. Tera Ground lets Bombirdier potentially block an Electric-type attack; OHKOing Rotom with Knock Off or heavily damaging Eelektross could be crucial for Bombirdier's teammates, but as a dedicated lead, Bombirdier will not be Terastallizing often because it is best reserved for its offensive teammates.</p> <p>As mentioned, Bombirdier is often relegated to hyper offensive teams, which make the most use out of the hazards and momentum generated by it. Fast setup sweepers like Lilligant, Hisuian Sneasel, and Vivillon all greatly appreciate both the entry hazard support and the setup opportunity granted through Memento. Bombirdier can be coupled with a dedicated Froslass lead, which can set Spikes and double up the entry hazards and support for the team, although Froslass is also direct competition for Bombirdier's role. Faster Taunt users like Pyroar and Qwilfish can shut down Bombirdier but must be wary of Bombirdier's attacks. Bombirdier is often dealt with by physical walls like Sandaconda and Qwilfish; using Knock Off to remove their Rocky Helmet and weaken them greatly assists physical sweepers like Hisuian Sneasel, Scyther, and Tauros.</p>"
      },
      "Choice Item": {
        "description": "<p>Bombirdier makes good use of Choice Scarf and Choice Band thanks to its great speed and access to pivoting moves. U-turn breaks Focus Sash and deals some damage, while Parting Shot lets other offensive teammates hit the field more comfortably and avoids contact with the opposing Pokemon. Bombirdier has access to some of the best offensive STAB moves in the game, with the highly coveted Knock Off, high-Base Power Brave Bird, and Rocky Payload-boosted Rock-type moves.</p> <p>Other useful options would be to use Stone Edge as a Rock-type pseudo-STAB attack; it has more power than Rock Blast but comes with more risk due to its lower accuracy. Additionally, Memento is an option over Parting Shot, which would further weaken an enemy to allow for a safer setup turn with a sweeper like Dudunsparce or Veluza. With this set, the Tera Dark is recommended to increase the damage of Knock Off; Tera Rock can also be considered, but most of the time, if you want to deal damage, Knock Off is more reliable. Brave Bird, the second STAB move, is another spammable option that helps Bombirdier deal with Fighting-type Pokemon that can take Dark and Rock moves, like Paldean Tauros and Toxicroak. With Choice Band, Bombirdier can deal some real damage off its great Attack stat.</p> <p>As for teammates, we have some options. Sandaconda its a good option because of its Electric immunity, and Parting Shot can help it boost up safety. Setup sweepers like Bruxish, Lilligant, and Farigiraf greatly benefit from Bombirdier's Parting Shot and Knock Off weakening the opposition. To continue the pivot partners, Scyther and Choice Scarf Rotom make a solid VoltTurn core with Bombirdier. Due to its Stealth Rock weakness, Bombirdier appreciates entry hazard removal from Braviary and Cryogonal.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400292, "username": "asa"}, {"user_id": 400664, "username": "Stories"}, {"user_id": 616408, "username": "DanGaetta"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 400664, "username": "Stories"}, {"user_id": 509790, "username": "Pokeslice"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Orthworm": {"sets": {"Coil": {}, "Utility": {}}},
  "Flamigo": {"sets": {"Choice Item": {}}},
  "Cetitan": {"sets": {"Belly Drum": {}}},
  "Veluza": {
    "overview": "<p>Fillet Away in conjunction with Sharpness-boosted STAB moves turns Veluza into a terrifying sweeper capable of shredding teams with only a single turn of setup. Veluza is an excellent choice for hyper offense teams, where it acts as a deadly wallbreaker and late-game cleaner. Veluza can easily find setup opportunities against passive foes, such as Vaporeon, and Choice-locked foes, such as a Passimian that just used Close Combat. Although Veluza is extremely powerful after setting up, it may not always get the chance to do so due to its frailty. Veluza's defensive typing is also relatively poor; it is weak to common attacks, including pivoting moves like U-turn from Scyther and Volt Switch from Rotom. Furthermore, Veluza's speed and firepower are rather mediocre prior to setup.</p>",
    "comments": "<h3>Other Options</h3> <p>Tera Ground enables Veluza to turn the tables on a Jolteon or Rotom trying to grab momentum with Volt Switch. Tera Electric is another option that lets Veluza avoid paralysis from Chansey and Sandaconda while also turning its Electric weakness into a resistance.</p> <h3>Checks and Counters</h3> <p><strong>Offensive Pressure</strong>: Veluza's mediocre bulk and need to sacrifice half of its health to set up means that sufficient offensive pressure can prevent it from taking over a game.</p> <p><strong>U-turn and Volt Switch</strong>: Veluza's poor defensive typing renders it weak to both U-turn and Volt Switch, which means that foes such as Jolteon and Scyther can easily gain momentum on or KO it.</p> <p><strong>Cacturne</strong>: Cacturne is immune to Psycho Cut and Aqua Cutter, enabling it to completely wall any Veluza not running Tera Fairy Tera Blast.</p>",
    "sets": {
      "Physical Sweeper": {
        "description": "<h4>Set Details</h4> <p>Fillet Away is one of the best setup moves in the game, doubling Veluza's Speed and power at the cost of half its health. Aqua Cutter and Psycho Cut are both boosted by Sharpness, and after a Fillet Away will OHKO many neutral targets, such as Rotom, Mabosstiff, and Clawitzer. For Veluza's last move, Substitute can be used to ease prediction, facilitate setup, and avoid Sucker Punch. Aqua Jet can also be used to revenge kill weakened foes and, after setup, outprioritize other priority moves such as Lycanroc's Accelerock. Tera Blast is an option with Tera Fairy to blast past Cacturne, which otherwise completely walls it. Otherwise, Tera Water is good choice to further boost the power of Veluza's Aqua Cutter, giving it a guaranteed OHKO on specially defensive Umbreon after Stealth Rock. Sitrus Berry helps Veluza set up sucessfully, and 4 HP EVs ensure that it will activate after a Fillet Away. An Adamant nature is preferred to maximize Veluza's damage output, but a Jolly nature enables Veluza to outspeed Timid Farigiraf prior to setup and Choice Scarf Zoroark post-setup.</p> <p>Veluza's incredible Speed and power after setup make it an excellent choice for hyper offense teams. Entry hazard support from Lycanroc and Qwilfish can help chip Veluza's checks into range of its attacks. Bulk Up Paldean Tauros is a great partner for Veluza, as it can easily switch into and set up against Pokemon that give Veluza trouble, such as Cacturne. In return, Veluza can set up on Pokemon used to revenge kill or force out Paldean Tauros, like a Choice Scarf Indeedee-F locked into Psychic or Psyshock. Paldean Tauros also helps Veluza break past shared walls in Vaporeon and Tera Water Sandaconda, enabling one of them to sweep late-game. Other good offensive partners to pair with Veluza include Jolteon and Quiver Dance Vivillon. Jolteon provides an Electric immunity for the team while also giving Veluza points of entry through Volt Switch. Vivillon threatens Cacturne, and its Sleep Powder may cripple one of Veluza's checks, allowing it to sweep. Indeedee-F is another good teammate for Veluza, as Psychic Terrain shields Veluza from priority attacks, such as Sucker Punch, while boosting the power of Psycho Cut to absurd levels.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272785, "username": "nimzowitsch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 423085, "username": "Deezcastforms"}]}]}
  },
  "Tatsugiri": {"sets": {"Nasty Plot": {}, "Choice Item": {}}},
  "Farigiraf": {
    "outdated": true,
    "overview": "<p>Farigiraf is one of the most threatening Stored Power users in the tier. It has more durability than Veluza and can boost Speed unlike Mesprit and Blissey, giving it more flexibility in how it approaches a sweep. Farigiraf's Cud Chew can grant it unique setup opportunities, as Sitrus Berry turns many 2HKOs into 3HKOs. However, Farigiraf usually needs at least 2 turns to start posing a serious threat; Knock Off from Bombirdier, Haze from Cryogonal and Articuno, and Encore from Sableye can easily disrupt its setup, while simple overwhelming offensive pressure can stop it from getting out of hand.</p>",
    "sets": {
      "Double Dance": {
        "description": "<p>Farigiraf usually wants to use Agility first followed by its other boosting move before it starts outputting damage. Sitrus Berry and Cud Chew allow Farigiraf to shrug off a majority of neutral attacks in the tier, greatly improving its survivability to grant Farigiraf the two turns of setup that it needs. The other alternative to Sitrus Berry is Cud Chew + Lum Berry, giving Farigiraf status immunity for 2 turns, which could allow Farigiraf to set up on the likes of Glare Sandaconda and Toxic or Thunder Wave Qwilfish. The Speed EVs let Farigiraf outspeed neutral-natured Clawitzer &amp; positive Speed-natured Cacturne and Ursaring at +0 while outrunning Choice Scarf Bruxish after an Agility, with the rest of the EVs being invested into Special Attack for maximum damage output. Dazzling Gleam is often preferred over Tera Blast for the ability to hit Dark-types without needing to Terastallize. Tera Fairy is very useful for its Dragon Tail immunity against Eelektross and Appletun, and turns Farigiraf's weaknesses to Dark and Bug into resistances, and also boosts Dazzling Gleam. Sap Sipper can also complement Tera Fairy to completely blank Appletun's dual STAB combination, with Cacturne and Lurantis being bonus setup targets. Armor Tail can be considered to stop priority moves from Pokemon such as Toxicroak and Bruxish while turning Sableye into setup fodder. Farigiraf can also use Calm Mind and a bulkier spread to set up more reliably on weaker special attackers such as Abomasnow, Raichu, and non-Trick Rotom. With Tera Steel, Farigiraf is able to better take on common Haze users like Articuno, Cryogonal, and Hisuian Qwilfish, hitting the former two super effectively with Tera Blast and gaining an immunity to the latter's Poison-type attacks.</p> <p>Farigiraf's low Speed often mandates using Agility first and also means it generally cannot threaten the opponent until turn 3, as it takes two turns to set up Agility followed by Nasty Plot. Strong teammates that can apply quick and immediate pressure on the opponent make for good partners, such as Tauros, Hisuian Sneasel, and Rotom. Pokemon that can also handle Farigiraf's checks and counters, namely Dark-types and Haze users, are especially appreciated. Nasty Plot + Taunt Houndoom and Trick Rotom or Haunter can bait out defensive responses such as Umbreon, Hisuian Qwilfish, and Blissey in order to cripple them. A double Psychic core involving Farigiraf and either Bruxish or Mesprit can also work to wear down their shared checks and prevent them from answering one or the other. Rest Sandaconda can shrug off attacks from Umbreon and Hisuian Qwilfish while even smacking the latter with Earthquake. Hisuian Sneasel and Toxicroak can threaten Umbreon and Hisuian Qwilfish, whereas Magneton, Pyroar, Houndoom, and Perrserker can switch into Haze Cryogonal and Articuno to apply offensive pressure. Scyther, Bombirdier, Magneton, and Perrserker can force out the opponent's less defensive Pokemon and pivot to give Farigiraf a window of opportunity to set up, with Bombirdier being particularly notable due to its access to Parting Shot and Memento. Abomasnow can provide Aurora Veil support for Farigiraf to make setting up easier.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 169054, "username": "Punchshroom"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}, {"user_id": 595639, "username": "plznostep"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}]}
  },
  "Dudunsparce": {"sets": {"Coil": {}, "Calm Mind": {}}},
  "Scream Tail": {"sets": {"Utility": {}}},
  "Brute Bonnet": {"sets": {"Tank": {"description": "<p>Synthesis can be used instead of extra coverage on Covert Cloak sets.</p>"}}},
  "Iron Thorns": {"sets": {"Dragon Dance": {}}},
  "Munkidori": {"sets": {"Pivot": {}, "Choice Scarf": {}}}
}