{
  "Charizard": {"sets": {"All-Out Attacker": {}, "Belly Drum": {}}},
  "Sandslash": {"sets": {"Rapid Spin": {}, "Swords Dance": {}}},
  "Venomoth": {"outdated": true, "sets": {"Offensive Quiver Dance": {}, "Quiver Dance + Disable": {}}},
  "Dugtrio-Alola": {"outdated": true, "sets": {"Fast Attacker": {}}},
  "Persian-Alola": {"outdated": true, "sets": {"Defensive Pivot": {}, "Choice Scarf": {}, "Nasty Plot": {}}},
  "Primeape": {"outdated": true, "sets": {"Offensive Stealth Rock": {}, "Bulk Up": {}, "Suicide Lead": {}}},
  "Poliwrath": {"outdated": true, "sets": {"Bulk Up": {}}},
  "Victreebel": {"sets": {"Sun Sweeper": {}}},
  "Magneton": {"sets": {"Offensive Pivot": {}, "Choice Specs": {}, "Choice Scarf": {}}},
  "Dodrio": {"sets": {"Swords Dance": {}}},
  "Muk": {"outdated": true, "sets": {"Defensive": {}, "Assault Vest": {}}},
  "Electrode-Hisui": {"sets": {"Offensive Pivot": {}}},
  "Exeggutor-Alola": {"sets": {"Choice Specs": {}, "Offensive Trick Room": {}, "Bulky Attacker": {}}},
  "Hitmonlee": {"sets": {"Terrain Sweeper": {}}},
  "Hitmonchan": {"sets": {"Bulky Rapid Spin": {}, "Swords Dance": {}}},
  "Weezing": {"sets": {"Physical Wall": {}}},
  "Rhydon": {"sets": {"Bulky Stealth Rock": {}, "Swords Dance": {}}},
  "Tauros": {"outdated": true, "sets": {"All-Out Attacker": {}}},
  "Jolteon": {
    "overview": "<p>With Speed only eclipsed by Hisuian Electrode backed up with good power, Jolteon establishes itself as a premier fast pivot. Its fast Volt Switch makes it an easy candidate on VoltTurn teams, and its adequate coverage with Alluring Voice and Shadow Ball discourages specially bulky Pokemon like Virizion and Mesprit from switching into it. Jolteon's decent set variety means it can be a deadly Calm Mind sweeper or a dangerous wallbreaker with Choice Specs. Jolteon's defensive utility with Volt Absorb and passable special bulk also makes it a situational switch-in to special attackers like Articuno, Cramorant, and Rotom. However, the lacking power of its coverage moves causes it to struggle quite hard against specially defensive Pokemon like Snorlax and Dudunsparce as well as Ground-types like Rhydon. Said Ground-types make Jolteon quite reliant on Terastalization to bypass its checks, which causes it to demand for more team support. Jolteon also faces competition from Hisuian Electrode, which boasts higher Speed and an additional Grass subtyping that allow it to beat Ground-types instead of being walled by them.</p>",
    "sets": {
      "Calm Mind": {
        "description": "<p>After one Calm Mind boost, Jolteon's Thunderbolt 2HKOes unboosted Orthworm. Volt Switch maintains momentum and allows it to escape bad matchups like Snorlax, Regirock, and Virizion. Jolteon's fourth moveslot is flexible and can depend on the team's need for coverage. Alluring Voice discourages certain Grass-types like Virizion and Hisuian Decidueye from switching in and also targets Dragon-types like Dipplin and Alolan Exeggutor that would be comfortable switching into its Electric-type STAB moves. It also hits Tera Dragon users like Sandaconda and Regirock, walls that would otherwise switch into Jolteon without too much trouble. Shadow Ball hits Psychic-types like Uxie and Mesprit harder than any of its STAB moves do while also hitting Ghost-types like Palossand and Mismagius quite hard. While Jolteon's Tera type is flexible, Tera Blast Ice synergizes the best when striking back at its overall checks, hitting Ground-types like Sandaconda and Rhydon and Dragon-types like Alolan Exeggutor and Dipplin. However, this comes at the cost of using up the Terastallization slot. Tera Fairy and Tera Ghost, on the other hand, strengthen Alluring Voice and Shadow Ball, respectively, and make Jolteon slightly better at taking Fighting-type attacks from Pokemon like Passimian and Virizion. Volt Absorb allows Jolteon to switch in against predicted Electric-type attacks from Pokemon like Rotom and opposing Jolteon.</p> <p>Jolteon's blistering Speed makes it a prime candidate for VoltTurn teams, pairing well with pivots like Mesprit, Passimian, and Hisuian Decidueye. In addition to pivoting, they all can provide utility with Knock Off. Knock Off support works especially well with Jolteon, as its Volt Switch is able to put more pressure on Pokemon reliant on items like Leftovers and Heavy-Duty Boots for longevity, such as walls like Snorlax and Hisuian Decidueye. Wallbreakers like Bruxish and Glastrier benefit from Jolteon's Volt Switch and can capitalize on its checks. Grass- and Water-types like Shaymin, Virizion, Qwilfish, and Poliwrath can switch in and force out the Ground-types Jolteon struggles against and delay its need to Terastallize. Similarly, checks to Grass-types like Qwilfish formes and Articuno can similarly benefit Jolteon either through entry hazard and status support or through pivoting, respectively, allowing it to Terastallize as a later time. Hisuian Electrode stands out as Jolteon's worst matchup, possessing a quadruple resistance to Jolteon's STAB moves, higher Speed, and an immunity to Alluring Voice; checks to Hisuian Electrode like Hisuian Decidueye and Alolan Exegutor can blank its Volt Switch and threaten the opposition with their powerful STAB moves. Deterrents to Snorlax like Regirock and Toxicroak are valuable for pressuring it to Terastalize sooner, which can be exploited by teammates like Qwilfish formes and Hisuian Sneasel.</p>"
      },
      "Choice Specs": {}
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 601970, "username": "sleid"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Snorlax": {
    "overview": "<p>Continuing its dramatic fall from grace from the higher tiers, Snorlax now establishes itself as a dominant force in ZU with its Curse sets. Thanks to its overall outstanding bulk and offensive versatility, Snorlax is quite difficult to stop once it gets stat boosts, even when factoring in Rest turns. Snorlax isn't just limited to late-game cleaning, either — it can also use said bulk and Thick Fat to function as a reliable sponge to common special attackers like the Oricorio formes, Jolteon, Typhlosion, and Hisuian Electrode while also being a good paralysis spreader with Body Slam. Walls comfortable switching into Body Slam also have to be aware of Heat Crash, limiting the consistency of its switch-ins. However, its low Speed and reliance on Rest or Protect for recovery make it quite easy to pressure it into passivity and cost momentum for its team. Snorlax's lack of resistances also makes it easy for Fighting-types like Virizion and Passimian to pressure it to Terastallize earlier than expected, which forces careful play to ensure a successful sweep.</p>",
    "comments": "<h3>Other Options</h3> <p>Snorlax's coverage move is quite flexible -— Crunch hits Ghost-types like Palossand and Drifblim harder, while Heavy Slam more heavily pressures Tera Fairy setup sweepers like Mesprit and Dudunsparce. However, Crunch is usually noticeably weaker compared to Heat Crash, and Heavy Slam worsens its matchup against Steel-types and Tera Steel Pokemon and is still walled by Rock-types. Tera Steel solidifies the matchup against Mesprit and Alcremie and empowers Heavy Slam, though this fails to address its weakness to Fighting-types and worsens its matchup against Ground-types like Rhydon and Sandaconda. Sleep Talk over Curse makes Snorlax more consistent as a special wall at the cost of its late-game potential. Heavy-Duty Boots is a notable alternative to Leftovers, allowing Snorlax to fare better against entry hazards and easing the need for hazard removal. However, Snorlax usually appreciates the passive recovery from Leftovers better. Offensive sets like Choice Band are usable to surprise the opposition but are held back by Snorlax's low Speed and giving up quite a lot of its bulk.</p> <h3>Checks and Counters</h3> <p><strong>Rock-types</strong>: Rock-types like Hisuian Avalugg, Regirock, and Rhydon are not particularly bothered by even a boosted Snorlax and can set up Stealth Rock or pressure it with repeated uses of Body Press, with the latter two even using it as setup fodder.</p> <p><strong>Fighting-types and Fighting-type Coverage</strong>: Fighting-types like Hisuian Decidueye, Virizion, and Passimian can threaten huge damage on Snorlax with their Fighting-type STAB moves, though none of them particularly enjoy it Terastallizing to Fairy. Toxicroak can even threaten Snorlax even when the latter Terastallizes with its Poison-type STAB moves. Pokemon with Fighting-type coverage like Clawitzer, Glasterier, and Braviary can also pressure it into Terastallizing sooner than expected.</p> <p><strong>Strong Wallbreakers</strong>: Strong physical wallbreakers like Glastrier, Braviary, and Bruxish can strike at Snorlax's initially lower physical bulk and cause it to use Rest sooner than expected; the latter can also pivot out with Flip Turn against predicted switch-ins.</p> <p><strong>Coil Sweepers</strong>: Coil sweepers like Orthworm and Dudunsparce can consistently keep up and eventually overpower Snorlax with their Steel typing and Dragon Tail, respectively, though the latter would need to PP stall a Terastallized Snorlax to win. While Sandaconda cannot outright beat Snorlax without critical hits, it can outlast Snorlax by PP stalling and can brush off status with Shed Skin.</p> <p><strong>Item Removal</strong>: Snorlax's Leftovers is an essential part for it to wall and sweep teams; Knock Off users like Bombirdier, Thwackey, and Dodrio endanger its chances of sweeping and follow up with strong STAB moves in their arsenals. Trick users like Mesprit, Rotom, and Mismagius can outright neuter Snorlax's sweeping potential with a Choice item, forcing it out.</p> <p><strong>Residual Damage</strong>: Snorlax hates taking residual damage, with common entry hazard setters like Orthworm, Qwilfish, and Sandaconda making it more difficult for Snorlax to sweep; the latter two can also rack up additional chip damage with Rocky Helmet. Status like burn and poison also forces Snorlax to use Rest, causing it to become more passive. Snorlax also can quickly get worn down by VoltTurn users like Mesprit, Hisuian Electrode, and Jolteon as a switch-in to them, risking losing momentum against them.</p>",
    "sets": {
      "CurseLax": {
        "description": "<p>STAB Body Slam not only functions as Snorlax's primary attacking move but also threatens incoming switch-ins like Qwilfish formes and Alcremie with the chance of paralysis. Heat Crash is a powerful coverage move that hits both Ghost-types like Rotom, Mismagius, and Oricorio-G that would freely switch into Body Slam and Tera Steel users like Hisuian Decidueye and non-Acid Armor Alcremie. Rest fully restores Snorlax's health and removes existing status conditions at the expense of making it passive for two turns. Alternatively, Protect scouts for Choice-locked foes like Passimian and Rotom and racks up additional Leftovers recovery at the cost of being unable to remove status. Tera Fairy turns its Fighting weakness into a resistance and provides an immunity to Dragon-type moves from foes like Dipplin and Alolan Exeggutor. Tera Fairy Snorlax also benefits from Poison- and Steel-type moves being uncommon. Thick Fat strengthens its defensive profile by making it a consistent switch-in to Fire- and Ice-types like Typhlosion, Charizard, and Frosmoth.</p> <p>Snorlax excels mid- or late-game as a setup sweeper that can take advantage of Fighting-types and wallbreakers being worn down. Physical walls like Qwilfish, Hisuian Decidueye, and Sandaconda shore up Snorlax's lower physical bulk and can provide entry hazards to wear down switch-ins like opposing Qwilfish and Dudunsparce; they are also excellent as Knock Off absorbers to preserve Snorlax's Leftovers. Choice item wallbreakers like Bruxish and Jolteon can simulataneously provide wallbreaking and pivoting support for Snorlax to enter the field safely; they can help discourage physical walls like Palossand and Qwilfish formes from freely switching in. Poison-types like Qwilfish and Weezing can help with Snorlax's weakness to Fighting-types and provide additional utility. Rock-types like Regirock, Rhydon, and Hisuian Avalugg can easily ward off anything Snorlax can do, so checks to them like Virizion, Hisuian Decidueye, and Weezing are helpful to consistently force them out. Palossand stands out, as it can not only check the aformentioned Rock-types but also Fighting-types thanks to its excellent bulk and typing. Due to Snorlax's utility as a special wall and susceptibility to residual damage, Defoggers like Hisuian Decidueye and Cramorant are critical in preventing Snorlax from being worn down by hazards; the lack of hazards make it far more consistent walling foes and sweeping throughout a game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 435539, "username": "BloodAce"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Articuno": {"sets": {"Special Wall": {}}},
  "Typhlosion": {"sets": {"Choice Scarf": {}, "Choice Specs": {}}},
  "Bellossom": {"outdated": true, "sets": {"Bulky Quiver Dance": {}}},
  "Qwilfish": {"sets": {"Defensive Pivot": {}, "Choice Scarf": {}, "Swords Dance": {}}},
  "Qwilfish-Hisui": {"sets": {"Specially Defensive": {}, "Swords Dance": {}}},
  "Sneasel": {"outdated": true, "sets": {"Fast Attacker": {}, "Choice Band": {}}},
  "Sneasel-Hisui": {"sets": {"Swords Dance": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Piloswine": {"outdated": true, "sets": {"Stealth Rock": {}, "Choice Band": {}}},
  "Porygon2": {"sets": {"Specially Defensive": {}}},
  "Smeargle": {"sets": {"Suicide Lead": {}}},
  "Medicham": {"outdated": true, "sets": {"Choice Scarf": {}, "Choice Band": {}, "All-Out Attacker": {}}},
  "Whiscash": {"outdated": true, "sets": {"Wall": {}}},
  "Regirock": {"sets": {"Physical Wall": {}}},
  "Bastiodon": {"sets": {"IronPress": {}}},
  "Floatzel": {"sets": {"Choice Band": {}, "Bulk Up": {}, "Choice Scarf": {}}},
  "Drifblim": {"sets": {"Calm Mind": {}, "Defog": {}}},
  "Mismagius": {"sets": {"Choice Specs": {}, "Nasty Plot": {}, "Calm Mind": {}}},
  "Spiritomb": {"sets": {"Physical Wall": {}}},
  "Toxicroak": {"outdated": true, "sets": {"Swords Dance": {}, "Nasty Plot": {}}},
  "Abomasnow": {"outdated": true, "sets": {"Aurora Veil": {}, "Choice Specs": {}}},
  "Magmortar": {"outdated": true, "sets": {"All-Out Attacker": {}}},
  "Rotom": {"sets": {"Choice Scarf": {}, "Utility": {}, "Nasty Plot": {}}},
  "Rotom-Frost": {"outdated": true, "sets": {"Nasty Plot": {}}},
  "Mesprit": {"sets": {"Choice Scarf": {}, "Substitute + Nasty Plot": {}, "Choice Specs": {}, "Defensive Pivot": {}}},
  "Shaymin": {"sets": {"Offensive Utility": {}, "Choice Scarf": {}}},
  "Gurdurr": {"outdated": true, "sets": {"Bulky Attacker": {}}},
  "Lilligant": {"sets": {"Sun Sweeper": {}}},
  "Eelektross": {"outdated": true, "sets": {"Defensive Pivot": {}, "Coil": {}}},
  "Braviary": {"sets": {"Bulk Up": {}}},
  "Virizion": {"sets": {"Swords Dance": {}, "Calm Mind": {}}},
  "Pyroar": {"sets": {"Special Attacker": {}}},
  "Malamar": {"sets": {"RestTalk": {}, "Choice Scarf": {}}},
  "Clawitzer": {"sets": {"Choice Specs": {}}},
  "Avalugg-Hisui": {"outdated": true, "sets": {"Suicide Lead": {}, "Offensive Utility": {}}},
  "Decidueye-Hisui": {"sets": {"Defog": {}, "Swords Dance": {}}},
  "Vikavolt": {"sets": {"Sticky Web Pivot": {}}},
  "Oricorio": {"sets": {"Offensive Quiver Dance": {}, "Bulky Quiver Dance": {}}},
  "Oricorio-Pa'u": {"outdated": true, "sets": {"Offensive Quiver Dance": {}, "Bulky Quiver Dance": {}}},
  "Oricorio-Sensu": {"sets": {"Offensive Quiver Dance": {}, "Bulky Quiver Dance": {}}},
  "Lurantis": {"outdated": true, "sets": {"Defog": {}}},
  "Passimian": {"sets": {"Choice Scarf": {}}},
  "Palossand": {"sets": {"Physical Wall": {}}},
  "Bruxish": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Choice Scarf Bruxish serves as an excellent revenge killer and cleaner that fits on many teams. Its high Speed allows it to outpace slower Choice Scarfer users like Passimian and naturally fast Pokemon like Jolteon. High-power STAB moves in Wave Crash and Psychic Fangs let Bruxish be threatening at any point in the game, as the combination is nearly unresisted. Psychic Fangs is easily more spammable over Wave Crash, as it doesn't have any recoil and hits Wave Crash-resistant Pokemon like Virizion and Qwilfish. Flip Turn lets Bruxish pivot out of unfavorable matchups and bring in its teammates. Crunch lets it hurt other Psychic-types such as Mesprit and opposing Bruxish. Aqua Jet allows Bruxish to pick off faster Choice Scarf users and unburden sweepers like Typhloshion and Grafaiai. Strong Jaw is necessary to make the otherwise low-Base Power Psychic Fangs and Crunch powerful, although Dazzling can be used to block Sucker Punch from the likes of Shiftry and Toxicroak. Tera Water powers Wave Crash to absurd levels, while Tera Dark gives Bruxish a STAB boost on Crunch.</p> <p>Bruxish best fits on balance and offensive teams that need speed control. It makes a great teammate for Grass-types like Whimsicott and Hisuian Decidueye, as it checks the Fire and Poison-types that threaten them. Physical sweepers like Swords Dance Virizion appreciate Bruxish softening up physical walls early-game, and Bruxish can clean up the weakened teams after they break through them. Bruxish's low bulk and tendency to wear itself down with recoil and entry hazards makes it difficult to get on the field, so pivots like Passimian and Jolteon can help Bruxish alleviate this weakness as well as form a VoltTurn core with it. Entry hazard setters like Qwilfish and Sandslash help wear down Bruxish's checks such as Orthworm. Hazard removers such as the aforementioned Sandslash can also clear hazards to help with Bruxish's longevity.</p>"
      },
      "Choice Band": {},
      "Swords Dance": {}
    },
    "credits": {"writtenBy": [{"user_id": 626095, "username": "sinnabyss"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 543866, "username": "5Dots"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Appletun": {"outdated": true, "sets": {"Special Wall": {}, "Iron Defense": {}}},
  "Sandaconda": {
    "sets": {
      "Physical Wall": {},
      "Coil": {
        "description": "<p>Sandaconda serves as a deadly late-game threat with the powerful combination of Coil, Rest, and Shed Skin. Earthquake hits most of the tier for at least neutral damage, while Sandaconda's other attacking move hits Pokemon that are immune to Earthquake like Bombirdier, Oricorio formes, and Braviary. Scale Shot allows Sandaconda to boost its Speed, outspeeding the entire unboosted metagame except for Hisuian Electrode at +1 and outpacing common Choice Scarf users like Typhlosion at +2. Alternatively, Stone Edge doesn't drop Sandaconda's Defense and has more immediate potential to threaten Flying-types like Oricorio formes, Bombirdier, and Charizard. Rest acts as excellent recovery to keep Sandaconda healthy and combines well with Shed Skin to make it more reliable and help it serve as a wall in early- and mid-game scenarios, especially when combined with Tera Dragon to flip matchups on common Water- and Grass-types like Swords Dance Qwilfish and Hisuian Decidueye. Coil Sandaconda can opt to run less Speed in exchange for more bulk, with 224 Speed EVs and a neutral nature being enough to outpace base 110 Speed Pokemon at +1 and still outpace Choice Scarf Bruxish at +2; however, running these Speed EVs means it no longer outspeeds common Chlorophyll sweepers like Victreebel and faster Choice Scarf users like Mismagius and Floatzel at +2. Sandaconda can also opt to run Attack investment instead of HP, but this makes it more difficult to wall the foes it's tasked with setting up on late-game.</p> <p>Levitate users such as Mesprit and Mismagius serve as potentially problematic Pokemon, since they are immune to Earthquake and can become fully immune to Sandaconda's moves, if it's running Scale Shot, with Tera Fairy, so specially bulky teammates like Hisuian Qwilfish and Snorlax as well as faster teammates like Hisuian Electrode can be extremely helpful to counteract them. Orthworm poses similar issues due to Earth Eater and Iron Defense, so wallbreakers that threaten it like Charizard and Typhlosion are invaluable as teammates. These two as well as Bombirdier and Glastrier also threaten Grass-types, which cause problems for Sandaconda pre-Terastallization. Water-types pose similar issues while also often carrying super effective coverage for Terastallized Sandaconda, so teammates like Snorlax, Poliwrath, and Virizion benefit it greatly. In return for all of these potential partners' help, Sandaconda turns many physical attackers into setup fodder. Some common examples of Pokemon completely walled by it late-game include Passimian, Hisuian Qwilfish, and Rhydon; after Terastallization, this list expands to include other offensive threats like Bruxish, Qwilfish, and Hisuian Decidueye.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 598623, "username": "BaitWiz"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 369076, "username": "Tuthur"}, {"user_id": 601970, "username": "sleid"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Cramorant": {"sets": {"Defog": {}}},
  "Frosmoth": {"sets": {"Quiver Dance": {}}},
  "Morpeko": {"outdated": true, "sets": {"Offensive Utility": {}, "Choice Band": {}, "Choice Scarf": {}}},
  "Glastrier": {"sets": {"Swords Dance": {}, "Choice Band": {}}},
  "Arboliva": {"outdated": true, "sets": {"Choice Specs": {}, "Bulky Attacker": {}, "Physically Defensive": {}}},
  "Naclstack": {"outdated": true, "sets": {"Stealth Rock": {}, "IronPress": {}}},
  "Toedscruel": {"outdated": true, "sets": {"Offensive Rapid Spin": {}}},
  "Orthworm": {"sets": {"Defensive": {}, "Coil": {}}},
  "Veluza": {"sets": {"Fillet Away Sweeper": {}}},
  "Farigiraf": {"sets": {"Double Dance": {}}},
  "Dudunsparce": {"sets": {"Coil": {}, "Calm Mind": {}, "Specially Defensive": {}}},
  "Dipplin": {"sets": {"Growth": {}}}
}