{
  "Charmander": {"sets": [{"name": "Sun Wallbreaker"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Flou", "user_id": 605215}]}]}},
  "Diglett-Alola": {"sets": [{"name": "Stealth Rock"}]},
  "Meowth": {"sets": [{"name": "Revenge Killer"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "ZeStinky", "user_id": 597006}]}]}},
  "Psyduck": {"sets": [{"name": "Rain Wallbreaker"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Altariel von Sweep", "user_id": 330191}]}]}},
  "Mankey": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Mankey is one of the most powerful Choice Scarf users in Little Cup thanks to its high Speed, which allows it to outpace or tie with the entire unboosted metagame. This allows Mankey to beat other common Choice Scarf users such as Magnemite, Mudbray, and Gothita. U-turn allows it to greatly capitalize on the switches it forces. Earthquake is a powerful coverage move that hits Mareanie, Glimmet, and Voltorb. Assurance is used to deal as much damage as possible to Ghost-types, OHKOing Eviolite variants on the switch if Stealth Rock is up, while Ice Punch OHKOes Toedscool and threatens Flying-types like Wattrel. Stone Edge is an uncommon option to hit Larvesta and Flying-types. Vital Spirit can be helpful on teams lacking a Grass-type, as it provides a switch-in to Toedscool's Spore, while Defiant is very useful in matchups against Pokemon such as Sticky Web Surskit and Parting Shot Shroodle, as the Attack boosts make Mankey nigh unwallable. Tera Fighting allows Mankey to hit as hard as possible with Close Combat in situations where an unboosted hit is insufficient. Some of Mankey's best teammates include Toedscool to switch in on Ghost-types and remove entry hazards, which can hamper Mankey's pivoting abilities, and either Gothita or Diglett, which can remove the bulky Poison-types like Mareanie and Foongus that give Mankey trouble. Mankey also performs well as part of a VoltTurn core with Pokemon like Volt Switch Voltorb and U-turn Zorua.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Drifting", "user_id": 342456}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}, {"username": "Éric", "user_id": 440139}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Slowpoke": {"sets": [{"name": "Defensive"}]},
  "Magnemite": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Magnemite is a powerful Choice Scarf user, capable of capitalizing on switches it forces with the combination of its high Special Attack, STAB Volt Switch, and Analytic. Tera Blast in combination with Tera Ice gives Magnemite STAB on the BoltBeam combination, letting it hit common checks such as Toedscool, Mudbray, and Wattrel for super effective damage. Alternatively, Tera Steel makes Flash Cannon a much more spammable attack and turns Steel Beam into a nuke. A Modest nature is preferred to improve damage rolls, especially with an Analytic boost; a Timid nature is an alternative to ensure Magnemite outspeeds Speed-boosted foes like Choice Scarf Gothita and Quaxly after a Rapid Spin. Ground-types like opposing Toedscool, Alolan Diglett, and Mudbray are the biggest threats to Magnemite; Pokemon like Grookey and Toedscool that can check Ground-types make good teammates. Magnemite can form a powerful VoltTurn core with other pivot move users such as Hisuian Voltorb and Nymble. Frail attackers such as Wingull appreciate Magnemite bringing them in safely with Volt Switch.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "gali", "user_id": 107567}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "aurora", "user_id": 109385}]}]}
  },
  "Grimer-Alola": {"sets": [{"name": "Tank"}]},
  "Shellder": {
    "sets": [
      {
        "name": "Physical Shell Smash",
        "description": "<p>Shellder is a powerful sweeper with access to Shell Smash, especially when supported by its ability Skill Link. Shellder’s base 100 Defense gives it plenty of opportunities to set up versus the tier's physical attackers such as Pawniard, Mudbray, and Alolan Grimer. Rock Blast is a fantastic compliment to Liquidation, allowing Shellder to break through Water resistances such as Foongus, and Hisuian Voltorb.Protect is useful for scouting foes' Tera types while blocking priority moves such as Sucker Punch and First Impression. Tera Water boosts its STAB damage even further, demolishing neutral targets that would otherwise take a hit such as Crabrawler and Pawniard. Tera Rock guarantees KOs on Water resistances such as Foongus and Hisuian Voltorb. Tera Dark doesn’t have the benefits of added power but instead blocks Prankster Encore from Shroodle and improves Shellder’s defensive profile by resisting Sucker Punch.</p> <p>Glimmet can greatly facilitate a sweep with its ability to set entry hazards. Alolan Grimer helps deal with Grass-types that deter Shellder's sweep and weakens the opposing team by using Knock Off. Grookey's Grassy Terrain provides Shellder with some passive recovery, and Grookey can pivot in Shellder via U-turn in addition to also having access to Knock Off. Choice Scarf Gothita can trap Pokemon via Shadow Tag to help facilitate a sweep, removing key pieces of the opposing team or using Trick to trap them using a non-helpful move. Memento support works wonderfully from teammates such as Drifloon, which can also use Will-O-Wisp to provide more Shell Smash opportunities, or Alolan Diglett, which can also set up Stealth Rock.</p> "
      },
      {"name": "Special Shell Smash"}
    ],
    "credits": {"writtenBy": [{"username": "TheShoddyStrawman", "user_id": 585065}], "teams": [{"name": "Quality checked by", "members": [{"username": "Éric", "user_id": 440139}, {"username": "Hacker", "user_id": 387847}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}, {"name": "Submitted by", "members": [{"username": "RedPee428", "user_id": 611652}, {"username": "Kaboom", "user_id": 300935}]}]}
  },
  "Voltorb": {
    "sets": [
      {
        "name": "Tera Pivot",
        "description": "<p>Voltorb's elite Speed tier and STAB Volt Switch make it one of Little Cup's premier pivots, as well as an excellent offensive check to fast threats like Wingull and Crabrawler. Volt Switch lets Voltorb deal solid damage while preserving itself and capitalizing on the switches it forces with its Speed. Thunderbolt deals a stronger blow, invaluable against bulky Water-types like Mareanie, Quaxly, and Shellos, and is valuable for cleaning up weakened fast threats. Tera Blast, once Voltorb has Terastallized, gives it the heralded BoltBeam coverage and turns the tables on would-be checks like Toedscool, Mudbray, Diglett, and Wattrel. Because of Voltorb's limited coverage and the prominence of Ground-types, Voltorb often depends on Terastallization (or the threat of it) to function well in a match. Voltorb leans on a few utility options for its fourth move due to its limited movepool; Protect stops Nymble's First Impression from revenge killing it and can scout defensive Terastallizations, especially Tera Water on Toedscool. Taunt prevents setup and entry hazards from the likes of Pawniard, Surskit, and Glimmet, and Thunder Wave neutralizes setup sweepers and faster threats that Voltorb cannot OHKO. Voltorb pairs well with teammates that can switch into its Ground-type checks when it has not Terastallized. Toedscool is a natural partner thanks to its bulk, Ground resistance, and ability to remove entry hazards for Terastallized Voltorb, given its new Stealth Rock weakness. Drifloon's Ground immunity also supports Voltorb well. As a pivot, Voltorb appreciates the support of other pivots to continually put your opponent on the back foot. Nymble has a powerful STAB U-turn and often invites in Mareanie, which Voltorb can pressure. Wingull not only checks Ground-types with its dual STAB types and Ground immunity, but also appreciates Voltorb handling the bulky Water-types that check it.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "goldenghost", "user_id": 32350}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Voltorb-Hisui": {"sets": [{"name": "Offensive Pivot"}]},
  "Wingull": {"sets": [{"name": "Offensive"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "gali", "user_id": 107567}]}]}},
  "Azurill": {"sets": [{"name": "Belly Drum"}]},
  "Numel": {"sets": [{"name": "Growth"}, {"name": "Stockpile + Body Press"}], "credits": {"writtenBy": [], "teams": [{"name": "submitted by", "members": [{"username": "Kaboom", "user_id": 300935}]}]}},
  "Buizel": {"sets": [{"name": "Rain Wallbreaker"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Altariel von Sweep", "user_id": 330191}]}]}},
  "Shellos": {"sets": [{"name": "Defensive"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Charis_Akins", "user_id": 588203}]}]}},
  "Drifloon": {"sets": [{"name": "Utility"}, {"name": "Mixed Attacker", "description": "<p>Drifloon runs 19 HP IVs to activate Unburden after 2 rounds of Stealth Rock damage.</p> "}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "gali", "user_id": 107567}]}]}},
  "Stunky": {"sets": [{"name": "Nasty Plot"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Kaboom", "user_id": 300935}]}]}},
  "Snover": {"sets": [{"name": "Physical Wall"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "TheShoddyStrawman", "user_id": 585065}]}]}},
  "Sandile": {"sets": [{"name": "Sticky Web Attacker"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Hacker", "user_id": 387847}]}]}},
  "Zorua": {"sets": [{"name": "Choice Scarf"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "TheShoddyStrawman", "user_id": 585065}]}]}},
  "Zorua-Hisui": {"sets": [{"name": "Pivot"}, {"name": "Nasty Plot"}]},
  "Gothita": {"sets": [{"name": "Choice Scarf"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Lialiabeast", "user_id": 564420}]}]}},
  "Deerling": {"sets": [{"name": "Offensive"}]},
  "Foongus": {"sets": [{"name": "Defensive"}]},
  "Axew": {"sets": [{"name": "Dragon Dance"}]},
  "Pawniard": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Pawniard's well-rounded stats, typing, and movepool make it one of the best role compressors in Little Cup. It can set up Stealth Rock while being a solid defensive answer to Pokemon such as Drifloon, Deerling, and Hisuian Zorua, or it can use Swords Dance and Defiant to become a top-tier sweeper with Sucker Punch. Low Sweep threatens opposing Pawniard, OHKOing after Stealth Rock damage, while also providing Speed control against common switch-ins like Crabrawler. Alternatively, teams that don't fear opposing Pawniard can opt for Night Slash, a consistent source of STAB damage that threatens bulky Water-types and pairs best with Swords Dance. Tera Fire gives Pawniard a burn immunity and lets it tank Hisuian Growlithe's Flare Blitz, while Flying and Ghost are both strong defensive Tera types that address Pawniard's key weaknesses; Tera Flying is a better choice against Ground-types like Mudbray and Alolan Diglett, whereas Tera Ghost is better against Crabrawler and doesn't add a Stealth Rock weakness. One of the best partners for Pawniard is Toedscool, as it is similarly versatile and counters the Pokemon Pawniard struggles with, such as bulky Water-types and Mudbray. Ghost-types like Drifloon and Hisuian Zorua can exploit Crabrawler. Most teammates appreciate Pawniard's versatility: Crabrawler, Toedscool, and Drifloon all heavily appreciate its defensive utility, as it switches into these Pokemon's common checks like Hisuian Zorua and Foongus. Pawniard also shines on teams without Glimmet that need a reliable Stealth Rock user, as well as Sticky Web teams that want a potent set-up sweeper and something to deter Drifloon's Defog.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Drifting", "user_id": 342456}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}, {"username": "DC", "user_id": 449990}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Larvesta": {"sets": [{"name": "Defensive Pivot"}], "credits": {"writtenBy": [], "teams": [{"name": "Sunmitted by", "members": [{"username": "Charis_Akins", "user_id": 588203}]}]}},
  "Crabrawler": {
    "sets": [
      {
        "name": "Bulk Up",
        "description": "<p>Crabrawler is a fantastic bulky attacker that checks dangerous threats such as Hisuian Growlithe and Toedscool, and can sweep teams with Bulk Up. Coverage moves such as Ice Punch, Thunder Punch, and Earthquake offer Crabrawler extreme flexibility in the threats it needs to cover. Ice Punch hits Foongus, Wattrel, and Toedscool, while Thunder Punch hits Mareanie, Wingull, and Quaxly; both options also hit Drifloon super effectively. Earthquake allows Crabrawler to hit Mareanie and Fuecoco and is its strongest neutral option against Hisuian Zorua. Tera Fire makes Crabrawler immune to burns, while Tera Electric makes Thunder Punch stronger against Water-types and gives it defensive utility against threats like Hisuian Voltorb and Wingull. Crabrawler hates dealing with opposing Ghost-types such as Hisuian Zorua, Greavard, and Drifloon, as well as Gothita. Hisuian Growlithe checks these threats and makes an excellent teammate for Crabrawler, as do Ghost-types such as Hisuian Zorua and Drifloon that benefit from the removal of opposing Pawniard.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TheShoddyStrawman", "user_id": 585065}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "gali", "user_id": 107567}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "Lunaflare", "user_id": 430518}]}]}
  },
  "Mareanie": {
    "sets": [{"name": "Defensive", "description": "<p>Mareanie is one of the top walls in Little Cup, capable of checking threats such as Hisuian Growlithe, Crabrawler, and Shellder. Haze shuts down dangerous set-up sweepers like Crabrawler and Swords Dance Pawniard, while Ice Beam hits Toedscool and Foongus. Mareanie has some other viable options for its fourth moveslot; Toxic Spikes wears down foes like Toedscool and synergizes with partners like Hex Hisuian Zorua, and Iron Defense turns Mareanie into a defensive wincon. Tera Ghost lets Mareanie excape Gothita's Shadow Tag while letting it take neutral damage from Crabrawler's coverage. Grass-types like Toedscool and Foongus are great partners that can switch into foes like Hisuian Voltorb and Mudbray; Foongus forms a potent Regenerator core with Mareanie as well.</p> "}],
    "credits": {"writtenBy": [{"username": "Flou", "user_id": 605215}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "gali", "user_id": 107567}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}]}]}
  },
  "Mudbray": {"sets": [{"name": "RestTalk"}, {"name": "Stealth Rock"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "grape tylenol", "user_id": 593128}, {"username": "Flou", "user_id": 605215}]}]}},
  "Sandygast": {"sets": [{"name": "Defensive"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Hacker", "user_id": 387847}]}]}},
  "Grookey": {"sets": [{"name": "Choice Scarf"}, {"name": "Pivot"}]},
  "Chewtle": {"sets": [{"name": "Shell Smash"}]},
  "Impidimp": {"sets": [{"name": "Dual Screens"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Sanjay das", "user_id": 557942}]}]}},
  "Fuecoco": {"sets": [{"name": "Defensive"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Joeshh", "user_id": 607664}]}]}},
  "Quaxly": {
    "sets": [
      {
        "name": "Rapid Spin",
        "description": "<p>Quaxly is a notable Rapid Spin user in LC due to its access to reliable recovery and good matchup into entry hazard setters like Pawniard and Glimmet; it can also double as a capable sweeper thanks to Moxie. Aqua Cutter gives up some power compared to Liquidation but does not make contact, which avoids activating Greavard's Fluffy and Voltorb's Static, and removes the risk of activating Pawniard's Defiant with a Defense drop. Aqua Jet is STAB priority that OHKOs Hisuian Growlithe, while Brave Bird provides super effective coverage versus Grass- and Fighting-types like Toedscool and Foongus. Encore can lock opposing Pokemon into unfavorable moves, such as weak setup moves, gaining momentum for Quaxly's team. Quaxly can use Tera Grass for a better matchup versus Electric- and Grass-types as well as a valuable immunity to Spore from Foongus and Toedscool. Tera Flying can also be used with Brave Bird to turn Quaxly into a more potent offensive threat. Pokemon weak to Stealth Rock, such as Hisuian Growlithe, Wingull, and Nymble, are great partners for Quaxly, as they appreciate the removal of entry hazards to be used at their full potential. Foongus is another good partner, as it can safely switch into Grass-types and provides valuable Spore support. Pokemon such as Toedscool and Wattrel check Electric-types for Quaxly.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "uhBella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "Acehunter1", "user_id": 430377}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}]}]}
  },
  "Nymble": {
    "sets": [
      {
        "name": "Revenge Killer",
        "description": "<p>Nymble's unique combination of STAB First Impression and a powerful ability in Tinted Lens allows it to become one of Little Cup's reliable revenge killers, picking off targets such as Toedscool and sweepers such as Shellder. U-turn allows Nymble to pivot on the switches it forces and avoid problematic matchups, such as Wattrel. Sucker Punch revenge kills foes that have Protect or can safely tank a First Impression, such as Drifloon. Tera Bug boosts Nymble's power to absurd levels, letting it OHKO Hisuian Growlithe. Nymble switches out of battle very often, so hazard control from teammates such as Drifloon, Quaxly, and Toedscool are good partners to have. Mareanie and Pawniard can switch into Nymble's common checks such as Hisuian Zorua and Mudbray well. Pokemon weak to Grass- or Dark-types such as Mudbray and Hisuian Zorua appreciate Nymble forcing out or removing their checks. Hisuian Voltorb and Grookey pair well with Nymble, as they can make a deadly VoltTurn combination.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "uhBella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "gali", "user_id": 107567}, {"username": "Drifting", "user_id": 342456}]}, {"name": "Grammar checked by", "members": [{"username": "Dawn of Ares", "user_id": 467437}]}]}
  },
  "Wattrel": {"sets": [{"name": "Offensive Pivot"}]},
  "Maschiff": {"sets": [{"name": "Choice Scarf"}], "credits": {"writtenBy": [], "teams": [{"name": "Submitted by", "members": [{"username": "Shandeur", "user_id": 580548}]}]}},
  "Shroodle": {"sets": [{"name": "Prankster Pivot"}, {"name": "Terrain Sweeper"}]},
  "Bramblin": {"sets": [{"name": "Spinner"}]},
  "Toedscool": {
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Toedscool is one of the premier forms of entry hazard removal in Little Cup, punishing Spore absorbers and spinblockers with Knock Off while using its good natural bulk and typing to serve as a check to Ground- and Electric-types like Hisuian Voltorb and Mudbray. The given EV spread allows Toedscool to hit 17 Speed, which outspeeds common 16 Speed entry hazard setters like Glimmet and Pawniard. Giga Drain gives Toedscool a form of recovery and the ability to beat Mudbray, while Spore punishes common switch-ins like Wattrel. Power Whip is an option to beat opposing Toedscool; if running the move, Toedscool should run an additional 36 Attack EVs and a Jolly nature. Toedscool's Tera type occasionally allows it to avoid super effective attacks. Tera Water is preferred to tank Hisuian Growlithe's Flare Blitz and serve as an emergency check to Wingull and offensive Quaxly. Tera Steel can also be used to deal with Tera Ice Electric-types more easily and to give it a favorable matchup against Foongus, but at the cost of adding unfortunate Ground and Fighting weaknesses. Toedscool pairs well with Pokemon that struggle with Stealth Rock chip, like Hisuian Growlithe, Nymble, and Wattrel, and teammates that appreciate the momentum that Toedscool generates, like Hisuian Voltorb, Grookey, and Hisuian Zorua. Water-types such as Mareanie and Quaxly have defensive synergy with Toedscool, both checking the Ice- and Fire-types that threaten Toedscool and benefitting from Toedscool's ability to absorb Electric-type moves.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "yellowfin", "user_id": 416460}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "Acehunter1", "user_id": 430377}]}, {"name": "Grammar checked by", "members": [{"username": "dex", "user_id": 277988}]}]}
  },
  "Glimmet": {
    "sets": [
      {
        "name": "Entry Hazard Setter",
        "description": "<p>Glimmet is one of the best entry hazard setters in LC because it can set up all of Stealth Rock, Spikes, and Toxic Spikes. Mud Shot threatens Steel-types like Pawniard and Alolan Diglett, albeit activating the former's Defiant, OHKOes opposing Hisuian Growlithe, and can help win matchups against faster threats with its Speed drop, especially on Focus Sash sets. Power Gem can be used to hit Ghost-types such as Hisuian Zorua and Drifloon. Eviolite allows Glimmet to set up entry hazards multiple times in a game and check Hisuian Growlithe and Drifloon, while Focus Sash can be used to guarantee hazards, even in unfavorable lead matchups such as Alolan Diglett. Tera Ghost lets Glimmet spinblock and allows it to escape Gothita. Ghost-types such as Hisuian Zorua, Drifloon, and Greavard should be used with Glimmet to maintain Glimmet’s hazards by spinblocking. U-turn and Volt Switch users like Hisuian Voltorb, Grookey, and Nymble are great partners, as their ability to force switches amplifies the damage Glimmet's hazards can deal to the opposing team. Offensive attackers such as Hisuian Growlithe, Crabrawler, and Pawniard appreciate Glimmet's hazards to secure KOs and wear down their checks.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Charis_Akins", "user_id": 588203}], "teams": [{"name": "Quality checked by", "members": [{"username": "DC", "user_id": 449990}, {"username": "goldenghost", "user_id": 32350}]}, {"name": "Grammar checked by", "members": [{"username": "Rabia", "user_id": 336073}]}]}
  },
  "Greavard": {"sets": [{"name": "Bulky Spinblocker"}]}
}