{
  "Azumarill": {
    "sets": [
      {
        "name": "Belly Drum",
        "description": "<p>Azumarill is a premier Belly Drum sweeper armed with Huge Power, a strong priority move in Jet Punch, which can be pushed to its maximum power with Tera, and wall breaking capabilities with Surging Strikes. Azumarill's Water / Fairy typing frequently gives it safe opportunities to setup Belly Drum against Dragon- and Dark-types such as Roaring Moon and Weavile. Hyper Drill is a neutral coverage move that can hit Toxapex for massive damage and doesn't trigger Baneful Bunker. Other physical attackers like Kingambit and Roaring Moon appreciate Azumarill's ability to break through physically defensive walls such as Ting-Lu and Great Tusk. Azumarill is prone to chip damage from Garchomp or Rocky Helmet Toxapex, so having an attacker that can deal with both like Iron-Valiant is advised. Azumarill also can have a tough time getting in and setting up a Belly Drum, so pairing it with screens support via Grimmsnarl, Shed Tail from Cyclizar, or pivots such as Corviknight is recommended.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}], "teams": [{"name": "Quality checked by", "members": [{"username": "Giagantic", "user_id": 220859}, {"username": "LBDC", "user_id": 464398}]}, {"name": "Grammar checked by", "members": [{"username": "Isaiah", "user_id": 375662}]}]}
  },
  "Scizor": {"sets": [{"name": "Swords Dance"}]},
  "Tyranitar": {
    "sets": [
      {
        "name": "Salt Cure",
        "description": "<p>With Ceaseless Edge and Stone Axe, Tyranitar becomes a potent entry hazard setter. Salt Cure pressures entry hazard removers like Corviknight, Great Tusk, and Toxapex while discouraging Pokemon that threaten Tyranitar like Iron Valiant and Gholdengo from switching in. Tyranitar also has the option of running Parting Shot to pivot on its would be switch-ins. Knock Off removes items like Covert Cloak from Pokemon like Toxapex and Gholdengo, which would otherwise block Salt Cure. The listed EV spread lets Tyranitar outrun most variants of Corviknight and Kingambit while having enough special bulk to survive +2 Make It Rain from defensive Gholdengo under Sand on top of checking other special attackers like Skeledirge, Indeedee, and Rotom-H. Threats to Tyranitar include Annihilape, Iron Valiant, Palafin, Gholdengo, and Great Tusk. Tera Water checks Palafin and Gholdengo, while Tera Flying and Fairy check Great Tusk and Iron Valiant. Heavy-Duty Boots avoids entry hazard damage, which can be useful with Tera Flying, while Leftovers increases Tyranitar’s longevity. Tyranitar prefers bulky teammates like Corviknight, Rotom-W, and Rotom-C to patch up its Ground weakness. Physically defensive Toxapex is appreciated to handle the likes of Palafin and Iron Valiant and covers for Tyranitar's Fighting, Water, and Fairy weaknesses while also providing entry removal with Mortal Spin. Offensive Gholdengo is a good teammate, as it blocks entry hazard removal while also being able to throw off powerful attacks and spread status with Infernal Parade and Thunder Wave. Powerful offensive Pokemon like Iron Valiant, Roaring Moon, and Palafin can more easily break holes with the chip damage provided by Tyranitar.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "ponchlake", "user_id": 574634}], "teams": [{"name": "Quality checked by", "members": [{"username": "Giagantic", "user_id": 220859}, {"username": "pannu", "user_id": 517892}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Rotom-Wash": {
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Rotom-W is an excellent defensive pivot that can take on dangerous attackers such as Palafin, Scizor, and Iron Treads and generate momentum with Volt Switch. While Scald offers more PP and reliability, Steam Eruption OHKOes Great Tusk after Stealth Rock and improves Rotom-W's overall offensive presence. Will-O-Wisp hinders physical attackers more reliably than Scald. Alternatively, Apple Acid breaks down defensive Pokemon such as Garganacl, while Haze neutralizes slow setup sweepers such as Scizor and Freeze-Dry hits Dragon-types like Dragonite and Garchomp super effectively. Roost provides consistent recovery, while Strength Sap makes Rotom-W more effective against physical attackers such as Great Tusk and Chien-Pao, but leaves it unable to recover against Gholdengo. The given Speed EVs allow Rotom-W to outspeed Jolly Azumarill and uninvested Great Tusk, but more Speed can be run to handle certain threats; 224 Speed outspeeds Palafin, while 240 Speed with a Timid nature outpaces Gholdengo. Tera Steel allows Rotom-W to more easily pivot into Toxapex and take on Dragon-types such as Garchomp. Alternatively, Tera Electric strengthens Volt Switch and makes Rotom-W less vulnerable to Salt Cure. Rotom-W appreciates partners that can pivot such as Ting-Lu, Slither Wing, and Corviknight. Physical walls like Garganacl and Skeledirge after Terastallizing can take on many of the physical attackers that Rotom-W cannot handle, such as Roaring Moon. Powerful offensive Pokemon such as Roaring Moon, Iron Valiant, and Iron Treads appreciate Rotom-W's ability to pivot them into battle.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "memesketch", "user_id": 537558}], "teams": [{"name": "Quality checked by", "members": [{"username": "Giagantic", "user_id": 220859}, {"username": "LBDC", "user_id": 464398}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Toxapex": {"sets": [{"name": "Physically Defensive Pivot"}, {"name": "RegenVest Pivot"}]},
  "Corviknight": {"sets": [{"name": "Physically Defensive Pivot"}]},
  "Grimmsnarl": {
    "sets": [
      {
        "name": "Dual Screens",
        "description": "<p>Due to its access to Prankster, dual screens, Parting Shot, and Taunt, Grimmsnarl distinguishes itself as the most reliable dual screens setter on hyper offense teams. Dual screens support gives setup sweepers such as Swords Dance Scizor, Iron Valiant, and Belly Drum Azumarill an easier time setting up and makes revenge killing them significantly harder. Parting Shot gives Grimmsnarl a way to pivot the aforementioned Pokemon in. Grimmsnarl can also use Memento, which further drops the stats of foes, although it doesn't allow Grimmsnarl to set up screens afterwards. Taunt stops would-be setup sweepers like Swords Dance Iron Hands and blocks opposing Pokemon like Glimmora from setting up entry hazards. Alternatively, Thunder Wave cripples faster offensive Pokemon like Iron Valiant, whereas Ceaseless Edge sets up Spikes while not being too passive. Tera Ghost allows Grimmsnarl to block Rapid Spin attempts from Pokemon such as Iron Treads and Great Tusk, although it is inadvisable to waste Tera on Grimmsnarl, as your setup sweepers may require it. Azumarill deserves a special mention as a Grimmsnarl partner, as its Water typing and access to moves like Jet Punch and Tidy Up make it a good Ting-Lu and Tyranitar answer, which would otherwise use Grimmsnarl as setup bait for Stealth Rock and Spikes due to being immune to Taunt.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "zastra", "user_id": 558636}], "teams": [{"name": "Quality checked by", "members": [{"username": "Giagantic", "user_id": 220859}, {"username": "LBDC", "user_id": 464398}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}, {"username": "Dawn of Ares", "user_id": 467437}]}]}
  },
  "Skeledirge": {"sets": [{"name": "Unaware Wall"}]},
  "Garganacl": {"sets": [{"name": "Specially Defensive Wall"}]},
  "Palafin": {"sets": [{"name": "Taunt + Bulk Up"}]},
  "Cyclizar": {"sets": [{"name": "Shed Tail"}, {"name": "Choice Scarf"}]},
  "Annihilape": {"sets": [{"name": "Bulk Up + Taunt"}, {"name": "Bulk Up + Chesto Berry"}, {"name": "Choice Scarf"}]},
  "Kingambit": {"sets": [{"name": "Swords Dance"}]},
  "Great Tusk": {"sets": [{"name": "Physically Defensive"}, {"name": "Choice"}, {"name": "3 Attacks"}]},
  "Slither Wing": {"sets": [{"name": "Choice Band"}]},
  "Iron Treads": {"sets": [{"name": "Offensive Spinner"}]},
  "Iron Hands": {"sets": [{"name": "Swords Dance"}, {"name": "Big Drummer Boy"}]},
  "Gholdengo": {"sets": [{"name": "Defensive Nasty Plot"}, {"name": "Choice Scarf"}]},
  "Ting-Lu": {
    "sets": [
      {
        "name": "Defensive Support",
        "description": "<p>Ting-Lu is an effective defensive support in STABmons, as with Ceaseless Edge or Spikes, it can serve as a very bulky entry hazard setter. In addition, thanks to its ability, its well-distributed stats, and Shore Up, it is able to check many attackers such as Iron Moth, Ceruledge, and Garganacl. Spikes should be used if reliability and lack of PP are a concern, especially on stall teams. Precipice Blades maximizes damage against Toxapex and other Ground-weak Pokemon like Iron Hands; however, Earthquake is a fine option if accuracy is a concern. There are multiple options for the last moveslot: Parting Shot lets Ting-Lu safely bring in offensive teammates via a slow pivot, Foul Play gives it a better matchup against setup sweepers like Salamence, Whirlwind phazes setup sweepers that Ting-Lu can't handle like non-Taunt Annihilape, and Knock Off can remove items like Heavy-Duty Boots from pivots like Tyranitar. Covert Cloak prevents Ting-Lu from being poisoned from Mortal Spin users like Toxapex, while Leftovers gives to it more passive recovery. Both Tera Ghost and Tera Poison allow Ting-Lu to surprise Fighting-types like Iron Hands; Tera Poison grants it an immunity to Toxic and lets it resist Grass-type attacks, while Tera Ghost allows it to spinblock. Alternatively, Tera Fairy and Tera Water provide great resistances to Roaring Moon and Palafin, respectively. Ting-Lu fits in a variety of teams, ranging from bulky offense to stall. Offensive teammates such as Iron Valiant, Palafin, and Iron Hands appreciate that Ting-Lu can both set Spikes and act as a slow pivot with Parting Shot. These three Pokemon also beat Great Tusk, one of Ting-Lu's biggest checks, as it is able to beat it with Fighting-type moves and remove its entry hazards with Rapid Spin. Defensive Pokemon like Toxapex, Amoonguss, and Dondozo are able to check Pokemon that Ting-Lu can't, which include Azumarill, Rotom-W, and Mimikyu. Ting-Lu struggles to make progress with entry hazards up, so entry hazard removal from the likes of Great Tusk, Toxapex, Rotom-W, and Corviknight is recommended.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "LBDC", "user_id": 464398}], "teams": [{"name": "Quality checked by", "members": [{"username": "Giagantic", "user_id": 220859}, {"username": "pannu", "user_id": 517892}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Roaring Moon": {"sets": [{"name": "Choice Band"}, {"name": "Itemless Acrobatics"}, {"name": "Choice Scarf"}]},
  "Iron Valiant": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Iron Valiant leverages its strong attacks, great typing, and good Speed tier to act as a potent special attacker. Fleur Cannon, its most powerful move, threatens common defensive Pokemon such as Garganacl and Ting-Lu; Moonblast trades power for consistent damage. Vacuum Wave picks off frail, weakened, or faster Pokemon, allowing Iron Valiant to revenge kill Kingambit and Roaring Moon, even after setup. Psyshock pressures specially defensive Pokemon, such as Clodsire, Blissey, and specially defensive Toxapex, while Thunderbolt hits Corviknight and physically defensive Toxapex. Choice Specs Iron Valiant fits best on balance or bulky offense teams that appreciate its immense wallbreaking ability. It pairs well with strong physical attackers such as Roaring Moon and Choice Band Dragonite, as they can work together to pressure each others checks. Entry hazard setters like Garchomp and Great Tusk also make good partners, as they chip Iron Valiant's checks enough for it to beat them. Iron Valiant isn't very bulky, so it appreciates bulky teammates such as Ting-Lu and Garganacl; Ting-Lu can also use Parting Shot to help Iron Valiant enter the field safely. Cyclizar can clear hazards and pivot Iron Valiant in with Shed Tail.</p> "
      },
      {
        "name": "Physical Life Orb",
        "description": "<p>Life Orb Iron Valiant uses its powerful moves and coverage to wallbreak and threaten a large portion of the tier. Triple Arrows threatens most defensive Pokémon, such as Garganacl and Ting-Lu, with its chance to drop Defense and flinch. Zen Headbutt hits Toxapex and Clodsire, which resist Iron Valiant's STAB moves, and Iron Hands, which can be problematic for non-Magical Torque Iron Valiant. Mach Punch revenge kills offensive Pokemon such as Roaring Moon and Kingambit. Knock Off wears down Iron Valiant's checks by removing their Leftovers or Heavy-Duty Boots, while Magical Torque gives it another strong STAB to hit the many Dark- and Fighting-types of the tier, such as Grimmsnarl and Iron Hands, respectively. Life Orb Iron Valiant's lack of longevity makes it fit best on bulky offense teams. It pairs well with defensive pivots who can help it safely switch in, such as Ting-Lu and Corviknight, and entry hazards setters who help it wear down its checks, such as Iron Treads and Great Tusk. Other physical attackers such as Garchomp and Slither Wing make good partners, as together they can overwhelm most defensive cores.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Iron Valiant is a threatening physical attacker thanks to its great typing and offensive stats. Triple Arrows is preferred over other Fighting-type moves thanks to its Defense drop chance, flinch chance, and high critical hit rate, which can put physical walls such as Corviknight and Rotom-W under pressure. Knock Off helps Iron Valiant wear down its checks more quickly, removing key items such as Leftovers and Heavy-Duty Boots from switch-ins. Mach Punch allows Iron Valiant to threaten faster Pokemon such as Roaring Moon, Meowscarada, and Cyclizar. It can also help to revenge kill boosted setup sweepers such as Sucker Punch Kingambit and, if weakened, Azumarill. Choice Band Iron Valiant fits on offensive and bulky offensive teams, as both physical and special wallbreakers appreciate the pressure it puts on the opposing team. Notable partners are Dragonite, which complements it offensively with priority and wearing down physical walls together, and Cyclizar, which helps it enter the field safely with Shed Tail. Iron Valiant's frailty and Choice lock make strong defensive teammates like Toxapex, Garganacl, and Corviknight helpful to switch into threats such as other Iron Valiant, Azumarill, and Dragonite.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Ducky", "user_id": 525446}], "teams": [{"name": "Quality checked by", "members": [{"username": "Giagantic", "user_id": 220859}, {"username": "LBDC", "user_id": 464398}]}, {"name": "Grammar checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Adeleine", "user_id": 517429}]}]}
  }
}