{
  "Charizard": {
    "sets": [
      {
        "name": "Drought Wallbreaker",
        "description": "<p>Thanks to its superb coverage and high Special Attack stat, Mega Charizard Y is a terrifying wallbreaker. Drought + Solar Beam allows Mega Charizard Y to subdue Water-types such Rotom-W, Gastrodon, and Tapu Fini, further restricting its defensive counterplay. Fire Blast is preferred to hit as hard as possible, though Flamethrower's perfect accuracy and greater PP make it worth consideration. Weather Ball is an interesting option, as it presents a challenge to rain teams by dealing considerable damage to Pelipper on the switch, but it comes at the cost of Mega Charizard Y losing its primary STAB move outside of sun. Scorching Sands pressures Heatran, Toxapex, and Skeledirge, while Focus Blast threatens Mega Tyranitar. Mega Charizard Y's tremendous wallbreaking prowess allows late-game sweepers such as Dragon Dance Dragapult, Dragonite, and Volcarona to take advantage of Unaware walls that have been compromised, such as Skeledirge and Clodsire. Mega Charizard Y's sun support benefits Protosynthesis users such as Great Tusk. Mega Charizard Y appreciates entry hazard control from teammates such as Great Tusk, Landorus-T, and Kartana, as it is extremely susceptible to Stealth Rock. It also struggles to break bulky Dragon-types such as Dragonite and Mega Latias as well as special walls like Clodsire and Hippowdon. Weavile, Tyranitar, and Kingambit subsequently form strong offensive cores with Mega Charizard Y, as they are able to Pursuit trap its aforementioned checks, with the former being able to deal with Hippowdon as well. Mega Charizard Y's middling Speed tier and unremarkable physical bulk leave it prone to being revenge killed by faster threats such as Dragapult, Mega Lopunny, and Tapu Koko. Therefore, bulky switch-ins such as Assault Vest Tangrowth, Ting-Lu, and Landorus-T make for good teammates.</p> "
      },
      {
        "name": "Dragon Dance",
        "description": "<p>Mega Charizard X is a powerful setup sweeper and wallbreaker thanks to the sheer power of its Tough Claws-boosted Flare Blitz. Earthquake covers a vast majority of Fire-resistant Pokemon, including Heatran, Toxapex, Garganacl, and Skeledirge, as well as Steel-types such as Gholdengo and Kingambit without the recoil. Aside from granting Mega Charizard X more setup opportunities, Roost compensates for Flare Blitz recoil and its Stealth Rock weakness, allowing it to take advantage of its typing and natural bulk to soft check common foes like Volcarona, Mega Scizor, and Choice Scarf Kartana as well as preventing revenge killing attempts from Mega Lopunny and Kingambit. Dragon Claw is an alternative on hyper offense teams where the longevity isn't as necessary, which allows Mega Charizard X to hit Dragonite, Mega Latias, and Garchomp as well as providing neutral coverage against foes like Rotom-W, Tera Water Skeledirge, and Tera Grass Heatran. Offensive partners like Kartana, Weavile, Iron Valiant, and Kingambit can pressure the opposition early-game for Mega Charizard X to sweep more easily, as they can cripple and either pressure or overwhelm shared checks in Toxapex, Slowbro, Skeledirge, and Iron Defense Garganacl; in return, it threatens Tangrowth for Kartana, handles Gholdengo for Iron Valiant, and melts other Steel-types like Mega Scizor and Corviknight for them. Pivots like Dragapult, Rotom-W, and Tornadus-T bring Mega Charizard X in safely via U-turn on Pokemon like Corviknight, Ferrothorn, and Gholdengo, respectively; the latter two in particular can remove entry hazards with Defog so it can enter the field unscathed, especially if it's not running Roost and hasn't Mega Evolved yet. Dual screen setters found on hyper offense teams, such as Tapu Koko and Grimmsnarl, give Mega Charizard X an easier time setting up.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "2020 idm boomer", "user_id": 385157}, {"username": "royalfluxh", "user_id": 493260}], "teams": [{"name": "Quality checked by", "members": [{"username": "Ryuji", "user_id": 515767}, {"username": "hidin", "user_id": 589564}, {"username": "ChrisPBacon", "user_id": 544502}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Clefable": {
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Clefable's great movepool, passable bulk, and Magic Guard + Soft-Boiled give it a unique niche as a defensive Fairy-type. It's able to fulfill many roles such as a Stealth Rock setter, a support Pokemon thanks to Thunder Wave and Knock Off crippling its checks like Heatran and Mega Scizor, and a potent sweeper with Calm Mind. Magic Guard lets Clefable absorb status moves like Toxic and Will-O-Wisp for teammates like Ting-Lu, Ferrothorn, and Gastrodon. It also allows it to ignore entry hazards, helping it check Pokemon like Mega Lopunny and Dragapult. Rocky Helmet punishes U-turn from Mega Lopunny and Landorus-T. The given EV spread allows it to survive two Returns from Mega Lopunny with Leftovers recovery while also checking special attackers like Choice Specs Dragapult. If Rocky Helmet is used, an alternative spread of 252 HP / 252 Def / 4 SpD with a Bold nature is recommended. Tera Water allows Clefable to have a better matchup into rain teams while resisting Steel-type attacks from Pokemon like Mega Scizor and Kingambit, allowing Clefable to catch them off-guard and cripple them. Tera Steel, on the other hand, allows Clefable to catch Tapu Lele and Iron Valiant with a Thunder Wave. Entry hazard setters like Ting-Lu, Garchomp, and Ferrothorn appreciate Clefable's ability to incapacitate common Defog users such as Tornadus-T and Rotom-W thanks to Knock Off. They also appreciate having one moveslot being freed if Clefable carries Stealth Rock. Similarly, Clefable can cripple common entry hazard setters like Ferrothorn and Heatran, helping Defog users like the aforementioned Tornadus-T and Rotom-W perform their role. Toxapex works well with Clefable, as it checks Poison- and Steel-types like Iron Moth and Mega Scizor, helping Clefable spread Thunder Wave or set up with Calm Mind. They can also both overwhelm Ferrothorn, as the former can burn it and the latter nullifies Leech Seed's recovery. If Thunder Wave is used, Hex users like Gholdengo and Dragapult can be used to break Pokemon like Toxapex and Heatran that would otherwise stop Clefable from sweeping with Calm Mind.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Ryuji", "user_id": 515767}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "hidin", "user_id": 589564}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Ninetales-Alola": {"sets": [{"name": "Aurora Veil Setter"}]},
  "Slowbro": {
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Slowbro's valuable defensive typing, solid physical bulk, and remarkable longevity between Slack Off + Regenerator make it a very reliable defensive pivot, capable of consistently checking dangerous physical attackers like Urshifu-R, Mega Medicham, Mega Lopunny, and Mega Swampert. The combination of Teleport + Future Sight lets Slowbro support its offensive teammates by providing them free entry while forcing immense pressure on a prospective switch-in. Heavy-Duty Boots allows Slowbro to switch freely in spite of any entry hazards. Tera Steel can be used in a pinch to check foes like Kingambit, Mega Tyranitar, and Tapu Lele, letting it either cripple them with a Scald burn or use Teleport into a revenge killer. Wallbreakers such as Kingambit, Iron Valiant, and Zamazenta appreciate Slowbro's FuturePort to bring them in safely on foes like Ferrothorn and Garganacl and subsequently pressure their switch-ins like Great Tusk, Clodsire, and Toxapex with the impending Future Sight. Specially defensive Pokemon such as Ting-Lu, Clodsire, and Heatran help cover threats like Tapu Koko, Volcarona, and Gholdengo, respectively; in return, Slowbro deals with Ground- and Fighting-types like Great Tusk, Garchomp, and Urshifu-R. Corviknight, Tornadus-T, and Buzzwole cover other physical attackers such as Kartana, Kingambit, and Weavile that Slowbro struggles with; the former two remove entry hazards with Defog in case Slowbro is forced to take a Knock Off, while the latter can make use of Future Sight to wallbreak easier.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "2020 idm boomer", "user_id": 385157}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Muk-Alola": {"sets": [{"name": "Assault Vest", "description": "<p>84 Attack EVs let Muk OHKO a Mega Charizard Y at full with Rock Slide.</p> "}]},
  "Chansey": {
    "sets": [
      {
        "name": "Pink Blob (Defensive)",
        "description": "<p>Thanks to its gargantuan Eviolite-boosted special bulk alongside a lack of relevant weaknesses, Chansey stands firmly as a formidable wall that blanket checks the metagame's special attackers, including Dragapult, Mega Charizard Y, and Volcarona. Toxic lets Chansey whittle them down, especially in conjunction with repeated Seismic Tosses, while Thunder Wave punishes poison-immune foes like Heatran and Toxapex and cripples switch-ins such as Mega Lopunny and Kingambit. Chansey can provide cleric support with Aromatherapy, especially since it can switch into status users like Clodsire and Rotom-W thanks to Natural Cure. However, Stealth Rock can be used if the team lacks another user, and Chansey can do it sufficiently by outlasting common entry hazard removers such as Great Tusk, Tornadus-T, and Landorus-T. Tera Steel allows it to reliably check Tapu Lele, Hatterene, and Tornadus-T, and it prevents Chansey from being poisoned. Chansey is generally reserved for bulkier builds that appreciate its defensive profile and can tolerate its overall passivity. Sturdy walls like Skeledirge, Buzzwole, Skarmory, and Corviknight can cover physical attackers like Zamazenta, Mega Lopunny, and Kartana for Chansey. Skeledirge's Unaware helps against setup sweepers like Mega Scizor and Mega Charizard X that attempt to use Chansey as setup fodder, while Corviknight's Defog alleviates Chansey from entry hazard pressure that would overwhelm it easily. Knock Off and Trick absorbers like Clefable, Toxapex, Mega Scizor, and Gholdengo make sure that Chansey can keep its valuable Eviolite; Additionally, Mega Scizor helps deal with Psyshock Tapu Lele, Gholdengo threatens Calm Mind Hatterene, and Calm Mind Clefable overwhelms Heatran—especially if it's paralyzed—all of which are special attackers that can beat Chansey one-on-one.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}], "teams": [{"name": "Quality checked by", "members": [{"username": "hidin", "user_id": 589564}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Gyarados": {
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<p>Mega Gyarados is a powerful sweeper on hyper offense teams thanks to Dragon Dance, Mold Breaker, and its high Attack stat. Mega Gyarados also possesses a valuable defensive typing that helps against foes such as Gholdengo, Volcarona, and Kingambit. Mold Breaker lets Mega Gyarados break through foes such as Tera Fairy Gastrodon and Skeledirge, the latter being a troublesome foe for teammates such as Dragonite and Dragapult. Substitute allows Mega Gyarados to avoid status from foes such as Toxapex, Skeledirge, and Rotom-W while also avoiding revenge killers such as Tapu Lele and Kartana. Alternatively, Earthquake lets Mega Gyarados break through Toxapex and Rotom-W. Taunt can also be used to deny recovery, Haze, and Iron Defense from Toxapex and Skarmory, though it is generally not preferred since it leaves Mega Gyarados vulnerable to Scald burns and revenge killers such as Tapu Lele. Mega Gyarados appreciates dual screen support from Tapu Koko, which allows it to set up more easily. In return, Mega Gyarados can pivot into Ground-type attacks from foes such as Landorus-T and Great Tusk. Mega Gyarados struggles against physical walls such as Skarmory, Ferrothorn, and Buzzwole, so it appreciates teammates such as Volcarona and Iron Valiant handling them. Entry hazard support from teammates such as Landorus-T and Glimmora helps weaken defensive foes such as Tangrowth and Tera Water Landorus-T for Mega Gyarados. Teammates such as Dragonite also appreciate Mega Gyarados weakening defensive foes such as Skeledirge and Ferrothorn so it can clean late-game.</p> "
      },
      {"name": "Dragon Dance + Flyinium Z"}
    ],
    "credits": {"writtenBy": [{"username": "TheSorcer3r", "user_id": 580037}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "ChrisPBacon", "user_id": 544502}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "hidin", "user_id": 589564}]}]}
  },
  "Ditto": {"sets": [{"name": "SUS"}]},
  "Zapdos": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Thanks to Zapdos’s great typing and strong offensive presence, few Pokemon aside from specially defensive walls such as Ting-Lu and Clodsire would want to switch into it. Volt Switch wears down common switch-ins such as Blissey, Heatran, Rotom-W, and Mega Tyranitar, bringing in teammates that punish them like Zamazenta and Kartana. Alternatively, Defog can clear away entry hazards set by Landorus-T and Great Tusk, though Zapdos sets lacking Heavy-Duty Boots struggle to reliably remove hazards. It also misses out on pivoting provided by Volt Switch. Static punishes contact attackers and pivots like Zamazenta, Tornadus-T, Mega Scizor, and Mega Lopunny. If not running Flyinium Z, Tera Flying lets Zapdos break past Landorus-T, Ferrothorn, and Gastrodon with relative ease, all while still threatening Pokemon like Annihilape. Flyinium Z allows Zapdos to muscle through the likes of Annihilape and Gastrodon. The given EV spread allows Zapdos to OHKO Annihilape with Supersonic Skystrike. Teammates like Kingambit, Heatran, and Mega Lopunny appreciate Zapdos putting pressure on their checks, as it threatens Pokemon like Great Tusk, Landorus-T, and Toxapex. Without Heavy-Duty Boots, Zapdos is very susceptible to Stealth Rock. As such, entry hazard removers like Great Tusk and Rotom-W are much appreciated. Wallbreakers like Urshifu-R and Garchomp help deal with Zapdos checks such as Clodsire, Ting-Lu, and Heatran. Mega Scizor is a notable partner for Zapdos, as it checks strong, offensive threats such as Mega Diancie and Mega Lopunny, absorbs poison for Zapdos, and forms a good pivoting core with it.</p> "
      },
      {
        "name": "Rain",
        "description": "<p>Zapdos in rain is a dangerous attacker due to it boosting Hurricane and Thunder’s accuracy, as well as destroying common rain checks like Rotom-W, Ferrothorn, and Tangrowth. Weather Ball under rain allows Zapdos to hit Landorus-T, Clodsire, and Heatran super effectively. Roost allows it to stay healthy throughout the game and consistently be able to check Grass-types like Kartana. Tera Flying allows Zapdos to break through Ferrothorn and Gastrodon after slight chip damage. The given EVs allow Zapdos to outspeed Great Tusk while also maximizing its offensive power to break foes such as Rotom-W, Ferrothorn, and Gastrodon. Pelipper is a mandatory partner for Zapdos, as it sets up rain and can safely pivot out to it. Ferrothorn checks foes such as Weavile and Mega Tyranitar while also setting entry hazards to weaken foes such as Heatran and opposing Ferrothorn. Additionally, Swift Swim Pokemon like Mega Swampert, Floatzel, and Barraskewda can help with Clodsire and Mega Tyranitar, which Zapdos struggles to break through. In return, Zapdos wears down Pokemon that the aforementioned rain wallbreakers would struggle with, such as Ferrothorn, Rotom-W, and Gastrodon, clearing the path for them to clean up after their checks are weakened.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>Leveraging an incredible ability in Static accompanied by a powerful Volt Switch and Hurricane, Zapdos serves as a stellar defensive pivot. Zapdos effectively switches into physical attackers such as Mega Lopunny, Zamazenta, Kartana, and Great Tusk, discouraging them from attacking by threatening a chance of paralysis. Zapdos can Volt Switch out as it pleases because of common Ground-types like Landorus-T, Garchomp, and the aforementioned Great Tusk fearing its powerful Hurricane. Hidden Power Ice can be used to threaten Ground-types like the aforementioned Landorus-T and Garchomp while additionally hitting Gliscor harder and much more reliably than Hurricane. Carrying Heat Wave is recommended with Hidden Power Ice to maintain the ability to OHKO Kartana. These positive matchups into many Ground-types allow Zapdos to serve as a solid Defog user, but it struggles to beat bulkier Stealth Rock users such as Heatran, Mega Tyranitar, and Clodsire. Alternatively, Zapdos can forgo Defog for Heat Wave, allowing it to threaten Pokemon such as Kingambit, Ferrothorn, Mega Scizor, and Gholdengo. Tera Steel is utilized by Zapdos to flip its Rock- and Ice-type weaknesses versus Pokemon like Mega Tyranitar, Weavile, and Mega Diancie as well as check Choice Specs Iron Valiant and Tapu Lele in a pinch. However, it becomes weak to common Ground- and Fighting-type moves from Pokemon it wants to check. Teammates that appreciate the spread of paralysis, such as Mega Medicham, Urshifu-R, and Weavile, naturally pair well with Zapdos. Mega Medicham particularly pairs nicely with it, as Mega Medicham threatens Clodsire while enjoying Zapdos pivoting it into favorable matchups such as Heatran, with Zapdos punishing Tornadus-T and Mega Lopunny looking to revenge kill Mega Medicham in return. Pursuit users like Kingambit and the aforementioned Weavile are useful teammates to assist in chipping down Clodsire as well as punishing Dragapult. Rock-types like Mega Diancie and Mega Tyranitar threaten Zapdos, so teammates that mitigate these weaknesses, like Hippowdon and Gastrodon, are appreciated.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "SoBalanced", "user_id": 603814}, {"username": "sealoo", "user_id": 514772}], "teams": [{"name": "Quality checked by", "members": [{"username": "TheSorcer3r", "user_id": 580037}, {"username": "Sulo", "user_id": 528036}, {"username": "ChrisPBacon", "user_id": 544502}, {"username": "Ryuji", "user_id": 515767}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "hidin", "user_id": 589564}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Zapdos-Galar": {"sets": [{"name": "Choice Band"}, {"name": "Bulk Up", "description": "<p>The set(s) displayed are used as a placeholder untill an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Moltres": {
    "sets": [
      {"name": "Specially Defensive"},
      {
        "name": "Defensive",
        "description": "<p>Moltres’s main niche comes from its variety of useful qualities making it a prominent defensive Pokemon. It is a defogger that can threaten Gholdengo; a check to common Stealth Rock setters like Great Tusk, Heatran, and Garchomp; and a deterrent to contact attackers like U-turn users, Kartana, and Mega Lopunny. However, its main weakness lies in its overreliance on its Heavy-Duty Boots—although Tera could let it drop its weakness to Rock, Tera is usually better spent on other Pokemon, so Moltres still fears Knock Off from opponents it would otherwise check, like Iron Valiant, Landorus-T, Kartana, and Mega Scizor. Tera Water is used to ease the matchup against rain, becoming a check to common rain abusers like Basculegion-M, Mega Swampert and Barraskewda and threatening to burn them with Flame Body. Tera Ground instead grants a resistance to Stealth Rock and Stone Edge from Choice Scarf Landorus-T and an immunity to Volt Switch from Tapu Koko, Zapdos, and Rotom-W and Thunderbolt from Iron Valiant. Mystical Fire is chosen over Flamethrower, as its Special Attack drop is useful to more easily check Pokemon like Iron Valiant, Mega Charizard Y, and Gholdengo. Scorching Sands is used to beat Heatran and also deter physical attackers looking to set up due to its high burn chance. Hurricane allows Moltres to OHKO Great Tusk and Mega Lopunny while heavily denting Volcarona and is useful in general as a powerful STAB option, U-turn allows Moltres to function as a pivot, pivoting out on foes like Heatran and Garganacl, and Toxic allows Moltres to punish Pokemon such as Hippowdon, Ting-Lu, and Garchomp looking to soak up its STAB options. The given EVs allow Moltres to survive two Frustration from Mega Lopunny without Stealth Rock damage. However, there are still many opponents that can pressure Moltres, like Garganacl, Toxapex, and Tapu Koko. Moltres thus pairs well with wallbreakers that can take advantage of such switch-ins to come in, like Tapu Lele or Iron Valiant. Moltres also dislikes having its Heavy-Duty Boots removed, so teammates that can absorb Knock Off are appreciated, including Mega Scizor and Gliscor.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "red fintans", "user_id": 637479}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "Dawn of Ares", "user_id": 467437}]}]}
  },
  "Moltres-Galar": {
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<p>Galarian Moltres serves as a unique setup sweeper on hyper offense teams thanks to its ability to effortlessly set up Nasty Plot against metagame staples such as Tornadus-T and Gholdengo with its solid defensive and offensive profile. Agility allows Galarian Moltres to outpace dangerous revenge killers such as Mega Lopunny, Zamazenta, and Choice Scarf Kartana. However, Taunt is also a valuable alternative to Agility in order to shut down defensive checks like Haze Toxapex and Unaware Clodsire while also preventing common status spreaders like Landorus-T, Ferrothorn, and Heatran from limiting its sweep. Heavy-Duty Boots negates chip damage from entry hazards and allows Galarian Moltres to set up more reliably. Flyinium Z is used in order to quickly eliminate bulkier threats such as Toxapex and Ferrothorn without risking a miss due to Hurricane's poor accuracy; however, this leaves Galarian Moltres unable to Terastallize against threats such as Tapu Lele. Sitrus Berry is another option that lets Galarian Moltres maintain its health and trigger Berserk twice. Galarian Moltres is a great user of Terastallization, using Tera Steel to set up on its standard checks in Tapu Lele, Toxapex, Tapu Koko, and Clefable. Tera Steel also lets it resist many forms of priority including, but not limited to, Mega Lopunny's and Mega Medicham's Fake Out, Weavile's Ice Shard, and Mega Scizor's Bullet Punch. However, Galarian Moltres's new weaknesses mean that it has a harder time setting up on Mega Lopunny, Heatran, and Landorus-T while also being susceptible to other forms of priority like Kingambit's Sucker Punch. Galarian Moltres enjoys dual screens support to let it set up incredibly easily, so Tapu Koko makes for a great partner as both a solid pivot and dual screens setter. Galarian Moltres can struggle against threats such as Mega Diancie, Iron Valiant, Kingambit, and Mega Tyranitar, so Mega Scizor and Hawlucha make for great partners to handle its checks offensively; in return, Galarian Moltres can break through Pokemon such as Toxapex, Landorus-T, and Gholdengo for them. Fighting-types such as Urshifu-R, Iron Valiant, and Zamazenta are also good partners that can check threats like Heatran, Kingambit, and Garganacl for Galarian Moltres. Iron Valiant, in particular, also synergizes well with dual screens Tapu Koko, making it a fantastic cleaner after Galarian Moltres has broken through the opposing team.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Runo", "user_id": 568189}], "teams": [{"name": "Quality checked by", "members": [{"username": "Taka", "user_id": 595062}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Dragonite": {
    "sets": [
      {
        "name": "Extreme Killer (Dragon Dance)",
        "description": "<p>Dragonite's high Attack stat, Dragon Dance, and Tera Normal make it a good user of Extreme Speed, being able to effectively clean late-game. Earthquake helps Dragonite eliminate Normal-resistant Pokemon such as Gholdengo, Kingambit, and Heatran. Roost improves Dragonite's longevity and enables it to acquire multiple boosts against passive opponents. Roost lets Dragonite check Volcarona and rain sweepers such as Barraskewda throughout the entire match. Ice Spinner is another choice that clears the priority-blocking Psychic Terrain and hits Great Tusk, Landorus-T, and Dragapult super effectively. Fire Punch can be used to hit bulky Steel-types not weak to Ground such as Corviknight, Mega Scizor, and Ferrothorn. An Adamant nature is usually preferred to maximize Extreme Speed's damage output, but a Jolly nature enables Dragonite to outspeed Tapu Koko and the Normal-immune Dragapult after a single Dragon Dance. Heavy-Duty Boots ensures that Dragonite will always retain Multiscale even if entry hazards are up, but if the team's entry hazard control is good, Silk Scarf is another option that boosts Extreme Speed's power. Dragonite fits well on offensive teams as a priority-using revenge killer and late-game cleaner. Entry hazard support from Great Tusk and Garchomp can help chip down bulky targets such as opposing Great Tusk into range of its attacks. Tapu Lele poses a serious threat to Dragonite, as not only does its Psychic Terrain block Extreme Speed on grounded targets, but with a Choice Scarf it can also outspeed and deal massive damage to Dragonite even after setup, especially if Dragonite has not Terastallized yet. Gholdengo is a good partner, as it can switch in on and threaten Tapu Lele and prevent the opponent from removing entry hazards. Dragonite often struggles against Unaware users such as Dondozo and Skeledirge, so Pokemon that can grab momentum against them are appreciated teammates. Rotom-W and Tapu Koko can come relatively freely on Dondozo and threaten it with a Volt Switch while Heatran and Mega Diancie can switch into and set up Stealth Rock against Skeledirge. Strong wallbreakers like Mega Medicham, Mega Charizard Y, and Zamazenta all take advantage of Pokemon that Dragonite tends to struggle with, such as Dondozo, allowing it to sweep more easily late-game.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "nimzowitsch", "user_id": 272785}], "teams": [{"name": "Quality checked by", "members": [{"username": "Ryuji", "user_id": 515767}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Mew": {
    "sets": [
      {
        "name": "Cosmic Power",
        "description": "<p>Mew is a potent late-game wincon that can bolster its already impressive defensive profile with Cosmic Power, shrugging off most hits after a few boosts. Mew has near-perfect coverage with Stored Power and Body Press, with the latter able to crucially smash Steel- and Dark-types like Kingambit, Ferrothorn, Mega Tyranitar, and Weavile, which would otherwise exploit it. Covert Cloak is a must for Mew to avoid being worn down by Garganacl’s Salt Cure and help against being burned by Scald from the likes of Toxapex. Tera Poison grants Mew an immunity to Toxic, removing the biggest roadblock to its sweep, allowing it to beat the likes of Heatran, Clodsire, and Gliscor. The given EV spread lets Mew outspeed non-Choice Scarf Urshifu-R. Since Mew is very passive while setting up, it is prone to being overwhelmed by Pokemon like Urshifu-R and Garchomp or used as setup fodder by Pokemon such as Gholdengo and Tornadus-T, thus making it crucial that Mew sets up or Tera at the right time. As such, teammates like Toxapex, Skarmory, and Zapdos are much appreciated to help check those Pokemon for Mew. Taunt from Tornadus-T and Heatran and Trick from Choice Specs Iron Valiant shut Mew down, so having teammates like Gliscor, Gholdengo, and Mega Scizor help deal with them. Gholdengo, in particular, is hard for Mew to deal with, as it can boost at a faster rate than Mew while taking a fully stacked-up Stored Power with ease and being immune to Body Press. Therefore, teammates that can threaten or Pursuit trap it such as Garchomp and Kingambit are very appreciated. Toxapex uses Haze to sit on Mew and forces it to Tera to avoid Toxic, thus overwhelming or removing Toxapex with the likes of Gholdengo, Garganacl, and Heatran allow Mew to set up and win.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "SoBalanced", "user_id": 603814}], "teams": [{"name": "Quality checked by", "members": [{"username": "Taka", "user_id": 595062}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Dawn of Ares", "user_id": 467437}]}]}
  },
  "Slowking": {
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Thanks to its solid special bulk and excellent longevity between Slack Off and Regenerator, Slowking establishes itself as a passable pivot in the metagame. It can switch into foes like Tornadus-T and non-Toxic Heatran, and it can even scout for Choice Specs users such as Dragapult, Iron Valiant, and Tapu Lele. Future Sight + Teleport or Chilly Reception lets Slowking support its frail offensive teammates such as Mega Lopunny and Dragapult, giving them safe switch ins and amplifying their wallbreaking prowess afterwards. Teleport is a much more reliable way of pivoting, as its higher PP makes it more valuable in longer games and it provides Slowking's teammates with a safe switch in against Ferrothorn and other Teleport users like Blissey and Slowbro. Alternatively, Chilly Reception's snow helps disrupt weather teams like sun and rain as well as support Ice-type teammates like Kyurem and Weavile with its Defense boost. Tera Fairy improves Slowking's matchup against Dragapult and Tapu Koko and maintains its Fighting resistance against Mega Lopunny, while Tera Dark lets it better stomach Ghost-type attacks from Gholdengo and Dragapult at the cost of being weaker against Tapu Lele and Iron Valiant. Both Tera choices importantly prevent Slowking from being Pursuit trapped by Kingambit, Weavile, and Mega Tyranitar. Wallbreakers like Zamazenta, Mega Lopunny, Great Tusk, and Kingambit appreciate Slowking's slow pivoting, with the looming Future Sight pressuring their switch-ins like Toxapex, Buzzwole, and defensive Great Tusk. Moreover, Slowking switches into their revenge killers, notably Nasty Plot Tornadus-T and Choice Scarf Tapu Lele. Defensive Pokemon such as Ferrothorn, Ting-Lu, and Tangrowth cover foes like Weavile, Tapu Koko, and Kartana, respectively; Ferrothorn and Tangrowth also deal with rain wallbreakers like Mega Swampert and Barraskewda that would otherwise overwhelm Slowking despite its Water resistance, with the latter in particular forming a Regnerator core with Slowking.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}], "teams": [{"name": "Quality checked by", "members": [{"username": "ChrisPBacon", "user_id": 544502}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Slowking-Galar": {
    "sets": [
      {"name": "Pivot"},
      {
        "name": "Assault Vest",
        "description": "<p>Galarian Slowking is a unique special wall, reliably using Future Sight against passive Pokemon like Toxapex and Clefable while also checking Pokemon like Walking Wake, Iron Valiant, and Iron Moth. It can also take super effective hits from Dragapult and Gholdengo. Flamethrower hits Steel-types like Kingambit, Gholdengo, and Ferrothorn, while Scald allows Galarian Slowking to spread poison and burn alike, crippling common switch-ins like Toxapex, Dragapult, and Gastrodon. Scald also punishes Ground-types like Landorus-T and Great Tusk. Ice Beam catches Ground-types and Dragonite, but it isn't as reliable as Scald, as it leaves Galarian Slowking unable to hit Heatran. Focus Blast instantly KOes Kingambit on the switch and hits Heatran harder, but it is very unreliable. The given EV spread prevents a 2HKO from Choice Specs Protosynthesis Walking Wake's Draco Meteor. Tera Steel helps Galarian Slowking check Fairy-types like Tapu Lele and Hatterene, while Tera Water improves its Walking Wake and rain matchups. Both also make Galarian Slowking neutral to Pursuit from the likes of Kingambit and Weavile. Future Sight support is highly appreciated by Fighting-types like Urshifu-R, Zamazenta, and Iron Valiant, as it pressures their checks in Toxapex, Skeledirge, and Clodsire. They can pressure Pursuit Kingambit, a major roadblock to Galarian Slowking. Knock Off absorbers like offensive Tornadus-T, Clefable, and Gliscor also work well with Galarian Slowking. The former can form a strong Regenerator core pivoting and gaining information through the game. Entry hazard setters like Ferrothorn and Ting-Lu appreciate Galarian Slowking's ability to cripple common Defoggers like Tornadus-T and Zapdos with Sludge Bomb and Scald. In return, Galarian Slowking likes entry hazards wearing down its checks, namely Kingambit, Heatran, and Gholdengo.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Ryuji", "user_id": 515767}], "teams": [{"name": "Quality checked by", "members": [{"username": "ChrisPBacon", "user_id": 544502}, {"username": "adem", "user_id": 529732}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}, {"username": "skippergamez", "user_id": 620268}]}]}
  },
  "Scizor": {
    "sets": [
      {
        "name": "Bulky Swords Dance",
        "description": "<p>Mega Scizor leverages its great bulk and solid defensive typing to serve as a sturdy check to many Pokemon—including Weavile, Kartana, and Tapu Lele—and a solid wincon as well. U-turn allows it to serve as a pivot: easily switching it out of checks such as Gholdengo, Urshifu-R, and Mega Charizard Y, it brings in teammates like Tapu Koko and Dragapult to deal with them. Close Combat can be used to dispose of Steel-types like Ferrothorn and Heatran much more quickly, greatly denting them on the switch. The given EV spread allows Mega Scizor to survive two Close Combats from Mega Lopunny after Stealth Rock and outspeed uninvested Heatran, with the HP and Special Defense EVs helping it check Tapu Lele. Mega Scizor's pivot support is extremely valuable to Pokemon such as Tapu Koko, Rotom-W, and Zamazenta, which all also appreciate how well it exploits defensive Pokemon such as Clodsire, Ferrothorn, and Landorus-T. Rotom-W forms a strong VoltTurn core with Mega Scizor as well, with both pivoting out on their checks and racking up solid chip damage over time. Nasty Plot Tornadus-T appreciates Mega Scizor pressuring specially defensive walls and offensive Pokemon like Weavile and Clodsire, letting it go all-in as an offensive wallbreaker with ease. Mega Scizor wearing down Rotom-W and Heatran is also particularly useful for Tornadus-T, as these Pokemon can heavily damage or cripple Tornadus-T in one way or another. Mega Scizor being completely countered by Gholdengo mandates a Pursuit trapper like Weavile or Kingambit to pressure it. Skeledirge also hard counters Mega Scizor, encouraging the aforementioned teammates as well as Garganacl and Heatran.</p> "
      },
      {
        "name": "Swords Dance + 3 Attacks",
        "description": "<p>This set takes on a much more offensive role, using its solid defensive typing for easy entry points against Pokemon like Weavile and Kingambit, setting up, and threatening the vast majority of the metagame with its strong Technician-boosted attacks. Close Combat KOes Steel-types like Heatran and Ferrothorn, as well as providing a strong neutral hit against Rotom-W. Dual Wingbeat hits Clodsire and Toxapex for reliable neutral damage and also hits Zamazenta super effectively, Knock Off is an alternative to hit Gholdengo reliably and remove items like Leftovers from Rotom-W and Heavy-Duty Boots from Tornadus-T, Skeledirge, and Volcarona. This allows a teammate or Mega Scizor to wear them down much more easily. Knock Off is especially relevant in Rotom-W's case, as removing Leftovers makes it easier to put into KO range of +2 Close Combat. Running Knock Off makes Toxapex a much worse matchup, however, so Pokemon like Great Tusk and Tapu Koko that can pressure it are appreciated. Sand Tomb can be used to reliably beat Clodsire, Toxapex, and Gholdengo, preventing them from reliably checking it. Offensive Mega Scizor fits much better on hyper offense teams, which appreciate its incredibly valuable—though short-term—defensive utility. Grimmsnarl is a perfect teammate, providing dual screens to let it set up against foes like Great Tusk, Dragonite, and Landorus-T; it also pivots Mega Scizor in and appreciates it baiting in Gholdengo, which prevents Grimmsnarl from pivoting as effectively. Gholdengo itself is also a notable partner, as it appreciates Mega Scizor dispatching the most popular Dark-types in Weavile and Kingambit. Entry hazards from suicide leads like Landorus-T and Garchomp allow Mega Scizor to clean late-game, as its foes must be chipped before any sweeping is done. Entry hazards particularly help in wearing down checks like Urshifu-R and bulkier Garchomp sets. Mega Scizor struggles against bulky Steel-resistant Pokemon like Rotom-W and Volcarona; Dragonite and Dragapult can take care of the latter, switching into Volcarona to set up as it switches into Mega Scizor, whereas Great Tusk can remove Leftovers from the former, making it easier for Mega Scizor to dispatch with +2 Close Combat. Physically defensive Unaware walls in Skeledirge and Dondozo completely wall Mega Scizor, so offensive Pokemon that can bait in or wear down these foes, including Iron Valiant, make for solid partners.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Sulo", "user_id": 528036}], "teams": [{"name": "Quality checked by", "members": [{"username": "adem", "user_id": 529732}, {"username": "Ryuji", "user_id": 515767}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Blissey": {
    "sets": [
      {
        "name": "Pink Blob",
        "description": "<p>Blissey's immense special bulk, useful utility moves, and reliable recovery allow it to function as a niche specially defensive pivot, as it checks threats such as Choice Specs Dragapult and Mega Charizard Y. Seismic Toss allows Blissey to pressure anything that isn't a Ghost-type with meaningful damage. Toxic is the preferred option to cripple Pokemon like Mega Charizard Y and Volcarona. Thunder Wave can also be used to annoy fast threats like Tornadus-T and Iron Valiant. It also allows Blissey to status Steel-types like Kingambit, Heatran, and Kartana. Teleport allows Blissey to safely pivot in teammates like Dragapult, Zamazenta, and Mega Medicham. However, Blissey is an acceptable Stealth Rock user if no other fits on your team. Shadow Ball can be considered as a niche option to break Dragapult's Substitutes and chip offensive Gholdengo, but it usually isn't worth dropping other moves. Tera Fairy gives Blissey a Fighting resistance in exchange for negligible Poison and Steel weaknesses, and it reduces the damage it takes from Pursuit users like Kingambit, Weavile, and Mega Tyranitar. This should be used if Blissey absolutely has to take on a Fighting- or Dark-type like Zamazenta, Mega Lopunny, or Weavile. Blissey's defensive profile makes it a liability into certain Ghost-types, specifically Dragon Dance Dragapult and Gholdengo. Kingambit is a great option that deals with the former two threats while also benefitting from Blissey bringing it in safely with Teleport. Other wallbreakers like Tapu Lele, Dragapult, Mega Charizard Y, and Mega Medicham also appreciate pivot support and benefit from Blissey spreading Thunder Wave. A switch-in to powerful physical attackers, like Zamazenta, Mega Lopunny, Mega Medicham, and Kingambit, is necessary. Options like Toxapex, Slowbro, Skarmory, and Great Tusk can help out on this front. Knock Off is irritating for Blissey, as losing its Heavy-Duty Boots is quite detrimental to its pivoting efforts. Options such as Flyinium Z Tornadus-T and Gliscor can help out in this regard.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Sputnik", "user_id": 475916}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "Ryuji", "user_id": 515767}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Tyranitar": {
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<p>Mega Tyranitar serves as a valuable Stealth Rock setter and Pursuit trapper due to its powerful STAB moves, great bulk, and Rock / Dark typing, allowing it to handle Ghost- and Flying-types well. Stone Edge threatens common Defoggers in Tornadus-T, Zapdos, and Rotom-W to ensure its Stealth Rock stays on the field. Crunch dents Pokemon like Dragapult and Gholdengo while doing sizable damage to Gastrodon and Ferrothorn. Alternatively, Superpower can be used over Crunch to immediately threaten Kingambit, Ting-Lu, and Ferrothorn, but it leaves Mega Tyranitar unable to pressure Pokemon like Gholdengo, Clodsire, and Reuniclus. Pursuit traps Pokemon like Tapu Lele, Dragapult, Tornadus-T, and Gholdengo. 108 Speed EVs allow Mega Tyranitar to outspeed Gholdengo. Mega Tyranitar's middling defensive typing leaves it extremely vulnerable to Pokemon such as Mega Lopunny, Great Tusk, and Zamazenta. As such, defensive Pokemon like Zapdos, Gholdengo, and Toxapex pair well with Mega Tyranitar, as they cover the threats it would struggle with. Toxapex in particular appreciates Mega Tyranitar trapping Heatran and Gholdengo with Pursuit, after which it can then stack Toxic Spikes. This, along with Mega Tyranitar's Stealth Rock, wears down each other's checks like Great Tusk, Landorus-T, and Zamazenta. Mega Tyranitar also appreciates Pokemon that can deal with Ground-types, such as Zapdos, Tornadus-T, and Tangrowth. Fighting-type partners such as Iron Valiant and Zamazenta greatly appreciate Mega Tyranitar removing Pokemon like Gholdengo and Reuniclus. Mega Tyranitar's sand enables Excadrill, which is a great offensive partner for it. Excadrill is able to snipe Pokemon like Mega Diancie and Kingambit, while Tyranitar deals with Flying-types like Zapdos and Mega Charizard Y in return. Mega Tyranitar can also chip Pokemon like Rotom-W and Landorus-T, which enables Excadrill break past them more easily.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "hidin", "user_id": 589564}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "ChrisPBacon", "user_id": 544502}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Pelipper": {
    "sets": [
      {
        "name": "Rain Setter",
        "description": "<p>Pelipper is a staple pick on rain teams thanks to its ability, Drizzle. Its physical bulk combined with Scald lets it check and potentially cripple foes such as Mega Lopunny, Mega Scizor, and Great Tusk. Hurricane is an alternative to Defog on teams that use Tornadus-T for entry hazard control, which offers better neutral coverage and the ability to hit foes such as Tangrowth and Tera Grass Heatran. Pelipper also operates as a slow pivot with U-turn, which is greatly appreciated by the team's wallbreakers to ensure that they can enter the field safely. Tera Ground offers an Electric immunity for threats such as Tapu Koko, whereas Tera Steel offers a strong defensive typing, letting Pelipper check Pokemon like Extreme Speed Dragonite in a pinch. As the premier rain setter, Pokemon that rely on rain to boost their power or operate effectively within it, such as Mega Swampert, Floatzel, Barraskewda, and Urshifu-R, make for common teammates. Mega Swampert offers a valuable Electric immunity for Pelipper, checking foes such as Tapu Koko. Tornadus-T can provide entry hazard control with Defog, letting Pelipper enter the field and summon rain without having to fear taking hazard damage. Ferrothorn takes advantage of Pelipper's typing and ability to form a solid defensive core and provide a robust blanket check for opposing rain. In return, Pelipper alleviates Ferrothorn's massive Fire weakness by setting rain, and it can check threats that Ferrothorn fails to cover, such as Mega Lopunny.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TheSorcer3r", "user_id": 580037}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "2020 idm boomer", "user_id": 385157}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Gardevoir": {"sets": [{"name": "Offensive"}]},
  "Sableye": {"sets": [{"name": "Defensive Magic Bounce", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Medicham": {
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<p>Mega Medicham is a tremendously strong wallbreaker due to Pure Power, strong STAB moves, and coverage. Fake Out lets Mega Medicham chip down and revenge kill Pokemon like Mega Lopunny, Iron Valiant, and Tapu Koko. It also can let Mega Medicham stall out rain, Toxic, and Terrain on foes, all while putting opponents into range for one of its stronger attacks safely. Ice Punch lets Mega Medicham get rid of Landorus-T and Dragonite, which can enable it to freely use its STAB moves. Bullet Punch can be used to snipe Pokemon like Iron Valiant, Mega Diancie, and Weavile, and it also removes revenge killers like Tapu Koko and Mega Lopunny after chip damage. Thunder Punch can be used to hit Slowbro, and in tandem with Electric Terrain, it can 2HKO Pokemon like Gholdengo and Victini. Alternatively, Thief can be used to immediately damage the aforementioned Pokemon, so it can use its STAB moves more. Due to Mega Medicham’s frailty and mediocre Speed tier, it is easily revenge killed. Defensive partners like Gholdengo, Ting-Lu, and Ferrothorn help check threats like Choice Scarf Tapu Lele and Dragapult. Knock Off and Pursuit users like Kingambit and Weavile also support Mega Medicham, as they break through Psychic- and Ghost-type Pokemon Mega Medicham struggle with, such as Slowbro, Victini, Gholdengo and Skeledirge, allowing it to consistently use its STAB attacks. Entry hazard support from Pokemon like Ting-Lu, Garchomp, and Ferrothorn benefit Mega Medicham, as it forces a lot of switches and entry hazards wear down checks quickly. Tapu Koko is a good partner for Mega Medicham, as it handles Pokemon like Tornadus-T and Slowbro reliably and powers up Mega Medicham's Thunder Punch. Tapu Lele can also be a good partner for Mega Medicham, as it powers up Zen Headbutt to insane levels, but blocking Fake Out and Bullet Punch from being used can be problematic. Pokemon like Volcarona and Kartana appreciate Torandus-T, Skeledirge, Clodsire, and Gholdengo being pressured constantly by Mega Medicham, enabling them to wreak havoc once the checks are removed or chipped.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "hidin", "user_id": 589564}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kaede", "user_id": 483087}, {"username": "adem", "user_id": 529732}]}, {"name": "Grammar checked by", "members": [{"username": "skippergamez", "user_id": 620268}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Torkoal": {"sets": [{"name": "Sun Setter"}]},
  "Altaria": {"sets": [{"name": "Dragon Dance", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Crawdaunt": {"sets": [{"name": "Choice Band"}, {"name": "Swords Dance", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Floatzel": {
    "sets": [
      {
        "name": "Rain Wallbreaker",
        "description": "<p>Floatzel is an incredible wallbreaker on rain teams, making use of its decent Attack stat powered by its Choice Band. Low Kick hits Ferrothorn and Ice Spinner hits Dragapult and Dragonite more reliably. However, because of Tera Water, its Water-type moves are all boosted considerably, so coverage is often unnecessary. Aqua Jet gives Floatzel priority outside of rain against weakened targets such as Tapu Koko, Iron Valiant, and Mega Lopunny, and it bypasses Kingambit's Sucker Punch. Tornadus-T and Zapdos all appreciate Floatzel's offensive capabilities, as it deals with wallbreakers such as Dragapult, Mega Diancie, Gholdengo, Zamazenta, Mega Lopunny, and Iron Valiant. Zapdos can reliably check Water-types that counter Floatzel like Slowbro and Dondozo. Tornadus-T can weaken and cripple Floatzel checks in Rotom-W, Dondozo, and Ferrothorn, as Knock Off removes Leftovers from them, making it easier for Floatzel to wallbreak. Offensive partners like Manaphy and Mega Swampert can overwhelm those same Water-resistant Pokemon as well as Dragonite. Ferrothorn can check priority users such as the aforementioned Dragonite and Kingambit, alleviating Floatzel's weakness to them.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Milo", "user_id": 540138}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "TheSorcer3r", "user_id": 580037}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Gastrodon": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Gastrodon finds itself a valuable role in National Dex primarily off its invaluable Water and Electric immunities, allowing it to handle terrifying rain sweepers such as Floatzel and Mega Swampert and answer Rotom-W perfectly. Scald lets Gastrodon threaten a burn against otherwise safe switch-ins such as Ferrothorn and Dragonite. Toxic better threatens defensive Pokemon such as opposing Gastrodon, Skeledirge, and Tornadus-T. Earthquake threatens Pokemon like Heatran, Clodsire, and Gholdengo. Relaxed should be selected as Gastrodon's nature if using Earthquake to not lower its damage output; Bold should be used otherwise. Tera Fairy can be used in a pinch to grant Gastrodon a resistance to Fighting against Urshifu-R and Barraskweda and a Dark resistance against Kingambit. The given EV spread maximizes Gastrodon's physical bulk to better take on the likes of Floatzel, Mega Swampert, and Urshifu-R. Gastrodon fits best on balance and bulky offense teams, which appreciate its defensive qualities while being able to supplement its passivity with offensive wallbreakers. Pokemon such as Tornadus-T and Gholdengo can switch into Grass-type coverage from Pokemon like Kartana and Ferrothorn; In return, Gastrodon provides entry hazard support to wear down answers such as Mega Tyranitar, Kingambit, and Clodsire. Strong, fast wallbreakers like Mega Diancie, Iron Valiant, and Zamazenta love having Gastrodon as a fallback measure against the myriad of Water-type revenge killers on rain such as Floatzel and Mega Swampert. If Gastrodon opts to use Spikes, it likes having Stealth Rock setters such as Heatran and Mega Diancie as partners to form an effective entry hazard-stacking core.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "ChrisPBacon", "user_id": 544502}], "teams": [{"name": "Quality checked by", "members": [{"username": "hidin", "user_id": 589564}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Garchomp": {
    "sets": [
      {
        "name": "Offensive Stealth Rock",
        "description": "<p>Garchomp serves as an excellent wallbreaker that possesses great defensive utility, having an Electric-type immunity and being a check to Pokemon like Heatran and Volcarona. Outrage with Dragonium Z muscles through Pokemon like Great Tusk, Tangrowth, and Ting-Lu. Garchomp fits best on offensive teams; Pokemon like Volcarona, Mega Charizard Y, and Tapu Koko benefit from it breaking through Pokemon like Toxapex, Clodsire, and Dragonite. Tapu Koko makes a stellar partner because it can pivot on Garchomp targets in Clodsire, Gastrodon, and Gliscor. In return, Tapu Koko threatens Corviknight and Slowbro, two major roadblocks for Garchomp. Pokemon like Mega Scizor and Kingambit can pressure revenge killers such as Iron Valiant, Weavile, and Dragapult thanks to their strong priority while taking several attacks from them. Rotom-W switches into Pokemon that threaten Garchomp such as Great Tusk and Tornadus-T. Garchomp can take care of Pokemon Rotom-W pivots out on such as Gastrodon, Ferrothorn, and Gholdengo.</p> "
      },
      {
        "name": "TankChomp",
        "description": "<p>Garchomp possesses great role compression and is a good check to contact attackers like Mega Scizor, Dragonite, and Mega Lopunny. Toxic can cripple switch-ins such as Landorus-T, Tangrowth, and Rotom-W. Dragon Tail can stop any setup attempts from Volcarona, Mega Scizor, and Dragonite lacking Ice Spinner and can wear down Pokemon like Corviknight, Rotom-W, and Landorus-T. Alternatively, Flamethrower can rip through Pokemon like Kartana, Mega Scizor, and Ferrothorn. Tera Ghost lets Garchomp spinblock Great Tusk and switch into Fighting-type moves from Pokemon like Mega Medicham and Zamazenta, while Tera Water grants resistances to Gholdengo's Make It Rain and Ice- and Water-type moves from Weavile, Floatzel, and Urshifu-R as well as neutrality to Fairy-type attacks from Iron Valiant and Mega Diancie. Tera Steel gives it a Toxic immunity and improves Garchomp's matchup against Tapu Lele, Kartana, and Dragapult. The given Speed EVs with a Jolly Nature allows Garchomp to outspeed Timid Gholdengo, while maximizing its physical bulk. Teammates like Mega Scizor, Gholdengo, and Volcarona can cover Garchomp's Ice and Fairy weaknesses and threaten out a majority of Garchomp checks such as Iron Valiant, Weavile, and Mega Diancie. In return, Garchomp can switch into Rock- and Fire-type Pokemon like Heatran, Mega Tyranitar, and Volcarona. Knock Off Kingambit and Weavile support Garchomp by crippling common Defoggers like Tornadus-T and Landorus-T.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>Mega Garchomp is a passable wallbreaker thanks to its its staggering Attack stat alongside Swords Dance, busting through bulky Pokemon like Garganacl, Hippowdon, and Toxapex. Its typing and solid natural bulk grant it it multiple setup opportunities, such as in the face of Volcarona, Mega Tyranitar, non-Toxic Heatran, and Zapdos. Scale Shot's multi-hit nature makes it effective against Dragonite and Substitute users like Kyurem and Serperior, as well as offensive teams supported by Cyclizar's Shed Tail. Most importantly, the Speed boost lets Mega Garchomp outpace would-be revenge killers like Dragapult, Iron Valiant, Tapu Koko, and—if it decides not to Mega Evolve yet—Choice Scarf Tapu Lele, allowing it to potentially clean up late-game. Fire Fang hits Skarmory, Corviknight, Tangrowth, and cleanly OHKOes Ferrothorn at +2. Mega Garchomp works well on offensive teams, ranging from offense to hyper offense. Pivots like Tapu Koko, Dragapult, Tornadus-T, and Victini give Mega Garchomp easy entry, bringing it onto their switch-ins such as Clodsire, Toxapex, Heatran, and Skeledirge, respectively. Tapu Fini provides Misty Terrain to prevent Mega Garchomp from being crippled by the aforementioned walls—at the cost of weakening its Scale Shot, however—as well as a switch-in to Ice Shard users like Baxcalibur and Weavile that can revenge kill Mega Garchomp easily. Dual screens and Shed Tail support from Tapu Koko or Grimmsnarl and Cyclizar give Mega Garchomp more setup opportunities. Setup sweepers such as Volcarona, Iron Valiant, and Dragonite enjoy Mega Garchomp pressuring foes like Skeledirge and Toxapex. Special wallbreakers like the aforementioned Iron Valiant, Tapu Lele, and Dragapult help against physical walls such as Dondozo and Tera Water Skeledirge that Mega Garchomp struggles with; Tapu Lele's Psychic Terrain also prevents Mega Garchomp's sweep from being cut short by priority attacks from the likes of Weavile, Mega Lopunny, and Kingambit.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "hidin", "user_id": 589564}, {"username": "royalfluxh", "user_id": 493260}], "teams": [{"name": "Quality checked by", "members": [{"username": "Ryuji", "user_id": 515767}, {"username": "Sulo", "user_id": 528036}, {"username": "2020 idm boomer", "user_id": 385157}]}, {"name": "Grammar checked by", "members": [{"username": "CryoGyro", "user_id": 331519}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Hippowdon": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Hippowdon is a bulky Ground-type wall and Stealth Rock setter able to switch into threatening offensive Pokemon such as Choice Scarf Tapu Lele, Iron Valiant, Tapu Koko, and Mega Charizard Y. It can find plenty of time to set up Stealth Rock and spread chip damage with Toxic and its ability Sand Stream. Sand Stream also allows Hippowdon to disrupt opposing weather, which is bolstered by its positive matchup against every other weather setter. Toxic notably nets a ton of chip damage on Defoggers attempting to get rid of Hippowdon's Stealth Rock and Ground-Immune Pokemon switching into Earthquake, such as Rotom-W, Tornadus-T, and Mega Charizard Y. Hippowdon can Terastallize into the Steel typing to avoid Toxic in addition to Grass-, Water-, and Ice-type attacks while maintaining its sand immunity and Stealth Rock resistance. Even beyond the simple type matchup chart changes, it allows Hippowdon to more easily check its targets such as Tornadus-T, Tapu Lele, Zapdos, and Mega Diancie. Maximum Special Defense EVs are ran due to Hippowdon having more valuable special targets than physical, namely the aforementioned Pokemon. Mega Lopunny and Tornadus-T appreciate Hippowdon's presence, as it checks both Choice Scarf Tapu Lele and Zapdos while setting up Stealth Rock to help wear down their checks. Defensively, Hippowdon supports Pokemon such as Garganacl and Skarmory; Garganacl appreciates the sand and its attached benefits and Skarmory appreciates the sturdy Ground-type anchor and special wall. Hippowdon struggles to fend off strong physical attackers like Kingambit, Mega Scizor, Kartana, and Mega Gyarados. For this reason, it pairs exquisitely with strong physical walls such as Skarmory and Buzzwole. Hippowdon also suffers from a Spikes vulnerability, meaning it appreciates Defog support from Pokemon like Tornadus-T and Zapdos.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "gamer but swag", "user_id": 585800}], "teams": [{"name": "Quality checked by", "members": [{"username": "ChrisPBacon", "user_id": 544502}, {"username": "hidin", "user_id": 589564}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Weavile": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Weavile's potent STAB combination and great offensive stats give it an excellent place in the National Dex metagame, with its ability to threaten teams offensively and Pursuit trap Pokemon such as Gholdengo and Galarian Slowking, easing matchups for teammates such as Sneasler and Tapu Lele. Triple Axel threatens OHKOs on offensive Pokemon such as Mega Charizard Y, Kartana, and Sneasler and 2HKOs on physically defensive Ferrothorn after minimal chip damage. Knock Off is a powerful STAB option that heavily damages switch-ins predicting Triple Axel such as Rotom-W, Heatran, and Alomomola. Ice Shard gives Weavile some form of speed control and helps finish off weakened foes that normally threaten it such as Mega Lopunny, Iron Valiant, and Tapu Koko, as well as boosted Pokemon such as Tera Flying Unburden Sneasler and Tera Grass Volcarona. Furthermore, Weavile's longevity, and therefore its offensive pressure, is limited by its weakness to Stealth Rock, so Defoggers such as Gliscor, Landorus-T, and Tornadus-T are all very helpful. Mega Scizor's U-turn and Alomomola's Flip Turn are also appreciated to bring Weavile in safely, due to its frailty. In return, Weavile helps these Pokemon out by getting rid of thorns such as Great Tusk, Gliscor, and Mega Charizard Y, letting Scizor have a larger role offensively, as well as removing Pokemon like Gholdengo and Zapdos for Alomomola, which can use Alomomola as setup fodder and threaten an OHKO with Thunderbolt or Volt Switch to gain momentum, respectively. Mega Medicham and Iron Valiant are both excellent partners for Weavile, taking care of Toxapex, as well as bulky Steel-types such as Heatran and Ferrothorn, with Weavile Pursuit trapping Gholdengo for both of them or forcing it to Terastallize. Although Tera Dark is the preferred Tera type in order to mitigate Weavile's weakness to Stealth Rock and boost Knock Off to absurd levels, Tera Ice can also be used, making Ice Shard an extremely threatening priority move, able to even 2HKO Pokemon that pressure Weavile such as Tapu Koko and Iron Valiant.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>Weavile's great Speed and Attack paired with Swords Dance makes it one of the most versatile Pokemon in the metagame, being able to wallbreak, revenge kill, and clean late-game. Most of Weavile's checks, such as Urshifu-R, Kingambit, and Heatran, aren't long-term checks and don't like losing their item. It also requires a minimal amount of chip damage on Pokemon like Buzzwole, Iron Hands, and Toxapex to effectively break them. Triple Axel is used for the larger damage output, but Ice Spinner can be used for a consistent and accurate STAB move. Icicle Crash avoids residual damage from contact abilities like Iron Barbs while also avoiding Static, Flame Body, and Rocky Helmet. Knock Off is usually preferred, as it can remove items from Toxapex and Ferrothorn and support Weavile's team, but Darkinium Z paired with Throat Chop allows Weavile to nuke its checks, mainly Toxapex, Corviknight, and Ferrothorn. Tera Dark removes Weavile's weakness to Bullet Punch from Mega Scizor while also propelling Knock Off's damage to nearly unstoppable levels. Pivot support from the likes of Landorus-T, Tornadus-T, and Tapu Koko helps Weavile by bringing it safely onto the field while also allowing it to set up, making it more consistent. Magnezone works well with Weavile, as it can trap and remove Mega Scizor, Ferrothorn, and Corviknight for it. In return, Weavile pressures Ground-types like Landorus-T and Garchomp. Weavile also appreciates being paired with strong wallbreakers that share checks with it such as Kartana, Tapu Lele, and Mega Mawile, as they can overwhelm them throughout the game. Weavile enjoys Spikes support from Ferrothorn, Ting-Lu, and Garchomp, as it forces chip damage on its checks, such as Mega Scizor, Toxapex, and Iron Hands.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "CPBBAE", "user_id": 619787}, {"username": "Ryuji", "user_id": 515767}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}, {"username": "Sulo", "user_id": 528036}, {"username": "hidin", "user_id": 589564}]}, {"name": "Grammar checked by", "members": [{"username": "berry", "user_id": 226455}, {"username": "autumn", "user_id": 384270}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Magnezone": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Magnezone carves itself a niche thanks to Magnet Pull, which allows it to trap and remove Steel-types such as Mega Scizor, Kartana, Ferrothorn, and Skarmory, potentially forcing the latter three to Terastallize so teammates such as Kartana and Tapu Lele can beat them. Volt Switch lets Magnezone maintain momentum while eliminating foes such as Skarmory and chipping Heatran, which cannot be trapped and removed consistently. Alternatively, Tera Blast + Tera Fighting lets Magnezone remove Kingambit, potentially forcing it to Terastallize as well. Hidden Power Fire hits foes such as the aforementioned Mega Scizor, Kartana, and Ferrothorn. Toxic is another alternative that punishes switch-ins such as Gastrodon, Ting-Lu, and Hippowdon, though it can be difficult to justify over other alternatives, as it hinders Magnezone's effectiveness as a trapper. Magnezone should only Terastallize when it can trap and eliminate Kingambit, since teammates such as Dragapult and Dragonite take advantage of Tera better. The given EV spread allows Magnezone to survive an unboosted Sacred Sword from Kartana. Teammates such as Dragonite and Kartana appreciate Magnezone removing foes such as Skarmory and Ferrothorn, allowing them to sweep easier. The former can also safely switch into Ground-type attacks for Magnezone, while the latter threatens troublesome Ground-types such as Hippowdon and Gastrodon. Teammates such as Dragapult and Landorus-T provide pivoting support for Magnezone, granting it free entry against foes such as Skarmory and Kingambit to ease prediction. Dragapult in particular appreciates Magnezone trapping and removing Kingambit, allowing it to sweep without fear of being Pursuit trapped.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TheSorcer3r", "user_id": 580037}], "teams": [{"name": "Quality checked by", "members": [{"username": "ChrisPBacon", "user_id": 544502}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Gliscor": {
    "sets": [
      {
        "name": "Hazards Support",
        "description": "<p>Thanks to its respectable bulk and fantastic passive longevity with Poison Heal, Gliscor occupies a fantastic niche on defensive teams. Its lack of use for its item slot after its activation combined with its Spikes immunity allows Gliscor to withstand weaker Knock Off attempts from Tornadus-T, Toxapex, and Ferrothorn. Gliscor can use its longevity to act as an excellent Defog user, as it can outlast common Stealth Rock setters such as Landorus-T, Ting-Lu, and Garganacl. Alternatively, Gliscor can opt for Stealth Rock if its team prefers it over Defog. Roost keeps Gliscor healthy alongside Poison Heal, allowing it to drain the PP of moves such as Heatran's Magma Storm and Garganacl's Salt Cure. Toxic allows Gliscor to pressure common entry hazard setters and Ground-immune Pokemon, such as Landorus-T, Ting-Lu, Rotom-W, and Tornadus-T. It also allows Gliscor to cripple offensive Pokemon such as Dragapult and Tapu Lele in a pinch. Tera Fairy gives Gliscor a generally solid defensive typing with few weaknesses, although at the cost of its Spikes immunity. The given HP EVs maximize Gliscor's recovery from Poison Heal and special bulk, with the remainder in Speed to outspeed Rotom-W. Gliscor fits best on defensive teams that appreciate its immense survivability and great support options. As such, Gliscor pairs well with sturdy physical and special walls, such as Skeledirge, Skarmory, Buzzwole, and Clodsire, since its relatively unremarkable bulk puts it at risk of being overwhelmed often. In return, it can switch into weak attacks with problematic secondary effects, such as Toxapex's Scald and Garganacl's Salt Cure, as well as help teammates keep their held items by absorbing Knock Off. Pokemon weak to entry hazards such as Nasty Plot Tornadus-T and Garganacl pair well with Gliscor's Defog support, while they act as threatening late-game wincons after Gliscor has worn down their checks. Gliscor pairs exceptionally well with Toxapex, as they form an incredibly sturdy pivoting core due to their incredible passive recovery.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance Gliscor is an incredibly potent wincon, using its incredible longevity and solid bulk to effortlessly setup on passive Pokemon such as Landorus-T, Toxapex, and Clefable. Facade provides Gliscor with an excellent alternative move to hit Ground-resistant and -immune Pokemon such as Skarmory, Zapdos, and Buzzwole, with its ample PP ensuring that it can outstall their recovery PP if necessary. Roost provides Gliscor with instant recovery, allowing it to check Pokemon like Mega Diancie and Heatran. The given EVs allow Gliscor to fulfill this purpose with Special Defense investment, with the HP maximizing its recovery from Poison Heal. Tera Fairy allows Gliscor to leverage a typing with few exploitable weaknesses, given Steel-types such as Kingambit and Gholdengo fear its Earthquake, while Tera Water improves Gliscor's matchup against Pokemon like Volcarona and Urshifu-R. However, it comes with more exploitable weaknesses, given the prominence of Tapu Koko, Rotom-W, and Ferrothorn. Gliscor fits best on balance and fat teams, which appreciate its ability to tear through opposing defensive cores while providing enough of a defensive backbone in return to facilitate this. Pokemon like Toxapex, Skarmory, and Gholdengo can exploit Gliscor's temporary checks such as Great Tusk, Skarmory, and Buzzwole, generating progress of their own. On the flip side, revenge killers such as Mega Lopunny and Dragapult can threaten offensive teams, given Gliscor's tendency to be overwhelmed when facing multiple strong wallbreakers. Gliscor appreciates Pursuit support from Mega Tyranitar or Kingambit, as it removes Gliscor's few true walls in Tera Ghost Rotom-W and Air Balloon Gholdengo.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "ChrisPBacon", "user_id": 544502}], "teams": [{"name": "Quality checked by", "members": [{"username": "Ryuji", "user_id": 515767}, {"username": "hidin", "user_id": 589564}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "hidin", "user_id": 589564}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Rotom-Wash": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Blessed with great typing alongside Levitate, Rotom-W is an exceptional defensive pivot, able to switch in and cripple physical attackers with Will-O-Wisp, as well as pivoting out of them safely using Volt Switch in order to bring in teammates. Furthermore, offensive teams appreciate its ability to check a multitude of threats, such as Mega Scizor, Mega Swampert, and Heatran. Common entry hazard setters such as Hisuian Samurott and Great Tusk value Rotom-W's STAB combination of Hydro Pump + Volt Switch, which naturally hits most hazard removers of the tier such as Great Tusk, Landorus-T, Gliscor, and Tornadus-T for super effective damage, threatening them and keeping up hazards. This also helps teammates such as Urshifu-R, Mega Lopunny, and Mega Diancie wallbreak more easily, as the added chip helps in breaking down their checks. Pain Split is Rotom-W's main form of recovery, allowing it to keep itself healthy throughout a match, although it is shaky due to its inconsistency. Defog is also an option, further facilitating bringing frail teammates in safely; however, Rotom-W struggles to threaten the premier Defog blocker in Gholdengo, although it can pivot out of it with Volt Switch. Due to Dragon-types' natural resistance to Water- and Electric-type moves, Fairy- and Ice-types such as Iron Valiant, Tapu Lele, and Weavile are extremely helpful in forcing progress against them. Rotom-W also struggles against Grass-types such as Kartana and Ferrothorn, which Volcarona, Mega Scizor, and Mega Charizard Y help threaten, with Mega Scizor notably forming a powerful VoltTurn core with Rotom-W. Tera Steel is the preferred Tera type for Rotom-W, granting it a number of useful resistances such as to Baxcalibur's Glaive Rush and Icicle Spear as well as Fairy-type STAB moves from Mega Diancie, Tapu Lele, and Iron Valiant. Tera Steel also grants an immunity to Toxic from Pokemon like Clodsire, Gliscor, and Toxapex, which would otherwise severely dampen Rotom-W's lifespan. Tera Ghost is another great option in order to spinblock Great Tusk, wall Swords Dance Gliscor, and, in a pinch, gain an immunity to Fighting-type STAB moves from Pokemon like Zamazenta, Urshifu-R, Great Tusk, and Sneasler.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Rotom-W functions as a shockingly potent pivot, as a lightning-quick Volt Switch allows it to reliably create big surges of momentum for teammates. Will-O-Wisp reliably chips down bulkier threats like Mega Scizor and Garchomp while also surprising faster physical attackers such as Mega Lopunny. Thunder Wave is an option that can pour a cold water onto a sea of speedy sweepers such as Dragon Dance Dragapult and Swords Dance Kartana, slowing them down. Trick stifles walls like Ferrothorn and Gastrodon who could otherwise stem the tide of Rotom-W’s momentum. Choice Scarf Rotom-W should not be Terastalizing in most cases, but a Steel or Ghost typing can be situationally useful against prominent metagame forces such as Great Tusk and Tapu Lele. Other pivots such as Mega Scizor, Tornadus-T, and Victini can create formidable VoltTurn cores with Rotom-W. Victini in particular deals with Grass-types like Ferrothorn and Kartana, while Rotom-W can threaten physically defensive walls such as Landorus-T and Great Tusk. Strong wallbreakers like Heatran, Iron Valiant, and Mega Medicham pair swimmingly with Rotom-W, as they plow through common defensive staples such as Gastrodon and Ferrothorn and benefit from Rotom-W pivoting them into advantageous positions.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "CPBBAE", "user_id": 619787}, {"username": "hidin", "user_id": 589564}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}, {"username": "sanguine", "user_id": 241308}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}, {"username": "red fintans", "user_id": 637479}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Heatran": {
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Heatran serves as an effective defensive pivot into Pokemon such as Tapu Lele, Tornadus-T, Victini, Mega Scizor lacking Close Combat, Volcarona, and Gholdengo. Magma Storm allows Heatran to trap and remove defensive Pokemon, such as Zapdos, Toxapex, and Skeledirge. Taunt allows Heatran to deny recovery from Pokemon such as Gastrodon, Clodsire, and Zapdos, making trapping them much more efficient, though it has to Terastallize for the former two. Earth Power provides consistent damage versus Pokemon such as Clodsire, Toxapex, and Gastrodon while also allowing Heatran to deal damage without running the risk of missing Magma Storm, particularly on its trapped opponents. Tera Grass allows Heatran to invalidate typical counterplay such as Gastrodon and Clodsire while also avoiding being revenge killed by Pokemon such as Landorus-T and Great Tusk. Taunt further bolsters Heatran's effective use of Tera, as it can avoid one of its only potential flaws in becoming vulnerable to Toxic. Heatran can also use Toxic itself to threaten Pokemon using it to set up, such as Garchomp and Dragonite while reducing longevity of Pokemon such as Pelipper, Mega Swampert, and opposing Terastallized Heatran. Tera Grass in conjunction with Flash Fire gives Heatran a unique defensive profile that lets it wall Pokemon such as Mega Charizard Y and opposing Heatran. Heatran must be careful with Tera usage, as Tera Grass can leave it vulnerable to Pokemon such as Volcarona and Tornadus-T. The given EV spread allows Heatran to outspeed uninvested Gholdengo while maximizing special bulk. Electric-types such as Tapu Koko, Zapdos, and Rotom-W appreciate Heatran’s ability to bait and remove popular Ground-types once Terastallized, such as Landorus-T, Clodsire, and Gastrodon, as well as heavily chippping Garchomp. Teammates such as Urshifu-R, Dragapult, and Mega Lopunny appreciate Heatran's ability to check Tapu Lele, taking its often choice locked STAB attacks and setting Stealth Rock or firing off a Magma Storm to force progress, benefitting its teammates. Pokemon such as Dragonite and Garchomp can benefit Heatran defensively with both punishing physical attackers such as Mega-Lopunny while also capitalizing on its wallbreaking potential. Heatran is also able to bait and eliminate Tera Fairy Skeledirge for these aforementioned teammates. Rotom-W defensively supports Heatran by preventing it from immediately Terastallizing to beat Clodsire, opposing Rotom-W, and Landorus-T if not desired, providing a safe switch. Heatran struggles to stay healthy in certain matchups versus offensive entry hazard-stacking teams that deny it from coming in freely without seriously chipping itself, so Defoggers like Tornadus-T benefit Heatran while also providing a Ground immunity. Heatran can take advantage of Choice-locked Grass types such as Rillaboom and Kartana when they are trying to hit Rotom-W, and Tornadus-T particularly likes Heatran's ability to check Zapdos and Tapu Koko. Heatran appreciates Pokemon who can soak up Fighting-type moves such as Great Tusk and Tangrowth as Heatran tends to invite in particularly strong revenge killers like Mega-Lopunny and opposing Great Tusk.</p> "
      },
      {
        "name": "Offensive",
        "description": "<p>Thanks to its unique typing and the combination of Magma Storm, Taunt, and Toxic, Heatran acts as an offensive wallbreaker capable of trapping and remove Pokemon like Clodsire and Toxapex for its teammates. Heatran's fantastic typing also allows it to check Pokemon like Tornadus-T, non-Close Combat or Sand Tomb Mega Scizor, and Tapu Lele. Leftovers gives Heatran longevity and consistency in its role, while Air Balloon lets it check itself and avoid Earthquake from common switch-ins like Garchomp, Gastrodon, and Gliscor. Firium Z allows Heatran to nuke the aforementioned Gliscor and Clodsire. While it doesn't help Heatran offensively, Tera Grass is its best Tera type; it gives it a resistance to Earthquake and takes advantage of the aforementioned Ground-types while also allowing it to be a nightmare for rain teams, as it can now spread Toxic and chip foes on rain very easily. Pivots like Tornadus-T, Tapu Koko, and Rotom-W makes great partners, as they lure Steel-types like Ferrothorn, Corviknight, and Mega Scizor, letting Heatran threaten them with a KO. It also appreciates Pokemon that share checks with it, such as Dragapult, Tornadus-T, and Gholdengo, as Heatran can cripple these common checks, namely Toxapex, Mega Tyranitar, and Gastrodon. Knock Off users like Toxapex and Tornadus-T remove Clodsire's and Toxapex's items, making them less consistent at checking Heatran in the long run.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "sealoo", "user_id": 514772}, {"username": "Ryuji", "user_id": 515767}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "hidin", "user_id": 589564}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Cresselia": {
    "sets": [
      {
        "name": "Stored Power",
        "description": "<p>Cresselia serves as a potentially terrifying setup sweeper, using its naturally titanic mixed bulk alongside Terastallization to accumulate multiple Calm Mind boosts, bolstering its Stored Power to incredibly dangerous levels to easily snowball if given the opportunity. Even without Terastallization, it can use its natural typing to withstand attacks from dangerous Pokemon such as Zamazenta, Great Tusk, and Mega Medicham. Hidden Power Fighting is the preferred coverage move to hit Mega Tyranitar and Heatran much harder, while Moonblast provides a stronger hit against the likes of Dragapult and Urshifu-R if Cresselia cannot afford to accumulate multiple Calm Mind boosts. Tera Poison is essential for removing Cresselia's weaknesses to Dark- and Ghost-type attacks from Dragapult, Gholdengo, and Hisuian Samurott while providing less exploitable weaknesses compared to Tera Steel, which makes Cresselia prone to being revenge killed by Fighting- and Fire-types such as Mega Lopunny, Sneasler, Heatran, and Mega Charizard Y. Covert Cloak allows Cresselia to negate secondary effects from Garganacl's Salt Cure and status from the likes of Toxapex, Sneasler, and Zapdos, while Leftovers provides passive recovery that makes Cresselia less exploitable and forced to heal. Maximum Speed EVs allow Cresselia to consistently outspeed Heatran and Gholdengo, which could otherwise irritate it, although more Defense investment could be used instead to better withstand attacks from the likes of Urshifu-R and Zamazenta. Cresselia fits best on either bulky balance or hyper offense teams, both able to provide support in different ways; the former give Cresselia a defensive core to fall back on should its sweep fail, while the latter pressure opposing defensive teams and can provide dual screens support via Tapu Koko and Dragapult to bolster its bulk even further. Both playstyles can reliably keep up Spikes using Skarmory, Clodsire, Mega Diancie, or Garchomp, which Cresselia mandates in order to wear down its checks such as Toxapex, Ferrothorn, and Heatran. Similarly, Knock Off support from the likes of Toxapex and Iron Valiant helps Cresselia pressure the aforementioned checks more effectively. Cresselia has difficulty withstanding rain teams due to them cutting Moonlight's healing, so defensive partners that match up positively against them such as Toxapex and Tera Water or Dragon Garganacl are appreciated. Cresselia struggles with bulkier playstyles that can neutralize it with the likes of Haze Toxapex and Unaware Tera Dark Clodsire, so Pokemon that can break defensive teams such as Swords Dance Gliscor and Gholdengo make for good partners.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "ChrisPBacon", "user_id": 544502}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Manaphy": {
    "sets": [
      {
        "name": "Rain Wallbreaker",
        "description": "<p>Manaphy carves a small niche as an adequate wallbreaker on rain teams. Its Tail Glow-boosted Hydro Vortex possesses nuclear power, capable of feats like OHKOing Chansey after Stealth Rock and significantly denting Pokemon such as Ferrothorn, Toxapex, and Tera Grass Heatran that give rain wallbreakers a hard time. Longevity from Rest + Hydration lets it sponge status moves in rain against defensive teams, which gives it plenty of opportunities to wallbreak by shrugging off their chip damage, such as against Toxapex and Clodsire's Toxic and Garganacl's Salt Cure. Energy Ball covers Gastrodon as well as Water-resistant foes like Rotom-W, Tera Water Ting-Lu, and Tera Water Garganacl without expending its Z-Move. Alternatively, Psychic hits Water Absorb Clodsire and Toxapex much stronger. Pelipper is a mandatory teammate due to providing the highly important rain with Drizzle. Swift Swim users like Mega Swampert and Barraskewda can keep the offensive pressure up against the opposition; their high Speed allows them to beat offensive teams by outpacing fast Pokemon like Mega Lopunny, Iron Valiant, and Tapu Koko that can overwhelm Manaphy, and they enjoy it dealing with bulky teams in return, impairing the likes of Tangrowth, Slowbro, and Rotom-W for them. Utility options from Tornadus-T and Ferrothorn are also appreciated; the former checks Kartana and Serperior that would otherwise revenge kill Manaphy, while the latter covers Tapu Koko and provides entry hazards. Kingambit and Weavile can Pursuit trap Dragapult and Mega Latias, both of which are problematic for Manaphy to face.</p> "
      },
      {
        "name": "Tail Glow",
        "description": "<p>Manaphy has a niche as a powerful wallbreaker outside of rain thanks to Tail Glow and its solid coverage, breaking through defensive foes such as Hippowdon, Heatran, and Garganacl. Energy Ball hits foes such as Gastrodon, Rotom-W, and Tapu Fini while Psychic hits foes such as Toxapex and Water Absorb Clodsire. Rindo Berry can be used so Manaphy can avoid revenge killers such as Kartana while improving its matchup against foes such as Tangrowth. Alternatively, Wacan Berry helps prevent Manaphy from being revenge killed by Tapu Koko and Iron Valiant. Ice Beam can be used over Psychic or Energy Ball to dent Dragonite, Ferrothorn, and Hydreigon, but Manaphy can no longer hit foes such as Toxapex and Gastrodon. Salac Berry with Substitute with either Tera Steel or Grass can be used to exploit the Pokemon that Manaphy threatens such as Hippowdon and Garganacl, outspeeding would-be revenge killers such as Tapu Koko and Kartana. Tera Water is used to boost the power of Surf, allowing Manaphy to 2HKO foes such as Ferrothorn and Unaware Clodsire. Manaphy fits best on offensive teams that appreciate its wallbreaking capabilities. Dual screens support from Tapu Koko or Grimmsnarl improves Manaphy's longevity, allowing it to set up easier. Teammates such as Dragapult and Volcarona appreciate Manaphy removing troublesome foes such as Mega Tyranitar, Kingambit, and Heatran for them to sweep. Manaphy also appreciates entry hazard support from teammates such as Glimmora and Landorus-T weakening foes such as Ferrothorn so Manaphy can break through them easier.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TheSorcer3r", "user_id": 580037}, {"username": "royalfluxh", "user_id": 493260}], "teams": [{"name": "Quality checked by", "members": [{"username": "hidin", "user_id": 589564}, {"username": "Sulo", "user_id": 528036}, {"username": "TheSorcer3r", "user_id": 580037}, {"username": "ChrisPBacon", "user_id": 544502}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Samurott-Hisui": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Scarf"}]},
  "Lilligant-Hisui": {
    "sets": [
      {
        "name": "Sun Sweeper",
        "description": "<p>With Chlorophyll, powerful STAB options in Solar Blade and Close Combat, along with a respectable base 105 Attack stat, Hisuian Lilligant can function as a powerful sun sweeper. It pairs well with the main sun setter, Mega Charizard Y, as it can switch into and threaten Mega Charizard Y’s checks such as Hippowdon, Heatran, and Clodsire; in return, Mega Charizard Y beats its checks like Gholdengo and Mega Scizor, if Hisuian Lilligant lacks Tera Blast. Solar Blade is used for raw power, although Leaf Blade is still an option for consistency outside sun. Tera Blast Fire, especially in sun, gives Lilligant a powerful third STAB option to punish foes that can tank its original STAB combination like Gholdengo, Mega Scizor, and Tera Poison Cresselia. Sleep Powder is an option to shut down checks such as Dragapult or scout for Tera types from Pokemon like Kingambit and Dondozo, which can be used as setup fodders or opportunities to give a free switch to an ally; this also allows Hisuian Lilligant to use Tera Fighting over Tera Fire for more power. Ice Spinner is another option, granting an OHKO on Flying-types that can absorb Hisuian Lilligant's STAB options such as Landorus-T, Tornadus-T, and most Zapdos sets. Hazard support is invaluable in allowing boosted Solar Blade to OHKO Toxapex lacking Heavy-Duty Boots and Mega Scizor, making Great Tusk and Heatran good partners that also passively benefit from the sun. Finally, Hisuian Lilligant is vulnerable to being revenge killed by faster threats once the sun ends, so it appreciates a sturdy defensive core to back it up; Toxapex, Heatran, and Great Tusk can tank hits from and reliably check threats such as Iron Valiant and Mega Lopunny once the sun goes down, while Landorus-T and Rotom-W are examples of pivots that can help bring Hisuian Lilligant in more easily.</p> "
      },
      {
        "name": "Hustle Breaker",
        "description": "<p>Hustle coupled with Victory Dance can be used to break common defensive Pokemon like Toxapex, Great Tusk, Landorus, Kingambit, and Heatran; Hisuian Lilligant also outspeeds a good portion of the metagame after a Victory Dance boost, allowing it to threaten even common Choice Scarf users such as Urshifu-R, Tapu Lele, and Gholdengo. Its main drawback lies in the decrease in accuracy, which makes it inconsistent and potentially easy to KO. Wide Lens can be used to circumvent this, as the accuracy boost will minimize the chances of a miss. Grassium Z can allow Hisuian Lilligant to dismantle defensive cores, letting it OHKO the likes of Toxapex , Landorus-T, and defensive Tornadus-T and heavily damage Zapdos after a Victory Dance and Stealth Rock damage to potentially open up a hole for another ally like Kartana or Volcarona to clean up. Victory Dance allows it to outpace most of the metagame and fire off powerful attacks. Tera Blast Ground allows Hisuian Lilligant to snipe Gholdengo and Skeledirge for super effective damage whilst also notably beating common Poison-types like Toxapex and Sneasler. Sleep Powder can be considered to shut down foes and set up more easily. Ice Spinner is also an option to beat common Flying-types like Landorus-T, Gliscor, and Tera Flying Kingambit. Icium Z is an option when running this, as it allows Hisuian Lilligant to score an OHKO on Gliscor, defensive Landorus-T, and defensive Garchomp whilst avoiding Rocky Helmet and Rough Skin chip from the latter two. Hisuian Lilligant has trouble setting up, as it is frail enough to be susceptible to the multitude of offensive Pokemon in the tier. Its inconsistent accuracy may also sometimes leave it open to attacks. Thus, dual screens support from the likes of Grimmsnarl and Tapu Koko is beneficial, although it should be noted that the latter summons Electric Terrain, which nullifies Sleep Powder. Entry hazard support is important to score OHKOs on certain Pokemon; for example, Bloom Doom OHKOes Toxapex and Tornadus lacking Heavy-Duty Boots after Stealth Rock damage. As such, Garchomp and Ferrothorn are examples of good entry hazard setters. Finally, Hisuian Lilligant can still be defensively checked by Pokemon like Zapdos, if lacking Ice Spinner, Volcarona, and defensive Gholdengo; allies that can beat these checks include Volcarona and Mega Diancie.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "red fintans", "user_id": 637479}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Zoroark-Hisui": {
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<p>Hisuian Zoroark plays as a terrifying setup sweeper with its Nasty Plot set, as it has an amazing STAB combination and can bait Pokemon with Illusion. It can break through Heatran, Ferrothorn, Ting-Lu, and Kingambit with Focus Blast, which in tandem with Tera Fighting allows Hisuian Zoroark to strengthen its Focus Blast to break the aforementioned threats more easily while also baiting Sucker Punch from Kingambit. Setup sweepers and wallbreakers like Mega Scizor and Iron Valiant appreciate Hisuian Zoroark baiting Skeledirge and Gholdengo. In return, Mega Scizor deals with Weavile and Kartana while Iron Valiant threatens Ting-Lu and Kingambit. Great Tusk is also a valuable teammate, as it deals with threats like Kingambit and Mega Lopunny while also providing general utility. While Hisuian Zoroark is powerful, it is vulernable to revenge killers such as Mega Lopunny, Dragapult, and Tapu Koko. As such, Pokemon like Zapdos, Slowbro, Ferrothorn, Kingambit and Great Tusk are good partners. Checks to revenge killers like Choice Scarf Tapu Lele and Dragapult are recommended; these include Mega Scizor, Gholdengo, Ting-Lu, Kingambit, and Heatran.</p> "
      },
      {
        "name": "Happy Hour",
        "description": "<p>With Happy Hour + Normalium Z, Hisuian Zoroark becomes a decent wincon, being given setup opportunities by baiting Pokemon with Illusion. +1 Focus Blast OHKOes Steel-types such as Heatran and Ferrothorn and Dark-types like Weavile and Mega Gyarados. Happy Hour Hisuian Zoroark is best suited on hyper offense teams because it can take advantage of dual screens to set up more easily. Hisuian Zoroark can disguise as Defiant Kingambit and bait Kingambit checks like Great Tusk and Skarmory. Tapu Koko can provide dual screens and pivot into Hisuian Zoroark against Pokemon like Gholdengo and Tornadus-T; this is best when Hisuian Zoroark is disguised as Kingambit or Mega Gyarados. Grimmsnarl is also an excellent teammate because it provides dual screens and lures and KOs Kingambit with Superpower. Tapu Lele appreciates Hisuian Zoroark beating Steel-types like Gholdengo and Heatran; Tapu Lele's Psychic Terrain also blocks Kingambit's Sucker Punch, letting Hisuian Zoroark KO it. Similarly, Mega Gyarados offensively checks Kingambit and wallbreaks early-game, letting Hisuian Zoroark sweep late-game. Dragapult can form an offensive Ghost-spam core with Hisuian Zoroark and appreciates it KOing Dark-types with Focus Blast. Entry hazard support from setters like Landorus-T and Glimmora allows Hisuian Zoroark to sweep more easily, since it struggles to OHKO most Pokemon even at +1.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "georgebowserjr", "user_id": 590164}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "Taka", "user_id": 595062}, {"username": "2020 idm boomer", "user_id": 385157}, {"username": "hidin", "user_id": 589564}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Amoonguss": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Amoonguss is a decent wall that serves as a stopgap against rain wallbreakers like Barraskewda and Floatzel while also checking other offensive threats like Kartana, Iron Valiant, Zamazenta, and Urshifu-R. Regenerator allows Amoonguss to check those same threats long-term; it also prevents it from being worn down by pivots like Rotom-W and Tapu Koko as well as entry hazards if its Heavy-Duty Boots is removed via Knock Off. Spore incapacitates switch-ins such as Heatran, Volcarona, and Dragapult; the latter two would otherwise use it as setup fodder, while the former completely walls Amoonguss by being immune to Sludge Bomb. Sludge Bomb spreads status against the aforementioned Volcarona and Dragapult as well as bulkier switch-ins like Skeledirge and Tornadus-T and threatens Iron Valiant. Hidden Power Fire lets Amoonguss chip Poison-immune foes like Ferrothorn and Mega Scizor as well as OHKO Kartana, preventing them from safely switching in. Heavy-Duty Boots lets it switch in as much as needed without fear of entry hazard damage; it also prevents Regenerator recovery from being stifled in longer games. Rocky Helmet is an alternative that wears down contact attackers like Mega Lopunny and Landorus-T as well as the aforementioned rain wallbreakers in Barraskewda and Floatzel. It should only be used if entry hazard control is decent enough, however, with support from Pokemon like Tornadus-T and Rotom-W. Tera Water provides invaluable resistances against Fire and Ice, letting Amoonguss potentially get an emergency Sludge Bomb or Spore in against foes like Weavile and Heatran. Tera Steel is an alternative that lets Amoonguss emergency check offensive foes like Tapu Lele while also giving it a better matchup against non-Heat Wave Tornadus-T; it also retains the Ice resistance given by Tera Water. Rotom-W is an excellent partner, as it stifles offensive and defensive Pokemon alike that Amoonguss struggles with, such as Heatran, Skeledirge, and Tornadus-T. In return, Amoonguss takes pressure off Rotom-W as a check to rain wallbreakers and can deal with Rotom-W switch-ins like Ferrothorn and Tangrowth. Gholdengo completely counters Amoonguss by virtue of its immunity to Spore and it taking negligible damage from Hidden Power Fire; as such, checks to it such as Kingambit and Poison Jab Clodsire are recommended, with the latter forcing Gholdengo to Terastallize so it can freely fish for poison.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Sulo", "user_id": 528036}], "teams": [{"name": "Quality checked by", "members": [{"username": "ChrisPBacon", "user_id": 544502}, {"username": "hidin", "user_id": 589564}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Alomomola": {"sets": [{"name": "Defensive"}]},
  "Mandibuzz": {"sets": [{"name": "Defensive", "description": "<p>The spread allows Mandibuzz to take two Draco Meteors from Choice Specs Dragapult from full, and outspeed defensive Rotom-W.</p> <p>The set(s) displayed are used as a plalceholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Hydreigon": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Hydreigon carves a niche in National Dex courtesy of its powerful Choice Specs-boosted attacks and nearly unresisted STAB combo. Additionally, its useful typing allows it to pivot into common defensive Pokemon such as Rotom-W and Gholdengo, giving it opportunities of entry. Fire Blast complements Dark Pulse and Draco Meteor very well, hitting Steel-types such as Ferrothorn and Kingambit. Flash Cannon allows Hydreigon to hit Fairy-types that would otherwise pivot into it, such as Mega Diancie and Iron Valiant, as well as hitting Mega Tyranitar moderately hard. U-turn is an alternative over the latter two moves that provides a more risk-free option to exploit Hydreigon's checks, giving Pokemon like Zamazenta and Mega Lopunny free entry. Tera Dark further boosts Hydreigon’s power, allowing its Dark Pulse to reliably 2HKO the likes of Toxapex and Heatran. Hydreigon fits best on bulky offense and offense teams that have reliable options to switch it in safely. Hydreigon pairs very well with pivots such as Mega Lopunny, Tornadus-T, and Landorus-T, as they can switch it in against opposing defensive Pokemon such as Landorus-T and Rotom-W. Assault Vest Tornadus-T pairs particularly well with Hydreigon, as it notably checks Dragapult, as well as providing insurance against foes such as Iron Valiant. Pokemon that can exploit common switch-ins to Hydreigon such as Mega Tyranitar and Kingambit pair well with Hydreigon, meaning the likes of Great Tusk and Zamazenta are good partners. Similarly, Pokemon that can lure or weaken the aforementioned switchins, such as Gholdengo and Dragapult, pair well with Hydreigon.</p> "
      },
      {
        "name": "Fire Spin",
        "description": "<p>With its solid natural bulk and good defensive typing in conjunction with Levitate, Hydreigon serves as a trapper that checks and eliminates Pokemon like Skeledirge and Mega Charizard Y lacking Focus Blast. Fire Spin traps and accumulates chip on a myriad of defensive Pokemon, such as Toxapex, Ting-Lu, Gastrodon, and Clodsire. Earth Power, in combination with Fire Spin, increases the damage that the aforementioned Pokemon take while also threatening Heatran. Alternatively, Dark Pulse can be used as a solid STAB move to hit airborne Pokemon such as Gliscor. Taunt prevents passive walls such as Toxapex and Gastrodon from healing while also preventing Hydreigon from being crippled by status from the aforementioned Pokemon as well. Tera Poison gives Hydreigon a Toxic immunity and a favorable defensive typing, allowing it to safely trap Pokemon such as Great Tusk and Iron Valiant. Offensive teammates like Mega Lopunny, Volcarona, and Dragapult appreciate Hydreigon trapping and removing walls like Toxapex, Clodsire, and Ting-Lu. Entry hazard setters such as Ferrothorn, Landorus-T, and Gastrodon support Hydreigon, as they heavily chip and pressure switch-ins like Kingambit in combination with Hydreigon's Fire Spin. Hydreigon is easily forced out by Fairy-types such as Tapu Lele, Mega Diancie, and Iron Valiant. As such, Pokemon that can handle the aforementioned threats such as Gholdengo, Clodsire, and Toxapex make great teammates for it.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "hidin", "user_id": 589564}, {"username": "ChrisPBacon", "user_id": 544502}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "ChrisPBacon", "user_id": 544502}, {"username": "hidin", "user_id": 589564}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Volcarona": {
    "sets": [
      {
        "name": "Offensive Quiver Dance",
        "description": "<p>Volcarona makes for a threatening late-game sweeper thanks to Quiver Dance, strong coverage moves, and a decent defensive profile. Fire Blast can be slotted over Flamethrower to hit much harder, notably OHKOing most variants of Gholdengo, but Flamethrower is usually better because of its consistency. Volcarona can utilize Giga Drain with Tera Grass to hit a plethora of Water-type Pokemon like Gastrodon, Rotom-W, and Urshifu-R hard, in addition to Ground- and Rock-types such as Great Tusk and Garganacl. Hidden Power Ground and Tera Ground help Volcarona bypass checks like Toxapex and Heatran after slight chip damage while also removing Volcarona’s glaring Rock weakness. Psychic with Tera Psychic allows Volcarona to break through Clodsire and Toxapex more reliably, but it is inferior to either of the previously mentioned Tera types due to its greater vulnerability to being revenge killed, and it leaves Volcarona completely stonewalled by Heatran. Flame Body can threaten to burn physical attackers like Mega Lopunny and Zamazenta, crippling them. Maximum Speed investment and a Timid Nature lets Volcarona outrun Choice Scarf users such as Tapu Lele and Urshifu-R after a boost. Modest can be run to hit walls like Clodsire and Toxapex harder, but it leaves Volcarona much more vulnerable to the aforementioned Choice Scarf users. Volcarona’s defensive utility is appreciated by allies such as Urshifu-R and Kingambit, as it can check dangerous Fighting-types like Iron Valiant and Zamazenta in a pinch. Bulky Dragon-types like Dragonite and Garchomp can use it as setup fodder—with the latter additionally threatening Volcarona’s longevity with Toxic—so allies that can handle them such as Ferrothorn and Rotom-W are great partners to support Volcarona in its sweep. Heatran and Toxapex wall Volcarona if it doesn’t have Hidden Power Ground, so teammates like that can check them such as Garchomp and the aforementioned Rotom-W are much appreciated. Heatran also makes for a great ally, as it can eliminate or cripple Toxapex, Clodsire, and Skeledirge, which clears the way for Volcarona to clean up late-game.</p> "
      },
      {
        "name": "Bulky Quiver Dance",
        "description": "<p>Volcarona distinguishes itself as a bulky setup sweeper by boasting reliable recovery, Quiver Dance, and being able to check Zamazenta and Iron Valiant with its unique typing. Bug Buzz can hit Mega Gyarados, Garchomp, and Mega Latias harder, but Giga Drain can be run to hit Water-types such as Urshifu-R, Gastrodon, and Rotom-W. Psychic can also be ran to threaten Clodsire and Toxapex. Will-O-Wisp makes Volcarona more utility-oriented, threatening physical attackers like Zamazenta and Dragonite with a burn more reliably, crippling them. However, the lack of coverage leaves Volcarona walled easily by most Fire-resistant Pokemon. The given Speed EVs allow Volcarona to outspeed Dragapult after a Quiver Dance, with the rest invested in HP and Defense so that it will always be 3HKOed by Zamazenta and defensive Great Tusk’s Earthquake. Volcarona struggles with status conditions, as they can hinder its ability to check threats like Zamazenta and Iron Valiant in the long term, thus status absorbers like Gliscor and Toxapex make good partners; the former provides Defog support, a Knock Off absorber, and a Heatran check, and the latter helps prepare Volcarona’s sweep with Knock Off and status inducement. Volcarona can be easily exploited by setup sweepers like Garchomp, Dragapult, Mega Tyranitar, and Dragonite, and so checks like Rotom-W, Kingambit, Ferrothorn, and Tapu Lele can help to alleviate these matchups.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "SoBalanced", "user_id": 603814}], "teams": [{"name": "Quality checked by", "members": [{"username": "hidin", "user_id": 589564}, {"username": "sanguine", "user_id": 241308}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Tornadus-Therian": {
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Tornadus-T is a staple of many teams, from balance to offense teams, given its wide utility movepool and survivability due to Regenerator. U-Turn allows it to pivot on the likes of Heatran and Gholdengo and bring offensive teammates like Iron Valiant and Great Tusk in. Tornadus-T is an excellent Defogger with its natural longevity and positive matchups against common hazard setters such as Landorus-T, Great Tusk, and defensive Garchomp. However, Taunt is an alternative to deny defensive Pokemon such as Clodsire and Skeledirge from healing, as well as preventing Annihilape from boosting. Taunt can also shut down status and hazard attempts from the likes of Ferrothorn and Ting-Lu. Knock Off is a fantastic tool to make progress, removing the Leftovers and Heavy-Duty Boots from Rotom-W, Gholdengo, and Toxapex, which would otherwise switch into Tornadus-T. Heat Wave is an alternative option to hit Ferrothorn, Gholdengo, and Mega Scizor for major damage, keeping hazards off against the former and preventing the latter two from boosting freely. Flyinium Z is a rare option over Heavy-Duty Boots for more immediate damage against Stealth Rock users like Landorus-T and Garchomp. Tornadus-T rarely Terastallizes, although Tera Steel can be useful in a pinch to resist Mega Lopunny's Return, Dragonite's Extreme Speed, and opposing Tornadus-T's Hurricane. The given Speed EVs allow Tornadus-T to outspeed unboosted Iron Valiant, with defensive EVs helping it check Mega Lopunny and Great Tusk. Tornadus-T fits best on bulky offense and balance teams, providing the overall team with valuable longevity and pivoting while wearing down the opposition and removing entry hazards. Tornadus-T pairs fantastically with Spikes users such as Ferrothorn and Gastrodon, as its Knock Off lets Spikes dig into Heavy-Duty Boots users. Additionally, they help Tornadus-T with its Electric weakness whilst Tornadus-T shores up their Fighting and Grass weaknesses. Powerful attackers such as Iron Valiant and Dragapult appreciate Tornadus-T giving them safe entry against common Steel-types such as Heatran and Gholdengo, to make up for their frailty. Tornadus-T can be vulnerable to Pursuit from the likes of Mega Tyranitar and Kingambit, so Pokemon that can exploit them such as Zamazenta, Mega Lopunny, Great Tusk, and Iron Valiant make good partners. Tornadus-T also functions excellently on rain teams alongside Pelipper and Mega Swampert, as the rain makes Hurricane reliable and the other team members appreciate it pivoting into Grass-type moves.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<p>Tornadus-T is an excellent wallbreaker and sweeper effective on a wide variety of teams. Hurricane is preferred over Bleakwind Storm, as the extra Base Power and confusion chance can be vital in muscling past bulky targets such as Clodsire, especially if forgoing Knock Off. Focus Blast and Heat Wave provide coverage against Steel-types, with the former also hitting Mega Tyranitar and Heatran while the latter KOs Gholdengo. Knock Off allows Tornadus to weaken checks such as Rotom-W and Zapdos to muscle past them with entry hazard support. It also cripples common Heavy-Duty Boots users such as Clodsire, Gastrodon, and Tapu Koko. Taunt is an alternative to shut down passive Pokemon such as Clodsire and Ting-Lu, which pack Toxic and phazing, respectively. Defog is a niche option on teams that appreciate the resulting role compression. Flyinium Z provides an accurate one-time nuke that can break past resistant Pokemon such as Rotom-W after a boost and mild chip damage, as well as heavily damaging the likes of Landorus-T and opposing Tornadus-T unboosted. 4 HP EVs maximize the recovery Tornadus-T receives from Regenerator. Tornadus-T fits best on stall and bulky balance teams, giving them a great way to close out games and revenge kill foes. Because of its relative frailty, it requires bulky cores to fall back on when a revenge killer forces it out. Unaware users such as Skeledirge and Clodsire pair excellently with it, handling the strong boosting sweepers that easily overpower Tornadus-T, while it provides Regenerator in return to switch into weak attacks without wasting their recovery PP. Toxapex also makes a great partner, as the two together form a double Regenerator core that staves off residual damage from the likes of Garganacl and burns from opposing Toxapex and Gastrodon. Toxapex additionally pivots into many Pokemon that outspeed Tornadus-T, including Zamazenta, Dragapult, Weavile, and Barraskewda in rain.</p> "
      },
      {
        "name": "Assault Vest",
        "description": "<p>Courtesy of its special bulk, Speed tier, and Regenerator, Assault Vest Tornadus-T is able to pivot into numerous special attackers such as Dragapult, Iron Valiant, and Tapu Lele. U-turn allows Tornadus-T to pivot out of these attackers and bring in its own threatening teammates, such as Mega Diancie and Zamazenta, against passive switchins - such as Rotom-W and Heatran. Knock Off cripples offensive and defensive Pokemon alike, removing items such as Choice Specs from Dragapult, Leftovers from Rotom-W and Gholdengo, and Heavy-Duty Boots from Clodsire, allowing Tornadus-T's teammates to more easily withstand these Pokemon. Heat Wave allows Tornadus-T to threaten Ferrothorn and Mega Scizor, preventing Ferrothorn from setting entry hazards and Scizor from using Tornadus-T as setup fodder. Alternatively, Superpower hits Kingambit and Mega Tyranitar much harder, exploiting their attempts to Pursuit trap Tornadus-T. Tera Steel allows Tornadus-T to withstand Psychic- and Dragon-type attacks from the likes of Tapu Lele and Dragapult in a pinch as well as Stealth Rock, while Tera Water provides a more solid overall defensive type with fewer exploitable weaknesses, as well as providing insurance against Volcarona. The given HP EVs maximize Tornadus-T's recovery from Regenerator, while the Speed EVs allow Tornadus-T to outspeed Iron Valiant. Tornadus-T fits best on bulky offense and offense teams that appreciate its ability to withstand powerful special attackers while keeping momentum with U-turn. Wallbreakers such as Mega Diancie, Zamazenta, and Urshifu-R enjoy Tornadus-T as a fallback measure, switching into revenge killers like Tapu Lele and Dragapult. Pokemon like Ferrothorn and Gholdengo appreciate the extra insurance Tornadus-T provides against special attackers, allowing them to run more physically defensive and offensive sets, respectively. Tornadus-T's Stealth Rock weakness means it can be difficult to pivot into entry with hazards up, so it pairs well with solid hazard removal options such as Landorus-T, Rotom-W, and Great Tusk. The aforementioned Pokemon also make up for Tornadus-T's relative physical frailty, being able to check the likes of Mega Lopunny and Dragonite.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "ChrisPBacon", "user_id": 544502}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "hidin", "user_id": 589564}, {"username": "adem", "user_id": 529732}]}, {"name": "Grammar checked by", "members": [{"username": "Lunaflare", "user_id": 430518}, {"username": "autumn", "user_id": 384270}, {"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Thundurus-Therian": {"sets": [{"name": "Nasty Plot"}]},
  "Landorus-Therian": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Landorus-T is an amazing defensive measure against revenge killers such as Zamazenta, Mega Scizor, and offensive Garchomp; it can also provide utility with entry hazards and status. U-turn allows Landorus-T to safely pivot into wallbreakers such as Urshifu-R, Tapu Lele, and Dragapult, as well as other defensive pivots like Tornadus-T and Rotom-W. Toxic cripples switch-ins such as Great Tusk, Tornadus-T, and Rotom-W. Alternatively, Hidden Power Fire can be used over Toxic to critically hit Mega Scizor, Kartana, and Ferrothorn, which can exploit Landorus-T with a free turn to set up hazards or set up with Swords Dance. Landorus-T can also forgo setting entry hazards and instead clear them with Defog. Rocky Helmet is the preferred item for Landorus-T to punish physical attackers such as Mega Lopunny and Kartana; however, if it decides to opt for Defog, then Leftovers is preferred for reliable passive recovery. Tera Water turns Landorus-T's most common weaknesses into resistances, which helps against moves such as Weavile's Triple Axel and Urshifu-R's Surging Strikes. It is most efficient to Tera when Landorus-T's counters use a move against it rather than on a switch. Defensive Landorus-T fits extremely well on balance and bulky offense teams. Wallbreakers such as Iron Valiant, Tapu Lele, and Volcarona all appreciate the utility and pivot support that Landorus-T provides with U-turn. Being heavily threatened by Pokemon like Weavile, Mega Medicham, and Dragapult makes partners like Heatran, Gholdengo, and Ferrothorn solid to use alongside it.</p> "
      },
      {"name": "Swords Dance"},
      {"name": "Choice Scarf"},
      {"name": "Suicide Lead"}
    ],
    "credits": {"writtenBy": [{"username": "Milo", "user_id": 540138}], "teams": [{"name": "Quality checked by", "members": [{"username": "hidin", "user_id": 589564}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Greninja": {
    "sets": [
      {
        "name": "Battle Bond Sweeper",
        "description": "<p>Greninja serves as a potentially lethal cleaner due to the significant boost to Speed and Special Attack granted by Battle Bond, being able to slice through weakened defensive cores and outspeed revenge killers such as Choice Scarf Kartana, Choice Scarf Tapu Lele, and Tapu Koko. Surf, despite being weaker than Hydro Pump, is a solid option due to its reliability, while Hydro Pump is a stronger alternative despite its lower accuracy, as it allows Greninja to OHKO targets such as Mega Charizard Y under sun. Dark Pulse gives Greninja a strong neutral STAB move to hit common Water-resistant Pokemon such as Ferrothorn, Toxapex, and Rotom-W, additionally wielding a nasty flinch chance to potentially break through them. Water Shuriken gives Greninja a priority option, crucial for revenge killing weakened targets that outspeed it like Tapu Koko and Mega Lopunny, as well as getting the jump on other priority moves such as Weavile's Ice Shard and the aforementioned Mega Lopunny's Quick Attack. Ice Beam is Greninja's coverage move of choice, being its strongest option versus Pokemon like Zapdos, Tornadus-T, and Dragonite. Tera Water is the preferred Tera type, giving a significant boost to both of Greninja's Water-type STAB moves to potentially secure KOs on targets like Mega Charizard Y in sun and Tapu Lele after a Battle Bond activation with Surf. Greninja can also serve as a potent albeit niche wallbreaker on rain teams, with rain boosting the power of its Water-type STAB moves to ridiculous levels. This allows teammates like Mega Swampert and Zapdos to clean up the weakened defensive cores consisting of Pokemon like Rotom-W and Galarian Slowking. However, Greninja alone can struggle to break through sturdier Water-resistant foes like Tera Water Garganacl, Toxapex, and Ferrothorn, so teammates like Tapu Koko, Gholdengo, and Heatran that can capitalize on Greninja forcing these foes in function well as teammates on certain offensive compositions.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Greninja is the fastest Choice Scarf user in the metagame, taking advantage of its blistering Speed tier and colorful Protean-boosted coverage to be a strong revenge killer and offensive pivot. Gunk Shot decimates Pokemon like Tapu Lele, Iron Valiant, and Tapu Koko. Ice Beam covers a plethora of Pokemon, including Tornadus-T, Dragapult, Kartana, and Landorus-T. Rock Slide deals with Volcarona and Mega Charizard Y. Aside from enabling Greninja to pivot, U-turn also provides coverage against Mega Tyranitar, Mega Gyarados, and opposing Greninja. The Special Attack EVs guarantee the OHKO against Kartana with Ice Beam. Terastallizing is mainly used to improve its offensive capabilities; for instance, Tera Poison gives Gunk Shot significant odds to OHKO specially defensive Tera Grass Heatran, Clefable, and Tera Fairy Garganacl after Stealth Rock, while Tera Ice boosts Ice Beam to OHKO Dragapult and physically defensive Tangrowth and Great Tusk. Wallbreakers like Garchomp, Zamazenta, Tapu Lele, and Mega Charizard Y appreciate Greninja's U-turn bringing them in safely on foes like Heatran, Garganacl, Toxapex, and Gholdengo, respectively. Garchomp also provides entry hazards to punish Greninja's forced switches, chipping down the likes of Garganacl and Heatran. In return, Greninja outpaces faster threats like Choice Scarf Tapu Lele, Iron Valiant, and Dragapult that would otherwise overwhelm them. Greninja can form a VoltTurn core with Pokemon such as Tornadus-T, Rotom-W, and Mega Scizor; the former two also provide Defog so Greninja can pivot more freely, especially if running Tera Ice.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "sealoo", "user_id": 514772}, {"username": "royalfluxh", "user_id": 493260}], "teams": [{"name": "Quality checked by", "members": [{"username": "Taka", "user_id": 595062}, {"username": "TheSorcer3r", "user_id": 580037}, {"username": "hidin", "user_id": 589564}]}, {"name": "Grammar checked by", "members": [{"username": "red fintans", "user_id": 637479}, {"username": "Milak", "user_id": 262594}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Hawlucha": {
    "sets": [
      {
        "name": "Unburden Sweeper",
        "description": "<p>Hawlucha is a terrifying setup sweeper with a stellar Speed tier alongside Unburden to instantly outspeed the entire metagame, including boosted foes like Iron Valiant, +2 Mega Gyarados, and weather sweepers such as Mega Swampert and—with the given Speed EVs—Excadrill. Its high-powered STAB moves—which can be boosted further by Swords Dance—hit almost the entire metagame neutrally; Acrobatics grants Hawlucha strong neutral coverage against the likes of Tornadus-T, Dragapult, and Tapu Lele, which is backed up by Close Combat to decimate Flying-resistant Pokemon like Kingambit, Garganacl, and Mega Tyranitar. Its item instantly activates Unburden under the corresponding Terrain and grants it setup opportunities from the Defense boost, especially in conjunction with Roost. Electric Seed helps against Kingambit, Zamazenta, and Great Tusk and prevents revenge killing attempts from Dragonite's Extreme Speed, Mega Scizor's Bullet Punch, and Weavile's Ice Shard, while Psychic Seed helps against Gholdengo, Volcarona, and Choice-locked Dragapult. Taunt or Substitute deals with problematic walls, ignoring status like Toxapex's Toxic and Skeledirge's Will-O-Wisp; Taunt also prevents their recovery and phazing as well as Defense-boosting attempts such as from Skarmory or Tera Water Buzzwole, while Substitute blocks Landorus-T's Intimidate and punishes the use of weak attacks like its U-turn, Garganacl's Salt Cure, and Alomomola's Scald. The bulk investment allows Hawlucha to survive Clefable's Moonblast, which is unnecessary if running Psychic Seed. 176 Speed EVs can be used instead to revenge kill +1 Dragon Dance Dragapult. Tera Flying boosts Hawlucha's Acrobatics, potentially OHKOing Clefable at +2 and letting it set up against defensive Tornadus-T if necessary. The corresponding Alolan Guardian is a mandatory teammate to reliably activate Hawlucha's Unburden; Tapu Koko provides dual screens and brings Hawlucha in safely on Tangrowth and Ferrothorn with U-turn, while Tapu Lele pressures Toxapex and overwhelms Gholdengo. Offensive Pokemon on hyper offense teams such as Iron Valiant, Volcarona, Dragonite, and Mega Gyarados help maintain offensive pressure against the opposition; notably, they can force damage onto shared checks like Gholdengo, Skeledirge, Zapdos, and Toxapex, respectively, for Hawlucha to sweep more easily.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}], "teams": [{"name": "Quality checked by", "members": [{"username": "ChrisPBacon", "user_id": 544502}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Diancie": {
    "sets": [
      {
        "name": "Mixed Wallbreaker",
        "description": "<p>Mega Diancie cements itself as an excellent mixed attacker, capable of punching through defensive cores with its superb STAB moves and coverage. Mystical Fire punishes Ferrothorn and Mega Scizor for attempting to switch into and take advantage of it. Alternatively, Earth Power significantly dents or OHKOes Heatran and hits Gholdengo and Clodsire harder. Mega Diancie acts as an excellent entry hazard stacker, as it takes advantage of the switches it forces and threatens out common entry hazard removers such as Tornadus-T and Great Tusk. Mega Diancie can use Spikes or Stealth Rock to weaken checks such as Mega Scizor and Heatran, depending on its coverage move, while punishing them for attempting to pivot into it. A Naive nature is preferred, as it allows Mega Diancie to take less damage from common priority moves in Kingambit's Sucker Punch and Mega Lopunny's Fake Out. However, Mega Diancie can also use Hasty in order to sponge Hurricane from Tornadus-T. Mega Diancie fits best on bulky offense and offense teams, which appreciate its early- or mid-game wallbreaking and ability to set entry hazards. Pokemon that appreciate Mega Diancie weakening common Steel-types such as Tapu Lele, Iron Valiant, and Dragapult pair well with it, using their higher Speed tiers to clean late-game. Additionally, Mega Diancie pairs well with Knock Off users like Tornadus-T and Kingambit, as they make Mega Diancie's entry hazards more effective and force checks such as Toxapex and Clodsire to succumb to them. Mega Diancie can struggle with entering the field given its relative frailty and poor defensive typing, which also gives it a tendency to be revenge killed by Pokemon like Mega Swampert and Zamazenta. As such, pivots that can bring it in safely such as Tornadus-T, Rotom-W, and Landorus-T make for good partners.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "ChrisPBacon", "user_id": 544502}], "teams": [{"name": "Quality checked by", "members": [{"username": "Ryuji", "user_id": 515767}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Hoopa-Unbound": {
    "sets": [
      {
        "name": "Wallbreaker",
        "description": "<p>Choice Band Hoopa-U is a strong physical wallbreaker that threatens slower teams thanks to its massive Attack stat and spammable STAB move in Hyperspace Fury. That said, Hoopa-U competes with Kingambit, which has significantly higher bulk and a way to bypass its Speed tier issue in Sucker Punch. Hoopa-U has a 4x weakness to U-turn and neutrality to Pursuit, meaning it cannot enter or leave the field easily. Nonetheless, Hoopa-U does not require setup, and it therefore has a niche into bulkier teams thanks to its immediate power. Drain Punch lets Hoopa-U take on Dark-types that would otherwise wall it, such as Kingambit and Mega Tyranitar, and Zen Headbutt hammers Zamazenta, Great Tusk, Buzzwole, and Toxapex while also hitting Clefable and Tera Fairy Garganacl neutrally. Gunk Shot provides Hoopa-U with another way to break through Fairy-types such as Tera Fairy Garganacl and Clefable. Tera Dark powers up Hoopa-U's Hyperspace Fury while giving it a resistance to Pursuit. Hoopa-U fits well on bulky offense teams, which appreciate its power allowing teammates to clean. As such, partners such as Mega Lopunny, Zamazenta, Iron Valiant, and Choice Scarf Tapu Lele pair well with Hoopa-U. The former three also check Kingambit, making Hoopa-U less prediction reliant with its attacks, while the latter appreciates Hoopa-U being able to wear down Steel-types such as Ferrothorn and Kingambit. Hoopa-U also has trouble getting into the field due to its low Speed and frail physical bulk, so pivots such as Mega Scizor and Rotom-W are appreciated to bring it in Hoopa-U more consistently. Rotom-W also pivots into Toxapex and Heatran to bring in Hoopa-U, while Mega Scizor pivots into Tapu Lele and Kingambit and brings in Heatran and Skeledirge for Hoopa-U to break through. Entry hazard setters are also appreciated, as Hoopa-U can more easily break through defensive teams with Spikes or Stealth Rock on the field. Thus, partners such as Ferrothorn and Garchomp are appreciated.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Taka", "user_id": 595062}], "teams": [{"name": "Quality checked by", "members": [{"username": "adem", "user_id": 529732}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Volcanion": {"sets": [{"name": "Choice Specs"}, {"name": "Wallbreaker", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Toxapex": {
    "sets": [
      {
        "name": "The Pex",
        "description": "<p>Toxapex acts as a fantastic defensive pivot on bulkier playstyles courtesy of its excellent bulk and Regenerator. This allows it to scout Choice-locked Pokemon such as Dragapult and Zamazenta and pivot around powerful attackers such as Iron Valiant. Scald and Knock Off allow Toxapex to meaningfully threaten foes and make progress by either causing crippling status or removing the foe's item respectively, while Toxic takes advantage of Toxapex's excellent bulk and Regenerator, putting foes on a timer for its teammates. Haze removes boosts from the likes of Dragon Dance Dragapult and Espathra. Other options such as Toxic Spikes and Baneful Bunker can be explored over either Toxic or Haze, with the intent to cripple offensive teams or maximize Toxapex's ability to scout and pivot, respectively. However, removing Toxic leaves Toxapex worse off against common Pokemon such as Skeledirge and Rotom-W, while removing Haze makes it harder to handle setup sweepers. Although Toxapex rarely Terastallizes, Tera Dragon ensures Rotom-W's Volt Switch never outdamages Regenerator while also removing its Ground and Electric weaknesses against the likes of Great Tusk and Tapu Koko. The EV spread maximizes Toxapex's physical Bulk while allowing it to survive two Scorching Sands from Mega Charizard Y. Toxapex fits best on defensively oriented teams, which don't mind its passivity and can make up for any of its defensive shortcomings. Toxapex pairs well with Unaware Pokemon such as Skeledirge and Clodsire, which can handle setup sweepers that Toxapex falters to such as Kingambit and Gholdengo. In return, Toxapex sponges various weaker attacks using Regenerator from the likes of Gastrodon and Rotom-W. Toxapex dislikes losing its item, as it can easily be pushed into KO range against wallbreakers such as Zamazenta and Dragapult alongside entry hazards. As such, Pokemon that can generally withstand Knock Off well, such as Flyinium Z Tornadus-T and Gliscor, pair excellently with it. Tornadus-T in particular makes for a great partner, as it can use Regenerator alongside Toxapex, pivoting between each other to handle Pokemon such as Great Tusk and Garganacl. Toxapex appreciates extra insurance against strong special attackers such as Tapu Lele and Iron Valiant. As such, Steel-types such as Gholdengo and Heatran pair well, especially since Toxapex can switch into the Shadow Balls and Focus Blasts aimed that them respectively.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "ChrisPBacon", "user_id": 544502}], "teams": [{"name": "Quality checked by", "members": [{"username": "hidin", "user_id": 589564}, {"username": "Ryuji", "user_id": 515767}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Kommo-o": {
    "sets": [
      {
        "name": "Clangorous Booster",
        "description": "<p>Kommo-o is a fearsome wallbreaker with its capability to omniboost as soon as it gets an opportunity with Clangorous Soul. Its ability to set up on common Pokemon like Kingambit, Gholdengo, and Volcarona and to potentially use Tera Steel to ignore Toxic from defensive Pokemon like Heatran and Toxapex allows it to start wallbreaking very early with its powerful coverage. Throat Spray grants an extra Special Attack boost when using Clangorous Soul, whereas Kommonium Z gives it Clangorous Soulblaze, which allows it to deal heavy damage while boosting its stats. Boomburst lets Kommo-o neutrally hit much of the metagame for large damage, which, when coupled with STAB Clanging Scales and Flamethrower as coverage for Steel-types, can easily break cores featuring the likes of Great Tusk, Skarmory, Ferrothorn, Toxapex, Gliscor, Landorus-T, and more. Bulletproof along with Tera Steel allows Kommo-o to wall Choice Scarf Tapu Lele looking to revenge kill it as well as set up in front of Gholdengo and Choice Specs Dragapult. Tera Normal gives Kommo-o a stronger Boomburst, while Tera Steel gives it a Toxic immunity and useful resistances to all of its weaknesses, allowing Kommo-o to take would-be checks, such as Dragapult, Tapu Lele, Baxcalibur, and Iron Valiant, by surprise and set up in front of them. However, Kommo-o likes to use its Tera and thus denies its teammates this option, and it can be checked by a well-timed Tera from Pokemon such as Tera Steel Garchomp and subsequently be revenge killed. It is also walled by the likes of Heatran, Garganacl, and Clodsire, which can tank its coverage options even without Terastallizing and cripple it with Toxic or Salt Cure or simply force it out and deny future setup opportunities. Finally, due to the nature of Kommo-o’s setup, it can only reasonably do so once per game, making Kommo-o more suited for offensive teams. Thus, having allies that can take care of Kommo-o’s defensive checks before it sets up can allow it to do its job much more effectively; physical attackers like Iron Valiant, offensive Landorus-T, and Samurott-H can pressure and remove checks for Kommo-o to break and potentially sweep. Hazard support is also valuable in preventing opponents from switching back and forth between Pokemon in a Regenerator core; in particular, Assault Vest Tornadus + Toxapex; Pokemon like Great Tusk and Garchomp can set up Stealth Rock to pressure switches.</p> "
      },
      {
        "name": "Belly Drum",
        "description": "<p>With Belly Drum, Kommo-o becomes a fearsome sweeper capable of wiping unprepared teams with relative ease. The HP cuts from Substitute and Belly Drum will immediately activate Salac Berry, giving Kommo-o maximum Attack along with increased Speed to sweep offensive and defensive teams alike. Substitute also allows Kommo-o to dodge status moves like Ferrothorn’s Leech Seed, Garganacl's Salt Cure, Landorus-T's Toxic, and Rotom-W's Will-O-Wisp that could potentially ruin Kommo-o’s sweep, instead giving it a free set up opportunity. Drain Punch is chosen over heavier hitting moves like Close Combat, as the extra damage is not needed, and Drain Punch can heal off the HP lost through Belly Drum and Substitute, making Kommo-o harder to revenge kill. Thunder Punch is used to dent and possibly KO common defensive tanks that can survive Drain Punch, like Skarmory, Toxapex, Tera Water Garganacl, Gholdengo, and Tera Flying Kingambit. Bulletproof stacked on top of Tera Steel allows Kommo-o to surprise opponents like Choice Scarf Tapu Lele and Choice Specs Dragapult looking to revenge kill it. Although Soundproof blocks moves such as Roar from defensive Garchomp and Bug Buzz from Volcarona, it is generally not preferred due to the lack of relevant sound-based moves in comparison to the bevy of aforementioned qualities gained from Bulletproof. Tera Electric can power up Thunder Punch with STAB to score KOs on the likes of Gholdengo, Tapu Lele, and Tera Fairy Kingambit, while Tera Steel gives it useful resistances that may allow it to reach Salac Berry range without Substitute by tanking a resisted hit from the likes of Tapu Lele or Mega Diancie. Belly Drum Kommo-o fits on hyper offensive teams that appreciate its ability to sweep or clean up teams once its checks are removed. Therefore, it appreciates partners that can lure and remove Pokemon like Clodsire, Tera Grass Heatran, Gliscor, and Landorus-T that check it; Tapu Koko in particular is good, as it can run Hidden Power Ice to bait and KO the latter two and badly chip the former two potentially into Kommo-o’s range while also boosting the power of its Thunder Punch by setting Electric Terrain. Belly Drum Kommo-o also has trouble setting up, as it mainly uses the element of surprise to get up a Substitute —namely, it exploits the opponent's fear of Clangorous Soulblaze and thus forces them to switch. Thus, it appreciates dual screens support from the likes of Grimmsnarl in order to more consistently set up Belly Drum.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "red fintans", "user_id": 637479}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "Deezcastforms", "user_id": 423085}, {"username": "Sabelette", "user_id": 583793}]}]}
  },
  "Rillaboom": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Rillaboom's combination of Grassy Glide and Grassy Surge makes it a reliable revenge killer, pressuring faster threats like Mega Lopunny, Mega Medicham, Garchomp, Barraskewda, and Iron Valiant. It also possesses great utility thanks to U-turn and Knock Off. Wood Hammer is Rillaboom's strongest STAB move, dealing massive damage to all non-resistant foes. Knock Off catches would-be checks like Tornadus-T and Zapdos on the switch, getting rid of their item at the same time. Superpower hits Steel-types like Kingambit, Heatran, and Ferrothorn. Tera Grass makes Rillaboom even more threatening; with Terrain-boosted Grassy Glide, it becomes near unstoppable, 2HKOing Tornadus-T after Stealth Rock. Rillaboom fits best on bulky offense teams, which appreciate speed control in Grassy Glide. Grassy Terrain sweepers like Hawlucha and Choice Scarf Kartana appreciate Rillaboom weakening their common checks—namely Zapdos, Tornadus-T, and Corviknight—so they can clean late-game. Magnezone is a standout partner for Rillaboom, as it can trap and remove Steel-types like Corviknight, Skarmory, Mega Scizor, and Ferrothorn, letting Rillaboom clean more easily. Heatran appreciates Rillaboom's Grassy Terrain giving it passive recovery and weakening Earthquake from the likes of Galarian Slowking. In return, Heatran pressures Rillaboom's checks, such as Buzzwole, Corviknight, Volcarona, Skarmory, and Skeledirge, while also providing Stealth Rock and checking Tornadus-T.</p> "
      },
      {
        "name": "Bulky Swords Dance",
        "description": "<p>Thanks to Grassy Glide and Grassy Surge, Rillaboom forces many switches against Pokemon like Rotom-W and Urshifu-R, meaning it can safely set up with Swords Dance to threaten the opposing team. Knock Off punishes its checks, like Zapdos and Tornadus-T. Superpower allows Rillaboom to threaten Steel-types like Heatran, Kingambit, and Ferrothorn, while Wood Hammer does massive damage to all neutral threats, even without a boost. The given EV spread allows Rillaboom to outspeed Mega Tyranitar while maximizing its bulk. The added bulk maximizes Rillaboom’s longevity, helping it perform long-term and deal with other terrain setters, like Tapu Lele. Life Orb gives Rillaboom a chance to OHKO offensive Tornadus-T with Tera Grass-boosted Grassy Glide, with its recoil being negated by the Grassy Terrain. On the other hand, Leftovers provides increased longevity for Rillaboom, allowing it to setup multiple times throughout a game. Tera Grass gives Rillaboom an even stronger Grassy Glide, allowing it to storm through most offensive teams that have limited resistances to it. Some Flying-resistant Tera types such as Steel and Electric can punish Zapdos and Tornadus-T, but they are usually suboptimal and don't benefit Rillaboom's offensive power. Magnezone works well with this set, as it can trap and remove Steel-types like Corviknight, Skarmory, and Mega Scizor. Hawlucha is a good partner as well, as Grassy Seed will activate Hawlucha's Unburden thanks to Grassy Terrain and Rillaboom can weaken their shared check in Zapdos so it can clean late-game. Since Superpower weakens Steel-types, Pokemon like Weavile and Mega Mawile pair well with Rillaboom. The latter also appreciates Grassy Terrain, as it softens Earthquake from the likes of Gliscor and Landorus-T.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Ryuji", "user_id": 515767}], "teams": [{"name": "Quality checked by", "members": [{"username": "2020 idm boomer", "user_id": 385157}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "skippergamez", "user_id": 620268}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Cinderace": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance Cinderace serves as a dangerous wallbreaker, as it easily exploits would-be checks thanks to its ability, Libero. Double-Edge becomes a STAB move after using Swords Dance, allowing Cinderace to not only wound Pokemon like Toxapex and Slowbro but also OHKO them with Normalium Z. High Jump Kick KOes Heatran and Mega Tyranitar, while Sucker Punch threatens faster Pokemon like Dragapult and Tornadus-T. Pokemon that can set entry hazards such as Landorus-T, Garchomp, Ferrothorn, and Ting-Lu help Cinderace break through its checks like Great Tusk and Tera Dragon Skarmory. Cinderace is vulnerable to faster Pokemon such as Mega Lopunny, Zamazenta, and Tapu Koko, so Pokemon like Toxapex, Ferrothorn, and Landorus-T are good teammates. Cinderace also benefits from dual screens from Tapu Koko or Grimmsnarl, allowing it to safely set up and start wreaking havoc on the opponent. Pokemon that can wear down Great Tusk, Skeledirge, and Tera Dragon Skarmory such as Iron Valiant, Mega Gyarados, and Dragapult form great offensive cores with Cinderace, which, in return, threatens Pokemon like Toxapex, Kingambit, and Mega Scizor. Entry hazard removers such as Tornadus-T and Great Tusk support Cinderace's Stealth Rock weakness.</p> "
      },
      {
        "name": "Offensive Pivot",
        "description": "<p>Cinderace utilizes its solid coverage alongside Libero and its high Attack and Speed to serve as a strong offensive pivot. High Jump Kick OHKOes foes such as Mega Tyranitar and Heatran while hitting others like Garganacl and Ting-Lu, though Cinderace must be mindful of Protect from the former and Tera Ghost from the latter causing it to take heavy recoil. U-turn lets Cinderace generate momentum, pivoting on switch-ins such as Toxapex and Slowbro to bring in teammates like Tapu Koko and Gholdengo that can handle them. Sucker Punch lets Cinderace threaten Dragapult, which would otherwise revenge kill it. Tera Fire boosts Pyro Ball's power, allowing Cinderace to 2HKO foes such as Great Tusk, Landorus-T, and Tera Fairy Garganacl after Stealth Rock. Cinderace must careful when using Tera, however, as Libero will no longer activate, leaving it more vulnerable to foes such as Rotom-W. Cinderace fits best on offensive teams that appreciate its pivoting ability. Tapu Koko forms a potent pivoting core with Cinderace, taking advantage of foes such as Toxapex and Rotom-W while granting Cinderace free entry against foes such as Ferrothorn and Tangrowth. They also overwhelm foes such as Ladorus-T, Gastrodon, and Great Tusk together. Cinderace also appreciates teammates such as Ferrothorn and Gastrodon providing entry hazard support to weaken foes such as Landorus-T and Great Tusk while also checking foes such as Rotom-W and Urshifu-R. Dragapult appreciates Cinderace handling foes such as Mega Tyranitar and Kingambit; in return, it threatens foes such as Skeledirge, which Cinderace struggles against. Future Sight support from teammates such as Slowbro and Tapu Lele helps pressure foes such as Toxapex for Cinderace; in return, Cinderace handles foes that threaten them such as Ferrothorn and Mega Scizor.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TheSorcer3r", "user_id": 580037}, {"username": "hidin", "user_id": 589564}], "teams": [{"name": "Quality checked by", "members": [{"username": "ChrisPBacon", "user_id": 544502}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "Dawn of Ares", "user_id": 467437}]}]}
  },
  "Corviknight": {
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Corviknight is a poor Defogger in the metagame, but its defensive profile still allows it to check Mega Lopunny, Garchomp, Great Tusk, and Kartana. It also individually beats hazard setters like Landorus-T, Great Tusk, and Clodsire. Brave Bird is the preferred option that pressures Dragapult, Zamazenta, Urshifu-R, and Iron Valiant, while Body Press pressures Kingambit, Ferrothorn, Heatran, and Weavile. Iron Defense or Bulk Up can be used over Defog to turn Corviknight into a bulky win condition and to improve its ability to check threats like Kingambit, Urshifu-R, and Dragon Dance Dragapult. Body Press should be used with Iron Defense, while Brave Bird can instead be used with Bulk Up. U-turn allows Corviknight to maintain momentum against the threats that it checks while also bringing in frailer teammates. The given HP and Defense EVs allow Corviknight to live a +2 Continental Crush from Landorus-T, while the rest of the EVs being in Special Defense helps out against Tapu Lele and Iron Valiant. Rocky Helmet allows Corviknight to chip threats like Mega Lopunny and Weavile. Tera Dragon removes Corviknight's Electric and Fire weaknesses and potentially allows it to turn the tables on Heatran and Rotom-W. Tera Ground can instead be used to halt Volt Switch attempts and surprise Tapu Koko, but the resistances it grants are not as consistently valuable as Dragon. Corviknight's biggest problem by far is Gholdengo, which blocks Corviknight's Defog attempts and sets up on it. Options that deal with it, such as Kingambit, Weavile, Ting-Lu, and Clodsire are therefore mandatory partners. U-turn can bring in the former two to Pursuit trap Gholdengo, while the latter two can stave it off defensively. Kingambit is especially potent with Corviknight, as it appreciates Corviknight's Rocky Helmet applying chip damage onto its checks like Mega Lopunny and Zamazenta. U-turn can also bring in other threats safely, such as Dragapult, Walking Wake, and Heatran. Corviknight's defensive profile gets taken advantage of by threats like Heatran, Mega Charizard Y, and Volcarona, so options such as your own Heatran, Garchomp, and Toxapex can help out in this regard.</p> "
      },
      {
        "name": "Bulk Up",
        "description": "<p>Corviknight is a formidable wincon that takes advantage of its typing and impressive bulk to garner boosts. It also provides a sturdy defensive backbone, consistently checking threats such as Tapu Lele, Kartana, and Dragonite. However, as Corviknight lacks immediate offensive presence and coverage, it suffers from being forced out by the likes of Zapdos and Heatran and being setup fodder from the likes of Kingambit and Gholdengo. Pressure, in conjunction with Substitute, allows Corviknight to PP stall checks like Heatran and Skarmory safely while bypassing status moves like Rotom-W's Will-O-Wisp and Clefable's Thunder Wave. Tera Water improves the matchup against Heatran, Weavile, and Urshifu-R, giving crucial resistances to safely let Corviknight boost up. Alternatively, Tera Dragon lets it take on Electric-types like Zapdos and Rotom-W while also helping against Heatran and Urshifu-R. However, Pokemon like Mega Diancie, Weavile, and Dragapult can now almost always force it out, though they do have to watch out for repeated Brave Bird hits. The given EV spread maximizes special bulk while still being able to survive a +2 Continental Crush from Garchomp followed by Stone Edge after Roost; it also lets Corviknight outspeed Skarmory and become only 3HKOed by Great Tusk's Close Combat. However, note that Corviknight will be taking a super effective Body Press from Skarmory after using Roost. Corviknight fits best on bulkier teams, which appreciate its ability to PP stall threats like Heatran and Toxapex while being a solid wincon. Pokemon like Toxapex and Clefable thus work well with it. Toxapex appreciates Corviknight reliably checking Tapu Lele and Landorus-T for it. In return, Toxapex helps check Weavile, Zamazenta, and Mega Lopunny, which Corviknight struggles to do. Calm Mind Clefable loves Corviknight draining PP from opposing Toxapex’s Haze; in return, it softens up Heatran. Ground-types like Gliscor and Great Tusk make excellent partners, as they absorb Electric attacks from the likes of Tapu Koko and remove entry hazards from the field. In exchange, Corviknight helps take Kyurem and Iron Valiant’s attacks. Due to Corviknight being walled by Electric- and Steel-types, such as Zapdos and Gholdengo, partners that can threaten them such as Mega Tyranitar and Heatran work well with it.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Sputnik", "user_id": 475916}, {"username": "Mawlicious", "user_id": 633402}], "teams": [{"name": "Quality checked by", "members": [{"username": "Ryuji", "user_id": 515767}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "Dawn of Ares", "user_id": 467437}]}]}
  },
  "Barraskewda": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Thanks to its high offensive stats alongside Swift Swim, Choice Band Barraskewda is a premier wallbreaker, offensive pivot, late-game cleaner, and revenge killer on rain teams. Its blistering Speed tier allows it to nearly outpace the entire metagame under rain, including boosted foes like Dragon Dance Dragapult and Mega Swampert. Liquidation's Defense drop lets it potentially 2HKO Pokemon such as Dragapult and Pelipper, while Waterfall's flinches gives Barraskewda slightly better odds to muscle past the likes of Slowbro and Toxapex. Flip Turn keeps up momentum by providing free entry for its teammates while chipping down switch-ins like Dondozo and Tangrowth. Close Combat hits Water-resistant foes such as Ferrothorn, Kartana, and Mega Gyarados, and it provides strong neutral coverage against the likes of Tera Water Great Tusk, Tera Grass Volcarona, and Gastrodon. Aqua Jet prevents Barraskewda from being revenge killed by priority attacks like Kingambit and Mega Mawile's Sucker Punch and—if rain is not active—lets it pick off faster threats such as Sand Rush Excadrill and boosted Volcarona and Iron Valiant. Alternatively, Psychic Fangs pressures Toxapex, Amoonguss, and Water Absorb Clodsire better. Tera Water skyrockets Barraskewda's rain-boosted STAB moves further, potentially 2HKOing even Water-resistant Pokemon like Ferrothorn and Rotom-W. Pelipper is a necessary teammate that spearheads rain teams by reliably summoning rain with Drizzle. Mega Swampert is a fantastic offensive partner that can overwhelm shared checks like Rotom-W, Dondozo, and Slowbro and appreciates Barraskewda's Flip Turn to bring it in safely on foes such as Toxapex, Dragapult, and Dragonite. Tornadus-T and Ferrothorn are rain team staples that support Barraskewda with Knock Off, crippling walls such as Rotom-W and opposing Ferrothorn; Ferrothorn in particular helps threaten Gastrodon with Power Whip and sets entry hazards to soften up foes. The aforementioned Pelipper and Tornadus-T also provide Defog support for Barraskewda to pivot throughout the game unperturbed, bring it in safely via U-turn, and threatens problematic Grass-types like Tangrowth and Tera Grass Heatran.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "TheSorcer3r", "user_id": 580037}, {"username": "Ryuji", "user_id": 515767}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Polteageist": {"sets": [{"name": "Shell Smash", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Hatterene": {
    "sets": [
      {
        "name": "Eject Button Support",
        "description": "<p>Hatterene's access to Magic Bounce, a vast support movepool, and Eject Button gives it a key role on offense teams as a pivot and a way to prevent entry hazards. Healing Wish gives Hatterene the ability to fully heal one of its teammates, giving wallbreakers and setup Pokemon such as Mega Charizard Y and Kingambit another chance to break through the opposing team. Mystical Fire is generally preferred over Dazzling Gleam to hit Gholdengo, Ferrothorn, and Kingambit on the switch, but Dazzling Gleam can be used to threaten Dragonite, Garchomp, and Dragapult. Nuzzle provides Hatterene with a way to punish Pokemon that would safely pivot into it otherwise, such as Heatran and Tornadus-T. Eject Button gives Hatterene the ability to take a hit and pivot into a teammate, letting frail wallbreakers such as Mega Charizard Y and Weavile come onto the field. Tera Steel removes Hatterene's weaknesses to Ghost and Steel, letting it pass a Healing Wish or cripple an opposing Pokemon such as Dragapult and Gholdengo while retaining its advantage against Dragon-types, though typically you would want to Terastallize a teammate for more offensive pressure. The given EV spread lets Hatterene outspeed Garganacl and Toxapex while maximizing its ability to pivot into physical attacks. Hatterene greatly benefits teams that rely on keeping entry hazards off the field, such as sun teams and some offense teams. As such, Mega Charizard Y is a fantastic partner, as it appreciates Hatterene keeping Stealth Rock off the field and walling Toxapex; in return, it is able to pressure Pokemon Hatterene brings in, such as Gholdengo and Kingambit. Focus Sash users such as Polteageist and Cloyster also make for good teammates thanks to Hatterene's ability to keep off hazards. Similarly, pivots such as Tapu Lele and Dragapult appreciate Hatterene's ability to keep off hazards and give them a second chance with Healing Wish, letting them come in safely and consistently. Hatterene's lack of longevity means that it usually cannot act as the sole form of hazard control. As such, Rapid Spin Great Tusk is a good partner alongside Hatterene for keeping hazards off of the field while also being able to support Mega Charizard Y on sun teams.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<p>Calm Mind Hatterene is a solid option for balance teams looking for both entry hazard control and a late-game wincon. Magic Bounce gives Hatterene a way to switch into entry hazard setters, utilize Calm Mind to force them out, and avoid status from Pokemon such as Garchomp and Toxapex. Psyshock lets Hatterene beat opposing Calm Mind and Quiver Dance sweepers like Iron Valiant and Volcarona, while Stored Power lets it bypass Skeledirge with enough Calm Mind boosts. Mystical Fire hits Kingambit, Gholdengo, and Ferrothorn super effectively. Draining Kiss acts as a form of recovery for Hatterene. Tera Water gives Hatterene a solid defensive typing while removing its weakness to Steel-type attacks from the likes of Gholdengo, Kingambit, and Mega Scizor. The given EV spread lets Hatterene outspeed Garganacl and Toxapex, letting Hatterene take out Toxapex with an attack before having its boosts removed by Haze. Hatterene works well when paired with Pokemon that dislike entry hazards, such as defensive Pokemon without Heavy-Duty Boots. These include partners like Toxapex and Garganacl, which can check other offensive and defensive Pokemon, giving Hatterene the leeway for a late-game sweep. Flyinium Z Tornadus-T appreciates Hatterene being able to Terastallize to force opposing Gholdengo to Terastallize, as well as keeping hazards off the field for it. Kingambit and Garganacl are great partners for their ability to reliably check Ghost-types like Dragapult and Gholdengo, with Kingambit even being able to Pursuit trap them. Great Tusk, Zamazenta, and Mega Scizor can check Kingambit for Hatterene as well. Hatterene's lack of longevity outside of Draining Kiss means that it appreciates a secondary form of entry hazard removal from teammates such as Tornadus-T, Zapdos, Great Tusk, Rotom-W, and Landorus-T. Alternatively, Hatterene enjoys pairing up with Spikes users such as Ferrothorn and Skarmory, as they pressure the opponent into using Defog, alleviating Hatterene's need to block entry hazards, as well as wearing down Hatterene's answers such as Heatran and Gholdengo.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Taka", "user_id": 595062}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "ChrisPBacon", "user_id": 544502}]}, {"name": "Grammar checked by", "members": [{"username": "deetah", "user_id": 297659}]}]}
  },
  "Grimmsnarl": {
    "sets": [
      {
        "name": "Dual Screens",
        "description": "<p>Grimmsnarl's solid defensive typing and Prankster make it a decent dual screens setter on hyper offense teams. Taunt denies Defog from foes such as Rotom-W and Tornadus-T and denies entry hazards from foes such as Landorus-T, Ferrothorn, and Hippowdon. It also prevents foes such as Volcarona and Annihilape from using Grimmsnarl as setup fodder. Spirit Break chips foes such as Ting-Lu and makes it easier to set up dual screens in front of special attackers such as Tapu Lele. Parting Shot can be used to pivot into teammates such as Dragonite, Dragapult, and Mega Scizor after setting screens, but it lets Dark-types such as Mega Tyranitar and Weavile—as well as Annihilape—exploit it, hindering its effectiveness. Superpower lets Grimmsnarl OHKO Kingambit after Stealth Rock, but it is ineffective outside of this matchup and is hard to justify over other alternatives. Grimmsnarl will very rarely Terastallize since teammates such as Dragonite take advantage of it far better. In a pinch, however, Tera Steel reverses its weaknesses and provides an overall solid defensive typing, which helps against foes such as Tapu Lele and Gholdengo. Tera Ghost is an alternative that prevents opposing Great Tusk from removing entry hazards with Rapid Spin. Teammates that take advantage of dual screen support such as Mega Scizor, Volcarona, Dragonite, and Kingambit make good partners, setting up safely and avoiding potential revenge killers such as Mega Lopunny and opposing Kingambit. Mega Scizor is a particularly good partner, handling foes such as Kingambit that use Grimmsnarl as setup fodder. Grimmsnarl has difficulty denying entry hazards from foes such as Mega Tyranitar and Ting-Lu, so it appreciates teammates such as Cyclizar clearing hazards from the field. Cyclizar also appreciates dual screen support from Grimmsnarl making it more difficult for foes to break the Substitute it passes to teammates.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TheSorcer3r", "user_id": 580037}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "Ryuji", "user_id": 515767}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Dragapult": {
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<p>Dragon Dance Dragapult is one of the most dangerous setup sweepers in the tier due to its blazing Speed and immense power. After a Dragon Dance, Dragapult outspeeds all Choice Scarf and Booster Energy users, such as Kartana, Greninja, and Iron Valiant, making it extremely hard to stop if it sets up successfully. Ghostium Z-powered Phantom Force enables a boosted Dragapult to blast through bulky Steel-types such as Corviknight, Ferrothorn, and Heatran after slight chip damage. Dragapult's typing gives it opportunities to switch in and set up against certain Pokemon such as Volcarona, non-Ice Spinner Dragonite, and Urshifu-R locked into a Fighting-type move. Substitute is the preferred option in the last moveslot to ease prediction and facilitate setup while also avoiding priority. Substitute also allows Dragapult to play mind games with Kingambit. Fire Blast is another option that allows Dragapult to deal massive damage to physically defensive Ferrothorn and Mega Scizor, both of which can survive a boosted Never-Ending Nightmare at full health. Clear Body is the preferred ability to avoid stat drops from Intimidate, but Infiltrator can also be used to improve the matchup against dual screens teams. A Jolly nature lets Dragapult outspeed Mega Lopunny and Tapu Koko prior to setting up. Dragon Dance Dragapult fits best on offensive teams, where it can function as a potent late-game cleaner with its Z-Move. Entry hazard support from Great Tusk, Garchomp, and Glimmora can help chip bulky foes such as Mega Tyranitar and Kingambit into range of Dragapult's attacks. Gholdengo can block attempts to remove entry hazards, as well as pressure certain physical walls that give Dragapult a hard time, such as Ferrothorn. Dragapult can struggle with bulky physical walls such as Dondozo, Garganacl, and post-Tera Skeledirge, so powerful special wallbreakers that can take advantage of these Pokemon, such as Tapu Lele and Mega Charizard Y, are greatly appreciated. Tapu Lele also provides Psychic Terrain, which thwarts revenge killing attempts from priority moves. A late-game cleaner such as Dragonite or Booster Energy Iron Valiant can take advantage of the holes Dragapult left behind in the enemy defensive core.</p> "
      },
      {
        "name": "Hex",
        "description": "<p>Despite Hex Dragapult's lack of immediate offensive presence, it can be a very annoying threat; it excels in getting around many of Dragapult's normal checks and counters, pivoting to dangerous teammates, and spreading status. Against common checks like Ting-Lu, Clodsire, and Toxapex, it can bring in Pokemon like Urshifu-R, Great Tusk, and Tapu Koko, respectively, to punish the opponent. Will-O-Wisp boosts Hex to monstrous levels and threatens to pacify physical attackers like Mega Lopunny, Zamazenta, and Kingambit. Dragon Darts is a strong physical move to better hit special walls like Clodsire, forcing it to recover lest Dragapult's teammates like Iron Valiant break through. With Tera Ghost, it can muscle through specially defensive Toxapex after burn and entry hazard damage with Hex, though Tera Fairy helps it tank hits from opposing Dragapult and Dark-type moves like Pursuit, and it can still check Zamazenta. Infiltrator allows it to check threats behind Substitutes, such as Iron Defense Zamazenta. Dragapult struggles to break through Heatran, so Pokemon that can pressure it such as Garchomp and Rotom-W are great partners. It also must be careful around Pursuit trappers like Kingambit and Mega Tyranitar, as even after a burn they heavily chip it; teammates like Urshifu-R, Iron Valiant, and Great Tusk are thus mandatory to threaten said trappers. Pokemon like Tapu Lele and Mega Charizard Y very much appreciate Dragapult crippling and weakening Kingambit and Tyranitar, respectively, as this aids in the process of removing them. In return, Dragapult can clean up the opposing team after its checks are gone. Pivots like Rotom-W and Corviknight bring Dragapult in, with the former checking Heatran and forming a nice VoltTurn core with it, and the latter tanking Dragon- and Fairy-type moves for it. Entry hazards and Knock Off from the likes of Ferrothorn and Great Tusk weaken the opposition for Dragapult to clean, notably its checks like Toxapex and Clodsire.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Dragapult is a menacing wallbreaker, being able to threaten many teams with its STAB Shadow Ball and Draco Meteor. The former in particular is very spammable, as only a limited pool of Pokemon can switch into it. U-turn takes advantage of this limited pool, pressuring Shadow Ball switch-ins like Kingambit and Mega Tyranitar while bringing in teammates such as Urshifu-R and Zamazenta. Flamethrower hits Kingambit for massive damage, while Hydro Pump helps against Mega Tyranitar and Ting-Lu. Finally, Thunder pressures would-be checks, such as Toxapex. Ghost is the best Tera type for Dragapult, as it propels its Shadow Ball to a near-unstoppable level, making it even more spammable. Dragon boosts Draco Meteor's damage while making Dragapult less susceptible to Pursuit, while Tera Fairy purely helps it defensively: not only does it not fear Pursuit, but it's also not weak to Ice Shard or Sucker Punch from Weavile and Kingambit, respectively. Finally, it gives Dragapult a Dragon immunity, which allows you to beat Dragon Dance Dragapult after it burns the Z-Move. Dragapult must be wary of Pursuit from Mega Tyranitar and Kingambit, as they can both shrug off multiple Shadow Balls and remove it from the game. However, it can pivot around its checks, so Pokemon that can take advantage of and remove them make great partners, such as Urshifu-R, Zamazenta, and Iron Valiant. The latter two also share checks with Dragapult, like Clodsire and Toxapex, meaning they can overwhelm these checks. Dragapult also greatly appreciates Knock Off support from Tornadus-T, Weavile, or Ferrothorn, as its checks such as Ting-Lu, Kingambit, and Garganacl all rely a lot on their items. Finally, since checks such as the aforementioned Mega Tyranitar and Kingambit are very susceptible to Spikes, Dragapult appreciates its setters such as Ting-Lu, Ferrothorn, and Gastrodon.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "SoBalanced", "user_id": 603814}, {"username": "nimzowitsch", "user_id": 272785}, {"username": "Ryuji", "user_id": 515767}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "Ryuji", "user_id": 515767}, {"username": "adem", "user_id": 529732}, {"username": "2020 idm boomer", "user_id": 385157}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Zamazenta": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>When equipped with a Choice Band, Zamazenta becomes one of the strongest wallbreakers in the metagame, thanks to its amazing Speed, great Attack, and solid defensive capabilities. There's only a limited pool of Pokemon that can switch into Zamazenta's Close Combat safely, such as Gholdengo, Hex Dragapult, and Skeledirge, all of which falter to Crunch. Wild Charge deals massive damage to Toxapex, Tornadus-T, and Slowbro while Ice Fang hits Landorus-T. Tera Fighting propels Zamazenta's Close Combat to nearly unstoppable levels, letting it 2HKO on a large variety of Pokemon, including Fighting-resistant Pokemon like Tornadus-T and Mega Latias. Zamazenta appreciates pivot support, as even if it's bulky enough to switch into neutral or resisted moves, it doesn't like being chipped. Therefore, Pokemon like Landorus-T, Dragapult, and Mega Scizor make good partners. It also really appreciates Future Sight support from Tapu Lele and Slowbro, as it helps it beat its most common switch-ins, such as Skeledirge, Toxapex, and Buzzwole. Entry hazard support helps Zamazenta against Gholdengo and the aforementioned Toxapex, so Pokemon like Ting-Lu, Garchomp, and Toxapex are valuable teammates.</p> "
      },
      {
        "name": "Howl",
        "description": "<p>Howl Zamazenta is a stupendous sweeper; thanks to its stellar bulk—improved by Dauntless Shield—and high Speed, it can set up multiples Howls and becomes near unstoppable once boosted. It also takes advantage of the many switches it forces with the threat of other sets and is ensured to setup at least one Howl without taking damage. Wild Charge, combined with an Electrium Z, gives Zamazenta a nuke to use against common switch-ins, such as Toxapex, Tera Water Skeledirge, and Tornadus-T. Ice Fang hits Landorus-T, while Crunch Ghost-types such as Gholdengo and Dragapult. This set, while scary, still possesses a pool of Pokemon capable of completely stopping it from making progress, such as Skeledirge, Unaware Clefable, and Dondozo. Therefore, Pokemon that can pressure them such as Mega Charizard Y, Heatran, and Tapu Lele are great teammates. Pursuit support from Kingambit, Weavile, and Tyranitar helps Zamazenta by removing Ghost-types like Gholdengo and Dragapult that can take a hit from it if Crunch isn't used. Knock Off from Ferrothorn, Tornadus-T, and the aforementioned Weavile cripples all of Zamazenta's checks, as they all dislike losing their items.</p> "
      },
      {
        "name": "Iron Defense",
        "description": "<p>Body Press lets Zamazenta become an extremely strong sweeper, being hard to remove after a couple of Iron Defenses due to its already amazing bulk. Crunch hits Ghost-types such as Dragapult and Gholdengo. Rest cures its status while healing it; Sleep Talk can be used alongside it as a way to stack Defense boosts faster and be less passive, but it's very unreliable. The combination of Protect and Substitute allows Zamazenta to reliably beat Tornadus-T and Zapdos, taking advantage of Hurricane's lack of accuracy. Tera Water helps against rain, as almost all rain sweepers are physical attackers, like Floatzel and Mega Swampert. This lets Zamazenta use them as setup fodder. It is especially effective when paired with Protect and Substitute, as it can easily waste rain turns. While very threatening, this set tends to struggle against walls such as Skeledirge, Dondozo, and Clefable, so Pokemon that pressure them such as Mega Charizard Y, Tapu Lele, and Heatran are great partners. If not using Crunch, Pursuit support from Kingambit and Weavile should be used to remove Ghost-types that Zamazenta can't touch. Since this set struggles against Flying-types such as Tornadus-T and Zapdos, Knock Off support from Kartana and the aforementioned Kingambit helps in dealing with them.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Ryuji", "user_id": 515767}], "teams": [{"name": "Quality checked by", "members": [{"username": "hidin", "user_id": 589564}, {"username": "adem", "user_id": 529732}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Urshifu-Rapid-Strike": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Urshifu-R serves as a wallbreaker that fits on bulky offense and rain teams. Swords Dance on top of very strong Base Power moves in Surging Strikes and Close Combat means that Urshifu-R can effectively break through a variety of defensive cores, especially with Terastallization. This includes Pokemon such as Ferrothorn, Toxapex, Ting-Lu, and Unaware Clodsire. Urshifu-R's Water / Fighting typing gives it chances to pivot into offensive Pokemon such as Weavile and Mega Scizor, providing it defensive utility as well. Taunt lets Urshifu-R pressure defensive Pokemon and prevent Toxic and Haze from being used while negating recovery on checks without Regenerator such as Pelipper, Dragonite, and Buzzwole. Ice Punch pressures checks such as Dragonite and Dragapult. A boosted Aqua Jet is able to KO a chipped Tapu Koko, Mega Medicham, and Mega Lopunny, especially with support from Pelipper's rain and Tera Water. Thunder Punch can be used to pressure or break through bulky Water-types that would normally wall Urshifu-R, such as Pelipper, Tapu Fini, Toxapex, Slowbro, and Dondozo. Punching Gloves is the preferred option for boosting both Thunder Punch's and Surging Strikes's base power and preventing Rocky Helmet recoil. Swords Dance- and Tera Water-boosted Surging Strikes is able to break past checks such as Buzzwole, Dragonite, Tera Fairy Skeledirge, and Iron Hands, especially when supported by rain from Pelipper. Pelipper is one of the best partners for Urshifu-R because it provides rain support, boosting Urshifu-R's Surging Strikes to absurd levels. Tornadus-T is a great teammate for Urshifu-R, as it appreciates Urshifu-R's ability to break past Ferrothorn, Clodsire, Garchomp, and Blissey while soft checking Weavile and Tyranitar. In return, Tornadus-T with Taunt is able to take on defensive Water-types such as Dondozo and Toxapex as well as Kartana. Tornadus-T can also utilize Supersonic Skystrike to break shared checks such as Tapu Koko and Toxapex. Mega Diancie, Ferrothorn, and Garchomp are valuable partners for setting entry hazards to wear down Urshifu-R's checks such as Buzzwole, Dragapult, and Tangrowth. Tapu Koko is another synergistic partner for being able to pivot into Toxapex and other defensive Water-types. Future Sight support from Tapu Lele and Slowbro is much appreciated to make it easier for Urshifu-R to take on Dondozo, Tangrowth, Toxapex, and Buzzwole without using Terastallization or Swords Dance. Dragon-types such as Dragonite and Dragapult are also threats, since they resist all of Urshifu-R's common moves bar Ice Punch, can threaten it out with Choice Specs-boosted attacks in Dragapult's case, or Dragon Dance in front of Urshifu-R, though Dragapult cannot switch into Urshifu-R multiple times. Garganacl also acts as a consistent check to Dragapult, sets Stealth Rock for Urshifu-R, provides a consistent switch-in to Skeledirge, as well as Toxapex and Dondozo when Terastallized into a Fairy- or Water-type, and pressures them for Urshifu-R with Salt Cure. If not running Taunt, Swords Dance Urshifu-R struggles with bulky Unaware threats like Tera Fairy Skeledirge and Dondozo, so special wallbreakers such as Tapu Lele, Choice Specs Tapu Koko, Tera Grass Heatran, and Flyinium Z Tornadus-T are appreciated.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Urshifu-R is a very strong wallbreaker and pivot that pressures defensive Pokemon such as Ferrothorn, Ting-Lu, and Unaware Clodsire. Urshifu-R can pivot into offensive Pokemon such as Weavile and Mega Scizor, but prefers to not lose its item. Since Urshifu-R forces switches with its STAB combo, U-turn is an excellent move to generate momentum on these switches, letting it bring in a teammate. Aqua Jet allows for Urshifu-R to KO a chipped Tapu Koko, Mega Medicham, Mega Lopunny, and pre-Tera Volcarona. Ice Punch hits Dragapult and Dragonite super effectively. Tera Water is the preferred Tera type, as once Rocky Helmet users are knocked off by a supporting partner and Garchomp and Ferrothorn are dealt with, Tera Water-boosted Surging Strikes can overwhelm checks such as Pelipper, Tera Water Garganacl, Tapu Fini, Toxapex, and Slowbro, especially with support from Pelipper's rain. Pelipper is a fantastic partner for Urshifu-R by virtue of it providing rain, which strengthens Urshifu-R's Surging Strikes. Entry hazard setters such as Glimmora, Garchomp, Clodsire, and Ferrothorn can help in wearing down its checks. Tapu Lele is a fantastic partner by providing Future Sight support, which lets Urshifu-R beat checks like Dragonite, Skeledirge, and Toxapex for Urshifu-R, as well as appreciating Urshifu-R's ability to pivot into Heatran and take on Ferrothorn. Urshifu-R struggles with defensive Water-types and Tangrowth, so partners such as Tapu Koko and Tornadus-T pair well with it. Tapu Koko also forms a pivot core with it, being able to consistently switch into Toxapex and Slowbro, and powering up Urshifu-R's Thunder Punch, while Urshifu-R pressures Ferrothorn for Tapu Koko. Tornadus-T is able to pressure defensive Water-types such as Toxapex with Taunt, check Kartana, remove entry hazards so that Urshifu-R can come in more often, bring Urshifu-R in with U-turn, and even utilize Supersonic Skystrike to break past shared checks such as Tapu Koko and the aforementioned defensive Water-types. Tornadus-T also appreciates Urshifu-R's ability to break Ferrothorn, while soft checking Tyranitar and Weavile. Urshifu-R struggles with Dragonite, so it appreciate partners such as Ferrothorn, Tangrowth, Pelipper, or Tera Fairy/Water Garganacl to help take on Dragonite. Rocky Helmet users such as Garchomp and Buzzwole make it harder for Urshifu-R to freely use Surging Strikes, so Knock Off support from users such as Weavile and Toxapex is much appreciated. Weavile in particular is able to take on Tornadus-T, Tangrowth, Dragonite, and Garchomp while also pressuring Toxapex. Urshifu-R is forced out by faster special attackers such as Choice Scarf Tapu Lele, Tapu Koko, and Tornadus-T, so Ferrothorn and Heatran are great partners for taking on these Pokemon and also providing entry hazard support. Pivots such as Rotom-W, Landorus-T, and Dragapult are good partners for being able to bring in Urshifu-R consistently throughout a game to wallbreak.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>With a Choice Scarf equipped, Urshifu-R becomes a potent pivot as well as a late-game cleaner. With a unique Speed tier, Urshifu-R gets the jump on the common Choice Scarf Tapu Lele while outspeeding setup sweepers such as Baxcalibur and Mega Gyarados. U-turn is integral, providing valuable pivoting potential on checks like Toxapex and Slowbro and serving as a midground into contact punishment from the likes of Ferrothorn and Garchomp. Aqua Jet allows Urshifu-R to halt Volcarona as well as pick off weakened sweepers such as Sneasler. Alternatively, Ice Spinner can be used to hit Dragon-types like Dragapult, Garchomp, and Dragonite. Additionally, Thunder Punch is a niche option to hit slightly harder against Slowbro and Toxapex. Tera Water boosts damage from Surging Strikes to ludicrous levels, as well as strengthening Aqua Jet to pick off bulkier sweepers like Iron Valiant. Teammates such as Tapu Koko, Tapu Lele, and Heatran appreciate Urshifu-R's ability to pivot out on Toxapex in particular, letting them freely fire off attacks and maintain momentum. Additionally, Tapu Lele can also use Future Sight to let Urshifu-R bypass normal checks like Buzzwole and the aforementioned Toxapex. Contact punishment from Pokemon like Skarmory and Garchomp is problematic, but can be circumvented with teammates who can remove their Rocky Helmet such as Kartana, Kingambit, and Tornadus-T. Tornadus-T makes for a great teammate particularly, removing Heavy-Duty Boots from the likes of Dragonite and Toxapex, allowing Urshifu-R to rack up more significant damage against them.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Taka", "user_id": 595062}, {"username": "sealoo", "user_id": 514772}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "adem", "user_id": 529732}, {"username": "ChrisPBacon", "user_id": 544502}, {"username": "Ryuji", "user_id": 515767}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Basculegion": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Swift Swim in conjunction with powerful STAB Wave Crash backed by a high HP stat to offset recoil makes Basculegion-M a premier rain wallbreaker in the tier. Choice Band is the preferred item for more power so long as it has pivots to fall back on, such as Pelipper, Ferrothorn, and Zapdos. Tera Water is the premier Tera option to pump as much power into Wave Crash as possible, allowing it to 2HKO even Water-resistant foes such as Rotom-W and Ferrothorn. Tera Water also removes its weakness to Sucker Punch from the likes of Hisuian Samurott and Mega Mawile, and it maintains its resistance to Bullet Punch from Mega Scizor, although it removes its immunity to Fake Out from Mega Medicham. This also leaves Basculegion-M susceptible to Wave Crash's heavy recoil damage, so Liquidation is used to mitigate this, and it should be used once Basculegion-M’s checks have been worn down in order to ensure that it does not KO itself with recoil. Basculegion-M thus benefits from an offensive partner like Mega Swampert, which can finish off threats weakened by Basculegion-M. Pelipper is necessary to set up rain for Basculegion-M and also serves as a pivot to give it a free switch, something Basculegion-M has trouble doing, as it prefers to preserve its HP for recoil. Other pivots like Eject Button Ferrothorn and Tornadus-T are also helpful to support Basculegion-M by giving a point of entry to start breaking.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "red fintans", "user_id": 637479}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Basculegion-F": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Basculegion-F finds itself a useful niche on rain teams, that being one of few special rain exploiters in the tier. Its access to Swift Swim as well as strong STAB options in Surf and Shadow Ball allows it to be immensely threatening once it's brought in, and its ability to hit hard on the special side allows it to pick up 2HKOs on many common Water resistances in the tier such as Rotom-W or Toxapex. Swift Swim is a fantastic ability for Basculegion-F, as it allows the capability to run a Modest nature over Timid, boosting Basculegion-F's breaking capabilities even further. A Speed-boosting nature is unnecessary due to hitting a whopping 510 Speed in rain, outrunning almost every Pokemon in the tier except for Choice Scarf Kartana and Iron Valiant in Electric Terrain. Surf is a great option as a reliable STAB move, because its above-average Base Power and perfect accuracy allow it to be spammed with little to no drawback, while Hydro Pump is a great option for the raw power, 2HKOing Tera Grass Heatran with minimal chip damage and OHKOing Mega Charizard Y in sun. Both of these moves are perfectly complemented by Basculegion-F's secondary STAB option, Shadow Ball, which provides neutral coverage against a majority of the metagame. Very few Pokemon can resist Basculegion-F's STAB combination, which is even further bolstered by Ice Beam as a coverage option. Ice Beam allows Basculegion-F to deal serious damage to Pokemon like Tera Grass Heatran and Dragonite. Basculegion-F is also a phenomenal Terastallization user, as it's able to use Tera Water to both shed its weakness to Kingambit's Sucker Punch and boost Surf to terrifying levels of power, making it capable of sweeping most teams with little to no chip damage. Basculegion-F pairs extremely well with Pelipper, since it's able to set rain and use U-turn to bring Basculegion-F in safely. It also appreciates support from the likes of Ferrothorn and Zapdos, as Ferrothorn can answer Iron Valiant's Moonblast and spread chip damage very effectively with Iron Barbs, and Zapdos can check Choice Scarf Kartana and Rillaboom defensively and threaten crippling paralyses. In turn, Basculegion-F supports them back by KOing Pokemon that'd normally be able to force them out or pivot around utilizing resistances and immunities. For example, it can bait Leaf Blade from Kartana to guarantee a safe switch into Zapdos or it can lure Grassy Glide from Rillaboom, allowing Ferrothorn to come in and start spreading chip damage.</p> "
      }
    ],
    "credits": {"writtenBy": [], "teams": [{"name": "Written By", "members": [{"username": "about15guys", "user_id": 625861}]}, {"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Sneasler": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Sneasler is a deadly sweeper with its high Attack stat in conjunction with Swords Dance and Unburden. Dire Claw is generally preferred over Gunk Shot for its perfect accuracy and a high chance to cripple the target with status. However, Gunk Shot has considerably more power, allowing Sneasler to OHKO most Zapdos at +2. Acrobatics is Sneasler's most spammable attack, especially if it has Terastallized, as it hits many neutral targets such as Tornadus, Dragapult, and Toxapex for high damage. Sneasler should be brought out when the Terrain matching its item is active, consuming its item and boosting Acrobatics. Alternatively, Tera Ground with Tera Blast can be used to deal massive damage to Gholdengo, Toxapex, and Skeledirge. An Electric Seed or Psychic Seed is recommended to instantly activate Unburden, and the boost to Sneasler's otherwise poor defenses may also facilitate setup. Tera Flying turns Sneasler's Ground weakness into an immunity, which often buys it a turn to set up. Tera Flying also grants STAB on Acrobatics, allowing Sneasler to OHKO Dragapult and physically defensive Great Tusk with Acrobatics after a Swords Dance.</p> <p>Sneasler serves as an excellent late-game cleaner on hyper offense teams. Entry hazard setters such as Mega Diancie or Landorus-T are useful teammates to help wear down Snealser's checks, such as Toxapex and opposing Landorus-T, into KO range for its attacks. Given Sneasler's item, a Terrain-setting partner such as Tapu Koko or Tapu Lele is mandatory. Tapu Koko provides entry opporunities with Volt Switch and U-turn while also setting Reflect and Light Screen, which facilitates setup. Tapu Lele pressures Toxapex, and its Psychic Terrain blocks priority attacks such as Bullet Punch from Mega Scizor, Fake Out from Mega Lopunny, and Sucker Punch from Kingambit, all of which can otherwise pick off a weakened Sneasler. However, one should be aware that Psychic Terrain will no longer block priority moves against a Tera Flying Snealser that has Terastallized. Other offensive partners that synergize well with Sneasler include Kingambit, Dragonite, and Volcarona, all of which can either assist in breaking through Sneasler's checks, such as Landorus-T, Gliscor, or Toxapex, or finish off a team weakened by Sneasler.</p> "
      },
      {
        "name": "Pivot",
        "description": "<p>Sneasler can use its combination of high Attack and Speed to function as a potent pivot, racking up chip damage against defensive Pokemon such as Landorus-T, Zapdos, Great Tusk, and other tanks. Its ability, Poison Touch, alongside Dire Claw allows it to spread status and cripple its checks, mainly to enable Hex Dragapult and hit would-be checks like Toxapex, Gastrodon, and Clefable for massive damage. Heavy-Duty Boots allows Sneasler to ignore Stealth Rock and Spikes to continue switching in and retain its offensive presence throughout the game. However, Sneasler is also hindered by contact punishment from the likes of Ferrothorn, defensive Landorus-T and Garchomp, and Zapdos, so Protective Pads helps provide more longevity. U-turn allows Sneasler to function as a pivot, bringing in other offensive threats such as Dragapult along with other special attackers like Tapu Lele to take advantage of physical tanks that can wall Sneasler such as Toxapex, Gliscor, and Landorus-T. U-turn also allows it to easily spread poison with Poison Touch. Fire Punch allows Sneasler to hit Gholdengo, which is immune to its STAB combination, and also dent Mega Scizor. Night Slash could be considered as an alternative to hit Dragapult switching in while also still hitting Gholdengo. Fake Out is another possibility to allow Sneasler to safely poison faster threats. However, Sneasler is easily checked by faster Pokemon that can threaten to revenge kill it such as offensive Tornadus-T, Choice Scarf users such as Urshifu-R or Landorus-T, and powerful priority users like Extreme Killer Dragonite. As such, Sneasler benefits from having a sturdy defensive backbone with Pokemon like Toxapex or Ferrothorn to tank hits that Sneasler dislikes. Sneasler also forces a lot of switches, so it benefits from allies that can set hazards like Ferrothorn, Skarmory, or Heatran, which also switch in on Flying- and Psychic-type moves for Sneasler. Sneasler also has a tendency to be completely walled by the likes of Toxapex, Gliscor, and Landorus-T and benefits greatly from having allies that it can pivot to in order to exploit these checks for damage, like Tapu Lele or Zapdos.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "nimzowitsch", "user_id": 272785}, {"username": "red fintans", "user_id": 637479}], "teams": [{"name": "Quality checked by", "members": [{"username": "adem", "user_id": 529732}, {"username": "ChrisPBacon", "user_id": 544502}, {"username": "Ryuji", "user_id": 515767}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Enamorus": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Enamorus is a potent wallbreaker, utilizing its strong Moonblast alongside colorful coverage to punch severe holes into defensive cores. Earth Power and Mystical Fire complement its STAB Moonblast well, with the former hitting Toxapex, Clodsire, Gholdengo, and Heatran, while the latter OHKOes Ferrothorn and Mega Scizor. Focus Blast grants Enamorus its strongest attack to hit Garganacl and Mega Tyranitar, which could otherwise survive Earth Power and Moonblast, respectively, while Psychic provides a safer middle ground option for Toxapex  Clodsire, and Mega Venusaur, which staves off its attacks otherwise. Tera Fairy grants Enamorus a power boost to Moonblast, notably allowing it to secure OHKOs against the likes of Landorus-T and Rotom-W, which would barely survive it otherwise. Enamorus fits best on bulky offense teams that appreciate its wallbreaking power while being able to support it adequately. Pivots such as Mega Lopunny, Landorus-T, and Tornadus-T grant Enamorus free switch in opportunities against Great Tusk, opposing Landorus-T, and Rotom-W. The latter two pivots and Great Tusk, also provide entry hazard removal, which aids Enamorus given its Stealth Rock weakness. Enamorus works well with fast cleaners such as Choice Scarf Tapu Lele and Choice Scarf Kartana, as they appreciate Enamorus punching holes into the likes of Gholdengo and Mega Scizor for the latter two to clean up weakened defensive cores.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<p>Calm Mind Enamorus serve as a solid wallbreaker, using forced switches from the likes of Great Tusk and Garchomp to set up. It is incredibly difficult to switch into after a boost given its strong Moonblast alongside coverage options in Earth Power and Mystical Fire to hit Fairy-resistant foes such as Heatran, Toxapex, and Ferrothorn, respectively. Alternatively, Enamorus can forgo Mystical Fire for Substitute to take advantage of pivoting attempts as well as sponge attacks from revenge killers such as Mega Lopunny and Iron Valiant, although it makes it less effective at hitting Ferrothorn and Mega Scizor. If using Substitute, Enamorus can opt for Leftovers instead of the standard Heavy-Duty Boots to potentially set up more Substitutes. Tera Ground boosts the power of Earth Power, allowing it to KO most Toxapex and Gholdengo sets after a boost, as well as giving it an immunity to Tapu Koko and Rotom-W's Electric-type attacks. Enamorus fits best on bulky offense and offense teams that appreciate its use as an early- to mid-game wallbreaker while granting it sufficient opportunities to enter the field. Therefore, pivots such as Mega Lopunny and Landorus-T pair well with it, bringing Enamorus in on physical walls it can exploit such as Great Tusk, Buzzwole, and Skarmory. Additionally, Pursuit trappers such as Mega Tyranitar and Weavile eliminate special walls such as Clodsire and Gholdengo that can serve as a roadblock to Enamorus. Fast late-game cleaners such as Choice Scarf Tapu Lele and Choice Scarf Kartana appreciate Enamorus, as they capitalize on it weakening or removing Steel-types for them to clean up.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Enamorus functions as an interesting revenge killer, being able to KO a range of setup sweepers such as Dragonite, Mega Gyarados, Baxcalibur, and even a weakened Volcarona courtesy of its great speed tier. Additionally, it can serve as a late-game cleaner once its checks such as Toxapex, Gholdengo, and Assault Vest Tornadus-T have been weakened by its teammates. However, its Stealth Rock weakness and relative frailty mean Enamorus struggles to withstand repeated switches as well as priority moves from the likes of Urshifu-R and Mega Lopunny. Tera Fairy boosts the power of Moonblast, notably allowing it to 2HKO Assault Vest Tornadus-T after Stealth Rock. Aside from coverage to hit Steel-types in Mystical Fire and Earth Power, Healing Wish can bring back a weakened teammate in a pinch, potentially being able to change the tide of a game. Therefore, Enamorus fits best on offense teams that appreciate its utility in Healing Wish while providing a positive matchup against opposing offensive teams. Powerful wallbreakers such as Baxcalibur and Volcarona appreciate Enamorus's Healing Wish, giving them a second lease on life, while Enamorus in turn capitalizes on them weakening the likes of Toxapex and Mega Scizor to clean late-game. Enamorus also greatly enjoys entry hazard removal support from Rotom-W, Tornadus-T, or Great Tusk, as it minimalizes its Stealth Rock weakness so it can switch in more effectively mid-game. Enamorus struggles with special wall such as Clodsire and Gholdengo, so Pokemon such as Landorus-T and Great Tusk make for good partners that can take advantage of them.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "ChrisPBacon", "user_id": 544502}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Meowscarada": {"sets": [{"name": "Offensive Pivot"}, {"name": "Choice Band"}]},
  "Skeledirge": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>When it comes to Unaware Pokemon, Skeledirge is one of the best available; it has great physical bulk and a solid move in Torch Song, which boosts its already good Special Attack. These traits make it a hard-to-break physical wall and a potential wincon as well. Will-O-Wisp lets it cripple physical attackers such as Mega Tyranitar, Garchomp, Great Tusk, and Landorus-T while also punishing Water-types such as Rotom-W. Combined with Will-O-Wisp, Hex helps it overwhelm passive checks in Toxapex, Gastrodon, and Clodsire while also allowing Skeledirge to sweep statused teams. While not as strong as Hex, Shadow Ball is a decent option as it's more consistent. Tera Water allows Skeledirge to beat rain teams by spreading burns against rain sweepers such as Mega Swampert, Barraskewda, and Floatzel. On the other hand, Tera Fairy allows it to counter Dragon Dance Dragapult and avoid Pursuit from Kingambit, Mega Tyranitar, and Weavile while also keeping a Fighting resistance, meaning it can still check Zamazenta. It also removes Skeledirge's Ground weakness, allowing it to comfortably burn Pokemon like Garchomp, Great Tusk, and Landorus-T. Skeledirge struggles against Heatran and Garganacl, as it can't burn them nor deal significant damage to them. Therefore, Pokemon that pressure them like Garchomp and Rotom-W for the former and Cover Cloak Gholdengo for the latter make good partners. Skeledirge also hates losing its item, so Knock Off absorbers like Flyinium Z Tornadus-T and Gliscor make for good teammates. The former can also weaken Heatran for it while Skeledirge can burn Mega Tyranitar. Special sponges like Gastrodon, Clodsire, and Toxapex all appreciate Skeledirge's ability to cripple physical attackers such as Kartana, Mega Lopunny, and Kingambit, alleviating the pressure these Pokemon exert on them. In return, they can all handle special attackers like Gholdengo, Choice Specs Dragapult, and Mega Charizard Y.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Ryuji", "user_id": 515767}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "2020 idm boomer", "user_id": 385157}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Quaquaval": {"sets": [{"name": "Swords Dance"}, {"name": "Bulk Up", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Garganacl": {
    "sets": [
      {
        "name": "IronPress",
        "description": "<p>Garganacl is an astounding wincon due to the combination of Iron Defense + Body Press allowing it to beat Pokemon like Dragonite, Kingambit, and Great Tusk. Salt Cure makes easy progress and accrues chip damage on switch-ins like Gholdengo, Rotom-W, Heatran, and Great Tusk while also forcing Pokemon like Gastrodon and Mega Scizor to burn their recovery PP more often, making them passive and more easily worn down. Recover allows Garganacl to check Pokemon like Tornadus-T and Dragapult long-term and increasess its sustainability as a wincon. Tera Water allows Garganacl to check Pokemon like Gholdengo and Urshifu-R while providing valuable resistances to Steel- and Water-type moves. Notably, It allows Garganacl to stave off rain attackers such as Mega Swampert and Barraskewda. Alternatively, Tera Fairy lets Garganacl reliably set up in front of Pokemon like Great Tusk and Zamazenta while also being a near hard check to Dragapult. Maximum Special Defense investment allows Garganacl to deal with Pokemon like Tapu Koko and Choice Specs Dragapult reliably. Pokemon like Toxapex, Clodsire, and Gholdengo pair well with Garganacl as they serve as reliable defensive checks to strong wallbreakers like Urshifu-R, Iron Valiant, and Tapu Lele, respectively. Entry hazard removers like Tornadus-T and Great Tusk are also appreciated, as Garganacl is susceptible to chip damage from entry hazard. Garganacl mandates Knock Off support to serve as an effective wincon, as it can be pivoted around with Regenerator Pokemon holding Heavy-Duty Boots such as Toxapex and Slowbro without it. As such, partners such as the aforementioned Tornadus-T and Kingambit are useful. It additionally needs entry hazard support from Pokemon such as Clodsire and Heatran to outdamage Regenerator. Wallbreakers like Iron Valiant and Kartana appreciate their checks in Skeledirge and Gholdengo from being worn down by Salt Cure; these Pokemon also appreciate having Garganacl as a wall to fall back on. Pokemon that can support Garganacl to let it clean up late-game like Weavile, Tapu Lele, and Kingambit pair well with it, as they can immediately remove Pokemon that Garganacl would struggle with, such as Covert Cloak Gholdengo and Urshifu-R.</p> "
      },
      {
        "name": "Stealth Rock",
        "description": "<p>Garganacl is a great entry hazard setter, as it takes advantage of the myriad of switches it forces with Salt Cure and ability to exploit passive Pokemon such as Toxapex and Clodsire. Salt Cure aggressively accumulates chip damage on switch-ins such as Urshifu-R and Kartana, and it punishes entry hazard removers like Great Tusk, Rotom-W, and Tornadus-T. Protect allows Garganacl to accrue more recovery from Leftovers and scout Pokemon like Great Tusk, Iron Valiant, and Dragapult, all while accruing chip damage on them with Salt Cure. Recover maintains Garganacl's longevity against Pokemon like Dragapult and Tapu Koko. Tera Water gives it neat resistances to Gholdengo's Make It Rain and Urshifu-R's Surging Strikes while also improving its matchup against rain wallbreakers such as Mega Swampert and Floatzel. Tera Fairy lets it handle Pokemon like Tera Grass Volcarona and Zamazenta safely, and it renders Dragapult useless against it. Maximum Special Defense investment allows Garganacl to deal with Pokemon like Volcarona, Tornadus-T, and Tapu Lele reliably. Pokemon like Toxapex, Kingambit, and Gholdengo support Garganacl as they deal with strong wallbreakers like Urshifu-R, Gholdengo, and Tapu Lele; Gholdengo in particular makes an amazing teammate as it prevents Defog and Rapid Spin from clearing Garganacl's Stealth Rock while also dealing with Pokemon like Mega Scizor and Kartana. Garganacl appreciates Knock Off users such as Tornadus-T and Toxapex, as they let it beat Regenerator Pokemon such as Slowbro and Toxapex with its own entry hazards. Pokemon that like their defensive checks being worn down due to Stealth Rock and Salt Cure such as Tapu Lele and Mega Medicham appreciate Garganacl's presence, as it wears down Pokemon like Tornadus-T and Gholdengo.</p> "
      },
      {"name": "Curse"}
    ],
    "credits": {"writtenBy": [{"username": "hidin", "user_id": 589564}], "teams": [{"name": "Quality checked by", "members": [{"username": "Ryuji", "user_id": 515767}, {"username": "ChrisPBacon", "user_id": 544502}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Armarouge": {"sets": [{"name": "Stored Power", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Ceruledge": {"sets": [{"name": "Swords Dance"}, {"name": "Bulk Up", "description": "<p>The set(s) displayed are used as a placeholder until an analysis is written for this Pokemon. Stay tuned for any updates!</p> "}]},
  "Glimmora": {
    "sets": [
      {
        "name": "Suicide Lead",
        "description": "<p>Glimmora is a valuable dedicated lead on hyper offense teams that can reliably set up multiple entry hazards in Stealth Rock, Toxic Spikes, and potentially Spikes, as well as remove opposing ones with Mortal Spin. It can make use of its solid coverage options and remarkable Special Attack to pose a noticeable offensive threat itself, especially against common entry hazard setters, removers, and other dedicated leads. Power Gem threatens the metagame's best Defogger in Tornadus-T, while Sludge Bomb dents screens setters such as Grimmsnarl and Tapu Koko and—if Focus Sash is still intact—Tapu Lele and Iron Valiant as well, which can be problematic against offensive teams. Earth Power pressures Steel-types like Heatran, Gholdengo, and Kingambit that would otherwise block Glimmora's Mortal Spin, while Energy Ball deals with other entry hazard setters and removers such as Great Tusk, Gastrodon, Mega Swampert, and Rotom-W. Focus Sash guarantees that Glimmora can set at least one layer of entry hazards, potentially letting Toxic Debris trigger twice as well. Tera Ghost is used in a pinch to spinblock foes such as Great Tusk and Excadrill and remove its Ground weakness to set up multiple entry hazards in the face of other setters like Landorus-T, Garchomp, and Gastrodon. Gholdengo is a near-mandatory teammate to keep up entry hazards by blocking every attempts to remove them, such as Defog and Rapid Spin. Setup sweepers like Kingambit, Volcarona, Dragapult, Dragonite, and Iron Valiant appreciate entry hazards wearing down foes such as Dondozo and Clodsire and not being chipped down by opposing ones themselves; particularly, Kingambit's Knock Off can remove Heavy-Duty Boots from the likes of Tornadus-T, Toxapex, and Volcarona to make them vulnerable to Glimmora's entry hazards.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}], "teams": [{"name": "Quality checked by", "members": [{"username": "Ryuji", "user_id": 515767}, {"username": "hidin", "user_id": 589564}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Dondozo": {
    "sets": [
      {
        "name": "Curse",
        "description": "<p>Thanks to its massive physical bulk and ability, Unaware, Dondozo serves as a wall for physical setup sweepers, such as Dragonite, Kingambit, and Dragon Dance Dragapult. Dondozo also annoys rain teams, shutting down wallbreakers such as Floatzel, Barraskewda, and Mega Swampert. With Curse, Dondozo can also function as a late-game sweeper. Liquidation is preferred to Wave Crash given that it has more PP and does not incur recoil. However, Wave Crash can also be considered for its greater power. Leftovers is preferred to maximize longevity; however, Heavy-Duty Boots is worth consideration to fortify switches into entry hazards. Tera Grass transforms Dondozo's Electric and Grass weaknesses into resistances, turning common threats in Tapu Koko and Kartana into fodder and avoiding Leech Seed from Ferrothorn. Dondozo fits best on bulky offense and balance teams, as they greatly appreciate its ability to wall physical setup sweepers. Given its mediocre special bulk, special walls such as Clodsire and Ting-Lu make for good teammates, as they can switch into special attackers such as Tapu Koko, Tera Grass Volcarona, and Choice Specs Dragapult. Gholdengo is another good teammate since it checks dangerous special wallbreakers such as Tapu Lele and Iron Valiant that can play around Dondozo's commonly paired special walls. Other Pokemon that can beat these threats include Mega Scizor and Clodsire.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "nimzowitsch", "user_id": 272785}], "teams": [{"name": "Quality checked by", "members": [{"username": "2020 idm boomer", "user_id": 385157}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Clodsire": {
    "sets": [
      {
        "name": "Unaware Wall",
        "description": "<p>Clodsire serves as a fantastic special wall, able to take on powerful attackers such as Dragapult and Mega Diancie while simultaneously stopping setup sweepers such as Gholdengo and Volcarona. Spikes are preferred on Clodsire, as the move has more limited distribution and Clodsire enters the field commonly enough to have the opportunity to use the move. However, Stealth Rock can be used if Clodsire's team requires it. Toxic is used to cripple common switch-ins to Clodsire, such as Landorus-T, Tornadus-T, and Great Tusk. Poison Jab can be used to poison post-Tera Gholdengo attempting to remove its Ground weakness, and it forces damage on Tornadus-T faster. Heavy-Duty Boots are preferred on Clodsire to negate its weakness to opposing Spikes teams, although Leftovers are also viable to increase Clodsire's longevity. Unaware is preferred over Water Absorb to negate Clodsire's passivity against setup sweepers, and Water Absorb does little to help against the likes of Mega Swampert and Gastrodon. Tera Dark grants Clodsire a Ghost resistance, which helps against Choice Specs Dragapult and Gholdengo, especially if using Poison Jab against the latter. It also grants Clodsire with a Pursuit resistance against the likes of Kingambit and Mega Tyranitar, which can both exploit its physical frailty. Clodsire fits best on defensively oriented teams that appreciate its special walling and entry hazard support. As Clodsire is weak to most physical attackers such as Kingambit, Great Tusk, and Dragonite, teammates that can cover them, such as Toxapex, Skeledirge, and Buzzwole, make for good partners. In return, Clodsire can switch into Electric-type attacks for the former, and powerful special attackers such as Dragapult for the latter two. Pokemon that benefit from Spikes support, such as Tornadus-T and Gholdengo, also pair well with Clodsire, as Spikes puts pressure on checks to them such as Ting-Lu and Mega Tyranitar. In return, Clodsire appreciates these teammates being able to make more immediate progress. Knock Off users such as the aforementioned Tornadus-T as well as Weavile and Mega Scizor pair well with Clodsire, crippling Heavy-Duty Boots users such as opposing Clodsire and Toxapex, giving Clodsire's entry hazards support a greater impact.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "ChrisPBacon", "user_id": 544502}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "Ryuji", "user_id": 515767}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Great Tusk": {
    "sets": [
      {
        "name": "Offensive Utility",
        "description": "<p>Great Tusk is an excellent Pokemon due to its amazing physical bulk, defensive typing, role compression, and movepool. It also has a very strong offensive presence and has utility moves in Rapid Spin and Stealth Rock to back it up. Headlong Rush is an amazing STAB move, letting Great Tusk force out Pokemon such as Heatran, Gholdengo, and Skeledirge very well. Earthquake can be used for a no-drawback STAB move, but the lack in power is certainly noticeable. Close Combat allows Great Tusk to annihilate Pokemon like Kingambit, and Ferrothorn, and it does a nice chunk to Rotom-W on the switch. Rapid Spin provides reliable entry hazard control, which is especially useful because Great Tusk forces out common Stealth Rock users like Heatran and Mega Tyranitar. It also lets Great Tusk outspeed foes like Iron Valiant, non-Choice Scarf Tapu Lele, and Tornadus-T. Ice Spinner lets Great Tusk hit Landorus-T, Dragonite, and Tornadus-T for good damage. Heavy-Duty Boots gives Great Tusk an entry hazard immunity and allows it to safely Rapid Spin, while Leftovers gives it passive recovery and lets it reliably check Pokemon like Kingambit and Garchomp. Icium Z allows Great Tusk to immediately remove Pokemon like Garchomp and Tornadus while also taking advantage of Tera Grass Heatran. Booster Energy can be used to improve Great Tusk's already great offensive output, but since it is a one-time use item, it can be quite unreliable. Tera Water improves the matchup into Pokemon like Urshifu-R and Floatzel. Tera Ground removes Great Tusk's Fairy and Psychic weakness and bolsters its offensive output, letting it OHKO Pokemon like Iron Valiant, Choice Scarf Tapu Lele, and Volcarona. Tera Steel gives Great Tusk resistances to the majority of its weaknesses, letting it KO Pokemon such as Tornadus-T, Iron Valiant, Tapu Lele, and Tapu Koko after luring them. Gholdengo and Kingambit make excellent partners for Great Tusk, as Gholdengo safely handles Pokemon like Tapu Lele and Iron Valiant while Kingambit can force out and Pursuit Pokemon like Tornadus-T and Dragapult. Great Tusk is commonly used as setup fodder against Pokemon like Iron Valiant and Volcarona, so partners like Clodsire and Dragonite can support it in that case. Entry hazard setters like Ferrothorn appreciate Rapid Spin support from Great Tusk, as it lets them keep entry hazards up while removing opposing ones, preventing the team from being worn down quickly. Stealth Rock-weak wallbreakers like Nasty Plot Tornadus-T and Mega Charizard Y also appreciate entry hazard removal from Great Tusk, as it lets them come in multiple times and poke holes in the opposition.</p> "
      },
      {"name": "Defensive", "description": "<p>96 Speed EVs let it outspeed non-Choice Scarf Kartana at +1 Speed.</p> "},
      {"name": "Offensive Bulk Up"}
    ],
    "credits": {"writtenBy": [{"username": "hidin", "user_id": 589564}], "teams": [{"name": "Quality checked by", "members": [{"username": "Jho", "user_id": 208105}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Scream Tail": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>A blend of a great Speed stat and solid mixed bulk, combined with great utility options and an interesting defensive typing, Scream Tail a solid niche in the tier, allowing it to check dangerous threats such as Mega Diancie, Tapu Lele, and Mega Medicham. Wish and Protect provide Scream Tail with recovery, with the latter also scouting Choice-locked Pokemon such as Dragapult and Kartana. Dazzling Gleam punishes Great Tusk and Iron Valiant and prevents them from freely exploiting Scream Tail. Encore pairs excellently with Scream Tail's high Speed, allowing it to shut down setup sweepers such as Urshifu-R, Cresselia, and Garchomp for its teammates to defeat. Leftovers provides Scream Tail with recovery that makes it less susceptible to being exploited by Wish, granting Pokemon such as Gholdengo and Heatran free switches. The given EVs maximize Scream Tail's bulk while allowing it to outspeed Enamorus and shut down Calm Mind variants with Encore. An alternative spread of 120 HP / 236 SpD / 152 Spe can be used to outspeed Hydreigon while receiving a Special Defense boost in Mega Charizard Y's sun, further amplifying Scream Tail's bulk and allowing it to check Charizard under sun. Tera Steel grants a resistance to Ice- and Fairy-type attacks from Kyurem, Tapu Lele, and Iron Valiant in a pinch, while Tera Fairy ensures Scream Tail resists Pursuit from Weavile and Mega Tyranitar and increases the power of Dazzling Gleam to potentially 2HKO and OHKO Garchomp and Iron Valiant, respectively. Scream Tail fits best on defensively oriented teams that appreciate its unique defensive attributes while being able to support it sufficiently in return. Pokemon with unreliable recovery such as Great Tusk, Dondozo, and Assault Vest Toxapex appreciate Scream Tail's high-HP Wishes, while in return they check Pokemon Scream Tail struggles with such as Mega Scizor and Volcarona. Due to its reliance on Protect and Leftovers for passive recovery, entry hazard control from teammates such as the aforementioned Great Tusk and Tornadus-T can help mitigate its recovery. Scream Tail's passive nature means it can be exploited by Steel-types such as Gholdengo, Ferrothorn, and Heatran, so Pokemon that aid against them while providing a more dangerous presence such as Zamazenta, Mega Lopunny, and Swords Dance Gliscor pair well with it.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "ChrisPBacon", "user_id": 544502}], "teams": [{"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Slither Wing": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>STAB U-turn and First Impression combined with a massive Attack stat make Slither Wing a solid wallbreaker, revenge killer, and pivot. First Impression clears Pokemon such as Kartana while also denting Bug-resistant Pokemon such as Dragapult and Mega Lopunny. U-turn lets Slither Wing obtain momentum while also chipping switch-ins like Tornadus-T and Landorus-T. Flare Blitz tears through Gholdengo and is Slither Wing's strongest attack against Landorus-T and Gliscor, while Earthquake hits Pokemon like Toxapex and Skeledirge while still threatening Gholdengo as well. Tera Bug bolsters First Impression's power to high levels, maximizing Slither Wing's revenge killing potential and enabling it to spread much more chip damage with U-turn; however, it gains a Stealth Rock weakness. Slither Wing pairs well with Mega Charizard Y, as it enables Protosynthesis, which lets Slither Wing threaten the opposition more often. It also boosts Flare Blitz, letting it dent Landorus-T and Gliscor better. In return, Mega Charizard Y threatens Landorus-T, Tornadus-T, and Gholdengo. Special wallbreakers that wear down Slither Wing checks such as Mega Diancie and Tapu Koko pair well with it; they also benefit from Slither Wing breaking their checks. Slither Wing lures in Flying-types such as Landorus-T, Tornadus-T, and Dragonite, so Pokemon such as Weavile and Tapu Koko pair well with it, both notably forcing Dragonite to Terastallize into the Normal-type and making it prone to First Impression.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "hidin", "user_id": 589564}], "teams": [{"name": "Quality checked by", "members": [{"username": "ChrisPBacon", "user_id": 544502}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Sandy Shocks": {
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<p>Sandy Shocks is a niche pivot thanks to its ability to switch into threats like Tornadus-T and Tapu Koko. Tera Blast with Tera Ice allows Sandy Shocks to blast through Ground- and Flying-types that are immune to its STAB moves like Garchomp, Dragonite, and most notably, Landorus-T. Alternatively, Tera Grass with Tera Blast is another option to hit Mega Swampert and Gastrodon super effectively and gives it a resistance to Ground, although it becomes completely ruined by Gliscor. If not using Tera Blast, Stealth Rock and Spikes allow Sandy Shocks to support its teammates by wearing down threats like Skeledirge, Gholdengo, and Tornadus-T. Tera Ground allows Sandy Shocks to boost the power of Earth Power, take less entry hazard damage, and shed its Ground weakness. Pokemon that appreciate being safely brought in like Heatran, Dragapult, and Annihilape against threats to it such as Ferrothorn, Dragonite, and Weavile are great partners for Sandy Shocks. Knock Off support from Pokemon like Tornadus-T and Great Tusk allows Sandy Shocks to capitalize on chipping down switch-ins like Dragonite and Tornadus-T. Sandy Shocks struggles against Ground-types without Tera Blast or if another teammate Terastallizes, therefore, Pokemon that threaten them such as Kartana, Walking Wake, and Weavile are great teammates.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "skippergamez", "user_id": 620268}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "ChrisPBacon", "user_id": 544502}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Iron Treads": {
    "sets": [
      {
        "name": "Entry Hazard Lead",
        "description": "<p>Iron Treads has a niche as an interesting entry hazard lead in the metagame. With both Stealth Rock and Rapid Spin, it can lay entry hazards while keeping them off for its teammates, and it is very threatening to Magic Bounce Pokemon in Mega Diancie and Hatterene. Steel Beam allows Iron Treads to sacrifice itself quickly in order to deny Defog attempts from the likes of Tornadus-T, Landorus-T, and Rotom-W. It is also Iron Treads's main tool of pressuring Hatterene, and it is generally powerful enough to chunk certain Ground-resistant and immune Pokemon, like Landorus-T, Tornadus-T, and Buzzwole. Booster Energy and Quark Drive together allows Iron Treads to outrun the entire unboosted metagame as well as Choice Scarf users like Tapu Lele, Urshifu-R, and Gholdengo, allowing it to consistently lay entry hazards. Tera Ghost allows Iron Treads to block opposing Rapid Spin attempts from Great Tusk if necessary. Iron Treads should be used as a lead on hyper offense teams, so other support teammates and sweepers are natural partners. Dual screens setters like Grimmsnarl and Tapu Koko allow their sweeping teammates another layer of support and safety, and they can use Taunt to consistently deny Defog attempts even after Iron Treads has fainted. Common hyper offense sweepers, like Mega Gyarados, Galarian Moltres, Kingambit, Volcarona, and Baxcalibur appreciate Iron Treads laying Stealth Rock while keeping hazards off at the same time. The former two in particular appreciate this, as Mega Gyarados is weak to Stealth Rock before mega evolving, while Galarian Moltres often prefers other items over Heavy-Duty Boots.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Sputnik", "user_id": 475916}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "Taka", "user_id": 595062}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Iron Hands": {
    "sets": [
      {
        "name": "Bulky Swords Dance",
        "description": "<p>Swords Dance Iron Hands is a potent wincon, using its amazing bulk in conjunction with its perfect coverage to punch holes in faster teams that lack the means to consistently wall it and trade extremely well. Wild Charge and Close Combat are higher power options over Thunder Punch and Drain Punch that allow for a few notable benchmarks, such as having a chance to 2HKO Tera Water Skeledirge and OHKOing defensive Rotom-W after Stealth Rock and a Swords Dance, but they both greatly sacrifice longevity. Ice Punch lets it nail Ground-, Flying- and Dragon-types that resist its STAB combination such as Landorus-T, Dragonite, Zapdos, and Great Tusk. Tera Water lets Iron Hands gain a much stronger defensive type overall, preventing Ground-, Psychic-, and Fairy-types from revenge killing it while improving the rain matchup significantly. The given EV spread allows Iron Hands to KO Tapu Lele with Thunder Punch after a Swords Dance and outspeed Chansey, with the rest dumped into Special Defense to maximize its lower special bulk. Entry hazard support from Garchomp, Gastrodon, Ferrothorn, and Mega Diancie is crucial to Iron Hands, as it quickly wears down all of its checks for it to clean late-game. Future Sight support is also notable, as it allows Iron Hands to bypass would-be checks such as Buzzwole and Skeledirge. Pivots such as Tapu Koko, Tornadus-T, and Landorus-T also work well with Iron Hands, as they bring it in safely and prevent it from being worn down quickly. Tapu Koko's Electric Terrain also activates Iron Hands's Quark Drive, boosting its Attack even further. Due to its great defensive utility, it partners well with Pokemon like Slowbro and Dragapult, as it takes advantage of Dark-types that pressure these two out, with Slowbro providing Future Sight support and Dragapult taking advantage of Iron Hands’s checks like Buzzwole and Skeledirge. Due to its lack of longevity, it is a poor singular check to threats such as Kingambit, Weavile, and Kartana, so pairing it up with Pokemon like tank Garchomp, Tapu Fini, and Rotom-W to form defensive a defensive core works wonders.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "adem", "user_id": 529732}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "Ryuji", "user_id": 515767}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Iron Jugulis": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Iron Jugulis serves as a solid wallbreaker, utilizing its solid STAB combination, coverage, and Speed tier to threaten foes. Earth Power snipes would-be checks like Heatran, Toxapex, and Mega Diancie. U-turn lets Iron Jugulis pivot into Pokemon that solve unfavorable matchups for it such as Kartana and Mega Scizor while also providing momentum for teammates like Tapu Koko and Great Tusk. Tera Flying boosts Hurricane to obscene levels while also giving it a resistance to Close Combat from the likes of Mega Lopunny and Zamazenta. Alternatively, Tera Ground gives Iron Jugulis a Stealth Rock resistance and gives it an easier time breaking through the likes of Mega Tyranitar and Clodsire. Iron Jugulis values pivots like Tapu Koko, Landorus-T, and Slowbro, as they provide it opportunities for it to come in and pressure Pokemon like Tangrowth and opposing Slowbro. Tapu Koko in particular is an astounding partner, as it enables Quark Drive for Iron Jugulis, which lets it outspeed Pokemon like Dragapult and Mega Lopunny. Slowbro also provides Future Sight to pressure Toxapex and Clodsire. Pokemon that can wear down checks to Iron Jugulis such as Assault Vest Tornadus-T and Ting-Lu with entry hazards like Landorus-T, Ferrothorn, and Heatran are appreciated. Entry hazard removers such as the aforementioned Tornadus-T and Rotom-W help compensate for Iron Jugulis's Stealth Rock weakness.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "hidin", "user_id": 589564}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "ChrisPBacon", "user_id": 544502}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Iron Moth": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Iron Moth's power, Speed tier, and U-turn allow it to function well as an offensive pivot. Energy Ball hits Gastrodon and Garganacl while U-turn allows Iron Moth to pivot out of bad matchups, such as Heatran, Toxapex, and Skeledirge. Alternatively, Psychic hits Toxapex, but it makes Iron Moth a significant momentum sink against Heatran and Mega Tyranitar. Heavy-Duty Boots allows Iron Moth to act as a pivot consistently without having to worry about entry hazard chip, which it is otherwise very vulnerable to. Tera Grass surprises Mega Swampert, Mega Tyranitar, Hippowdon, and Garchomp defensively before hitting them back with a powerful Energy Ball. Iron Moth fits well on VoltTurn offenses, specifically those including Tapu Koko, who is a natural partner for it. Tapu Koko can set Electric Terrain for Iron Moth in order to boost its Special Attack and benefits from Iron Moth bringing it in on Toxapex. Conversely, Tapu Koko can bring Iron Moth in on threats to it, such as Ferrothorn and Rillaboom. Iron Moth also benefits heavily from Future Sight support, as it prevents Toxapex from safely switching in while also applying some chip onto Heatran. Slowbro can pivot into threats to Iron Moth, such as Garchomp, Mega Lopunny, and Zamazenta, while Slowking helps out even more against Heatran. Entry hazard setters like Ferrothorn, Mega Diancie, Garchomp, and Landorus-T wear down Iron Moth's checks like Heatran, Garchomp, and Mega Tyranitar. Garchomp in particular pivots into Heatran relatively well. Powerful offensive threats like Dragapult, Zamazenta, Mega Lopunny, and Tapu Lele appreciate Iron Moth bringing them in safely on threats like Heatran, Toxapex, and Skeledirge while also being a decent wallbreaker in its own right. The former three can also use their good Speed tier to help out Iron Moth against more offensive builds.</p> "
      },
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Iron Moth is a prediction-reliant but extremely dangerous wallbreaker that can systematically break down defensive cores while still being useful against offense due to its decent Speed tier. Energy Ball hits threats such as Gastrodon, Garganacl, and Garchomp. Psychic hits Toxapex and Clodsire hard, while also having a decent chance of 2HKOing physically defensive Skeledirge. Iron Moth can also opt for Tera Blast + Tera Ground to hit Toxapex, Heatran, Skeledirge, and Clodsire all at once while removing its irritating Stealth Rock weakness. This makes Iron Moth very reliant on Terastallizing to break certain teams, however. Tera Grass should be used otherwise, as it still lessens Iron Moth's Stealth Rock weakness while also allowing it to potentially turn the tables on Garchomp, Mega Swampert, and Urshifu-R. U-turn can also be used to ease prediction and safely bring in teammates, but Iron Moth's Stealth Rock weakness makes this a risky proposition. Iron Moth needs very solid entry hazard control, so options such as Tornadus-T, Landorus-T, Cyclizar, and Great Tusk make for solid teammates; the former three can also bring Iron Moth in safely via pivoting. Tapu Koko is another great option, as Electric Terrain jacks up Iron Moth's power to titanic levels, cleanly 2HKOing Clodsire, Garchomp, and Skeledirge with Fire Blast after the Quark Drive boost. It also allows Iron Moth to deal sizable damage to physically defensive Toxapex with Fire Blast, potentially 2HKOing it after some chip. Heatran switch-ins such as Garchomp, Rotom-W, and Slowking are appreciated, as its presence makes it very hard for Iron Moth to safely use its STAB moves. The latter two can use pivot moves to bring Iron Moth in. Heatran can beat these with Tera Grass and Tera Blast, but Iron Moth will be able to use Sludge Wave on it if Terastallization is forced. Powerful anti-offense Pokemon such as Mega Lopunny, Dragapult, and Iron Valiant are good teammates, as they appreciate Iron Moth wearing down defensive cores while supporting Iron Moth against fast offenses that exploit its Speed tier.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Sputnik", "user_id": 475916}], "teams": [{"name": "Quality checked by", "members": [{"username": "hidin", "user_id": 589564}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Baxcalibur": {
    "sets": [
      {
        "name": "Dragon Dance",
        "description": "<p>Baxcalibur serves as a potent Dragon Dance sweeper with powerful STAB moves, threatening to OHKO the majority of the metagame at +1. Icicle Crash with Heavy-Duty Boots to flinch through potential checks such as Skarmory and Corviknight is a good alternative. Earthquake hits Steel-types such as Heatran, Kingambit, and Gholdengo, while also hitting defensive staples such as Skeledirge, Garganacl, and Toxapex. Thermal Exchange lets Baxcalibur avoid Will-O-Wisp from Pokemon like Rotom-W and Skeledirge, and it dissuades the use of moves such as Volcarona's Flamethrower and Heatran's Magma Storm, as well as coverage from Choice-locked Pokemon like Dragapult. Tera Steel lets Baxcalibur avoid Toxic while also denying Choice Scarf Tapu Lele from revenge killing it and allowing setup in front of Choice Specs Dragapult. Tera Dragon powers up Baxcalibur's Glaive Rush to lethal levels, while Earthquake boosted by Tera Ground lets Baxcalibur OHKO the aforementioned Kingambit, Garganacl, and more often that not Toxapex at +1, avoiding Iron Head, Salt Cure, and Haze, respectively. Baxcalibur functions well on offensive teams that provide dual screens support, letting it set up freely in front of Pokemon like Rotom-W and Slowbro. Baxcalibur's ability to rip holes in Pokemon like Ferrothorn and Toxapex-reliant cores greatly benefits teammates like Tapu Lele, Weavile, and Urshifu-R, which can quickly snowball late-game. Baxcalibur also appreciates Steel-types like the aforementioned Ferrothorn, Heatran, and Gholdengo, as they check Choice Scarf Tapu Lele. Gholdengo in particular checks Iron Valiant, which revenge kills Baxcalibur with Quark Drive. Landorus-T pivots out on Pokemon such as Rotom-W, giving Baxcalibur an opportunity to setup while also checking threatening Fighting-types like Zamazenta and Mega Lopunny. Baxcalibur appreciates entry hazard removal for Loaded Dice sets to maximize its solid natural bulk, so teammates such as Great Tusk, Tornadus-T, and Rotom-W are appreciated. Skarmory, Mega Scizor, and Ferrothorn are particularly annoying for Baxcalibur, so teammates such as Mega Lopunny, Great Tusk, and Tapu Lele who assist in chipping them down are appreciated.</p> "
      },
      {"name": "Substitute + Dragon Dance"},
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Baxcalibur finds a niche as an adequate wallbreaker by utilizing its high Attack and a strong, spammable STAB move in Glaive Rush, 2HKOing physically bulky Pokemon like Toxapex, Skeledirge, and Slowbro. Its natural bulk alongside Thermal Exchange grants it plenty of wallbreaking opportunities, with the latter letting it ignore Rotom-W’s and the aforementioned walls' crippling Will-O-Wisp and Scald burns. Ice Shard allows it to revenge kill faster threats like Dragapult, Iron Valiant, Mega Lopunny, and Choice Scarf Landorus-T. Earthquake deals with Steel-types such as Gholdengo, Kingambit, and Heatran, and it's Baxcalibur's hardest-hitting attack against Skeledirge, Garganacl, and Mega Tyranitar. Tera Ice and Tera Dragon boost its offensive presence; the former allows Icicle Crash to 2HKO Ferrothorn and provides significant odds for Ice Shard to OHKO Tornadus-T, as well as Dragonite through Multiscale, while the latter does so similarly with Glaive Rush, possibly OHKOing Rotom-W and 2HKOing Buzzwole. A defensive alternative is viable, as Tera Steel lets Baxcalibur stomach Dragapult's Draco Meteor, Iron Valiant's Moonblast, and Gholdengo's Make it Rain, shed its Stealth Rock weakness, and switch into Toxapex's Toxic. Pivots like Tornadus-T, Rotom-W, Tapu Koko, and Landorus-T can bring Baxcalibur in safely on Pokemon like Rotom-W, Tangrowth, Clodsire, and opposing Landorus-T, respectively. Setup sweepers or late-game cleaners such as Volcarona and Iron Valiant appreciate Baxcalibur handling Toxapex, Heatran, and Clodsire, while the likes of Dragonite and Choice Scarf Kartana enjoy Baxcalibur overwhelming physical walls like Ferrothorn, Tangrowth, and Skeledirge.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}, {"username": "sealoo", "user_id": 514772}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "2020 idm boomer", "user_id": 385157}, {"username": "hidin", "user_id": 589564}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Gholdengo": {
    "sets": [
      {
        "name": "Defensive Nasty Plot",
        "description": "<p>Gholdengo uses its great typing and decent bulk to switch into Pokemon such as Tapu Lele, Hawlucha, most Mega Medicham, most Iron Valiant, and Zamazenta. Gholdengo's typing and unique ability in Good as Gold make it the premier stopgap to entry hazard removal and a good asset for entry hazard-stacking teams. Gholdengo can switch in on Defoggers like Rotom-W and Tornadus-T—the tier's top Defogger—and can switch in on status moves like Leech Seed from Ferrothorn and Toxic from Clodsire after Gholdengo Terastallizes. A STAB combination of Ghost / Steel hits many targets neutrally, with Shadow Ball being incredibly spammable and Make It Rain hitting Ghost-resistant Pokemon like Garganacl, Tyranitar, and Weavile; the former two are otherwise able to switch in freely. Tera Ghost allows Gholdengo to maintain its spinblocking abilities while strengthening Shadow Ball against foes like Toxapex and improving its matchup into Garganacl. Tera Fairy lets Gholdengo switch out of otherwise crippling Pursuit. Tera Water lets it stay in on four attacks Kingambit and begin setting up, but still leaves it vulnerable to Garganacl and taken advatange of by Rotom-W. The removal of a Ground weakness also allows it to take advantage of Heatran, Ting-Lu, and Clodsire. 128 Special Defense EVs let Gholdengo survive two Heat Waves from offensive Tornadus-T from maximum HP, while the Special Attack allows it to OHKO bulky Tornadus-T with Make It Rain after a Nasty Plot; the remaining are put in Defense to take hits from the likes of Kingambit and Mega Tyranitar much better after Terastallizing. Entry hazard setters like Ting-Lu, Clodsire, Gastrodon, and Mega Diancie appreciate their hazards staying up for as long as possible. Pokemon like Mega Lopunny appreciate Gholdengo beating common revenge killers in Choice Scarf Tapu Lele and Zamazenta. Rotom-W is notable in that it checks Pokemon like Mega Swampert, Heatran, and Victini, and it appreciates Gholdengo providing entry hazard control. Gholdengo struggles against Kingambit, which it lets in for free and struggles to switch out of due to Pursuit. Kingambit is punished by Fighting-type teammates such as Urshifu-R, Zamazenta, Iron Valiant, and Mega Lopunny. Gholdengo also struggles against Mega Lopunny, which can switch in on stray Shadow Balls and bypass its Fighting immunity with Scrappy. Gholdengo also struggles against Clodsire and opposing Ghost-types, such as Dragapult and opposing Gholdengo. These can be checked by Pursuit users such as Weavile, Kingambit, and Mega Tyranitar.</p> "
      },
      {"name": "Choice Scarf"}
    ],
    "credits": {"writtenBy": [{"username": "gamer but swag", "user_id": 585800}], "teams": [{"name": "Quality checked by", "members": [{"username": "adem", "user_id": 529732}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Ting-Lu": {
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Ting-Lu is an outstanding wall, utilizing its immense bulk, Vessel of Ruin, and useful defensive typing to check threats such as Dragapult, Espathra, and Tapu Koko well. With access to both Stealth Rock and Spikes, Ting-Lu is a flexible entry hazard setter that supports its teammates well. Ruination allows Ting-Lu to pressure Pokemon such as Rotom-W, Tornadus-T, Great Tusk, and Landorus-T, which don't care about its Earthquake. Rest is an option for more longevity across the length of a game, but it renders Ting-Lu useless for a few turns. Whirlwind works exceptionally well with other hazard setters like Ferrothorn and Mega Diancie, as it lets Ting-Lu wear down Pokemon quickly for its teammates, as well as phazing setup sweepers such as Espathra and Dragonite easily. Tera Poison grants Ting-Lu a Toxic immunity while also preventing Fairy-types like Mega Diancie and Iron Valiant from taking advatange of it. Tera Water gives Ting-Lu a solid typing defensively, letting it switch into Barraskewda and Weavile easily. Ghost is also a solid Tera type, as it lets Ting-Lu check Fighting-types like Zamazenta and Iron Valiant, as well as blocking Rapid Spin attempts from Great Tusk. Water-types such as Barraskewda, Urshifu-R, and Floatzel easily force Ting-Lu out, making Water-resistant teammates such as Ferrothorn, Slowbro, and Dragonite great partners. Due to Ting-Lu's susceptibility to Fighting-types like Mega Medicham, Great Tusk, and Zamazenta, Pokemon like Gholdengo, Tornadus-T, and Skeledirge work really well alongside it. Gholdengo in particular forms a potent defensive core with Ting-Lu, preventing its entry hazards from being Defogged. Wallbreakers such as Urshifu-R, Dragapult, and Iron Valiant all pair amazingly with Ting-Lu's hazard support. Lastly, due to Ting-Lu's susceptibility to hazard chip damage, entry hazard removers like Tornadus-T, Rotom-W, and Great Tusk are invaluable partners.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "adem", "user_id": 529732}], "teams": [{"name": "Quality checked by", "members": [{"username": "Ryuji", "user_id": 515767}, {"username": "Sulo", "user_id": 528036}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Iron Valiant": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Iron Valiant is a threatening wallbreaker, punching holes in teams with its good offensive stats and wide special movepool. Iron Valiant can't fit all its desired options, but its versatility means opponents must scout it. Thunderbolt helps deal with Pokemon like Toxapex and Corviknight. Psyshock dents Clodsire,which usually hard counters Iron Valiant otherwise, while Shadow Ball helps against Gholdengo and Skeledirge. Trick can cripple Iron Valiant's switch-ins such as Toxapex, Clodsire, and Corviknight. Fairy is the premier Tera type to boost its Moonblast to extreme levels, with it even denting resistant foes like Gholdengo and Victini. Electric is also a good choice, as it helps against Bullet Punch from Mega Scizor and Hurricane from Tornadus-T and Zapdos, and Thunderbolt becomes an extra STAB move. Steel works in the same vein, but it doesn't have any offensive utility, although it provides Iron Valiant a Toxic immunity and more resistances. This set appreciates pivots like Landorus-T, Tapu Koko, and Slowbro to pressure the opponent's team and bring it in. In particular, Tapu Koko also boosts Iron Valiant's Speed thanks to Electric Terrain activating Quark Drive, while Slowbro provides Future Sight support, helping Iron Valiant to push through Toxapex and Clodsire. Entry hazards from Pokemon like Ting-Lu, Garchomp, and Gastrodon help wear down Iron Valiant's checks, such as Gholdengo, Clodsire, and Toxapex. They also can switch into faster Pokemon that threaten Iron Valiant, such as Tapu Koko, Choice Scarf Rotom-W, and Choice Scarf Victini. Pursuit Kingambit, Weavile, and Mega Tyranitar can trap and remove Pokemon that Iron Valiant struggles to break through, like Gholdengo and Victini.</p> "
      },
      {
        "name": "Mixed Attacker",
        "description": "<p>Iron Valiant has the stats to be a good mixed attacker. The given EV spread allows it to OHKO Blissey with Close Combat. Psyshock helps deal with Clodsire, and Thunderbolt hits Corviknight and Toxapex. Knock Off is a good option, as it helps beat Gholdengo while usefully removing items from the likes of Skeledirge, Volcarona, and Corviknight. Fairy is the best Tera type for this set, as it lets Moonblast's damage skyrocket. Steel can make up for Iron Valiant's atrocious bulk, which is even worsened by the Naive nature, and Electric also brings some defensive use while giving Thunderbolt STAB. Both also help Iron Valiant against Tornadus-T and Mega Scizor, as it can resist Hurricane and Bullet Punch. Iron Valiant appreciates slow pivots like Landorus-T, Slowbro, and Corviknight bringing it in safely. Entry hazard control is required to ensure Iron Valiant's survivability. Therefore, Defoggers like Corviknight and Tornadus-T, Rapid Spin users like Great Tusk, and even Magic Bounce users such as Mega Diancie are good partners.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<p>Calm Mind Iron Valiant is a strong wallbreaker and a potent wincon due to its offensive pressure and Speed boost from Booster Energy. It already possesses a high base Speed, meaning it outpaces every relevant Choice Scarf user besides itself. Calm Mind helps it pressure supposed checks such as Toxapex, Corviknight, and Mega Scizor, although you'll need to Terastallize Iron Valiant to beat the latter. Thunderbolt helps it hit these threats, while Psyshock allows Iron Valiant to properly beat Clodsire and the aforementioned Toxapex. Thunderbolt in combination with an Electrium Z can dent checks like Toxapex and Gholdengo once boosted. Steel is the best Tera type, as it lets Iron Valiant block poison and resist strong priority moves, such as Fake Out from Mega Lopunny and Bullet Punch from Mega Scizor. Electric is also a very strong option, as it still helps against Bullet Punch and allows Iron Valiant to bash through Skeledirge and the aforementioned Mega Scizor. Since Booster Energy only activates once, this set requires a lot of support before coming in and setting up. Therefore, it's limited to very offensive playstyles. Entry hazards from Garchomp, Ting-Lu, and Landorus-T are needed to weaken Iron Valiant's checks such as Toxapex, Clodsire, and Mega Scizor, helping it punch through them. Pokemon that share checks with Iron Valiant are also valuable teammates, like Dragon Dance Dragonite, Weavile, and Volcarona, as together they can overwhelm common checks like Corviknight and Toxapex. Iron Valiant also appreciates dual screens from Grimmsnarl or Tapu Koko. The latter brings Electric Terrain, which can be useful for Quark Drive and Thunderbolt in extended endgame scenarios. Finally, Swords Dance Kingambit and Swords Dance Garchomp can deal with its checks like Toxapex and Clodsire.</p> "
      },
      {
        "name": "Choice Scarf",
        "description": "<p>Thanks to its high Speed and capable offensive stats, Iron Valiant is a very potent Choice Scarf user, revenge killing Dragonite and Zamazenta and cleaning up weakened teams. Close Combat and Moonblast hit a large variety of Pokemon, and Knock Off cripples foes while hitting Gholdengo and Skeledirge hard. Trick cripples checks like Toxapex and Clodsire. Tera Fairy helps Iron Valiant clean through weakened teams, and Steel allows it to reliably beat Dragonite while resisting priority moves from the likes of Mega Lopunny and Mega Scizor. Entry hazards from setters like Garchomp and Ting-Lu are heavily recommended to weaken Iron Valiant's checks such as Mega Scizor, Toxapex, and Clodsire. Trappers can remove Pokemon it tends to struggle against, such as Toxapex and Gholdengo. Therefore, Heatran, Kingambit, and Weavile are good teammates. Mega Charizard Y, Heatran, and the aforementioned Kingambit can break through Iron Valiant's aforementioned checks. Finally, defensive Pokemon, such as Mega Scizor, Gholdengo, and Heatran can cover for Iron Valiant once it gets forced out after revenge killing.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Ryuji", "user_id": 515767}], "teams": [{"name": "Quality checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "hidin", "user_id": 589564}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Ogerpon-Wellspring": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>A complementary typing and a great Attack stat, especially when considering the 1.2x boost from its Wellspring Mask, give Ogerpon-W a niche as a powerful wallbreaker. Water- and Grass-type attacks hit most Pokemon for at least neutral damage, and after a Swords Dance boost, anything that doesn't resist its STAB combination is KOed. Even checks such as Baxcalibur and Tera Grass Heatran struggle to take a Swords Dance-bolstered Ivy Cudgel, and some of the stoutest walls, such as Toxapex, take heavy damage from a boosted Power Whip. Ivy Cudgel is its strongest Water-type STAB option and hits most Pokemon for neutral damage. Power Whip punishes common Water-resistant Pokemon such as Toxapex, Rotom-W, and Alomomola and is preferred to Wood Hammer despite the potential inaccuracy to avoid recoil. Horn Leech can also be used in order to supplement Ogerpon-W's longevity and let it come in more often. Trailblaze is another niche option, usually seen on Aurora Veil or dual screens hyper offense teams, boosting Ogerpon-W's Speed and allowing it to sweep. Play Rough notably hits Dragon-types that otherwise could resist Ogerpon-W's STAB combination such as Baxcalibur and Dragonite. Superpower is another great option, notably KOing Ferrothorn after a Swords Dance boost. Due to its great wallbreaking capability, setup sweepers such as Volcarona and Booster Energy Iron Valiant appreciate defensive cores being heavily weakened, allowing them to sweep. Water Absorb is a particularly useful ability prior to Terastallizing, as Ogerpon-W can find opportunities to set up on Pokemon such as Mega Swampert and Manaphy, as well as block Alomomola's Flip Turn. Ogerpon-W also appreciates entry hazards from Hisuian Samurott and Landorus-T, as the chip helps it pressure defensive cores even further. Despite all this, bulky Grass-types such as Ferrothorn, Amoonguss, and Kartana can check Ogerpon-W, so Pokemon like Iron Valiant, Mega Medicham, and Zapdos are beneficial as teammates. Ogerpon-W is also threatened by faster attackers like Iron Valiant and Mega Lopunny, so defensive pivots such as Landorus-T, Galarian Slowking, and Mega Scizor are also extremely useful. Despite being locked to Tera Water, this is actually very beneficial to Ogerpon-W, taking away its weaknesses to Flying- and Poison-type attacks and letting it stay in on threats such as Tornadus-T and Sneasler. In addition, Tera Water boosts its Ivy Cudgel to stupendous amounts, 2HKOing Ferrothorn after Stealth Rock and minimal chip at +2. The 1.5x Special Defense boost granted upon Terastallizing can also help mitigate attempts to revenge kill Ogerpon-W by foes like Choice Scarf Tapu Lele, Iron Valiant, and Choice Scarf Gholdengo.</p> "
      }
    ],
    "credits": {"writtenBy": [], "teams": [{"name": "Written By", "members": [{"username": "CPBBAE", "user_id": 619787}]}, {"name": "Quality checked by", "members": [{"username": "sealoo", "user_id": 514772}]}, {"name": "Grammar checked by", "members": [{"username": "Grabby", "user_id": 555379}, {"username": "autumn", "user_id": 384270}]}]}
  }
}