{
  "Ninetales-Alola": {
    "overview": "<ul> <li> <p>Weather control in Snow Warning and Aurora Veil support give Alolan Ninetales a strong niche in the metagame. Alolan Ninetales's great offensive typing allows it to threaten Chien-Pao, Urshifu-S, and Landorus with an OHKO while also walling the former two.</p> </li> <li> <p>Alolan Ninetales pairs especially well with slower Ice-types that appreciate the added bulk from snow, such as Articuno and Baxcalibur. Hisuian Arcanine also makes for an excellent partner, helping Alolan Ninetales set up Aurora Veil through Intimidate support, dishing out great damage, and threatening Ice-resistant foes, such as Gholdengo, Incineroar, and Kingambit. All of these partners have fantastic offensive pressure through setup or Choice items, making up for Alolan Ninetales's poor offenses. Ogerpon-W does a great job at helping set up Aurora Veil with Follow Me and threatening foes that resist Ice-type moves like Incineroar with Ivy Cudgel.</p> </li> <li> <p>Alolan Ninetales struggles against opposing weather setters such as Tornadus, which can shut down the snow composition. Fire- and Steel-types such as Gholdengo and Chi-Yu are threats, as they resist Ninetales-Alola's and Articuno's Ice-type STAB moves, as well as ignoring Ogerpon-W's Follow Me through Make It Rain and Heat Wave.</p> </li> </ul>",
    "sets": {"Screen Setter": {"description": "<ul> <li> <p>Moonblast guarantees a 2HKO on Urshifu-R. Helping Hand helps make up for Alolan Ninetales's poor damage output.</p> </li> <li> <p>Light Clay is used to make sure Aurora Veil lasts for the majority of the game.</p> </li> <li> <p>The defensive investment allows Alolan Ninetales to survive Choice Specs Flutter Mane's Moonblast and avoid the 2HKO from Ogerpon-W's Ivy Cudgel and Rillaboom's Wood Hammer, while the Speed investment allows it to outspeed Landorus.</p> </li> <li> <p>Tera Fire allows Alolan Ninetales to resist the Fire- and Steel-type moves that otherwise give it trouble, such as Gholdengo's Make it Rain and Ogerpon-H's STAB moves.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"user_id": 641287, "username": "LovelyLuna"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 646006, "username": "Choruto"}, {"user_id": 558405, "username": "SoulboyVGC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arcanine-Hisui": {
    "overview": "<ul> <li> <p>Hisuian Arcanine is a potent offensive Pokemon on many teams thanks to its good Attack, great STAB coverage, and excellent ability in Intimidate, giving it good matchups against Tornadus, Rillaboom, and Chien-Pao.</p> </li> <li> <p>Hisuian Arcanine works best in Tailwind compositions where its average Speed and poor defensive typing don't often hold it back, hence why Tailwind setters like Tornadus make good partners. In return, Hisuian Arcanine can provide Tornadus with Intimidate support, letting it stick around longer and support it with Tailwind or Bleakwind Storm damage.</p> </li> <li> <p>Hisuian Arcanine can be severely overwhelmed by Pokemon like Urshifu-R and Landorus, making Pokemon like Rillaboom and Latias good partners. Hisuian Arcanine also can be hindered heavily from other Intimidate users like Incineroar, meaning it appreciate having Pokemon like Landorus which can threaten it.</p> </li> </ul>",
    "sets": {
      "Choice Band": {
        "description": "<ul> <li> <p>Tera Blast with Tera Fairy can hit foes like Urshifu-R, Urshifu, and Raging Bolt, the former of which walls Hisuian Arcanine's STABs. Head Smash can be used to threaten Pokemon like Incineroar and Ogerpon-W with an OHKO at the cost of being chipped down by recoil.</p> </li> <li> <p>Choice Band boosts Hisuian Arcanine's damage, allowing for OHKOs on top threats like Urshifu-R, Kingambit, and Ogerpon-H.</p> </li> <li> <p>The given EV spread lets Hisuian Arcanine take two unboosted Flutter Mane Shadow Balls and almost always survive a Stomping Tantrum from Ogerpon-H. The Speed EVs let it outspeed Regieleki in Tailwind.</p> </li> <li> <p>Tera Fairy lets Hisuian Arcanine remove its weakness to Fighting-type attacks, which can be useful in a pinch against Chien-Pao; this can also let it survive Surging Strikes from Mystic Water Urshifu-R. Tera Normal boosts Extreme Speed's damage, which can be helpful against neutral targets like Urshifu-R.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"user_id": 646006, "username": "Choruto"}, {"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 633500, "username": "StupidFlandrs48"}]}]}
  },
  "Articuno": {
    "overview": "<ul> <li> <p>Articuno has a unique niche in the metagame thanks strong Ice-type STAB attacks and great bulk. Blizzard allows Articuno to tear through common cores utilizing Rillaboom, Landorus, and Raging Bolt.</p> </li> <li> <p>Alolan Ninetales is mandatory with Articuno, patching up Blizzard's accuracy and amplifying its bulk and damage output through snow, Aurora Veil, and Helping Hand. Landorus makes for a great offensive partner, threatening Ice-resistant foes like Incineroar, Gholdengo, and Kingambit. Articuno is capable of removing Ground-immune foes like Dragonite and opposing Landorus in return.</p> </li> <li> <p>Articuno's lack of coverage means aforementioned Ice resists such as Incineroar, Gholdengo, and Kingambit are problematic. Opposing weather from setters like Sunny Day and Rain Dance Tornadus are also an issue, as Articuno becomes a lot easier to remove without the added bulk and accurate Blizzards.</p> </li> </ul>",
    "sets": {
      "Choice Specs": {
        "description": "<ul> <li> <p>Blizzard is used as Articuno's primary Ice-type STAB move, as it threatens both opponents. Ice Beam is used for a strong single-target attack, and Freeze-Dry is chosen to threaten Water-types like Ogerpon-W, Urshifu-R, and Terastallized Amoonguss, which otherwise take it's hits exceptionally well. Sheer Cold is preferred in the last moveslot to threaten bulky Ice-resistant foes such as Incineroar, Dondozo, and Kingambit.</p> </li> <li> <p>Choice Specs allows Articuno to 2HKO Flutter Mane and Terastallized Ogerpon-W with Ice Beam and Freeze-Dry, respectively.</p> </li> <li> <p>The given EV spread lets Articuno almost always avoid the 2HKO from Choice Specs Flutter Mane's Tera Fairy Dazzling Gleam and almost always survive Ogerpon-H's Tera Fire Ivy Cudgel under snow and Aurora Veil.</p> </li> <li> <p>Articuno utilizes Tera Ice to shed its weakness to Raging Bolt's Thunderclap and keep the Defense boost from snow as well as make up for its mediocre damage output. This is because snow and Aurora Veil allow Articuno to function in seemingly bad matchups without a defensive Tera type.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641287, "username": "LovelyLuna"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 558405, "username": "SoulboyVGC"}, {"user_id": 646006, "username": "Choruto"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528485, "username": "DerpySuX"}, {"user_id": 633500, "username": "StupidFlandrs48"}]}]}
  },
  "Dragonite": {
    "overview": "<ul> <li> <p>Dragonite's great movepool, well-rounded stats, great ability in Inner Focus that makes it immune to Fake Out and Intimidate from Incineroar, and stellar matchups into threats like Urshifu-R, Rillaboom, and Ogerpon-W makes Dragonite a great Pokemon in Regulation F.</p> </li> <li> <p>When holding a Choice Band, Dragonite becomes one of the scariest Pokemon in the metagame for its breaking power. Its best partner, Chien-Pao, supports it with Sword of Ruin and pressures Pokemon that prevent Extreme Speed, such as Indeedee and Flutter Mane. Dragonite and Chien-Pao also are good into Rillaboom and Ogerpon-W, making Dondozo and Tatsugiri, which struggle with these two, great partners as well.</p> </li> <li> <p>Flutter Mane is also a great partner, as it breaks through Iron Hands and Gholdengo for Dragonite, while Dragonite is a great switch into Scarf Urshifu-R and Rillaboom.</p> </li> </ul>",
    "sets": {
      "Choice Band": {
        "description": "<ul> <li> <p>Extreme Speed is a priority move that hits the majority of the metagame for neutral damage, making it ideal to lock into.</p> </li> <li> <p>Aerial Ace allows Dragonite to OHKO Pokemon like Urshifu-R, Rillaboom, and Amoongus without having to be lock into Outrage. Aqua Jet is secondary priority and allows it to double up with its partner on Ghost-types like Flutter Mane, and Ice Spinner allows it to remove Indeedee-F's Psychic Terrain while still having coverage for Pokemon like Rillaboom and Amoongus.</p> </li> <li> <p>Outrage is used as its Dragon-type STAB move and allows it to OHKO almost the entire metagame.</p> </li> <li> <p>Stomping Tantrum gives coverage into Steel-types like Kingambit and Archaludon.</p> </li> <li> <p>The Speed EVs allow Dragonite to outspeed Dragapult in Tailwind, with the remaining EVs maximize its Attack and round out its bulk, allowing it to live attacks such as Choice Specs Flutter Mane's Dazzling Gleam</p> </li> <li> <p>Normal is used as the Tera type, boosting Dragonite's Extreme Speed to stellar levels of power and removing its weaknesses to common Fairy- and Ice-type moves.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Porygon2": {
    "overview": "<ul> <li> <p>Porygon2 is one of the bulkiest Pokemon in the format with Eviolite, which allows it to set up Trick Room for it and its partners and beat most Pokemon in the format one-on-one with Recover. With a Download Special Attack boost, it is able to OHKO Pokemon such as the Landorus formes, Tornadus, and Dragonite with Ice Beam.</p> </li> <li> <p>Porygon2 appreciates redirection, damage reduction, and Fake Out support to set up Trick Room and to allow it to Recover safely, making Amoonguss, Ogerpon-W, Gouging Fire, and Incineroar excellent partners. Amoonguss especially benefits from Trick Room, since it is able to utilize its low Speed under Trick Room to incapacitate foes with Spore. Ursaluna is also a great partner for Porygon2, since, as a slow and offensive Pokemon, it appreciates Trick Room letting it deal great damage to faster foes that threaten it outside of Trick Room like Flutter Mane and Urshifu. This damage output is something that Porygon2 lacks.</p> </li> <li> <p>Porygon2 struggles against Snarl, Taunt, Amoonguss, Incineroar, and Urshifu. Snarl makes it deal significantly less damage, which allows opponents to ignore it without being punished. Taunt removes valuable options from Porygon2 such as Trick Room and Recover. Spore from Amoonguss can stop Trick Room setups and makes Porygon2 vulnerable to strong attacks such as Close Combat from Urshifu, Moonblast from Flutter Mane, and Sacred Sword from Chien-Pao without being able to heal the damage off with Recover. Amoonguss also underspeeds Porygon2, punishing Trick Room setups, meaning that once Trick Room is set up, Amoonguss can Spore Porygon2 before it attacks, removing its access to recovery and damage. Incineroar pressures Fake Out, which helps stop Trick Room. Additionally, Incineroar can use Knock Off to remove the Eviolite from Porygon2, making it easier to KO. Finally, Urshifu can threaten Porygon2 with a 2HKO with Close Combat if Porygon2 does not Terastallize.</p> </li> </ul>",
    "sets": {
      "Offensive TR Setter": {
        "description": "<ul> <li> <p>Tera Blast is used as strong Normal-type STAB move that offers coverage once Porygon2 Terastallizes. When Tera Blast is paired with a Download Attack boost, Tera Blast becomes a physical move when Porygon2 Terastallizes. This allows you to hit Assault Vest users like Raging Bolt and Rillaboom harder, as well as Pokemon with high base Special Defense such as Flutter Mane. Ice Beam is used as coverage against Landorus and Amoonguss, and Recover is used for longevity, allowing it to set Trick Room up multiple times.</p> </li> <li> <p>With the bulk investment bolstered by the Eviolite, this Porygon2 always survives three Sacred Swords from Chien-Pao, Timid Choice Specs Chi-Yu Overheat, and two Moonblasts from Special Attack Booster Energy Flutter Mane. It also almost always lives a Sword of Ruin Close Combat from Adamant Urshifu.</p> </li> <li> <p>Tera Poison is the main Tera type for Porygon2. It offers resistances to Grass-, Fighting-, and Fairy-type attacks, which are important against Rillaboom, Urshifu, and Flutter Mane, respectively, as well as offering a solid overall defensive typing. Additionally, it allows it to hit Grass- and Fairy-types like Rillaboom, Ogerpon-W, and Tera Fairy Flutter Mane for super effective damage with Tera Blast. Tera Fairy is used to wall Urshifu and hit it and Raging Bolt for super effective damage. Tera Flying is used to hit Grass- and Fighting-types like Urshifu, Ogerpon, and Rillaboom. Additionally, it makes Porygon2 immune to Earthquake from Ursaluna, giving its partner a valuable spread move. Finally, Tera Ghost is used for an immunity to Fighting-type attacks and Fake Out, as well as giving it the ability to hit Flutter Mane.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 657713, "username": "Flarefox_7"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}, {"user_id": 558405, "username": "SoulboyVGC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Smeargle": {
    "overview": "<ul> <li> <p>Smeargle is a Pokemon with access to a strong supportive movepool, allowing it to function as a niche supportive option with great role compression.</p> </li> <li> <p>Smeargle works well alongside Urshifu-S, especially Choice Band variants. Along with Follow Me support, Wide Guard can protect Urshifu from common super effective spread moves like Dazzling Gleam and Bleakwind Storm.</p> </li> <li> <p>Smeargle's biggest weakness is its abysmal stats, necessitating the use of Focus Sash in order to give it any survivability. Due to its dreadful Attack stat, it cannot provide any offensive pressure outside of Endeavor, and so it is almost completely reliant on its partner to deal damage.</p> </li> </ul>",
    "sets": {"Support": {"description": "<ul> <li> <p>Burning Bulwark can be used to dissuade Fake Out and potentially burn physical attackers; however, Spiky Shield can be considered to block certain status effects and bypass opposing Focus Sashes.</p> </li> <li> <p>Decorate can punish passive play in front of Fake Out pressure and should be used alongside Pokemon slower than Smeargle in order to immediately threaten +2 attacks.</p> </li> <li> <p>The invested bulk allows Smeargle to survive a Tachyon Cutter from Iron Crown and almost always survive a Surging Strikes from Urshifu-R after Terastallizing into Grass.</p> </li> <li> <p>Tera Grass is generally preferred to be immune to Spore, though Tera Ghost can be used for a Fake Out immunity.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"user_id": 627748, "username": "Jesuuuus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 646006, "username": "Choruto"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Entei": {
    "overview": "<ul> <li> <p>Entei is a strong offensive threat thanks to its amazing movepool, and access to Sacred Fire and Extreme Speed. Its great defensive stats combined with the immunity to Fake Out and Intimidate given by Inner Focus make it difficult to slow down. When next to Chien-Pao, it can threaten to OHKO on metagame staples Kingambit, Rillaboom, and frailer Flutter Mane sets.</p> </li> <li> <p>As mentioned above, Chien-Pao is a great partner for Entei as Its Sword of Ruin ability helps Entei get KOs more easily. Chien-Pao can also remove Indeedee-F's Psychic Terrain with Ice Spinner, allowing Entei to click Extreme Speed. Another great partner for Entei is Raging Bolt, which, with its powerful Electric-type moves, especially Thunderclap, can pressure foes resistant to Sacred Fire such as Urshifu-R. Ogerpon-W is also a great partner that can redirect Urshifu-R's Surging Strikes or threaten it with a strong Horn Leech.</p> </li> <li> <p>Despite its strengths, Entei struggles against bulky Water- and Fire- types like Urshifu-R, Terastallized Ogerpon-W, Incineroar, and Gouging Fire, which resist Sacred Fire. All of them also either resist Chien-Pao's Ice-type STAB move or can mitigate it and Entei's damage output. Entei also faces issues against Farigiraf, which blocks Extreme Speed.</p> </li> </ul>",
    "sets": {"Bulky Attacker": {"description": "<ul> <li> <p>Snarl slows down strong special attackers such as Flutter Mane, Raging Bolt, and Iron Crown. Tera Blast can be used instead when using Tera Grass to hit Water-types.</p> </li> <li> <p>Assault Vest helps increase Entei's longevity against special attackers such as Flutter Mane, making Entei even harder to remove taking into account Sacred Fire's burn chance.</p> </li> <li> <p>The EV spread allows Entei to survive a 116 Special Attack Modest Earth Power from Landorus and, when Terastallized, almost always survive Mystic Water Urshifu-R's Tera Water-boosted Surging Strikes, the rest of the EVs are used to maximize its damage output.</p> </li> <li> <p>Tera Grass provides resistances to Water- and Ground- types like Urshifu-R and Landorus, as well as granting a Spore immunity. Tera Normal boosts Entei's Extreme Speed power while also removing its original weaknesses.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"user_id": 646065, "username": "Draxolotl"}, {"user_id": 641287, "username": "LovelyLuna"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 646006, "username": "Choruto"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Pelipper": {
    "comments": "<h3>Teambuilding</h3> <ul> <li>Pelipper excels in teams capable of taking advantage of Drizzle while also having sufficient defensive options to switch around to regain control of the weather late-game.</li> <li>Archaludon, with its signature move Electro Shot, works exceptionally well in rain, and it provides a defensive backbone to the team thanks to its immense bulk and ability, capable of switching into threats such as Tyranitar's Rock Slide and Maushold's Population Bomb. It quickly becomes an offensive threat once it starts stacking up Electro Shot boosts in rain.</li> <li>Basculegion-M's ability Swift Swim makes it desirable on rain teams both as an early-game powerhouse with its fast rain-boosted Wave Crash and as a late-game sweeper with Last Respects. Its immense Speed and power help it form a well-rounded balanced core with Archaludon and Pelipper, taking on threats such as Garchomp and Gholdengo, while Pelipper threatens the Grass-types that resists Wave Crash like Amoonguss and Rillaboom with Hurricane.</li> <li>Pelipper struggles against opposing weather setters like Tyranitar, which not only tanks Pelipper's STAB moves in sand but also breaks its Focus Sash with sand chip damage and KOs it with Rock Slide. Archaludon takes advantage of Pelipper's rain to fire off Electro Shots as well as completely walling Pelipper's STAB attacks. Amoonguss is an excellent disruptive option, taking advantage of its bulk to survive attacks like Knock Off from Tyranitar and Draco Meteor from Archaludon and put the aforementioned threats to sleep with Spore. Basculegion-M is a great check against Tyranitar as well, outspeeding and OHKOing it with Wave Crash.</li> </ul> <h3>Strategy Comments</h3> <ul> <li>As a rain setter, Pelipper is often used to enable Archaludon snowball with Electro Shots while handling threats like Amoonguss with Hurricane. Speed control with Tailwind is desirable due to Archaludon's slow Speed, and it helps tremendously against balance archetypes.</li> <li>Pelipper is often lead with Basculegion-M or Archaludon to immediately take advantage of rain, provided the opposing team lacks a method to change the weather. A more flexible approach would be to lead the weather-reliant Pokemon like Archaludon and prepare Pelipper as a switch-in to swiftly take control of the game with a well-timed weather change. It is pivotal to keep Pelipper intact for late-game weather control, as lack of such could potentially end up severely weakening the board and result in a loss of momentum.</li> <li>Rivaling weather setters like Tyranitar and Alolan Ninetales threaten Pelipper's rain. It's advisable to preserve Pelipper and switch it in to thwart Aurora Veil setups from Alolan Ninetales, while Archaludon or Basculegion-M should take out Tyranitar first. Opposing Archaludon can end up being a powerful threat due to being capable of walling Pelipper while taking advantage of its rain. The ideal option here would be to use Amoonguss to force it to Terastallize into a Grass-type, and then have Pelipper deal a massive amount of damage to it with Hurricane.</li> </ul>",
    "sets": {
      "Weather Setter": {
        "description": "<ul> <li>Pelipper functions as a weather setter thanks to Drizzle, enabling powerhouses like Archaludon and Basculegion-M to dish out enormous damage as well as providing support in the form of speed control or Wide Guard. Its Flying- and Water-type STAB options combined with its decent Speed help Pelipper to fill in the role of an attacker as well, taking advantage of its own rain to buff its offensive options.</li> <li>Weather Ball is a flexible attack that gains a STAB boost in rain while providing decent coverage under opposing weather like sun. Tailwind provides speed control for the team, whereas Wide Guard protects the team from Gholdengo's Make it Rain, Ursaluna-B's Hyper Voice, Expanding Force in Psychic Terrain, and Garchomp's Earthquake.</li> <li>Focus Sash allows Pelipper to survive an attack due to the set's frailty, increasing its long-term value as a weather setter and allowing it to get an extra attack off.</li> <li>Tera Stellar further boosts its damage, allowing Pelipper to OHKO Amoonguss and Annihilape with Hurricane and Tera Normal Ursaluna-B and Assault Vest Incineroar with rain-boosted Weather Ball. Meanwhile, Tera Ghost provides an immunity to Fake Out, enabling an early Tailwind uninterrupted while keeping Focus Sash intact.</li> <li>A maximized Special Attack stat with a Modest nature secures an OHKO on Incineroar with rain-boosted Weather Ball and on Amoonguss with Tera Stellar Hurricane, while a Timid nature can be opted for faster speed control and securing KOs on weakened Pokemon, and it comes in handy in rain mirror matches.</li> </ul>"
      },
      "Rain Setter": {
        "outdated": true,
        "description": "<ul> <li> <p>Pelipper can use Wide Guard over Protect to block spread move, most notably Iron Crown's Expanding Force. Pelipper utilizes Weather Ball to obtain strong boosted STAB, threatening Incineroar and Landorus.</p> </li> <li> <p>Pelipper utilizes Rocky Helmet to provide useful chip damage against Fake Out users, Ice Spinner Chien-Pao, and Urshifu-R, but can use Focus Sash for survivability or Damp Rock to extend rain for slower teams.</p> </li> <li> <p>When using Focus Sash, Pelipper should use an alternative spread of 4 HP / 252 SpA / 252 Spe with a Modest or Timid nature instead, foregoing bulk.</p> </li> <li> <p>The EV spread helps Pelipper survive a Choice Specs Flutter Mane's Moonblast and almost always a Miracle Seed Rillaboom's Wood Hammer. The Speed investment allows Pelipper to outspeed Ogerpon when in Tailwind.</p> </li> <li> <p>Tera Steel helps Pelipper gain resistances to strong threats like Rillaboom and Flutter Mane, giving it a turn to set Tailwind or click Hurricane. Tera Flying can be used to boost Pelipper's damage output and, when fully invested in Special Attack, threaten Amoonguss for an OHKO. Tera Ghost makes Pelipper immune to common moves, being Fake Out and Extreme Speed.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 239881, "username": "Mr.GX"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 657713, "username": "Flarefox_7"}, {"user_id": 645750, "username": "iPetBigfoot"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Torkoal": {
    "overview": "<ul> <li> <p>Torkoal is a premier offensive Pokemon seen on Trick Room teams thanks to its great STAB moves, fantastic ability, and good defenses. Its low Speed also makes it faster than most of the tier when in Trick Room, and it has great matchups into Pokemon like Amoonguss</p> </li> <li> <p>Some of Torkoal's strongest partners are Trick Room setters like Cresselia and Farigiraf, which can help set up Trick Room and protect it from damage with Ally Switch and Armor Tail, respectively. Torkoal also pairs well with other Pokemon that benefit from Trick Room like Ursaluna-B and Iron Hands, which can threaten neutral damage onto most of the tier, notably threatening Pokemon like Raging Bolt and Tera Water Ogerpon-W, respectively.</p> </li> <li> <p>Torkoal struggles against bulky Pokemon that resist Fire like Raging Bolt, Incineroar, as well as Tera Water Ogerpon-W, and Assault Vest Rillaboom, as they can withstand its boosted Eruptions and burn Trick Room turns, making partners like Ursaluna-B, Amoonguss, and Rillaboom appreciated.</p> </li> </ul>",
    "sets": {"Trick Room Sweeper": {"description": "<ul> <li> <p>Earth Power hits foes that resist Fire like Entei, Incineroar, Arcanine-Hisui, and Raging Bolt.</p> </li> <li> <p>Charcoal boosts the damage of Torkoal's Fire-type moves, letting it OHKO Assault Vest Kingambit.</p> </li> <li> <p>Tera Fire further bolsters Torkoal's Fire-type moves, letting it even 2HKO foes that resist Fire like Raging Bolt, Chi-Yu, and Tera Water Amoonguss.</p> </li> </ul>"}},
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Metagross": {
    "overview": "<ul> <li> <p>Metagross serves as a good defensive Pokemon on balance teams thanks to its great defenses that are bolstered even further by Assault Vest, its good ability, and its nice defensive typing against foes like Raging Bolt and Iron Crown. Its access to coverage and high Attack stat make it appreciated as an offensive threat too.</p> </li> <li> <p>Metagross can pair well with offensive Pokemon like Flutter Mane and Landorus, which can help deal with the Dark-, Ghost-, and Fire-types that threaten it like Urshifu-S, Gholdengo, and Entei. Another excellent partner can be Ogerpon-W, which has great synergy with Metagross, being able to deal with Ground-types like Landorus and redirect Sucker Punch from Chien-Pao, while Metagross can help Ogerpon-W against Rillaboom and Raging Bolt.</p> </li> <li> <p>Before Terastallizing, Metagross can be overwhelmed by Pokemon like Kingambit, Chi-Yu, and Entei, making defensive partners like Amoonguss and Incineroar appreciated. Rillaboom can also be a good teammate for Metagross, providing it with passive recovery and utility via Grassy Terrain and Fake Out, respectively.</p> </li> </ul>",
    "sets": {
      "Bulky Attacker": {
        "description": "<ul> <li> <p>Stomping Tantrum lets Metagross hit Fire- and Steel-types likeIncineroar, Entei, and Kingambit and can also help against targets like Raging Bolt. Stomping Tantrum in particular is important to hit Steel-types like Iron Crown, as they wall Metagross's STAB moves.</p> </li> <li> <p>Bullet Punch can be used to help pick off weakened foes like Flutter Mane.</p> </li> <li> <p>With an Assault Vest, Metagross can almost always survive Earth Power from Landorus</p> </li> <li> <p>With the given EV spread, Metagross almost always survives Icicle Crash from Adamant Chien-Pao when using Tera Dragon, and it is only 3HKOed by -1 Adamant Chien-Pao's Sacred Sword when using Tera Steel. The Speed EVs let it outspeed -1 Adamant Landorus-T, as well as Roaring Moon and Adamant Chien-Pao when in Tailwind.</p> </li> <li> <p>Tera Dragon lets Metagross handle Fire-types like Chi-Yu and Entei in a pinch, and it can also be useful to deal with Water-types like Ogerpon-W and Choice Scarf Urshifu-R. Tera Steel helps remove its weakness against Pokemon like Kingambit, Flutter Mane, and Chien-Pao, and it can also give Bullet Punch a chance to OHKO offensive Flutter Mane.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}]}
  },
  "Registeel": {
    "overview": "<ul> <li> <p>With an extremely high Defense stat and access to the coveted IronPress combination, Registeel serves the role of the format's late-game sweeper. Steel is an incredibly good typing defensively, and Clear Body stops Intimidate from the likes of Incineroar, which could otherwise prevent the OHKO on Flutter Mane with Heavy Slam.</p> </li> <li> <p>Registeel fits best on balance teams that feature its favorite partners. Incineroar and Amoonguss can slow down the pace of the game, Latias provides crucial speed control in Tailwind, and Rillaboom's Grassy Surge and Fake Out is appreciated by Registeel. Additionally, Latias and Rillaboom threaten Urshifu-R. Similarly, Raging Bolt is also a good Registeel partner, being the premier Urshifu-R counter in the format.</p> </li> <li> <p>Notable good matchups for Registeel include Rillaboom and Ogerpon-W, both of which get cleanly 2HKOed by Body Press after a single Iron Defense boost. Kingambit also does poorly against Registeel, as Swords Dance can be mitigated by Iron Defense and Body Press hits Kingambit very hard if it does not Terastallize.</p> </li> <li> <p>However, not all physical attackers are helpless against the IronPress Registeel. Both Urshifu formes can pose a threat, depending on Registeel's choice of Tera type. Chien-Pao can threaten heavy damage with Sacred Sword if Registeel has not used Terastallization. Gholdengo is also a hard counter to Registeel, as it is immune to Body Press and resists Heavy Slam while also being able to set up with Nasty Plot and break through Registeel's high bulk.</p> </li> </ul>",
    "sets": {
      "IronPress": {
        "description": "<ul> <li> <p>Heavy Slam allows Registeel to hit opposing Ghost-types like Flutter Mane. 52 Attack EVs allow Heavy Slam to OHKO bulky Flutter Mane.</p> </li> <li> <p>Leftovers keeps it healthy throughout the game, with Protect providing additional turns of recovery.</p> </li> <li> <p>Tera Water is the standard Tera Type for Registeel, allowing it to resist Urshifu-R's Surging Strikes and being a generally good defensive typing. However, with the rise of Urshifu-S, Tera Fairy is a viable option to resist Wicked Blow and Fighting-type moves while also being neutral into the majority of the metagame. Be careful using this, however as Teratallized Urshifu-R threatens a 2HKO with Surging Strikes, and Landorus can easily pin you with Earth Power and Sludge Bomb.</p> </li> <li> <p>The Special Defense investment allows Registeel to almost always survive Timid Earth Power from Landorus. The rest of the Defense EVs along with an Impish nature maximize its damage output.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 558405, "username": "SoulboyVGC"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Latias": {
    "overview": "<ul> <li> <p>Latias is an exceptional Tailwind setter thanks to its great bulk, defensive typing, Levitate, and solid Speed. It also checks common threats such as Landorus and Urshifu-R.</p> </li> <li> <p>Assault Vest Kingambit is a great partner, beating most of Latias's counters like Flutter Mane, Gholdengo, and, to an extent, Incineroar. It also makes great use of Tailwind, and Latias beats most of its counters as well.</p> </li> <li> <p>Latias can be very tough to remove especially if it Terastallizes into a Poison-type, which, when combined with Levitate, has only one weakness and many valuable resistances. This becomes extra apparent when using Recover, which lets it clean up late-game when positioned well, especially if Mist Ball gets some Special Attack drops.</p> </li> </ul>",
    "sets": {"Bulky Tailwind Setter": {"description": "<ul> <li> <p>Ice Beam is great coverage in general and very important for OHKOing Landorus, one of Latias's best and most important matchups.</p> </li> <li> <p>Rocky Helmet lets Latias punish common and important moves like Fake Out and U-turn. It also breaks Chien-Pao's Focus Sash if it opts to run Ice Spinner and heavily discourages the prevalent Urshifu-R from attacking it.</p> </li> <li> <p>The Speed EVs allow it to outspeed max Speed Landorus, the Special Attack EVs let it OHKO Urshifu-R and Landorus more consistently, and the rest of the EVs are used to optimize its bulk.</p> </li> <li> <p>Tera Poison, when paired with Levitate, makes Latias very difficult to break, as Psychic-types, besides opposing Latias, are not common, and the Poison typing offers resistances to many relevant offensive types, the most important of which being Fairy, because of Flutter Mane.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"user_id": 562330, "username": "Robbie35646"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 518634, "username": "Sole Survivor"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Gallade": {
    "overview": "<ul> <li> <p>Gallade is a strong option on Trick Room teams thanks to its high physical damage output, unique coverage and utility movepool. It can deal with many problematic matchups for Trick Room, such as set up sweepers via Sacred Sword and spread moves via Wide Guard.</p> </li> <li> <p>Gallade is used on teams with Indeedee-F, as the Fighting-type coverage it provides is crucial in dealing with Incineroar, Ting-Lu and other Dark-types that give Trick Room sweepers such as Hatterene trouble. Sharpness-boosted Sacred Sword does massive damage, putting pressure on opponents from turn one, as well as checking several problematic matchups, such as Dondozo. Wide Guard removes the most common way to bypass Indeedee-F's Follow Me, spread moves, and presents mind games on opponents on whether Gallade will use Wide Guard or set up Trick Room.</p> </li> <li> <p>Gallade's typing is amazing offensively, but defensively leaves much to be desired. Its Defense and HP are low, making it vulnerable to attackers like Rillaboom and Urshifu that can take one attack from Gallade while OHKOing it back. While its Special Defense is high, it is made moot by relevant special attackers such as Flutter Mane and Tornadus, which both resist Sacred Sword and hit it for super effective damage. However, it should be noted that Wide Guard blocks both Bleakwind Storm and Dazzling Gleam.</p> </li> </ul>",
    "sets": {"Trick Room Abuser": {"description": "<ul> <li> <p>Psycho Cut and Sacred Sword are the highest base power moves that take advantage of Sharpness.</p> </li> <li> <p>The Defense EVs allow Gallade to survive a Wicked Blow and Surging Strikes from Urshifu-S and Urshifu-R, respectively.</p> </li> <li> <p>Tera Grass allows Gallade to ignore powder moves from Amoonguss, a common Trick Room counter, and resist common physical attackers such as Rillaboom. Alternatively, Tera Fire can be used to resist common anti-Trick Room leads such as Chi-Yu and Flutter Mane, as well as giving Gallade a Fairy resist.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"user_id": 558405, "username": "SoulboyVGC"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 646006, "username": "Choruto"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Heatran": {
    "overview": "<ul> <li> <p>Heatran is a niche bulky offensive threat thanks to its solid stats and great typing, bolstered by Flash Fire. This makes Heatran have an incredible matchup against most of the metagame, such as Flutter Mane and Gholdengo.</p> </li> <li> <p>Rillaboom is a great partner for Heatran, as it resists Heatran's prominent weaknesses, while also hitting Pokemon like Ogerpon-W and Urshifu-R for huge damage. Heatran also pairs well with Ogerpon-W, which supports Heatran with Follow Me, as well as threatening Urshifu-R and Landorus.</p> </li> <li> <p>Although Heatran resists a lot of attacks with its typing, it's weak to both of the Urshifu formes, Ogerpon-W, Landorus, and Iron Hands. Heatran also faces tough Fire- and Steel- competition, especially with Incineroar.</p> </li> </ul>",
    "sets": {
      "Bulky Attacker": {
        "description": "<ul> <li> <p>The combination of Heatran's STAB moves, Heat Wave and Flash Cannon, can hit a lot of Pokemon in the metagame super-effectively, while Earth Power is a good coverage move that can hit Pokemon that resist Heatran's STAB combination, like Incineroar. Magma Storm is also another option as a Fire-type attack, as it traps the opponent, which works well with Leftovers.</p> </li> <li> <p>Leftovers is a good item choice for Heatran, as it can live two Shadow Balls from Flutter Mane with a Special Attack-Booster Energy, and with Rillaboom's Grassy Surge, Heatran can constantly restore HP. Life Orb can increase Heatran's damage output, making it more of a threat.</p> </li> <li> <p>228 HP, 84 Defense EVs, and 20 Special Defense EVs allow Heatran to take an Ivy Cudgel from Ogerpon-W, almost always survives a Sludge Bomb from Landorus after Heatran Terastallizes and Life Orb recoil, and finally, with 20 Speed EVs, Heatran outspeeds both Urshifu formes after a Speed drop.</p> </li> <li> <p>Tera Grass is an excellent Tera type for Heatran, allowing it to resist Water- and Ground-type moves from the likes of Pokemon like Urshifu-R and Landorus. Tera Fairy can allow Heatran to resist Urshifu-S's STAB moves and be a neutral type against the metagame.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 651372, "username": "4Kuser"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Cresselia": {
    "overview": "<ul> <li> <p>Cresselia shines in VGC as an incredibly bulky Trick Room setter with access to Lunar Blessing. Cresselia is a great check to Amoonguss and Urshifu-R, nullifying Spore with Lunar Blessing and pressuring the latter with a 2HKO.</p> </li> <li> <p>Cresselia's strongest partner is Ursaluna, as it's a strong Trick Room sweeper that appreciates Lunar Blessing negating the burn chip damage. Cresselia's Levitate also allows Ursaluna to freely click Earthquake. Cresselia also appreciates Pokemon like Amoonguss and Iron Hands, which help get up Trick Room and act as threats under Trick Room themselves.</p> </li> <li> <p>Cresselia struggles against Incineroar, as Fake Out can allow Incineroar's partner to get off another hit, which can be the difference between setting up Trick Room and not. Cresselia also faces issues against Farigiraf, which can reverse or Imprison Trick Room. Tornadus can also prove to be difficult, as Taunt prevents Trick Room from going up and takes advantage of Cresselia's passivity.</p> </li> </ul>",
    "sets": {
      "Trick Room Support": {
        "description": "<ul> <li> <p>Cresselia uses Moonblast to hit more of the metagame for super effective damage, including Urshifu-S, while Ice Beam can be used to threaten the Landorus formes and Dragonite. Cresselia may opt for Psychic for the extra power before Terastallization.</p> </li> <li> <p>Helping Hand allows Cresselia to more actively support its partners, especially Ursaluna and its Earthquake. Cresselia can use Ally Switch to provide game-deciding mind games and a way to protect its partners in a pinch.</p> </li> <li> <p>Cressellia uses Safety Goggles to protect itself from Amoonguss's Spore and be able to consistently protect its teammates with Lunar Blessing.</p> </li> <li> <p>The EV spread allows Cresselia to almost always survive two Mystic Water Surging Strikes from Urshifu-R, and always avoid the 2HKO from Choice Specs Flutter Mane's Moonblast.</p> </li> <li> <p>Tera Fairy is the most consistent for Cresselia, as it provides a resistance to the common Dark-type moves such as Urshifu-S's Wicked Blow or Kingambit's Kowtow Cleave, as well as gaining STAB on Moonblast. Tera Poison is a generally good defensive typing further bolstered by Levitate, and it provides key resistances to Flutter Mane's Moonblast and Rillaboom's STAB moves.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641287, "username": "LovelyLuna"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 294287, "username": "yuki"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Whimsicott": {
    "overview": "<ul> <li> <p>Whimsicott's combination of a good supportive movepool, great Fairy typing allowing it to threaten Pokemon like both Urishifu formes, and Prankster makes it a good utility Pokemon in Regulation F.</p> </li> <li> <p>Whimsicott enjoys fast threats like Flutter Mane, Urshifu formes, and Landorus, which can exploit its Tailwind</p> </li> <li> <p>Whimsicott also can use Beat Up to form a niche but lethal combination with Pokemon like Terrakion.</p> </li> <li> <p>Whimsicott struggles against faster Pokemon with super effective STAB moves like Tornadus and Chien-Pao, so Pokemon who can deal with these two like Flutter Mane and Raging Bolt are helpful to have.</p> </li> </ul>",
    "sets": {
      "Sun Setter": {
        "description": "<ul> <li> <p>Moonblast keeps Whimsicott from being passive and hits threats like Raging Bolt and Urshifu-S for super effective damage.</p> </li> <li> <p>Whimsicott can opt for Beat Up instead, allowing it to trigger Annihilape's Rage Fist and Terrakion's Justified ability.</p> </li> <li> <p>Sunny Day activates Pokemon like Flutter Mane and Raging Bolts's abilities, making them more potent threats, as well as weakening Urshifu-R and Ogerpon-W.</p> </li> <li> <p>The fourth move slot is customizable; Fake Tears allows Whimsicott to weaken Pokemon for partners like Flutter Mane and Landorus, Encore locks foes into unfavorable moves like Protect and Fake Out, Taunt helps shut down more passive Pokemon like Amoonguss and opposing Whimsicott.</p> </li> <li> <p>The EV spread allows Whimsicott to live Tornadus's Bleakwind Storm and outspeed Maximum Speed Tornadus.</p> </li> <li> <p>Tera Water grants Whimsicott valuable resistances to Fire-, Ice-, and Steel-types like Incineroar, Chien-Pao, and Kingambit while generally being a great defensive typing.</p> </li> <li> <p>Covert Cloak allows Whimsicott to be immune to Fake Out.</p> </li> </ul>"
      },
      "Offensive Utility": {"description": "<ul> <li> <p>Protect is valuable for dealing with Fake Out, but it does not allow to fit Sunny Day.</p> </li> <li> <p>Tera Ghost makes Whimsicott immune to common priority moves like Fake Out and Extreme Speed as well as providing a resistance to Poison-type moves like Landorus' Sludge Bomb.</p> </li> <li> <p>Focus Sash allows Whimsicott to have another chance to set up Tailwind or support its team later on in the game, as its mediocre defensive stats and plethora of weaknesses otherwise leave it potentially OHKOd by most Pokemon in the metagame.</p> </li> <li> <p>Note that if Whimsicott is running Beat Up, an EV spread of 252 HP / 4 Def / 252 Spe with a Jolly Nature is more optimal.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Amoonguss": {
    "overview": "<ul> <li> <p>Amoonguss excels as a support Pokemon thanks to its great defensive typing and toolkit. Regenerator gives Amoonguss longevity and allows it to constantly answer Urshifu-R, Iron Hands, and Flutter Mane with Rage Powder throughout the game.</p> </li> <li> <p>Amoonguss appreciates Incineroar allowing it to pivot to activate Regenerator, as well as the Intimidate and Fake Out support Incineroar provides after pivoting in. Incineroar also helps Amoonguss by pressuring the powder-immune Grass-types and weakening threats like Chien-Pao and opposing Incineroar, while Amoonguss can keep it healthy through Pollen Puff and protect it from Pokemon like Urshifu-R and Flutter Mane in return.</p> </li> <li> <p>Amoonguss also pairs well with frail offensive Pokemon like Urshifu-R, which threatens problematic Fire-types like Incineroar and Entei. Amoonguss can also protect Urshifu-R from Flutter Mane and Raging Bolt through Rage Powder.</p> </li> <li> <p>Amoonguss struggles against Pokemon like Entei and Chi-Yu, which threaten to OHKO it, as well as Grass-types like Rillaboom or opposing Amoonguss who can ignore it. Ogerpon-W with Follow Me can be an issue because it restricts Amoonguss from putting foes to sleep.</p> </li> </ul>",
    "sets": {
      "Bulky Support": {
        "description": "<ul> <li> <p>Amoonguss can use Spore to disable the majority of the metagame and enable offensive partners in the process. It can also use Pollen Puff to keep its partners healthy as well as pressure Ogerpon-W with super effective chip damage</p> </li> <li> <p>Amoonguss can utilize Sitrus Berry for burst healing and to survive the 2HKO from Choice Specs Flutter Mane's Shadow Ball. It can also opt for Rocky Helmet to punish physical attackers, especially Urshifu-R.</p> </li> <li> <p>The HP EVS optimize Sitrus Berry recovery, and in conjunction with the Defense and Special Defense EVs, it survives the OHKO from Adamant Chien-Pao Ice Spinner and the 2HKO from Gholdengo's Shadow Ball, respectively.</p> </li> <li> <p>Amoonguss makes use of Tera Water, as it synergizes with its original typing while keeping a resistance to Water. This enables it to take on Entei, Chien-Pao, and Incineroar while keeping its role as a consistent Urshifu-R answer. This is great for Amoonguss as many of these Pokemon like to partner together. Tera Fairy can be used instead to resist Urshifu-S's STAB moves and not be vulnerable to Ogerpon-W after Terastallizing.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641287, "username": "LovelyLuna"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 518634, "username": "Sole Survivor"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Volcarona": {
    "comments": "<h3>Teambuilding</h3> <ul> <li>Setup Volcarona fits well on balance teams, as it requires utility and defensive support to enable it to sweep.</li> <li>Rillaboom is an excellent teammate, as it uses Fake Out to give Volcarona room to set up and sets up Grassy Terrain that augments Volcarona's passive recovery and powers up Giga Drain. Redirectors like Clefable draw attacks away from Volcarona, letting it set up more easily. Intimidate users like Paldean Tauros-W and Incineroar supplement Volcarona's ability to enhance its special bulk by reducing the damage of physical attackers.</li> <li>Kingambit is a common teammate on the balance teams that Volcarona fits on. Assault Vest variants threaten foes like Incineroar, Tyranitar, and Dragapult that Volcarona struggles against.</li> <li>Volcarona, before Terastallizing, hates Water- and Rock-types like Basculegion-M and Tyranitar, so Grass-types like Rillaboom give it leeway against them. Additionally, Volcarona's coverage does not extend to Fire- and Dragon-types like Incineroar and Dragapult; Water-types like Paldean Tauros-W threaten the former, while Fairy-types like Clefable assist against the latter. Primarina fulfills both of these categories. Dragon-types like Dragapult are also able to threaten opposing Dragon-types for Volcarona.</li> </ul> <h3>Strategy Comments</h3> <ul> <li>As a setup sweeper, Volcarona wants Fake Out support and redirection to give it breathing room to set up. The earlier in the game Volcarona can get set up, the more difficult it will be to remove it from the field, as a boosted Volcarona will be able to stay healthy more easily with its powerful Giga Drain. Intimidate cycling assists in this, as it reinforces Volcarona's physical bulk to complement Quiver Dance, which boosts its special bulk.</li> <li>Volcarona is actually one of the greatest adversaries of rain teams, as with redirection support and Terastallization, it can boost to a level where it takes the special attacks of the rain attackers with ease. From there, its boosted attacks will rip apart these rain attackers and completely deny them the ability to revenge kill it. In these matchups, it's better to avoid using too many attacks on Archaludon, as its Stamina-boosted Body Press will eventually become too strong for Volcarona to handle. Early in the game, Pelipper threatens Volcarona with both of its STAB moves, so redirection will prevent Volcarona from being KOed by Pelipper before it can get set up. Additionally, Swift Swim Basculegion-M is a threat before Volcarona has set up, easily outspeeding and overwhelming it with rain-boosted Water-type attacks.</li> <li>Volcarona lacks coverage to threaten Dragon-types, so the likes of Dragapult and Dragonite can take it on effectively. This extends to Tera Dragon Pokemon like Gholdengo, which gain the ability to resist its attacks. Similarly, Fire-types like Incineroar and Tera Fire users like Rillaboom resist both of its attacks, and they are also immune to burns from Heat Wave and Flame Body. Trick Room teams invalidate Volcarona's Speed boost, though the Special Defense boost enables it to take attacks from the special attackers on these teams. Another useful tactic is to use physical attackers, as it has worse Defense and cannot improve it with Quiver Dance.</li> </ul>",
    "sets": {
      "Bulky Setup Sweeper": {
        "description": "<ul> <li>Volcarona utilizes the bulk, power, and Speed granted by Quiver Dance, the recovery from Giga Drain, and Terastallization, which lets it work its way around its checks, to become difficult to take down and take over games as a result.</li> <li>Heat Wave and Giga Drain give Volcarona great coverage, letting it hit most foes in the metagame with its boosted attacks.</li> <li>Leftovers gives Volcarona passive recovery, augmenting the recovery that Giga Drain provides to be at higher HP to survive more attacks. Covert Cloak lets Volcarona ignore Fake Out to set up or throw out its attacks more freely. If Volcarona does not use Tera Grass, Safety Goggles is an alternative that lets it ignore Amoonguss's support options.</li> <li>Tera Grass gives Volcarona a resistance to Water- and Electric-type attacks like Basculegion's Wave Crash and Archaludon's Electro Shot, removes its weakness to Rock-type attacks like Glimmora's Meteor Beam and Tyranitar's Rock Slide, makes it immune to Amoonguss's Spore, and powers up Giga Drain, which not only lets it do more damage to Water-, Ground-, and Rock-types like Paldean Tauros-W, Ursaluna-B, and Tyranitar but also lets it restore more HP in the process, making it more likely to sweep games. Tera Dragon gives Volcarona similar defensive benefits and doesn't make it weak to Pelipper's Hurricane and Fire-type attacks like Armarouge's Armor Cannon and Incineroar's Flare Blitz, though it becomes weak to Dragon-type attacks like Dragapult's Dragon Darts and Dondozo's Order Up.</li> <li>252 HP EVs and 92 Defense EVs ensure that Dondozo's Wave Crash 4HKOes a Terastallized Leftovers Volcarona, Choice Band Dragapult's Dragon Darts 2HKOes a non-Tera Dragon Leftovers Volcarona, and non-Adaptability Basculegion-M's 100 Base Power Last Respects 2HKOes Volcarona. Volcarona will still have enough special bulk to survive Pelipper's Hurricane; after a Quiver Dance, it will take a Blood Moon from Tera Normal Life Orb Ursaluna-B or a Choice Specs Tera Fire Overheat from Hisuian Typhlosion in sun.</li> <li>68 Special Attack EVs and Modest nature ensure that +1 Volcarona nearly always OHKOes Gholdengo and Kingambit with Heat Wave and 3HKOes a +2 Special Defense Unaware Leftovers Dondozo with Tera Grass Giga Drain, and the 84 Speed EVs let Volcarona outspeed Adamant Basculegion-M.</li> <li>Even with only 4 Special Attack EVs, though, a +1 Volcarona will still OHKO bulkless Basculegion-M and maximum HP Ursaluna-B with Giga Drain with the aid of either Tera Grass or Grassy Terrain, OHKO Primarina with +1 Giga Drain with both of these multipliers, and OHKO Amoonguss with a +2 Heat Wave. 148 Speed EVs allow Volcarona to outspeed Modest Glimmora.</li> </ul>"
      },
      "Quiver Dance": {
        "outdated": true,
        "description": "<ul> <li> <p>Volcarona prefers Flamethrower as its Fire-type STAB move for the OHKO on Amoonguss at +1 and the OHKOs on Assault Vest Rillaboom and Kingambit when at +2. Volcarona uses Tera Blast to threaten Raging Bolt and the Urshifu formes. Giga Drain can be used instead for longevity and a better way to threaten Tera Ogerpon-W.</p> </li> <li> <p>Leftovers' recovery is most effective, as Volcarona is intended to stay on the field from start to finish, Giga Drain and common support enables this.</p> </li> <li> <p>The EVs allow Volcarona to survive Ogerpon-W's Ivy Cudgel, and, when Terastallized and at +1 Special Defense, two Special Attack Booster Energy Flutter Mane Dazzling Gleams. The Speed investment allows for Volcarona to outspeed unboosted Iron Bundle after a Quiver Dance, and the remaining EVs are used to maximize damage.</p> </li> <li> <p>Even when boosted, Volcarona will struggle against the aforementioned Fire-types, so Landorus and Urshifu-R make great teammates. Volcarona is a great answer to Flutter Mane and Rillaboom in return.</p> </li> <li> <p>Volcarona prefers Tera Fairy to resist Urshifu-S's STAB moves, while Tera Dragon is another option to resist Urshifu-R's Surging Strikes and Ogerpon-W's STAB moves. Both Tera types synergise with Volcarona's original typing, thanks providing Steel-, Ice-, and Fairy-type resistances.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 555379, "username": "Tbolt"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 558405, "username": "SoulboyVGC"}, {"user_id": 645750, "username": "iPetBigfoot"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Tornadus": {
    "overview": "<ul> <li> <p>Tornadus is one of the strongest support Pokemon bearing a great toolkit, including Tailwind, Taunt, Rain Dance, and Sunny Day. Prankster provides great speed and weather control. It has a great matchup against Rillaboom and Amoonguss, thanks to Bleakwind Storm, a great spread move which gives it a field presence, and Taunt.</p> </li> <li> <p>Tornadus has amazing synergy with Urshifu-R and fast Pokemon like Flutter Mane, Chien-Pao, and Landorus, which define the archetype of tailwind hyper offense.</p> </li> <li> <p>Tornadus can become vulnerable to certain threats like Urshifu-R, Chien-Pao, and opposing Taunt Tornadus depending on its item choice. Focus Sash struggles against Urshifu-R, and items like Covert Cloak and Mental Herb struggle against Chien-Pao. Rocky Helmet matches poorly into Fake Out and Taunt pressure.</p> </li> <li> <p>Tornadus struggles to create field pressure as a singular Pokemon. It cannot Taunt Pokemon like Farigiraf and Indeedee due to their respective abilities blocking priority. Chien-Pao, Raging Bolt, Iron Hands and Archaludon are bad matchups for it because of their ability to quickly remove it from the field.</p> </li> </ul>",
    "sets": {
      "Bulky Tailwind": {
        "description": "<ul> <li> <p>Bleakwind Storm provides good damage into Rillaboom and Ogerpon-W. Tailwind is the most effective speed control Tornadus has access to. Taunt helps shut down Amoonguss and helps to manage certain Trick Room Pokemon like Porygon2 and Dusclops, but Protect can be run instead to ensure Tailwind goes up. Rain Dance and Sunny Day serve as weather control, which enables your sweepers and disables opposing weather-based sweepers. Rain Dance pairs well with Urshifu-R and Ogerpon-W while Sunny Day powers up Chi-Yu and Flutter Mane.</p> </li> <li> <p>This given EV spread focuses on bulk, surviving Mystic Water Surging Strikes from Urshifu-R and Tera Fairy Choice Specs Moonblast from Flutter Mane. The low Speed investment ensures that Tornadus sets up its own weather.</p> </li> <li> <p>Rocky Helmet helps against Urshifu-R mirrors and provides good chip into opposing physical attackers making contact. Covert Cloak prevents Fake Out flinches from Incineroar and Rillaboom. It also negates any secondary effects from moves like Rock Slide and Icy Wind. This ensures that Tailwind goes up. Mental Herb helps to shrug off one Taunt.</p> </li> <li> <p>Tera Dark provides an immunity to Prankster Taunt, guaranteeing Tailwind. Tera Steel provides useful resistance to Chien-Pao and Flutter Mane's STAB moves. Both Tera types improve matchups into Psyspam and against Electric-type moves from Pokemon like Raging Bolt, Iron Hands and Archaludon.</p> </li> </ul>"
      },
      "Offensive Tailwind": {"description": "<ul> <li> <p>Focus Sash ensures Tornadus survives one attack and set up Tailwind. Protect becomes important to avoid Fake Out without committing the Tera early.</p> </li> <li> <p>Tornadus rarely Terastallizes, but Tera Ghost can ensure that it can more reliably set up Tailwind by negating Fake Out from Pokemon like Incineroar and Rillaboom, and Extreme Speed from Pokemon like Dragonite and Entei. Tera Flying increases its offensive pressure.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"user_id": 641757, "username": "fyfyy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Landorus": {
    "overview": "<ul> <li> <p>Landorus is one of the best special attackers in the format currently, as its Sheer Force and Life Orb boosted STAB moves devestate opposing teams and nail prominant threats like Archaludon, Kingambit, Incineroar, and Raging Bolt.</p> </li> <li> <p>However, Landorus has a very crowded Speed tier, thus speed control from Pokemon such as Latias and Tornadus is vital against faster checks like Chien-Pao and Choice Scarf Urshifu-R. Both Pokemon also act as excellent Urshifu-R checks themselves.</p> </li> <li> <p>Fake Out users like Rillaboom and Incineroar can be great teammates too, buying time for Landorus to set up Substitute. Rillaboom also serves as another answer to Urshifu-R, while Incineroar helps dampen the damage from opposing Chien-Pao. Other common Landorus checks include Pokemon that can comfortably ignore Earth Power, namely Latias and Tornadus.</p> </li> <li> <p>Ogerpon-W is also a particularly good teammate, as it can redirect and absorb attacks from Chien-Pao and Urshifu-R while dealing decent damage back.</p> </li> </ul>",
    "sets": {
      "Life Orb": {
        "description": "<ul> <li> <p>Earth Power serves as its main STAB attack, allowing it to hit the majority of the format for good damage.</p> </li> <li> <p>Sludge Bomb is able to deal respectable damage against Ground-resistant foes, such as Rillaboom and Tornadus. Tera Poison can also elevate Sludge Bomb's damage and secure KOs against Rillaboom.</p> </li> <li> <p>Tera Poison in conjunction with 132 HP and 4 Def EVs lets Landorus survive Surging Strikes from Tera Water Urshifu-R the majority of the time. The remaining EVs are used to maximize its Speed and Special Attack.</p> </li> <li> <p>A timely Tera Poison lets Landorus live a Tera Fairy-boosted Choice Specs Moonblast from Flutter Mane, as well Ice-type attacks from Chien Pao.</p> </li> <li> <p>Substitute allows Landorus to punish passive plays, mainly switches and Protect. A well-timed Substitute in front of a Kingambit also prevents Landorus from getting knocked out by a potential Sucker Punch. This move can be substituted for Sandsear Storm on Rain teams or when paired with Rain Dance Tornadus.</p> </li> <li> <p>A Timid nature can be considered, allowing Landorus to outspeed faster Urshifu-R and Ogerpon-W variants, at the cost of damage.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 435812, "username": "Yuichi"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 562330, "username": "Robbie35646"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Landorus-Therian": {
    "overview": "<ul> <li> <p>A great STAB combination, a sky-high Attack stat, and Intimidate allow Landorus-T to function well in many different roles. These make it a great Choice Band sweeper, threatening many common metagame threats such as Raging Bolt and Flutter Mane. Landorus-T can also function as a Intimidate pivoter, using its great STAB combination and movepool to provide utility.</p> </li> <li> <p>More offensive Landorus-T sets appreciate speed control support from Tornadus and Icy Wind Flutter Mane, with the former being more consistent by providing Tailwind support and hitting the Grass-types that resist Ground such as Rillaboom, while the latter has excellent offensive synergy. Redirection support from Ogerpon-W and Amoonguss is also appreciated, with both benefiting from Intimidate and Ogerpon-W specifically handling the Ice- and Water-types that give Landorus-T trouble. Choice Scarf Landorus-T partners well with all of the above options; however, it doesn't rely on speed control compared to Choice Band variants.</p> </li> <li> <p>Rillaboom and Ogerpon-W are difficult for Landorus-T to handle, with the former having Fake Out. which is even more potent because Landorus-T almost exclusively runs Choice items, and halving the damage of Earthquake, while the latter has super effective Water-type STAB moves and a way to redirect its Stomping Tantrum; both of these also resist Ground. Incineroar is also an issue, as even though it's weak to Ground, Intimidate and Parting Shot let it constantly debuff Landorus-T, removing the its potential to OHKO many Pokemon. Landorus-T also finds itself difficult to slot into many teams, as each of its individual strong points are better found in other options, such as Incineroar generally being a strong Intimidate pivot and the other Landorus forme being a better offensive threat.</p> </li> </ul>",
    "sets": {
      "Offensive Sweeper": {
        "description": "<ul> <li> <p>Stomping Tantrum is the best single target Ground-type move available, while Earthquake is used to dish out damage to more foes and bypass Follow Me. Rock Slide hits the Flying-types that are immune to Ground, while U-turn is a strong pivot option that also hits Ground-resistant Grass-types, even having a chance to OHKO frailer Ogerpon formes.</p> </li> <li> <p>Choice Band allows Landorus-T to function as a sweeper, partially negating the low Base Power of its Ground-type moves and giving it rolls to OHKO many prevalent threats such as Raging Bolt, Kingambit, and Flutter Mane.</p> </li> <li> <p>The Defense investment allows Landorus-T to survive a Wicked Blow from Tera Dark Urshifu-S, Kowtow Cleave from a +1 Attack Black Glasses Kingambit, and Ivy Cudgel from Ogerpon-W. The Special Defense investment allows Landorus-T to survive a Moonblast from Choice Specs Flutter Mane. The Speed investment outspeeds Adamant Chien-Pao at -1, with the rest being put into Attack.</p> </li> <li> <p>Tera Fairy is generally preferred for being a stronger neutral type into the current metagame. It also resists Sucker Punch from Kingambit, which threatens big damage thanks to its ability Defiant, and other Dark-type attackers, allowing it to wall Urshifu-S.</p> </li> </ul>"
      },
      "Damage Oriented Pivot": {"description": "<ul> <li> <p>Stomping Tantrum is used as the strongest Ground-type move available, with Rock Slide being coverage for Flying-types and U-turn for general utility. Tera Blast Flying gives Landorus-T a Flying-type move, despite coming at a high cost, allowing it to hit the Grass-types that otherwise resist Stomping Tantrum, as well as generally having more flexibility in the matchups it can be brought to.</p> </li> <li> <p>Choice Scarf gives Landorus-T the jump on many of its counters such as Chien-Pao and Ogerpon-W and helps it pivot more easily with U-turn.</p> </li> <li> <p>The EV spread still survives Wicked Blow from Tera Dark Urshifu-S and Ivy Cudgel from Ogerpon-W, with the Attack investment guaranteeing an OHKO on Rillaboom with Tera Blast Flying.</p> </li> <li> <p>Tera Flying is used to give Landorus-T a Flying-type STAB move with Tera Blast and remove its Water-type weakness.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"user_id": 646006, "username": "Choruto"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}, {"user_id": 558405, "username": "SoulboyVGC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 594122, "username": "Evie"}]}]}
  },
  "Sylveon": {
    "overview": "<ul> <li> <p>Sylveon's solid natural bulk as well as access to absurd damage from Pixilate-boosted Hyper Voice makes it a solid setup sweeper. With its pure Fairy typing, Sylveon boasts a better matchup into Ghost- and Dark-type threats such as Flutter Mane and Urshifu-S than its main Fairy-type competition, Flutter Mane.</p> </li> <li> <p>Sylveon appreciates support from Fake Out and Follow Me, allowing it to set up Throat Spray or Calm Mind more easily. Incineroar makes up for Sylveons middling physical bulk with Parting Shot and Intimidate, as well as handling the Steel- and Fire-types that Sylveon struggles against. Ogerpon-W not only provides Follow Me support but similarly to Incineroar is able to handle Steel- and Fire-type attacks safely. Landorus is a great offensive partner, with it and Sylveon covering each other's checks, as well as making up for Sylveon's low initial damage output.</p> </li> <li> <p>Sylveon's biggest issue is that it struggles to find a slot on most teams due to its competition with Flutter Mane, which is more of an immediate threat thanks to its higher single target damage, higher Speed, and Fake Out immunity from its Ghost typing. While Sylveon has use cases thanks to its bulk and pure Fairy typing, Flutter Mane is easier to fit into most compositions and is able to function well with minimal support. Sylveon's middling Speed means it is vulnerable to being overwhelmed by foes, making utilizing its strong setup options difficult.</p> </li> </ul>",
    "sets": {
      "Throat Spray Sweeper": {
        "description": "<ul> <li> <p>Hyper Voice allows Sylveon to utilize Throat Spray as well as being a strong spread move after the boost from Pixilate. Misty Terrain allows Sylveon to block Spore from Amoonguss, while Calm Mind is also viable as another way to further increase Sylveons damage output. Quick Attack picks off Urshifu-S and Chien-Pao, which normally run Focus Sash. If Sylveon is running Tera Fire, Tera Blast is also an option to hit Fairy-resistant foes such as Amoonguss and Gholdengo, as well as being a strong single target Fairy-type move before Terastallization thanks to Pixilate.</p> </li> <li> <p>The invested Defense allows Sylveon to survive Wood Hammer from Rillaboom, as well as Ivy Cudgel from a Terastallized Ogerpon-W. Sylveon is also able to survive a Metal Coat-boosted Make It Rain from Gholdengo. Enough Speed is invested for Sylveon to outspeed Chi-Yu when under Tailwind, with the rest dumped into Special Attack.</p> </li> <li> <p>Both Tera Fire and Water allow Sylveon to check problematic Steel- and Fire-types such as Gholdengo, Incineroar and Assault Vest Kingambit, though Tera Water is generally preferred thanks to having fewer weaknesses to common offensive threats. Tera Fire has valuable resistances to Fairy- and Grass-type moves on top of the coverage with Tera Blast; however, it makes Sylveon weak to more metagame threats, such as Landorus and Ogerpon-W.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 646006, "username": "Choruto"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}, {"user_id": 558405, "username": "SoulboyVGC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 528485, "username": "DerpySuX"}]}]}
  },
  "Incineroar": {
    "comments": "<h3>Teambuilding</h3> <ul> <li>Amoonguss works exceptionally well with Incineroar, protecting it from Water- and Fighting-type attacks such as Basculegions Wave Crash and Annihilapes Drain Punch. Amoonguss also provides Incineroar with much appreciated healing. In return, Incineroar can handle Gholdengo and switch into Fire-types like Talonflame and Volcarona as well as removing opposing Safety Goggles with Knock Off.</li> <li>Incineroar also works well with Gholdengo, providing Intimidate and Fake Out support to help it set up safely. Gholdengo also takes advantage of Incineroars ability to do great damage to Kingambit, considering Gholdengo can blow up Clefable and Sneasler that may attempt to protect Kingambit.</li> <li>Porygon2 and Ursaluna can set up Trick Room and Substitute more easily thanks to Incineroars support. Ursaluna can then blow up Pokemon Incineroar struggles to damage like Archaludon and opposing Incineroar.</li> <li>Incineroar can struggle to do its job against Pokemon that threaten it such as Pelipper, the Ursaluna formes, and Annihilape. Bulky support Incineroar can also feel passive at times because of its lackluster damage output, especially when it cant use Parting Shot because of redirection or Taunt. Therefore, offensive Pokemon like Gholdengo and Ursaluna that can take on these threats and make up for Incineroars poor damage output are greatly appreciated.</li> </ul> <h3>Strategy Comments</h3> <ul> <li>Incineroar is an effective support Pokemon and pivot thanks to Fake Out, Intimidate, and its pivoting moves. This makes Incineroar strongest when it can switch in and slow down threats like Sneasler and Rillaboom. When using Taunt or Will-O-Wisp, Incineroar can shut down opposing wincons like Porygon2s Trick Room and Kingambit. Rage Powder from Amoonguss makes it easier for Incineroar to pivot in and out.</li> <li>Incineroar is strong throughout the entire game; it's usually preserved throughout the game, as even switching it in is impactful, and a late-game Fake Out can be crucial regardless of how injured Incineroar is. Incineroar is notably strongest as a lead where it can threaten Fake Out and weaken opposing threats without risking any damage. Against Annihilape and Kingambit however, Incineroar likes to be paired with pieces that force them out before coming in, such as Gholdengo and Ursaluna. Assault Vest Incineroar can afford to stay in and do invaluable damage as an offensive piece occasionally, though it notably has to be a lot more careful against Amoonguss.</li> <li>Incineroars biggest weaknesses are Annihilape and Kingambit, as they take advantage of Intimidate and can prove to be dangerous wincons with support. Pelipper and Ursaluna-B also prove troublesome, (AC) as they are powerful attackers unaffected by Intimidate. Incineroar relies on teammates such as the aforementioned Gholdengo and Ursaluna to handle these threats along with Fake Out support. When Incineroar pivots in, it can also lead to a loss of momentum against setup Pokemon that cant be flinched with Fake Out, such as Bulk Up Annihilape, Nasty Plot Gholdengo, and Substitute Ursaluna, so it must be careful when pivoting. Bulky support Incineroars damage output can often feel underwhelming, especially against opposing Incineroar. Assault Vest Incineroar has a tougher time providing support, notably having more trouble getting setup sweepers into position, since it lacks Parting Shot. This can make the mirror matchup tougher, as opposing Incineroar can position their threatening allies better.</li> </ul>",
    "sets": {
      "Bulky Support": {
        "description": "<ul> <li>Incineroar excels as a support Pokemon and pivot thanks to its vast supportive movepool, Intimidate, and great typing, providing Incineroar with resistances to Gholdengos, Rillabooms, and Kingambits STAB moves.</li> <li>Incineroar can utilize Taunt over Flare Blitz to shut down support Pokemon like Amoonguss and Trick Room from Porygon2. Incineroar can also use Will-O-Wisp over Flare Blitz to weaken physical attackers like Garchomp and especially Kingambit, which punishes Intimidate.</li> <li>Safety Goggles is preferred, so Incineroar can reliably check and ignore Amoonguss. Sitrus Berrys burst healing helps Incineroar avoid 2HKOs from attacks like Choice Specs Gholdengos Make it Rain and Pelippers Weather Ball after Terastallization.</li> <li>Tera Ghost is preferred to grant Incineroar an immunity to Sneaslers Close Combat and Dragonites Extreme Speed as well as a crucial immunity to Fake Out from opposing Incineroar and Rillaboom. Tera Grass can be used instead to grant Incineroar resistances to Water- and Ground-type moves such as Basculegions Wave Crash and Garchomps Stomping Tantrum. Tera Grass also provides an immunity to Spore and Rage Powder from Amoonguss if Safety Goggles have been removed with Knock Off or Incineroar is using Sitrus Berry.</li> <li>The defensive EVs allow Incineroar to survive Garchomps Life Orb-boosted Stomping Tantrum and, after using Tera Ghost, Gholdengos Life Orb-boosted Shadow Ball and Choice Band Basculegions 100-Base Power Last Respects after Intimidate.</li> </ul>"
      },
      "Assault Vest": {
        "description": "<ul> <li>Assault Vest Incineroar is a fantastic pivot thanks to its exceptional defenses and access to Fake Out. The extra bulk enables Incineroar to play more offensively with respectable Attack and Speed investment.</li> <li>Assault Vest helps Incineroar take attacks from Pelipper, Ursaluna-B, and Archaludon.</li> <li>Tera Grass is preferred due to the Spore and Rage Powder immunity on top of the valuable resistances to Ground- and Water-type moves, such as Basculegions Wave Crash and Garchomps Stomping Tantrum.</li> <li>The Attack EVs allow Incineroar to almost always 2HKO Kingambit with Flare Blitz after Intimidate. The defensive investment ensures that Incineroar takes Annihilapes +1 Drain Punch and avoids the 2HKO from Choice Scarf Hisuian Typhlosions Heat Wave after Terastallization. The Speed EVs enable Incineroar to outspeed Sneasler under Tailwind.</li> <li>Bulky support Incineroar is more flexible and can use Parting Shot as its pivot move of choice. Assault Vest Incineroar trades this flexibility in exchange for vastly more special bulk and offensive prowess. Bulky support Incineroar doesnt have to burn Terastallization to handle Amoonguss and can use Tera Ghost instead.</li> </ul>"
      },
      "Assault Vest Pivot": {"outdated": true, "description": "<ul> <li> <p>Assault Vest makes Incineroar even bulkier at the cost of utility in not running Parting Shot or Safety Goggles.</p> </li> <li> <p>The given EV spread allows Incineroar to avoid the 2HKO from Choice Specs Flutter Mane's Moonblast and take Landorus's Earth Power, while the Defense EVs let Incineroar survive Close Combat from the Urshifu formes with Sword of Ruin active.</p> </li> <li> <p>Tera Grass is preferred because it flips Incineroar's weaknesses and allows it to be a consistent Amoonguss answer, ignoring Spore and Rage Powder. Incineroar can also use Tera Fairy as a more all-round defensive typing and as a way to check Urshifu-S.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"user_id": 641287, "username": "LovelyLuna"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 558405, "username": "SoulboyVGC"}, {"user_id": 645750, "username": "iPetBigfoot"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Primarina": {
    "comments": "<h3>Teambuilding</h3> <ul> <li>Primarina fits well on balance teams, as it benefits from utility moves like Fake Out, healing, and redirection support that allow it to attack freely while other Pokemon cover its weaknesses.</li> <li>Primarina synergizes well with Sneasler, as Sneasler covers its Grass-type weakness. Additionally, Rillaboom offers Fake Out utility and passive Grassy Terrain recovery, benefiting a bulkier attacker like Primarina.</li> <li>Electabuzz is an effective redirector, shielding Primarina from threats like Archaludon and Sneasler while also redirecting Spores from Amoonguss thanks to its Vital Spirit ability and providing speed control with Electroweb. Similarly, Magmar makes a great partner with its access to Vital Spirit and Follow Me. In addition, Magmar resists Rillaboom's Grass-type attacks and can use Will-O-Wisp to compensate for Primarinas lower physical bulk.</li> <li>Though Primarina sits in an awkward Speed tier, it can operate on teams with a Trick Room mode such as compositions with Porygon2 and Ursaluna.</li> <li>Kingambit is a strong offensive partner for Primarina. With Primarina's chip damage, Kingambit can more easily secure KOs with Sucker Punch. Additionally, most Kingambit sets include Swords Dance, allowing it to punish passive plays and forcing the opponent to choose between Primarina or Kingambit to target.</li> <li>Gholdengo is another common partner for Primarina, as they effectively cover each other's weaknesses. Primarina threatens Pokemon like Incineroar and Garchomp, which can beat Gholdengo, while Gholdengo walls and pressures threats like Sneasler, Rillaboom, and Amoonguss.</li> </ul> <h3>Strategy Comments</h3> <ul> <li>As a slower-paced offensive piece, Primarina excels when it's positioned to safely chip away at opponents. For instance, being alongside a redirection Pokemon allows it to unleash substantial chip damage with Hyper Voice. Due to its respectable bulk, Primarina can often continue using Hyper Voice until a Pokmon that poses a significant immediate threat, such as Rillaboom, enters the field.</li> <li>The strategy with Primarina is to wait for the opportunity to establish a strong offensive position. Typically, this involves pivoting it around until it can come in and clean up effectively mid- or late-game.</li> <li>As mentioned earlier, Rillaboom and Archaludon are significant threats; however, Sneasler effectively counters both. When facing opposing Sneasler or setup sweepers like Gholdengo or Volcarona, it's crucial to position Primarina correctlyeither by placing it next to a redirector, so it can attack freely, or by utilizing other Pokemon to apply more immediate pressure. This is because Primarina is most effective when its consistent spread chip damage is sufficient to prevent it from being outpaced on offense.</li> </ul>",
    "sets": {
      "Bulky Attacker": {
        "description": "<ul> <li>Primarina excels at dealing consistent damage and wearing down opposing Pokemon. Its strong offensive typing, high Special Attack, and ability to take advantage of STAB Hyper Voice with Liquid Voice make it a formidable threat. Additionally, it puts pressure on common metagame Pokemon like Incineroar and Garchomp.</li> <li>Haze prevents setup Pokmon from exploiting Primarina's slower offensive pace. More importantly, it's often used to counter the Dondozo and Tatsugiri matchup.</li> <li>While Throat Spray provides a power boost after using Hyper Voice, Life Orb offers more immediate damage, making it better suited for more aggressive teams. For example, Life Orb guarantees an OHKO on Hisuian Typhlosion with Hyper Voice while allowing Primarina to 2HKO Sneasler and Choice Specs Gholdengo with Hyper Voice. Sitrus Berry, on the other hand, enables Primarina to take on a more passive role, consistently enhancing its survivability. For instance, Sitrus Berry's recovery enables it to live two Stomping Tantrums from Life Orb Garchomp.</li> <li>Tera Poison allows Primarina to resist both of Sneasler's STAB moves and, unlike the other two recommended Tera types, doesn't introduce many common weaknesses. Tera Steel gives Primarina an immunity to Poison-type moves like Sneasler's Dire Claw and a resistance to Steel-type attacks, making it particularly effective against Gholdengo's Make it Rain. Tera Grass, like Tera Poison and Tera Steel, offers a resistance to Grass-type moves from Pokemon like Rillaboom. It also provides a resistance to Electric-type attacks like Electro Shot from Archaludon, and an immunity to Spore, preventing Amoonguss from shutting it down.</li> <li>With the given Defense and HP investment, Primarina is guaranteed to survive Grassy Glide from maximum Attack Rillaboom and a 100-Base Power Last Respects from non-Adaptability Choice Band Basculegion. The Special Defense investment ensures it can withstand Tera Steel Make it Rain from Choice Specs Gholdengo, Blood Moon from Life Orb Ursaluna-B, and two Freeze-Dry hits from Alolan Ninetales. The Special Attack investment gives Primarina a good chance to OHKO Garchomp with Moonblast and non-bulky Talonflame with Hyper Voice, while the Speed investment is designed to outspeed maximum Speed Maushold in Tailwind.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 646416, "username": "CodeVG"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 657713, "username": "Flarefox_7"}, {"user_id": 645750, "username": "iPetBigfoot"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Kommo-o": {
    "overview": "<ul> <li> <p>Kommo-o is a strong setup sweeper thanks to its excellent defensive stats and access to STAB Body Press. Its defensive typing gives it critical resistances to the signature moves of both Urshifu formes, which ignore the Defense boosts from Iron Defense. With proper support, Kommo-o is capable of becoming extremely difficult to remove once it starts setting up Iron Defense, making it an extremely effective sweeper.</p> </li> <li> <p>Kommo-o appreciates teammates that help it set up more easily. Incineroar and Amoonguss are great at this, with Incineroar being able to cycle Fake Out and Parting Shot, while Amoonguss provides Spore as well as redirection support. Both give Kommo-o turns to set up and more room to maneuver, and they also have strong defensive synergy with Kommo-o. Ting-Lu is another great partner, as it can whittle down foes with Ruination, and its ability Vessel of Ruin makes Kommo-o harder to remove.</p> </li> <li> <p>Ironically, one of Kommo-o's biggest weaknesses is its typing. While its numerous resistances are valuable, namely into the Ogerpon and Urshifu formes, in exchange, it is weak to a whole host of common offensive types. Strong attackers such as Flutter Mane, Raging Bolt, and Chien-Pao hit Kommo-o for super effective damage, with the former two being special attackers and the latter using Sacred Sword, meaning they all ignore Iron Defense boosts. Kommo-o is often forced to Terastallize, and requires careful positioning around threats to conserve its HP for a late game sweep.</p> </li> </ul>",
    "sets": {
      "Iron Defense Sweeper": {
        "description": "<ul> <li> <p>Iron Head is used to hit Flutter Mane, which is immune to Body Press.</p> </li> <li> <p>Leftovers is used for extra recovery, since Kommo-o will be on the field for long periods of time.</p> </li> <li> <p>Overcoat is picked for an immunity to powder moves, allowing it to ignore Amoonguss, which can otherwise redirect a resisted Body Press and slow it down with Spore.</p> </li> <li> <p>The Special Defense investment allows Kommo-o to live a Blood Moon from Life Orb Ursaluna-B and makes Shadow Ball from Special Attack Booster Energy Flutter Mane a 3HKO. On the physical side, the Defense investment allows Kommo-o to comfortably live Chien-Pao's Icicle Crash, as well as making Urshifu-S's Wicked Blow a 3HKO after Terastallizing into Steel. The Attack investment gives the best chance for an OHKO on Flutter Mane with Iron Head after Terastallizing into Steel.</p> </li> <li> <p>Tera Steel has the best synergy with Kommo-o's original typing since it provides resistances to every type that Kommo-o is weak to. It also gives STAB to Iron Head, allowing for a favorable roll to OHKO Flutter Mane</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 646006, "username": "Choruto"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Rillaboom": {
    "overview": "<ul> <li> <p>Rillaboom maintains its status as a premier Fake Out pivot thanks to U-turn, Grassy Glide, and Grassy Terrain. Rillaboom fits on many archetypes and has a wide range of playstyles. Rillaboom is a great counter to Water-types like Urshifu-R and Ogerpon-W, as it is able to switch into their attacks and pressure them for huge damage if not a KO.</p> </li> <li> <p>Assault Vest Rillaboom is the most common set currently, as it checks Flutter Mane, and can switch in on special threats and threaten with Fake Out or Grassy Glide.</p> </li> <li> <p>Common Rillaboom partners include Urshifu-R and Incineroar to complete the Fire / Water / Grass core, and more offensive sets pair well with Entei and Chien-Pao with priority spam. Other great partners are defensive Pokemon such as Calm Mind Raging Bolt that benefit from Grassy Terrain recovery and Fake Out.</p> </li> <li> <p>Common Rillaboom checks include Fire-types, Intimidate Pokemon to greatly reduce Rillaboom's damage output, and Pokemon that resist Grass. This includes Entei, Dragonite, and especially Incineroar.</p> </li> </ul>",
    "sets": {
      "Offensive Pivot": {"description": "<ul> <li> <p>Rillaboom is generally restricted to Fake Out, Wood Hammer, and Grassy Glide, with the 4th move usually being U-turn to pivot and sometimes High Horsepower to check Fire- and Steel-types, that would otherwise completely wall Rillaboom.</p> </li> <li> <p>Rillaboom may run Tera Grass to boost its already high levels of damage, or Tera Fire to stay in on common threats such as Incineroar and Chien-Pao and U-turn out to safely bring in a frailer Pokemon.</p> </li> <li> <p>The EV spread allows Rillaboom to almost always survive Entei's Sacred Fire and avoid the 2HKO from Protosythesis-boosted Flutter Mane's Moonblast while retaliating with a OHKO. Thanks to its priority moves, Rillaboom can afford to not invest in Speed.</p> </li> </ul>"},
      "Offensive Nuke": {
        "description": "<ul> <li> <p>Maximum Attack along with Tera Grass allows Rillaboom to always KO Flutter Mane with Sword of Ruin-boosted Grassy Glide. Protect is favored as the last move, as Rillaboom loses a lot of the bulk from the Assault Vest.</p> </li> <li> <p>This set generally looks for all-or-nothing plays, picking up OHKOs against common tanks such as Iron Hands, Farigiraf, and Ogerpon-W with Wood Hammer, and picking up KOs on frailer pokemon with Grassy Glide.</p> </li> <li> <p>This set can struggle against Intimidate, especially Incineroar, as the sudden drop to its Attack can severely minimize the absurdity of Rillaboom's attacks, allowing bulkier Pokemon to survive a boosted Wood Hammer.</p> </li> <li> <p>The EV spread allows Rillaboom to survive Tera Stellar Ice Spinner from Chien-Pao at -1 and almost always take Fairy Feather Tera Fairy Flutter Mane's Moonblast. Rillaboom can afford to forgo Speed investment, as it already outspeeds common slow Pokemon like Farigiraf and Incineroar.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 590686, "username": "sempra"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Hatterene": {
    "overview": "<ul> <li> <p>Wielding the highest Special Attack of any Pokemon to get Expanding Force and Speed lower than even Amoonguss, Hatterene is the poster child for Trick Room variants of Psychic-type spam teams. It deals with many of the usual Trick Room answers, including Iron Hands and Amoonguss, even being immune to the latter's Spore due to Magic Bounce. Magic Bounce also prevents potential Taunt users from shutting down Trick Room.</p> </li> <li> <p>Hatterene requires two things to succeed; Trick Room and Psychic Terrain. Indeedee-F provides both with Psychic Surge, Trick Room, and Follow Me to help Hatterene set up its own Trick Room. It is nearly impossible to deny Trick Room against a lead of Hatterene and Indeedee-F. Torkoal and Ursaluna deal with Steel-types that resist both of Hatterene's STAB moves, and they also benefit from Trick Room.</p> </li> <li> <p>Aforementioned Steel-types like Gholdengo are tougher to break through for Hatterene, as well as Dark-types that take neutral damage from Dazzling Gleam, such as Incineroar, Kingambit, and Chi-Yu, the latter of which has Snarl to lower Hatterene's damage output. Assault Vest Raging Bolt running Snarl also slows Hatterene down, despite being weak to Dazzling Gleam. Rillaboom changing the terrain, weakening Expanding Force greatly, and allowing priority moves to go through can also be a huge blow to a gameplan involving Hatterene.</p> </li> <li> <p>Lastly, like most Trick Room sweepers, Hatterene is susceptible to Trick Room either being denied or fully stalled out, leaving it defenseless.</p> </li> </ul>",
    "sets": {"Bulky Life Orb Attacker": {"description": "<ul> <li> <p>Tera Psychic boosts Hatterene's damage output to scary levels, allowing it to OHKO Ursaluna-B and have a favorable roll to OHKO bulky Flutter Mane. Alternatively, Tera Fire is a great defensive typing against the Flutter Mane and Chi-Yu combination, as well as Gholdengo.</p> </li> <li> <p>212 HP EVs minimize Life Orb recoil, and 100 Defense EVs alongside them allow Hatterene to always survive Adamant Tera Dark Urshifu-S's Wicked Blow. The rest of the EVs are invested in Special Attack to maximize damage output, and a Quiet nature + 0 Speed IVs ensures you move before minimum Speed Amoonguss in Trick Room.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"user_id": 558405, "username": "SoulboyVGC"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Indeedee-F": {
    "overview": "<ul> <li> <p>Indeedee-F is an exceptional support Pokemon, mainly being used for redirection with Follow Me and allowing the Trick Room teams it excels on to set up Trick Room safely. Psychic Surge allows partners such as Hatterene to sweep under Trick Room with Expanding Force. A niche use of Indeedee-F is as an Imprison + Trick Room user on hyper offense offensive teams that who have a bad matchup into Trick Room teams.</p> </li> <li> <p>Iron Crown is a popular partner for Indeedee-F, as it's in Regulation F. It is a strong special attacker with Expanding Force that appreciates Indeedee-F's redirection and damage boosting with Helping Hand.</p> </li> <li> <p>Other common partners for Indeedee-F include Armarouge, Hatterene, and Torkoal. The former benefit from Psychic Terrain by getting a boost to their STAB, Expanding Force, and Torkoal can go for Eruptions without fear of priority thanks to Psychic Terrain. Some other notable Trick Room partners are both Ursaluna formes.</p> </li> <li> <p>Pokemon that are able to remove Psychic Terrain, such as Chien-Pao and Rillaboom, also serve as good checks to Indeedee-F. Rillaboom sets up Grassy Terrain and Chien-Pao can remove Psychic Terrain with Ice Spinner, nullifying the Psychic-type spam strategy.</p> </li> <li> <p>Indeedee-F's best counters are Dark- and Steel-types, namely Incineroar, Kingambit, Archaludon, and Gholdengo, as they resist Psychic and Fairy and can take advantage of Indeedee-F's passivity.</p> </li> </ul>",
    "sets": {
      "Bulky Support": {
        "description": "<ul> <li> <p>Dazzling Gleam and Psychic are Indeedee-Fs primary damaging moves. Psychic is Indeedee-F's best STAB move, but Dazzling Gleam can be used, since its partners have Psychic-type coverage and it also hits Dark-types.</p> </li> <li> <p>Follow Me negates damage for partners and redirects status moves, being particularly valuable on Trick Room teams to ensure Trick Room goes up smoothly.</p> </li> <li> <p>Many offensive teams will utilize Helping Hand and Protect or Trick Room and Imprison as an answer to opposing Trick Room teams.</p> </li> <li> <p>Trick Room teams will opt for Trick Room and Helping Hand to give the Trick Room sweepers a damage boost. Protect can also be used on Trick Room teams over Helping Hand to preserve Indeedee-F and help reset Trick Room.</p> </li> <li> <p>Rocky Helmet is used to damage contact-making physical attackers. For example, (ac) Ice Spinner Chien-Pao would get rid of Psychic Terrain but would also have its Focus Sash broken, becoming vulnerable to Indeedee-F's partners. Safety Goggles protects Indeedee-F from Amoonguss's Spore and lets it safely redirect it from teammates. Psychic Seed increases Indeedee-F's already-good special bulk in Psychic Terrain.</p> </li> <li> <p>Tera Fairy provides resistances to all of Indeedee-F's weaknesses, therefore making it a good defensive Terastilization option, especially against Dark-types such as Incineroar and Chien-Pao.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 658956, "username": "gurupatak"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 435812, "username": "Yuichi"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Urshifu": {
    "overview": "<ul> <li> <p>Urshifu-S is capable of dealing massive damage with its signature move Wicked Blow and high base Attack, as well as its amazing ability in Unseen Fist, which allows it to bypass Protect and apply constant pressure.</p> </li> <li> <p>Tornadus is a great partner for Urshifu-S, as it provides speed control with Tailwind and can launch powerful Bleakwind Storms into Fighting-types like Urshifu-R that resist Wicked Blow. Many of Urshifu-S's threats, such as Chien-Pao, Flutter Mane, and Urshifu-R naturally outspeed it, so strong speed control is vital. Ogerpon-W can Terastallize to better handle a lot of threats to Urshifu-S such as Chien-Pao, Flutter Mane. and Landorus, and support it with Follow Me. Rillaboom hits most Dark-resistant foes such as Iron Hands and Urshifu-R for high damage, and can support it with Fake Out and priority Grass Glide, which combined with a Sucker Punch from Urshifu-S can OHKO Flutter Mane. In return, Urshifu-S handles Rillaboom's weaknesses, hitting the plethora of Steel- and Dark-types that resist its Grass-type STAB moves such as Kingambit, Incineroar, and Gholdengo.</p> </li> <li> <p>Urshifu-S struggles to break through teams with strong Dark-resistant Pokemon or generally bulky supports like Urshifu-R, Iron Hands, and Tera Fairy Flutter Mane as well as redirection from Amoonguss and Fake Out from Incineroar. Due to its poor defensive typing, middling Speed and lack of coverage, it faces issues against faster teams and its many checks.</p> </li> </ul>",
    "sets": {
      "Focus Sash": {"description": "<ul> <li> <p>Close Combat hits common Dark-resistant Pokemon such as Incineroar and Kingambit. Sucker Punch provides priority and makes up for Urshifu-S's average Speed tier.</p> </li> <li> <p>Urshifu-S uses Tera Dark to fire off strong Wicked Blows or Tera Stellar to boost the damage output of its STAB moves. Tera-boosted Close Combat OHKOes common Incineroar at -1 Attack, and both Tera types will allow Urshifu-S to OHKO Flutter Mane, provided its boost is still intact for Dark-type moves.</p> </li> <li> <p>Focus Sash allows Urshifu-S to survive any one attack, making up for its poor defensive typing. In contrast to Choice items, it gives Urshifu-S the freedom to switch moves and use Detect when threatened, which is especially strong against Fake Out leads.</p> </li> <li> <p>The extra EVs in Defense are to maximize Urshifu-S's chance of surviving a use of Surging Strikes from Tera Water Mystic Water Urshifu-R.</p> </li> </ul>"},
      "Choice Band": {
        "description": "<ul> <li> <p>Choice Band is used to guarantee an OHKO on common targets like Landorus, Ogerpon-H, Flutter Mane, and even Tornadus that are not invested heavily in physical bulk. Even naturally bulky Pokemon such as Dragonite and Walking Wake can be OHKOed or put in the range for minimal damage to KO them.</p> </li> <li> <p>Poison Jab is excellent coverage, hitting the problematic Fairy-types that Urshifu-S normally struggles with. After Terastallization, you can guarantee an OHKO on almost all Rillaboom, Terastallized Flutter mane, and even bulkier pokemon like Tera Fairy Indeedee-F. U-turn is also a viable move as a pivot option.</p> </li> <li> <p>The Attack investment and Adamant nature are necessary to get the KOs mentioned earlier, such as the OHKO on Landorus and Tornadus. The Defense investment allows Urshifu-S to survive the combination of Tera Normal Choice Band Dragonite's Extreme Speed and Sucker Punch from Adamant Chien-Pao. The Special Defense EVs allow Urshifu-S to take a variety of strong attacks such as Earth Power from Landorus and Bleakwind Storm from Tornadus. The remaining EVs are placed in Speed.</p> </li> <li> <p>Tera Poison is chosen to resist the Fighting- and Fairy-type moves that would otherwise hit Urshifu-S super effectively. Urshifu-S is naturally immune to Psychic and has Dark-type moves to cover for the weakness, and it also naturally threatens Psychic-types like Farigiraf. Tera Dark is also an option, as the extra damage combined with Choice Band is absurd and, combined with good Tailwind support and redirection, is a good choice. However, it requires more careful positioning around threats, as Urshifu-S won't be able to Terastallize out of it's Fairy- and Fighting-type weaknesses.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 646006, "username": "Choruto"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 572981, "username": "Aera"}, {"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Urshifu-Rapid-Strike": {
    "overview": "<ul> <li> <p>Urshifu-R is one of the most oppressive Pokemon in the game format due to its high Attack stat, powerful Surging Strikes, and Unseen Fist ability, which allows it to completely ignore Protect. Furthermore, its strong matchups against metagame staples Incineroar, Chien-Pao, and Landorus add to its viability.</p> </li> <li> <p>Urshifu-R is commonly paired with Tornadus, which provides it with Prankster Tailwind support, allowing it to outspeed the entire unboosted metagame; Tornadus also beats Urshifu-R's few checks, such as Ogerpon-W and Amoonguss. Chien-Pao is another common partner, decreasing foes' Defense with Sword of Ruin and checking Amoonguss and Tornadus; Urshifu-R, in return, helps Chien-Pao beat its checks such Entei and as the ubiquitous Incineroar. Incineroar and Rillaboom also make for excellent partners for Urshifu-R, as the trio forms a fundamentally strong Fire-Water-Grass Fire / Water / Grass core, covering each other's weaknesses.</p> </li> <li> <p>Due to all of its strong points, Urshifu-R always has a big target on its back, notably being checked by Pokemon such as Rocky Helmet Amoonguss and Speed Booster Energy Flutter Mane, which is commonly utilized on Tailwind teams, as it can outspeed and OHKO Urshifu-R if it does not Terastallize. Raging Bolt and Rillaboom also immensely pressure Urshifu-R with their priority moves in Thunderclap and Grassy Glide, the former of which may even OHKO Urshifu-R depending on Raging Bolt's Special Attack investment. Rillaboom can also disrupt Urshifu-R and its teammates with Fake Out. Iron Hands comfortably takes even Tera Water-boosted Surging Strikes and can potentially OHKO Urshifu-R back with Wild Charge, so players should be careful to position Urshifu-R into safe and advantageous situations.</p> </li> </ul>",
    "sets": {
      "Choice Scarf": {
        "description": "<ul> <li> <p>U-turn allows Urshifu-R to hit Ogerpon-W hard, get around Amoonguss, and pivot between its teammates like Incineroar and Rillaboom. Aqua Jet is a good option to revenge kill weakened Speed Booster Energy Flutter Mane and Sucker Punch Chien-Pao, as well as a way to get around Raging Bolt's Thunderclap. Ice Spinner can be utilized to remove Rillaboom's Grassy Terrain and Indeedee's Psychic Terrain. It also provides Urshifu-R with a way to hit Amoonguss.</p> </li> <li> <p>Choice Scarf lets Urshifu-R get the jump on and threaten an OHKO with Surging Strikes against Pokemon it normally cannot outrun, such as Flutter Mane, Chien-Pao, and Choice Scarf Landorus-T. As an added bonus, Choice Scarf also allows it to outspeed Dragapult.</p> </li> <li> <p>The Special Defense investment lets Urshifu-R always survive a maximum Special Attack Iron Bundle Freeze-Dry and, when Terastallized, a Choice Specs Moonblast from Flutter Mane. The Defense EVs allow Urshifu-R to withstand a Choice Band- and Tera Normal-boosted Extreme Speed from maximum Attack Tera Normal Dragonite with Sword of Ruin active.</p> </li> <li> <p>Urshifu-R is a great beneficiary of Terastallization, as Tera Water allows it to 2HKO almost the entire unresisted metagame while simultaneity getting rid of its Fairy and Flying weaknesses. Urshifu-R can also opt for Tera Poison or Grass, providing a resistance to Rillaboom's Grassy Glide and resistances to Flutter Mane and Raging Bolt's STAB moves, respectively. The latter keeps the Flying weakness but welcomes an immunity to Spore and Rage Powder.</p> </li> </ul>"
      },
      "Mystic Water": {"description": "<ul> <li> <p>Aqua Jet picks off weakened Flutter Mane, Chien-Pao, and Entei, which are normally faster than Urshifu-R.</p> </li> <li> <p>The Defense investment helps Urshifu-R take a Choice Band, Tera Normal Dragonite Extreme Speed from maximum Attack Dragonite even with Sword of Ruin active on the battlefield, as well as a Miracle Seed Rillaboom Grassy Glide. The Special Defense EVs let Urshifu-R almost always survive Thunderclap from Raging Bolt and Dazzling Gleam from Choice Specs Flutter Mane. The Speed EVs let Urshifu-R outspeed -1 Roaring Moon and Adamant Chien-Pao.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"user_id": 518634, "username": "Sole Survivor"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 532450, "username": "TheRealBigC"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Regidrago": {
    "overview": "<p>*Regidrago is a great offensive Pokemon that has immense damage output and can sweep teams easily thanks to Dragon's Maw and Dragon Energy.</p> <p>*When paired with Pokemon like Tornadus, the Ogerpon formes, and Indeedee that provide speed control, redirection, and priority immunity, respectively, it truly becomes difficult to hinder Regidrago's damage output. Gholdengo is one of its best partners, as it can effectively remove Flutter Mane and Chien-Pao, which are major threats for Regidrago.</p> <p>*Regidrago cannot damage the most influential Pokemon of the format  Flutter Manewith its STAB moves. Its middling Speed makes it vulnerable to faster threats, though with the right support that ensures that all the Fairy-, Steel-types, and common Focus Sash users like Chien-Pao are checked, it can absolutely steamroll teams.</p>",
    "sets": {"Dragon Fang": {"description": "<p>*Draco Meteor allows Regidrago to pick OHKOs when Dragon Energy isn't dealing much damage at low HP, and Earth Power allows it to damage to Steel types like Gholdengo and Kingambit.</p> <p>*Regidrago boosts its damage output with Dragon Fang that stacks on Dragon Maw and does insane damage.</p> <p>*Tera Steel is a great defensive Tera that allows it to resist its original weaknesses.</p>"}},
    "credits": {"writtenBy": [{"user_id": 641757, "username": "fyfyy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Ursaluna": {
    "comments": "<h3>Teambuilding</h3> <ul> <li>Ursaluna mandates Trick Room support, as without it, it is very vulnerable to the vast majority of attackers, which are faster than it. Therefore, tactics that virtually guarantee that Trick Room gets set up are good for Ursaluna teams. Redirection also enables Ursaluna to throw out its powerful attacks.</li> <li>Porygon2 is an excellent partner to Ursaluna, as it can leverage its bulk and Recover to set up Trick Room multiple times in a battle; this lets Ursaluna be a threat throughout the game. It also provides special offense to complement Ursaluna's physical offense. Incineroar is great with Porygon2, as its Fake Out makes it easier for Porygon2 to set up Trick Room, which benefits Ursaluna because it wants Trick Room to be set up. Incineroar can also safely bring in Ursaluna with Parting Shot or U-turn.</li> <li>Ursaluna also fits on Psychic-type spam teams. These teams use Indeedee-F, which has both Follow Me and Trick Room, to enable attackers that can also set up Trick Room like Hatterene and Armarouge. Not only do these teams reliably set up Trick Room, but they also provide powerful special offense to pair with Ursaluna's powerful physical offense.</li> <li>Gholdengo is a common sight on Ursaluna teams, as it handles Archaludon and Fighting-types that scare Ursaluna. Amoonguss fits well on Trick Room teams, as its Rage Powder lets Porygon2 set up Trick Room and Ursaluna attack more freely, and its Spore lets it shut down one foe so that the Ursaluna can target the other more freely. Amoonguss also supports Ursaluna by extending its longevity with Pollen Puff.</li> </ul> <h3>Strategy Comments</h3> <ul> <li>Ursaluna is a Trick Room sweeper, and it wants to be positioned on the field such that it can throw out its attacks with as many turns of Trick Room as possible. Getting Trick Room up is a major priority for Ursaluna's teams, so tactics that disrupt this, including Fake Out, Taunt, Imprison, and Trick Room, give more room to deal with the mighty bear.</li> <li>Ursaluna is not concerned with the battle state as long as Trick Room is set; if it is, then Ursaluna provides the most value when using with Facade or Headlong Rush. However, Ursaluna itself doesn't help its partner set up Trick Room, so it is less advisable to lead Ursaluna if the opposing team has the means to disrupt Trick Room. Despite this, Ursaluna wants to enter the battle with as many turns of Trick Room as possible, so aggressive switching or switch moves can be utilized to maximize Ursaluna's threat potential.</li> <li>Rain teams threaten to overwhelm Ursaluna with their boosted Water-type attacks, so weather of its own from the likes of Torkoal and Tyranitar is very useful; alternatively, if Trick Room is set up, Ursaluna can simply run them over itself. Grassy Glide from Rillaboom bypasses Trick Room and threatens Ursaluna greatly; Terrain support or redirection from Indeedee-F neutralizes this threat. Intimidate cycling will weaken Ursaluna greatly, but if it is behind a Substitute, it does not need to fear it. Fighting-types like Sneasler and Gallade are problematic for Ursaluna, but redirection from the likes of Amoonguss and Terastallizing Ghost can mitigate them. Corviknight completely walls Ursaluna's STAB moves, so Ursaluna is reliant on teammates to weaken Corviknight so that it can be dealt with. Certain Pokemon such as Torkoal and Hatterene move before Ursaluna in Trick Room, so they can push damage into Ursaluna before it can respond; however, these are usually only seen on opposing Trick Room teams.</li> </ul>",
    "sets": {
      "Guts": {
        "description": "<ul> <li>Ursaluna is a destructively powerful Trick Room attacker that doesn't fear Amoonguss's Spore. It takes advantage of Guts, Flame Orb, and Facade to delete bulky foes like Garchomp, Rillaboom, and Hatterene.</li> <li>Earthquake is a powerful spread move that threatens both foes, bypassing redirection, but it requires teammates to either be immune to Ground or use Protect in order for it to be used safely. Meanwhile, Substitute takes advantage of foes that try and use Protect to passively let Ursaluna wear itself out with burn chip damage and stall out Trick Room turns; it will also block Intimidate once it has been set up.</li> <li>Flame Orb activates Guts and boosts the power of Facade. One side benefit of getting burned is that Ursaluna won't be put to sleep by Amoonguss's Spore and Vivillon's Sleep Powder.</li> <li>Tera Ghost allows Ursaluna to become immune to Fighting-type attacks and Fake Out; the latter is important because it would otherwise deny Ursaluna from attacking in Trick Room. Tera Fairy also sheds Ursaluna's weakness to Fighting while letting it beat Dragon-types like Dragapult and Archaludon. Tera Normal powers up Facade even further, allowing it to turn 2HKOs or unfavorable OHKO chances on the likes of Amoonguss, Electabuzz, Clefable, Ursaluna, and Ursaluna-B into guaranteed OHKOs.</li> <li>The given EV spread allows Ursaluna to survive a Life Orb Ursaluna-B's Blood Moon, a +1 Draco Meteor from Archaludon, or a Make it Rain from Choice Specs Gholdengo and the burn damage right after while maximizing its Attack.</li> </ul>"
      },
      "Guts Attacker": {
        "outdated": true,
        "description": "<ul> <li> <p>Facade and Headlong Rush are used as the strongest attacks available to Ursaluna. Earthquake is used as a strong spread damage option and to bypass Follow Me from opposing Ogerpon formes. Swords Dance can also be used to punish passive play and to reverse some of the effects from Intimidate, but this forces Ursaluna to give up one of its Ground-type moves.</p> </li> <li> <p>The EV spread allows Ursaluna to survive Moonblast from Choice Specs Tera Fairy Flutter Mane, Blood Moon from Life Orb Ursaluna-B, and Ivy Cudgel from Ogerpon-W, all after burn damage. The rest of the EVs are invested into Attack</p> </li> <li> <p>Tera Ghost is used to give Ursaluna an immunity to Fighting-type attacks but more importantly Fake Out, removing a key method to stalling out Ursaluna's Trick Room turns. Tera Poison can be used for more resistances, notably improving the matchup against Rillaboom and Flutter Mane, which it normally struggles with; however, Ursaluna loses the Fake Out and Fighting immunity.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 555379, "username": "Tbolt"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 657713, "username": "Flarefox_7"}, {"user_id": 501951, "username": "zee"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Ursaluna-Bloodmoon": {
    "overview": "<ul> <li> <p>Ursaluna-B is a great special attacker thanks to its great bulk and ability in Mind's Eye, which allows it to hit Ghost-types like Flutter Mane. Ursaluna-B also works very well on Trick Room teams because of its low Speed. Pokemon like Urshifu-R, Landorus, non-Assault Vest Kingambit, and Rillaboom all fear getting OHKOed by Urslauna-B.</p> </li> <li> <p>Even though Ursaluna-B is strong under Trick Room, it still struggles against Amoonguss, which can outspeed it under Trick Room and put it to sleep. Therefore, Pokemon like Flutter Mane and Ogerpon-W are recommended teammates. Ogerpon-W can protect Ursaluna-B from attacks like Urshifu-R's Surging Strikes and when Terastallized, Chien-Pao's Icicle Crash. Farigiraf is almost mandatory for this set, as it allows Ursaluna-B to truly shine by setting up an unblockable Trick Room.</p> </li> <li> <p>Ursaluna-B also cannot threaten Assault Vest Rillaboom very well, and Rillaboom can threaten it back with a super effective Grassy Glide or Wood Hammer.</p> </li> </ul>",
    "sets": {"Trick Room Sweeper": {"description": "<ul> <li> <p>Hyper Voice provides Ursaluna-B with a more spammable Normal-type STAB attack, especially during Blood Moon's cooldown.</p> </li> <li> <p>Life Orb is recommended, as it provides Ursaluna-B with a boost to its attacks, and Ursaluna-B doesn't mind the recoil due to its great bulk and ability to consistently move first under Trick Room.</p> </li> <li> <p>The given EV spread lets it live a Tera Fairy Moonblast from a Special Attack Booster Energy Flutter Mane. 0 Speed IVs and a Quiet nature allow it to function better under Trick Room.</p> </li> <li> <p>Ursaluna-B may opt for an EV spread of 84 HP / 252 SpA / 172 Spe to outspeed Adamant Chien-Pao under Tailwind.</p> </li> <li> <p>Tera Normal can be used to boost the damage output of Blood Moon and Hyper Voice to nuclear levels.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"user_id": 629794, "username": "LOrd Fernado"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Glimmora": {
    "overview": "<ul> <li> <p>Glimmora is a strong offensive threat with access to a good STAB combination and the powerful move Meteor Beam, which, when used with the Power Herb, can melt many targets, such as Assault Vest Entei and Incineroar. With Toxic Debris and signature move Mortal Spin, Glimmora can punish physical attackers and passive play, and, when combined with the threat of Meteor Beam, make it impossible to ignore while also requiring careful positioning to properly handle.</p> </li> <li> <p>Glimmora has traditionally fit best on Dondozo teams, as the combination of Toxic Debris and Mortal Spin means your foes almost guaranteed to be afflicted with poison, putting your opponent on a timer. Assault Vest on Glimmora is especially effective on Dondozo teams, as the extra longevity helps it spread poison better and stall out even longer, making up for the lowered damage output.</p> </li> <li> <p>With Meteor Beam, Glimmora can utilize its high Special Attack stat and good offensive typing as a damage dealer. Tornadus and Ogerpon-W are good partners; Tornadus provides speed control and can launch powerful Bleakwind Storms into Fighting-types that resist Meteor Beam and Ogerpon-W redirects potential Water- or Ground-type attacks while pressuring threats like Urshifu-R and Landorus. In return, Glimmora can threaten Grass-types, which resists both Ogerpon-W's STAB moves.</p> </li> <li> <p>Glimmora's poor defensive typing, combined with its middling bulk and average Speed, makes Glimmora a glass cannon. Glimmora is weak to many prominent offensive threats such as Urshifu-R, Landorus, and Gholdengo. Glimmora also struggles to handle Rock-resistant foes such as Iron Hands, Kingambit, and Urshifu-R. Even then, many of these foes will concede Toxic Spikes while taking out Glimmora; for instance, Urshifu-R will set up both layers of Toxic Spikes if it attacks Glimmora. Amoonguss is another difficult match up, as it absords Toxic Spikes and takes Glimmora's attacks comfortably, while threatening a Spore.</p> </li> </ul>",
    "sets": {
      "Meteor Beam": {
        "description": "<p>Meteor Beam's power against most neutral targets is devastating. The Special Attack boost allows Glimmora to output offensive pressure with Sludge Bomb even after Power Herb is consumed.</p> <ul> <li> <p>Earth Power is used as coverage for the Steel-types that resist Glimmora's STAB combination. Energy Ball is also an option to utilize the Tera Grass STAB boost and to hit Pokemon that resist Meteor Beam such as Urshifu-R but makes it so that Steel-types resist all of Glimmora's attacks.</p> </li> <li> <p>The Special Attack investment along with the Modest nature is necessary to pick up a OHKO on Landorus, Walking Wake, and Terastillized Urshifu-R with Meteor Beam. The OHKO on Landorus and Urshifu turns the match up against hyper offensive teams completely on its head, especially with speed control support from Tornadus.</p> </li> <li> <p>The Defense investment is enough to guarantee surviving Rillaboom's Wood Hammer and a favourable roll of taking Kingambit's Iron Head. The Special Defensive investment lets it live Gholdengo's Make It Rain and Latias's Mist Ball. The rest of the EVs are invested into Speed, which allows Glimmora to outspeed Choice Scarf Landorus-T when in Tailwind.</p> </li> <li> <p>Tera Grass has better synergy with Glimmora's original typing and provides an immunity to spore, but gives Glimmora weakness to common threats such as Chien-Pao. Tera Water, defensively, is a stronger neutral type into the metagame, but has fewer relevant resistances to common threats.</p> </li> </ul>"
      },
      "Bulky Attacker": {"description": "<ul> <li> <p>Both Earth Power and Energy Ball are fine options, but Energy Ball can do more damage against neutral targets if Glimmora Terastallizes into a Grass type.</p> </li> <li> <p>Mortal Spin is used as the final move for a more consistent method to spread poison than Toxic Debris.</p> </li> <li> <p>The Assault Vest gives Glimmora much more longevity, as it allows it to comfortably tank special attacks while still dissuading physical attackers with the threat of Toxic Spikes. On teams where being able to spread poison is important, Assault Vest is a good option.</p> </li> <li> <p>The special bulk allows Glimmora to live many strong super effective attacks, such as Choice Specs Gholdengo's Make It Rain; it also makes Choice Specs Flutter Mane's Shadow Ball a 3HKO. Glimmora still lives a Rillaboom Wood Hammer with the HP investment.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"user_id": 646006, "username": "Choruto"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}, {"user_id": 518634, "username": "Sole Survivor"}]}]}
  },
  "Dondozo": {
    "overview": "<ul> <li> <p>Dondozo is a formidable threat thanks to its stats being doubled when combined with Tatsugiri's Commander ability. Due to its immense bulk, Dondozo is difficult to remove without adequate answers, easily sweeping through entire teams on its own.</p> </li> <li> <p>Dondozo performs best with offensive threats that can break apart teams for it and still function independently without needing to pivot. Examples include Chien-Pao and Dragonite, as well as Tornadus and a sweeper such as Urshifu-S or Flutter Mane. The two cores utilize strong speed control and get off massive damage early, allowing Dondozo to clean up. Glimmora is another excellent partner, as its ability and signature move put foes on a timer, forcing them to burn through Dondozo before fainting to Toxic poison.</p> </li> <li> <p>Dondozo struggles against Pokemon that can ignore its stat boosts, either by neutralizing or bypassing it entirely. Both Urshifu formes and Chien-Pao with Sacred Sword ignore Dondozo's Defense boost, with Chien-Pao both outspeeding and threatening Dondozo if it uses Tera Grass, and Urshifu-S dealing big damage with Wicked Blow and removing Dondozo's ability to stall with Protect. Incineroar and Gouging Fire are able to consistently weaken Dondozo with Breaking Swipe and Intimidate cycling respectively. A combination of Incineroar and Amoonguss is particularly difficult to handle, as Amoonguss can keep Incineroar safe with redirection and Incineroar is free to cycle Parting Shot and Intimidate.</p> </li> <li> <p>Dondozo requires much more experience to properly play compared to other sweepers, due to only making plays with one Pokemon for most of the game. While its not impossible to play into certain difficult matchups, especially with a strong composition and much practice, it necessitates significant reads and good positioning of Dondozo to win.</p> </li> </ul>",
    "sets": {
      "Offensive Sweeper": {
        "description": "<ul> <li> <p>Wave Crash is Dondozo's strongest Water-type move, OHKOing Pokemon like Tornadus and Gholdengo. Earthquake bypasses Follow Me from Ogerpon-W, and provides it a strong spread move thats picks off weakened foes.</p> </li> <li> <p>Rocky Helmet breaks Focus Sash on Chien-Pao and Urshifu, allowing for an OHKO. It also allows for big damage on Urshifu-R using Surging Strikes. Leftovers allows Dondozo to recover swathes of health, even more so by stalling with Protect. However, its harder to use now, as most threats to Dondozo can outdamage Leftovers recovery, especially so considering the Urshifu formes ignore Protect. Clear Amulet can be used to remove ways to weaken Dondozo, primarily Incineroar and Gouging Fire.</p> </li> <li> <p>20 Defense EVs ensure that Sacred Sword from Chien-Pao is a 4HKO and allow Dondozo to survive two Wicked Blows from Urshifu-S. 76 Special Defense EVs allow Dondozo to survive two Moonblasts from Tera Fairy Choice Specs Flutter Mane. The Attack investment ensures Wave Crash OHKOes Urshifu-S after Rocky Helmet damage and that Order Up 2HKOes Ogerpon-W and Urshifu-R.</p> </li> <li> <p>Tera Grass provides resistances to Grass- and Electric-type attacks, as well as giving an immunity to Spore from Amoonguss, which is otherwise difficult to deal with.</p> </li> </ul>"
      },
      "Supportive Yawn": {
        "description": "<ul> <li> <p>Dondozo can utilize its strong natural bulk and typing to function as a supportive wall with Yawn.</p> </li> <li> <p>Yawn Dondozo pairs best with Ting-Lu, as a combination of Sand Tomb and Yawn can reliably slow down foes and Ting-Lu's Vessel of Ruin helps with Dondozo's frailer Special Defense.</p> </li> <li> <p>Dondozo struggles against Rillaboom and Amoonguss, as both resist Wave Crash, and it is harder to make damage over time stick with Grassy Terrain and Pollen Puff respectively. Additionally, the former threatens super effective damage on Dondozo and the latter threatens Spore.</p> </li> <li> <p>Leftovers recovery gives Dondozo additional staying power in slower-paced battles compared to recovery Berries.</p> </li> <li> <p>Oblivious prevents Dondozo from being shut down with Taunt from Pokmon such as Tornadus or affected by Intimidate from foes like Incineroar.</p> </li> <li> <p>The invested bulk allows Dondozo to survive Thunderbolt from Raging Bolt, as well as surviving two Earth Powers from Landorus and OHKOing in return with Wave Crash. Heavy Slam is used to OHKO Flutter Mane.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 646006, "username": "Choruto"}, {"user_id": 627748, "username": "Jesuuuus"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}, {"user_id": 646006, "username": "Choruto"}, {"user_id": 558405, "username": "SoulboyVGC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 528485, "username": "DerpySuX"}]}]}
  },
  "Tatsugiri": {
    "overview": "<ul> <li>Tatsugiri is solely used to combine with Dondozo, and shouldn't be picked outside of that purpose.</li> </ul>",
    "sets": {
      "Choice Scarf Support": {
        "description": "<ul> <li> <p>Icy Wind is used as a late-game speed control option. Dragon Pulse is a more consistent STAB move compared to Draco Meteor and Muddy Water, at the cost of damage. Sleep Talk allows Tatsugiri to better answer Amoonguss, while Tera Blast hits Flutter Mane and Chien-Pao in the rare circumstances where Tatsugiri is Terastallized.</p> </li> <li> <p>Choice Scarf allows Tatsugiri to clean up late-game once Dondozo is down, either serving as speed control with Icy Wind to support its partner or dealing damage with Muddy Water and Draco Meteor.</p> </li> <li> <p>The given EVs allow Tatsugiri to outspeed Choice Scarf Landorus-T and survive an Icicle Crash from Chien-Pao and a Wicked Blow from Urshifu-S.</p> </li> <li> <p>Tera Steel gives Tatsugiri a resistance to Dragon and Fairy and a generally better defensive profile. Tera Water can be used to boost Muddy Water's damage and remove its weakness to Flutter Mane's Fairy-type STAB moves, which is useful in some end-game scenarios.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 646006, "username": "Choruto"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Farigiraf": {
    "overview": "<ul> <li> <p>Farigiraf's excellent bulk combined with the immunity to Prankster Taunt and Fake Out given by Armor Tail ability make Farigiraf an extremely consistent Trick Room setter. This is because its ability prevents Farigiraf from being taunted by the main Taunt user in the format, Tornadus, and the opponent can no longer use Fake Out to stall out Trick Room turns. Additionally, Armor Tail gives Farigiraf a great matchup against Pokemon that rely on priority like Rillaboom and Dragonite.</p> </li> <li> <p>The different Ogerpon formes are all great partners for Farigiraf, because the redirection means Trick Room is almost guaranteed to go up, while their Grass typing means that Spore is no longer an issue. Ogerpon-W has a great defensive typing and can easily tank most hits it redirects away from Farigiraf, Ogerpon-H hits Amoonguss and the Steel-types that resist Farigiraf's moves, and Ogerpon-C is particularly helpful for redirection due to its Sturdy ability. Rillaboom and Incineroar are also great partners, as Fake Out + Trick Room is a great combination due to the fact that Fake Out prevents both opponents from attacking Farigiraf before Trick Room goes up.</p> </li> <li> <p>Partners that are physically frail or weak to one of the big priority moves like Urshifu-R really enjoy having it as an ally. Flutter Mane is an excellent partner, as it can handily deal with the Dark-types that Farigiraf struggles against, and Ursaluna-B is a strong Trick Room sweeper that enjoys being immune to the Fake Out cycling from Incineroar and Rillaboom.</p> </li> <li> <p>Farigiraf can have a difficult time against Pokemon that can threaten to OHKO it both in and out of Terastallization, like Kingambit and Urshifu-S. Another issue is opposing Trick Room Pokemon, especially Torkoal and Amoonguss, the former being able to outspeed Farigiraf inside of Trick Room and OHKO it with Tera Fire-sun-boosted Eruptions, and the latter being able to put any Farigiraf that isn't running Safety Goggles to sleep and just being a general threat when Trick Room is up.</p> </li> </ul>",
    "sets": {
      "Bulky Support": {
        "description": "<ul> <li> <p>While Psychic and Trick Room are self-explanatory, Dazzling Gleam is a fantastic option to hit Dark-types. Psychic Noise is a good option, as it completely restricts the use of Horn Leech from the Ogerpon formes, and Drain Punch from Iron Hands, which Farigiraf's partners might be weak to; Psychic Noise also stops all Pokemon from healing from Rillaboom's Grassy Terrain. Imprison is used to block opposing Trick Room while also stopping opposing Flutter Mane from using Dazzling Gleam. Protect is just a generally consistent option, allowing Farigiraf to stick around to provide the team with priority blocking for longer.</p> </li> <li> <p>Sitrus Berry is generally preferred, as the extra recovery allows it to live important attack combos such as Chien-Pao's Icicle Crash into Entei's Sacred Fire; however, Safety Goggles is also a valid option, allowing it to ignore Spore from opposing Amoonguss, a common counter to Trick Room.</p> </li> <li> <p>With Sitrus Berry recovery, Farigiraf can always survive an Icicle Crash from Adamant Chien-Pao and a Sword of Ruin-boosted Sacred Fire from Entei. The Special Defense investment allows Farigiraf to live an unboosted Overheat from Timid Chi-Yu. The rest of the EVs were put into offense.</p> </li> <li> <p>Fairy is the best Tera type on Farigiraf in this format, allowing it to resist common Dark-type attacks from Urshifu-S and Kingambit. It also allows Farigiraf to deal more substantial chip damage with Tera Fairy Dazzling Gleam, allowing it to OHKO Urshifu-S.</p> </li> </ul>"
      },
      "Offensive": {
        "description": "<ul> <li> <p>Hyper Voice activates Throat Spray to inflict a lot of damage and boost subsequent Psychics. Psyshock deals less damage than Psychic overall, but it allows Farigiraf to hit Flutter Mane and Assault Vest Pokemon like Rillaboom harder.</p> </li> <li> <p>Throat Spray allows Farigiraf to put really good amounts of pressure unlike other Trick Room setters. Life Orb allows for more immediate damage and more pivoting ability, as you wont lose the damage boost when switching out, but provides less damage overall.</p> </li> <li> <p>The HP and Special Defense EVs allow Farigiraf to survive Tera Fairy Moonblast from Choice Specs Flutter Mane, Tera Normal Helping Hand-boosted Hyper Voice from Life Orb Ursaluna-B, as well as non-Tera Life Orb Blood Moon. The heavy amount of Special Attack investment allows Farigiraf to serve its role as an offensive Pokemon very well, especially after a Throat Spray boost. The Defense investment allows Farigiraf to take Surging Strikes from Tera Water Choice Scarf Urshifu-R.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 615665, "username": "CbuttyVGC"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 646006, "username": "Choruto"}, {"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Kingambit": {
    "comments": "<h3>Teambuilding</h3> <ul> <li> <p>Coverage for Fighting-, Fairy- and Dark-types such as Primarina, Incineroar, and Sneasler is almost necessary when teambuilding with Kingambit. Both sets enjoy having redirection on their side, including the likes of Clefable, Electabuzz, and Amoonguss, which can easily take in Fighting-type attacks from threats like Annihilape and Sneasler. Swords Dance Kingambit can take advantage of redirection to a greater extent, since this can open windows for setup opportunities.</p> </li> <li> <p>Rillaboom is a really good partner for Kingambit, providing setup opportunities with Fake Out and threatening Ground-types such as the Ursaluna formes. Dark-resistant Pokemon like Incineroar and even opposing Kingambit can be covered by Primarina, which also has great defensive synergy with Kingambit. Sneasler also works at removing Dark-types while also removing Fairy-types and providing another source of Fake Out support for Kingambit.</p> </li> <li> <p>Kingambit, thanks to its typing, is extremely weak to Fighting-types, including Annihilape, Sneasler, and Flamigo, which prove to be an issue. The aforementioned Amoonguss and Clefable can take in these Fighting-type attacks. Primarina, as mentioned before, has great defensive synergy with Kingambit, taking Fighting- and Fire-type attacks with ease, while Kingambit can cover for it against Grass- and Poison-type attacks.</p> </li> </ul> <h3>Strategy Comments</h3> <ul> <li> <p>Kingambit's main role is either a setup sweeper with Swords Dance or a defensive pivot piece with Asssault Vest. Swords Dance Kingambit's main goal is to set up and stay healthy; redirection and Fake Out support are usually necessary in achieving this. With Tera Dark and at +2, it's very easy for Kingambit to pick up momentum quickly and blitz through careless players. Don't be greedy with using Swords Dances, as it's easy for Kingambit to be OHKOed or brought to low health with careful positioning around Sucker Punch, especially in a format with Fighting-type coverage everywhere.</p> </li> <li> <p>Kingambit succeeds as a setup sweeper thanks to its typing, bulk, and on Assault Vest sets, coverage. Its typing has many resistances to top types like Dragon, making Kingambit an amazing counter to Dragapult and Hydreigon. Kingambit's bulk, especially when it's paired with Assault Vest, is really good, allowing Kingambit to withstand hits and potentially turn the tables in a losing late-game position.</p> </li> <li> <p>Dark-resistant Pokemon are a huge issue for Kingambit, easily taking Kowtow Cleave and Sucker Punch even if they're boosted. These Pokemon can be taken care of by partners such as Primarina and Sneasler. Fighting-types, including the likes of Annihilape, can be a massive issue, easily using Kingambit to set up. Sneasler in particular can be a problem, only taking notable damage from Iron Head. Fighting-type coverage moves is also rather prevalent in the metagame, with Pokemon like Low Kick Tyranitar and Body Press Archaludon being common. For this, Ghost-type switch-ins like Dragapult or redirection can be helpful in deterring Fighting-type attacks. Additionally, opposing Sneasler can be picked off by Dragapult. Offensive Fairy-types such as Primarina can scare Kingambit away from Terastallizing into a Dark-type, as Moonblast would otherwise easily chunk Kingambit. Sneasler can easily deal with Fairy-types by hitting them hard with Dire Claw.</p> </li> </ul>",
    "sets": {
      "Offensive": {
        "description": "<ul> <li> <p>Kingambit is easily able to steamroll through teams, having a great typing both offensively and defensively and easily defeating metagame staples like Gholdengo as well as decimating foes thanks to Swords Dance. Swords Dance bolsters Kingambit's Attack such that it can pick up OHKOs on bulky Pokemon such as Rillaboom, Ursaluna-B, and Amoonguss using Kowtow Cleave, with the latter two requiring Tera Dark.</p> </li> <li> <p>Sucker Punch compensates for Kingambit's low Speed while also immediately either forcing out or pinning Choice item attackers and Assault Vest users. On top of that, Sucker Punch can cause mind games, with Kingambit potentially just using Kowtow Cleave while forcing a switch with the threat of Sucker Punch. Low Kick can defeat Tyranitar and opposing Kingambit as well as Incineroar. Iron Head can be used as coverage for Dark-resistant Pokemon like Primarina and Sneasler, but it's generally harder to pilot and use.</p> </li> <li> <p>Black Glasses is used to boost the main two moves on Kingambit, Kowtow Cleave and Sucker Punch. It allows +2 Kowtow Cleave to OHKO Rillaboom outright and Archaludon with Tera Dark as well as letting Kingambit pick off Volcarona with a +2 Sucker Punch. Safety Goggles stops Sucker Punch from getting redirected and negated by Rage Powder, which can be a huge issue for Kingambit. Safety Goggles can also deny Spore, allowing Kingambit to use Amoonguss to set up. Safety Goggles can miss key OHKOs on the Pokemon shown in the aforementioned calculations.</p> </li> <li> <p>Tera Dark boosts Kingambit's damage further, allowing for OHKOs on Maushold and Gholdengo with Sucker Punch, as well as removing Kingambit's Fire weakness and 4x Fighting weakness, proving to be useful against threats like Incineroar, which Kingambit otherwise struggles to get rid of, and certain Fighting-type coverage and Pokemon like opposing Kingambit's Low Kick and Annihilape, which otherwise OHKO Kingambit.</p> </li> <li> <p>Kingambit is really difficult to stop after a Swords Dance boost and Terastallizing, OHKOing Ursaluna with Kowtow Cleave. This set struggles with four-moveslot syndrome, as having to pick between the flexibility of Swords Dance and a coverage move is difficult. Another issue that this set has is that it can be really difficult to take Dark-resistant Pokemon down, such as Incineroar. For this, setting up in front of another Pokemon or removing the Dark-resistant Pokemon can help Kingambit thrive.</p> </li> </ul>"
      },
      "Assault Vest": {
        "description": "<ul> <li> <p>Assault Vest Kingambit is great at taking strong hits whilst hitting back hard thanks to its high Attack stat. Its typing works amazing defensively thanks to the lack of good Ground- and Fighting-types, which is even better considering Assault Vest Kingambit works well as a bulky switch-in to many metagame staples such as Gholdengo. Defiant is very powerful on this set due to the lack of Swords Dance.</p> </li> <li> <p>Low Kick is used as coverage for Dark-types, beating Pokemon such as Incineroar and opposing Kingambit.</p> </li> <li> <p>Assault Vest allows Kingambit to take attacks like Earth Power from Ursaluna-B and Electro Shot from Archaludon as well as surviving extremely powerful attacks such as +1 Fiery Dance from Volcarona.</p> </li> <li> <p>Fire is arguably the best Tera type on this set, providing a resistance to Fire while also removing Kingambit's weakness to Fighting. As a bonus, Tera Fire grants Kingambit a burn immunity, being very useful when facing foes like Talonflame. Tera Flying removes both Kingambit's Ground- and Fighting-type weaknesses, turning them into an immunity and a resistances, respectively. Tera Dark boosts Kingambit's Dark-type STAB moves, which can be very necessary due to not using Swords Dance.</p> </li> <li> <p>The physical bulk investment lets Kingambit survive a Drain Punch from Annihilape and a rain-boosted Wave Crash from Basculegion-M. With the given special bulk, Kingambit can survive a +1 Fiery Dance from Volcarona and an Earth Power from Ursaluna-B. The offensive investment lets Sucker Punch OHKO Gholdengo with a Defiant boost while OHKOing Dragapult 75% of the time without it.</p> </li> <li> <p>Assault Vest Kingambit is more flexible in move choices compared to Swords Dance variations, able to freely carry Iron Head and coverage moves as well as generally being more flexible in playstyle. With Assault Vest, this set has great survivability. However, Assault Vest Kingambit doesn't have much sweeping potential due to not running Swords Dance. Not being able to run Protect is also a noteworthy issue, as in a metagame where Trick Room and weather are everywhere, this drawback can make it difficult to position Kingambit and its allies.</p> </li> </ul>"
      },
      "Bulky Attacker": {"outdated": true, "description": "<ul> <li> <p>The given EV spread allows Kingambit to survive Life Orb Ursaluna-B's Earth Power or an Ivy Cudgel from Ogerpon-H as well as avoid the 3HKO from Raging Bolt's Thunderbolt. The Speed investment allows Kingambit to outspeed Landorus in tailwind.</p> </li> <li> <p>Low Kick allows Kingambit to threaten Dark-Types such as Incineroar and opposing Kingambit; however, Tera Blast can also be used to cover for Dark- and Fighting-Types at the cost of needing to Terastallize.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"user_id": 650323, "username": "PenguGuy1"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 646006, "username": "Choruto"}, {"user_id": 657713, "username": "Flarefox_7"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Scream Tail": {
    "overview": "<ul> <li> <p>Scream Tail has strong supportive moves such as Encore and Disable, which it can consistently use to disrupt opposing Pokemon thanks to its great natural bulk and Speed.</p> </li> <li> <p>Scream Tail works well alongside Pokemon such as Gholdengo and Ogerpon-W, as it can punish passive plays and shut down Choice-locked threats such as opposing Flutter Mane and Urshifu-R, locking them into resisted Fairy- and Water-type attacks for Gholdengo and Ogerpon-W, respectively.</p> </li> <li> <p>Scream Tail cannot provide any offensive pressure outside Dazzling Gleam and hence is completely reliant on its partners to deal damage. It is also vulnerable to being shut down by moves such as Taunt from Tornadus and Spore from Amoonguss. Scream Tail struggles against Gholdengo, which completely counters Scream Tail by being immune to status moves thanks to Good as Gold.</p> </li> </ul>",
    "sets": {"Support": {"description": "<ul> <li> <p>Booster Energy allows Scream Tail to outspeed most of the metagame and launch fast Encores and Disables.</p> </li> <li> <p>Dazzling Gleam is used to chip low health targets. Disable and Encore are great supportive tools to disrupt foes and can punish passive play.</p> </li> <li> <p>The EV spread allows it to survive Choice Specs Flutter Mane Shadow Ball while comfortably taking a Tera Water Surging Strikes from Urshifu-R and Tera Dark Wicked Blow from Urshifu-S.</p> </li> <li> <p>Tera Dark is preferred for Prankster Taunt immunity and a Ghost resistance. Alternatively, Tera Grass can be used to provide immunity to powder moves from Amoonguss.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"user_id": 641757, "username": "fyfyy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 558405, "username": "SoulboyVGC"}, {"user_id": 646006, "username": "Choruto"}]}, {"name": "Grammar checked by", "members": [{"user_id": 470115, "username": "SolarBeam"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Flutter Mane": {
    "overview": "<ul> <li> <p>Flutter Mane's extraordinary Special Attack and Speed combined with its fantastic offensive typing makes it one of the most effective cleaners in the format, 2HKOing the majority of the metagame. Flutter Mane can also play a supportive role for its team thanks to Icy Wind and Speed Booster Energy.</p> </li> <li> <p>Offensive sets appreciate Pokemon that bring speed control like Latias and Tornadus, as well as Pokemon that provide it with longevity like Incineroar and Amoonguss. Supportive sets instead become the speed control and help support slower offensive Pokemon like Urshifu-R and Chi-Yu. Chi-Yu works particularly well as a partner, bolstering Flutter Mane's damage with Beads of Ruin and checking Steel-types like Kingambit while Flutter Mane takes care of Fighting-types like Urshifu-R in return.</p> </li> <li> <p>Bulky Assault Vest users that can take a boosted Moonblast and OHKO Flutter Mane in response like Kingambit and Rillaboom are some of its toughest matchups. Flutter Mane also faces issues into faster threats like Chien-Pao and Choice Scarf Urshifu-R. Additionally, redirectors like Indeedee-F and Ogerpon-W mitigate its damage output when on the field.</p> </li> </ul>",
    "sets": {
      "Offensive": {"description": "<ul> <li> <p>Flutter Mane is an effective cleaner thanks to Moonblast, which is its strongest STAB move, and Dazzling Gleam, which provides spread damage.</p> </li> <li> <p>Special Attack Booster Energy is Flutter Mane's strongest boosting item if it wants to keep Protect. Fairy Feather can be used instead, allowing it to retain its offensive boosts when switching at the cost of damage.</p> </li> <li> <p>The EV spread is built to survive an Ice Spinner from Jolly Chien-Pao and to outspeed Tornadus, with the remaining EVs boosting Flutter Mane's Special Attack</p> </li> <li> <p>Flutter Mane appreciates Tera Fairy to further boost its damage on Moonblast and Dazzling Gleam . This also removes its Ghost weakness and makes it resist Dark-type attacks, allowing it to better deal with opposing Flutter Mane and survive a potential Sucker Punch from Pokemon like Kingambit.</p> </li> </ul>"},
      "Choice Specs": {"description": "<ul> <li> <p>Choice Specs is Flutter Mane's strongest boosting item and allows it to do immediate damage.</p> </li> <li> <p>Flutter Mane utilizes Icy Wind as a speed control option and as coverage to threaten chipped Landorus. Thunderbolt and Power Gem are strong coverage options for important Pokemon like Tera Water Urshifu-R and Incineroar, respectively.</p> </li> <li> <p>The above spread allows Flutter Mane to survive a Surging Strikes from a Choice Scarf Urshifu-R while outspeeding Adamant Chien-Pao. The remaining EVs are used to maximise its Special Attack.</p> </li> <li> <p>Flutter Mane takes advantage of Tera Fairy by removing its Ghost weakness and giving it a Dark resistance, allowing it to better deal with opposing Flutter Mane and survive a potential Sucker Punch from Pokemon like Chien-Pao. Tera Fairy also allows Flutter Mane to secure an OHKO on Tera Water Urshifu-R.</p> </li> </ul>"},
      "Speed-Boosting Support": {"description": "<ul> <li> <p>Flutter Mane requires Icy Wind to accomplish its role as speed control, forcing it to pick between Dazzling Gleam and Moonblast.</p> </li> <li> <p>Speed Booster Energy allows Flutter Mane to outspeed the majority of the metagame.</p> </li> <li> <p>With Booster Energy, Flutter Mane can outspeed opposing Chien-Pao at -1 and Modest Gholdengo in Tailwind. The defensive investment lets it survive Adamant Chien-Pao's Ice Spinner and Gholdengo's Make It Rain.</p> </li> <li> <p>Tera Fairy is appreciated to gain more of an offensive presence and helps against opposing Flutter Mane, as Speed Booster Energy Flutter Mane is unable to OHKO opposing Flutter Mane with Shadow Ball.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"user_id": 641287, "username": "LovelyLuna"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 435812, "username": "Yuichi"}]}, {"name": "Grammar checked by", "members": [{"user_id": 552227, "username": "Kinetic"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Iron Bundle": {
    "overview": "<ul> <li> <p>Iron bundle is the fastest threat in Regulation F thanks to Booster Energy and is used as a speed control option. It can threaten Landorus, Ogerpon-W, Incineroar, and Urshifu-R with super effective damage and an OHKO on the former two.</p> </li> <li> <p>Iron Bundle appreciates offensive Pokemon that take advantage of Icy Wind like Urshifu-S, Ogerpon-H, Choice Specs Flutter Mane, and Landorus. Flutter Mane and Landorus specifically threaten Kingambit and Urshifu for Iron Bundle.</p> </li> <li> <p>Iron Bundle is weak to priority attackers like Rillaboom, Chien-Pao, Dragonite, and Raging Bolt, since they can ignore Iron Bundle's Speed and Icy Wind's Speed drops while still pressuring it for huge damage if not an OHKO because of its low defenses.</p> </li> </ul>",
    "sets": {"Glass Cannon": {"description": "<ul> <li> <p>Icy Wind is used for speed control, Hydro Pump is used as the main Water-STAB move, and Freeze-Dry is preferred to threaten common Water-types like Urshifu-R and Ogerpon-W.</p> </li> <li> <p>Booster Energy is used to raise its Speed, which allows it to outspeed threats like Choice Scarf Urshifu-R, Booster Energy Flutter Mane, and Regidrago and Modest Landorus under Tailwind.</p> </li> <li> <p>Tera Ghost is used for an immunity to threatening priority moves like Fake Out and Extreme Speed.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"user_id": 657713, "username": "Flarefox_7"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Iron Hands": {
    "overview": "<ul> <li> <p>Iron Hands is a strong Pokemon with high HP and Defense stats that allow it to be an effective switch-in to most neutral attacks, and it also has access to a powerful tool in Fake Out. Iron Hands's great stats allow it to output consistent pressure as well as making it hard to remove. Iron Hands has strong matchups into both Urshifu formes and Tornadus, and its great stats allow it to beat most of the metagame one-on-one.</p> </li> <li> <p>Iron Hands appreciates speed control, so some good partners for it are Farigiraf and Tornadus. The combination of Armor Tail and Trick Room from Farigiraf and Fake Out from Iron Hands almost guarantees Trick Room is set up, which allows Iron Hands to dish out massive damage with Close Combat and Wild Charge. Tornadus is another good form of speed control for Iron Hands, since it can catch opponents off guard and synergizes better with faster offensive partners like the Urshifu formes and Ogerpon-H becauase their high Speed stats do not allow them to function in Trick Room effectively.</p> </li> <li> <p>Iron Hands is weak to Pokemon that help mitigate damage like Incineroar and Landorus-T, since they can cycle Intimidate. This is a huge detriment for Iron Hands, since it is a Pokemon that likes staying on the field and whittle down its foes. Lowering its Attack stat does not allow it to do its job nearly as well. Iron Hands also has to make a very difficult choice in its held item. Clear Amulet leaves it susceptible to special attackers like Landorus and Flutter Mane, while Assault Vest leaves it susceptible to the aforementioned Incineroar and Landorus-T.</p> </li> </ul>",
    "sets": {
      "Bulky Attacker": {
        "description": "<ul> <li> <p>Close Combat is picked to allow an OHKO on Incineroar, Wild Charge is used as the most consistent Electric-type STAB move, and finally Heavy Slam is used as coverage against Flutter Mane and as a strong neutral option.</p> </li> <li> <p>Clear Amulet prevents stat drops from Incineroar, allowing Iron Hands to play more offensively.</p> </li> <li> <p>The Invested bulk allows Iron Hands to survive a Tera Fairy Dazzling Gleam from Choice Specs Flutter Mane, as well as two Icicle Crashes from Chien-Pao. The rest of the EVs are invested into Attack.</p> </li> <li> <p>Tera Grass is used to resist attacks from Electric-resistant Ground- and Grass-type foes such as Landorus, Rillaboom, and Ogerpon-W while also providing a powder move immunity from Amoonguss. Tera Fire can also be used to resist Fairy- and Fire-type moves from Flutter Mane and Ogerpon-H; however, this keeps the weakness to Landorus as well as adding a Water-type weakness.</p> </li> </ul>"
      },
      "Offensive Pivot": {
        "description": "<ul> <li> <p>Drain Punch is used, as Assault Vest Iron Hands wants to keep staying on the field, Wild Charge is used as the most consistent Electric-Type STAB move, and finally Heavy Slam is used as coverage for Flutter Mane and as a strong neutral option.</p> </li> <li> <p>The 252 Special Defense EVs are used to minimize the damage taken from threatening special attacks like Earth Power from Landorus or Moonblast from Flutter Mane. The Speed EVs are used to outspeed the Urshifu formes and Adamant Ogerpon formes in Tailwind.</p> </li> <li> <p>Assault Vest helps Iron Hands's low Special bulk and allows it to take super effective hits better.</p> </li> <li> <p>Tera Grass is used to resist moves from Electric-resistant Ground- and Grass-type foes such as Landorus, Rillaboom, and Ogerpon-W while also providing a powder move immunity from Amoonguss. Tera Fire can also be used to resist Fairy- and Fire-type moves from Flutter Mane and Ogerpon-H; however, this keeps the weakness to Landorus as well as adding a Water-type weakness.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 657713, "username": "Flarefox_7"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 646006, "username": "Choruto"}, {"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Iron Jugulis": {
    "overview": "<ul> <li> <p>Iron Jugulis's great type combination and access to strong support moves such as Tailwind and Snarl make it a niche but powerful disruptive threat. With Booster Energy, Iron Jugulis is able to outspeed almost every other Pokemon in the format and use its great support options to apply pressure on the opponent with fast Snarls and Air Slashes. Its typing gives it an immunity to Prankster Taunt, as well as resistances to attacks from several common threats such as Rillaboom's Wood Hammer and Urshifu-S's Wicked Blow.</p> </li> <li> <p>Iron Jugulis is used on semi-Trick Room teams with Farigiraf and Ursaluna-B, as it forces opponents to respect both a potential Tailwind from Iron Jugulis and Trick Room from Farigiraf. Both Incineroar and Ogerpon-W are great partners for Iron Jugulis; Incineroar provides Fake Out support and weakens potential threats such as Chien-Pao with Intimidate, and Ogerpon-W provides redirection to allow Iron Jugulis to set up Tailwind more easily. Flutter Mane also forms a very strong and consistent pairing with Iron Jugulis, countering opposing Dark-types that Iron Jugulis would have trouble dealing with.</p> </li> <li> <p>While having a few strong resistances, Iron Jugulis's typing also means it's weak to common metagame threats such as Flutter Mane, especially the Speed Booster Energy variants, and Chien-Pao, which threaten an OHKO. Iron Jugulis also struggles against Pokemon that resist its STAB moves and can take advantage of its low damage output like Incineroar and Raging Bolt. Additionally, Iron Jugulis struggles to find a place on most teams due to it competing with Tornadus, which, unlike Iron Jugulis, has access to Prankster Tailwind, a strong Flying-type STAB move in the form of Bleakwind Storm, and Prankster Rain Dance and Sunny Day.</p> </li> </ul>",
    "sets": {
      "Tailwind Support": {
        "description": "<ul> <li> <p>Snarl is helpful to slow down the plethora of strong special attackers in the format.</p> </li> <li> <p>Booster Energy allows Iron Jugulis to fire off fast attacks like Snarl into opposing special attackers and set up Tailwind more easily, as well as outspeed threats such as Chien-Pao.</p> </li> <li> <p>The bulk allows Iron Jugulis to survive a Extreme Speed from Choice Band Tera Normal Dragonite with Sword of Ruin active, as well as an Icicle Crash from a -1 Attack Chien-Pao. After a Snarl, Iron Jugulis lives a Dazzling Gleam from Choice Specs Tera Fairy Flutter Mane, as well as Thunderbolt from Raging Bolt.</p> </li> <li> <p>Both Tera Poison and Steel are viable, but Poison is generally preferred thanks to the Fighting resistance and generally better synergy with Iron Jugulis's original type. In comparison, Tera Steel gives more resistances to powerful moves in the format like Blood Moon and Make It Rain, but it is weak to more types than Tera Poison.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 664689, "username": "PokeknightVGC"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 657713, "username": "Flarefox_7"}, {"user_id": 646006, "username": "Choruto"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Baxcalibur": {
    "overview": "<ul> <li> <p>Baxcalibur's massive Attack stat, solid bulk, and STAB Ice-type moves allow it to apply immediate offensive pressure or set up to sweep. Landorus, Raging Bolt, Rillaboom, and Amoonguss fear its Ice-type STAB moves, and Incineroar and Ogerpon-W struggle to damage Baxcalibur, which opens up setup opportunities.</p> </li> <li> <p>Incineroar, Rillaboom, Ogerpon-W, and Amoonguss are great teammates for Baxcalibur, providing Intimidate, Fake Out, Grassy Terrain, and redirection support to give it opportunities to set up Swords Dance and fire off its attacks. Baxcalibur also functions well on Pelipper + Archaludon rain teams, as it threatens Raging Bolt, Amoonguss, Landorus, and Rillaboom, all of which rain struggles against.</p> </li> <li> <p>Steel-types like Kingambit and Gholdengo resist Baxcalibur's STAB attacks, which can hinder its ability to sweep or punch holes. In addition, the prevalence of Flutter Mane, Urshifu-R, and Urshifu-S can pressure it to Terastallize. Baxcalibur's low Speed can also make it struggle to keep up with offensive pressure from the opposing side.</p> </li> </ul>",
    "sets": {
      "Clear Amulet": {
        "description": "<ul> <li> <p>With the given EV spread, Baxcalibur can outspeed -1 Landorus and survive Choice Band Wicked Blow from Urshifu-S, a Tera Stellar Sacred Sword from Chien-Pao, and a Dazzling Gleam from Choice Specs Flutter Mane.</p> </li> <li> <p>Glaive Rush is Baxcalibur's best Dragon-type STAB because of its massive Base Power, with Protect offsetting the drawback. Ice Shard makes up for Baxcalibur's middling Speed tier and threatens Landorus. Icicle Crash is a good Ice-type STAB that has a chance to flinch the target. Swords Dance grants Baxcalibur a boosting move that makes it a more threatening Pokemon to the opposition.</p> </li> <li> <p>Tera Poison grants Baxcalibur a to resistance Urshifu's Close Combat and Flutter Mane's Fairy-type moves while also being a great neutral type against the majority of the metagame.</p> </li> <li> <p>Clear Amulet gives Baxcalibur an immunity to Intimidate from the likes of Incineroar and Hisuian-Arcanine. It also helps against Icy Wind from Flutter Mane and ElectroWeb from Assault Vest Raging Bolt.</p> </li> <li> <p>Thermal Exchange prevents Baxcalibur from being burned by Wil-O-Wisp users like Incineroar in addition to deterring Ogerpon-H and Chi-Yu from using their Fire-type STAB moves.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 638516, "username": "TundraRage65"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}, {"user_id": 627748, "username": "Jesuuuus"}, {"user_id": 558405, "username": "SoulboyVGC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 633500, "username": "StupidFlandrs48"}]}]}
  },
  "Gholdengo": {
    "comments": "<h3>Teambuilding</h3> <ul> <li> <p>Gholdengo works best on archetypes that can find a way to support its Make It Rain sweep. It prefers partners with Fake Out like Incineroar, Sneasler, and Rillaboom as well as redirection from Pokemon like Amoonguss and Electabuzz in order to let it set up, while Choice Specs Gholdengo pairs best with priority Tailwind setters like Talonflame, Whimsicott, and Murkrow. Dragon-types like Hydreigon and Dragapult also synergize well with Gholdengo, as they can switch into Fire-type attacks like Volcarona's Heat Wave and Incineroar's Flare Blitz, while Gholdengo switches well into the Fairy-, Dragon-, and Ice-type attacks that threaten the aforementioned Dragon-types ands hit Fairy- and Ice-types for super effective damage.</p> </li> <li> <p>Nasty Plot Gholdengo synergizes well with Pokemon like Incineroar, Rillaboom, and Amoonguss that can give it turns to set up through Fake Out and Rage Powder. Choice Specs sets prefer partners with speed control options like Tailwind Whimsicott to help them against faster threats like Dragapult.</p> </li> <li> <p>Gholdengo struggles against Pokemon that resist its STAB combination like Incineroar and Kingambit. Fighting- and Ground-types like Flamigo, Sneasler, Garchomp, and Ursaluna can help against bulky Dark- and Steel-types that resist Make It Rain and Shadow Ball. Garchomp is another threat, as it outspeeds Gholdengo and threatens it before and after Terastalizing with Stomping Tantrum and Dragon Claw, respectively.</p> </li> </ul> <h3>Strategy Comments</h3> <ul> <li> <p>Gholdengo's main role is to play as a sweeper. Depending on the set, it can accomplish this either by setting up with Nasty Plot or by removing opposing Steel-resistant Pokemon and then sweeping with Choice Specs-boosted Make It Rain.</p> </li> <li> <p>Gholdengo is best used as an early- or late-game threat depending on the opposing team. Gameplay should focus on either removing Pokemon that can resist Make It Rain or using Gholdengo to break a hole in the opposing team and then using another strong offensive threat like Ursaluna to clean up afterwards. Nasty Plot sets are mostly used as an early-game option to take advantage of passive leads. Choice Specs sets can be used at any point in the game due to not needing to set up.</p> </li> <li> <p>Kingambit and Incineroar are Gholdengo's biggest checks, as they resist its STAB attacks and can threaten it with super effective damage. Pokemon like Sneasler, Flamigo, and Paldean Tauros-W can threaten the aforementioned checks. Another method is to focus on chipping them down throughout the game before finishing them off with Gholdengo. Both Gholdengo sets struggle with smart switches, as Make It Rain lowers Special Attack, while Shadow Ball being single target leaves Gholdengo open to the other opposing Pokemon's attacks.</p> </li> </ul>",
    "sets": {
      "Bulky Setup Sweeper": {
        "description": "<ul> <li> <p>Gholdengo leverages its immunities and resistances from its typing and ability to set up with Nasty Plot and sweep with Make It Rain.</p> </li> <li> <p>Leftovers increases Gholdengo's survivability, while Metal Coat and Life Orb allow Gholdengo to start attacking without needing a turn to setup. Metal Coat is preferred on sets that still lean on Nasty Plot, while Life Orb sets play more like a Choice Specs set that has the option to switch moves and punish passive turns with Nasty Plot.</p> </li> <li> <p>Tera Dragon allows Gholdengo to resist Fire- and Water-type attacks like Flare Blitz from Incineroar and Wave Crash from Basculegion, allowing it to set up with Nasty Plot or to start attacking after getting a boost. Tera Steel Gholdengo is typically run with Life Orb to let it pick up OHKOs on Pokemon like Primarina and Amoonguss when paired with Nasty Plot.</p> </li> <li> <p>The Speed investment lets Gholdengo outspeed bulky Volcarona, while the bulk investment lets it survive Wave Crash from Choice Band Basculegion-M and Tera Dark Throat Chop from Sneasler. A Modest nature lets Metal Coat Gholdengo OHKO Ursaluna-B with Make It Rain, while a Timid nature paired with 164 Speed EVs allows it to outspeed all opposing Modest Gholdengo.</p> </li> <li> <p>Pros:</p> </li> <li> <p>Setup Gholdengo can easily run away with the game if its given a turn to set up.</p> </li> <li> <p>Setup Gholdengo can also afford to run more bulk investment, as it can increase its Special Attack.</p> </li> <li> <p>Cons:</p> </li> <li> <p>Requiring a turn to set up can lead to Gholdengo being OHKOed or heavily chipped before it can start doing damage.</p> </li> <li> <p>Teams featuring Nasty Plot Gholdengo often have to include more support Pokemon such as Amoonguss and Electabuzz in order to get the most value out of it, as they ensure Gholdengo will have a safe chance to set up.</p> </li> </ul>"
      },
      "All Out Attacker": {
        "description": "<ul> <li> <p>Choice Specs Gholdengo uses its high Special Attack stat, decent Speed, and powerful spread move to severely dent the opposing team.</p> </li> <li> <p>Thunderbolt is a good coverage option for Gholdengo to threaten Water-types that resist Make It Rain like Pelipper. Power Gem also allows Gholdengo to threaten Incineroar while still threatening Pelipper. Trick works well with Gholdengo's immunity to Fake Out to allow it to shut down setup strategies or to force Trick Room setters like Porygon2 to switch out.</p> </li> <li> <p>Tera Steel maximizes Gholdengo's damage output with Make It Rain, letting it do as much damage as possible before being knocked out and allowing it to pick up OHKOs on Pokemon such as Ursaluna-B.</p> </li> <li> <p>A Timid nature lets Gholdengo outspeed Modest Glimmora and Basculegion, while a Modest nature guarantees the OHKO against bulky Annihilape with Shadow Ball.</p> </li> <li> <p>Pros:</p> </li> <li> <p>Choice Specs Gholdengo has a very high initial damage output, not requiring the setup turn that plagues the Nasty Plot set.</p> </li> <li> <p>Teams without a bulky Pokemon that resists Make It Rain can quickly be blown away.</p> </li> <li> <p>Cons:</p> </li> <li> <p>Choice Specs Gholdengo's inability to switch moves and lack of setup can cause its Special Attack to quickly plummet if it tries to spam Make It Rain against Pokemon like Incineroar and Kingambit. This causes it to often have to switch out, losing momentum.</p> </li> </ul>"
      },
      "Nasty Plot": {
        "outdated": true,
        "description": "<ul> <li> <p>Make It Rain is used for powerful STAB damage, and Shadow Ball is used as Gholdengo's Ghost-type STAB move.</p> </li> <li> <p>The main item used is Leftovers so Gholdengo can stay on the field for longer. Gholdengo can also opt for Metal Coat to OHKO Flutter Mane, in sacrifice of longevity.</p> </li> <li> <p>The bulk investment allows Gholdengo to almost always survive a Mystic Water Tera Water-boosted Surging Strikes from Urshifu-R and two Magnet-boosted Thunderclaps from Raging Bolt.</p> </li> <li> <p>Gholdengo prefers Tera Fairy, but occasionally runs either Tera Steel or Dragon. Fairy allows Gholdengo to resist Urshifu-S's STAB moves and is a great defensive typing, bolstered by Gholdengo's original resistances to Steel and Poison. Tera Dragon also has great synergy with Gholdengo's Steel typing, providing welcome resistances to Ogerpon-W's STAB attacks. Tera Steel greatly increases Gholdengo's damage output and OHKOes Flutter Mane and the majority of Terastallized Pokemon, such as Tera Fairy Raging Bolt, Kingambit, and Gouging Fire.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 645750, "username": "iPetBigfoot"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 239881, "username": "Mr.GX"}, {"user_id": 657713, "username": "Flarefox_7"}]}, {"name": "Grammar checked by", "members": [{"user_id": 327515, "username": "Zrp200"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Chien-Pao": {
    "overview": "<ul> <li> <p>Chien-Pao is an excellent offensive Pokemon bearing a great offensive typing and a fantastic Speed tier. Chien-Pao is capable of taking on the majority of the format, and it's especially strong against Tornadus and Landorus thanks to its typing and Sword of Ruin.</p> </li> <li> <p>Incineroar has Intimidate and resists both of Chien-Pao's STAB attacks, which makes it difficult for Chien-Pao to deal with, therefore Urshifu-R is a strong partner as it utilizes Sword of Ruin and pressures Incineroar.</p> </li> <li> <p>Chien-Pao struggles to take on Urshifu-R, which can both take its attacks comfortably and outspeed it with a Choice Scarf. Urshifu-R can also threaten Chien-Pao through its Focus Sash. Terastallized Ogerpon-W and Amoonguss resist its Ice STAB moves and can redirect Sucker Punch, making them good answers to Chien-Pao.</p> </li> </ul>",
    "sets": {
      "Glass Cannon": {
        "description": "<ul> <li> <p>Ice Spinner is an alternative Ice-type STAB move that provides increased accuracy and a way for teams to handle Rillaboom and Indeedee-F in exchange for higher power and a flinch chance. However, it prevents Chien-Pao from attacking Rocky Helmet Amoonguss and Latias as freely.</p> </li> <li> <p>Chien-Pao uses Sacred Sword as coverage for relevant Pokemon such as Incineroar and Kingambit.</p> </li> <li> <p>Chien-Pao utilizes Focus Sash to make up for its poor defensive typing combined with its lackluster bulk, as it allows it to stay an extra turn on the field to help partners exploit Sword of Ruin, which is significant for offensive compositions.</p> </li> <li> <p>With Tera Stellar, Chien-Pao has the option to pick up OHKOs on Pokemon it usually wouldn't be able to OHKO, such as Flutter Mane and Amoonguss. However, it has to be wary of pivots and foes using Protect, as the power boost is temporary. Chien-Pao can also use Tera Ghost to remove its Fighting weakness and become immune to priority moves like Fake Out, which is crucial for Focus Sash.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641287, "username": "LovelyLuna"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 562330, "username": "Robbie35646"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Ting-Lu": {
    "overview": "<ul> <li> <p>With excellent bulk, Vessel of Ruin, and a strong support movepool, Ting-Lu makes for a good supportive attacker. Thanks to Vessel of Ruin, it can slow down the metagame's special attacking compositions, like Farigiraf + Ursaluna-B and Flutter Mane + Chi-Yu. These traits make for a good supportive attacker and defensive wall.</p> </li> <li> <p>Ting-Lu synergizes well with bulky disruptive Pokemon that can take advantage of Vessel of Ruin. Dondozo is the perfect example, as it appreciates Vessel of Ruin to more easily set up Yawns in combination with Ting Lu's Sand Tomb. Ting Lu's typing makes it weak to many of the strong physical attackers in the format, such as both Urshifu formes, Rillaboom, and the various Ogerpon formes, meaning it appreciates Incineroar's Intimidate and Amoonguss's redirection.</p> </li> <li> <p>Ting Lu struggles with passivity; it's vulnerable to being overwhelmed or weakened by Intimidate easily, relying on partners to make up for its low damage. These partners can include Dragonite, which is unaffected by Intimidate and threatens big damage with priority, or Gouging Fire, which can use Howl to increase Ting Lu's offensive presence.</p> </li> </ul>",
    "sets": {
      "Sand Tomb Support": {"description": "<ul> <li> <p>Sand Tomb is able to trap in opponents so they can't escape disruption like Yawn. Ruination and Rocky Helmet act as the main damage dealing methods, with Stomping Tantrum used as its STAB move and Body Press as a consistent source of damage when Intimidated. Taunt can be used to shut down Amoonguss and other status moves.</p> </li> <li> <p>The Special Defense investment allows Ting-Lu to live Moonblast from Choice Specs Tera Fairy Flutter Mane. The Defense investment allows Ting-Lu to survive Wood Hammer from Rillaboom and Ivy Cudgel from a Terastallized Ogerpon-W.</p> </li> <li> <p>Tera Poison is the most consistent Tera type for Ting-Lu, as it provides a resistance to Flutter Mane's Moonblast, the STAB moves of Rillaboom, and Close Combat from the Urshifu formes.</p> </li> </ul>"},
      "Bulky Attacker": {"description": "<ul> <li> <p>Heavy Slam allows Ting-Lu to OHKO Flutter Mane, while Ruination and Body Press provide consistent damage. Alternatively, Throat Chop can be used as a reliable Dark-Type STAB move that can also prevent Parting Shot from Incineroar and Hyper Voice from Ursaluna-B.</p> </li> <li> <p>Ting-Lu uses Assault Vest to bolster its special bulk. The EV spread allows Ting-Lu to survive 3 Moonblasts from Flutter Mane, and it also almost always lives Surging Strikes from Tera Water Urshifu-R. The Attack investment ensures an OHKO on Flutter Mane with Heavy Slam.</p> </li> <li> <p>Tera Poison is the most consistent Tera type for Ting-Lu, as it provides a resistance to Flutter Mane's Moonblast, the STAB moves of Rillaboom, and Close Combat from the Urshifu formes.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"user_id": 558405, "username": "SoulboyVGC"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 646006, "username": "Choruto"}, {"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Chi-Yu": {
    "overview": "<ul> <li> <p>With an excellent Special Attack stat, which is bolstered by Beads of Ruin and great STAB moves, Chi-Yu threatens its foes with the highest damage output in the format and Chi-Yu is capable of OHKOing the majority of the metagame. Beads of Ruin also helps increase Chi-Yu's partner's offensive pressure.</p> </li> <li> <p>Chi-Yu struggles due to its mediocre Speed stat, so speed control from Tornadus and Speed Booster Energy Flutter Mane is greatly appreciated. Choice Scarf Chi-Yu prefers teaming up with offensive threats like Choice Specs Flutter Mane to make up for the lost damage output. Tornadus and Flutter Mane can also help take care of the Urshifu formes, which threaten Chi-Yu, while Chi-Yu can in return increase their damage output with Beads of Ruin as well as remove Steel-types like Kingambit.</p> </li> <li> <p>Chi-Yu struggles against Pokemon that can take its attacks and either hinder it or exploit its weak defensive profile. Incineroar and Raging Bolt are great answers to Chi-Yu, as they can comfortably take all of its attacks and disrupt it through tools such as Fake Out, Knock Off, Parting Shot, Electroweb, and Snarl. Once Terastallized, Ogerpon-W also takes Chi-Yu's attacks incredibly well and threatens an OHKO on it with Ivy Cudgel.</p> </li> </ul>",
    "sets": {
      "Choice Attacker": {
        "description": "<ul> <li> <p>Snarl is used as utility and a way to check special attacking compositions such as Farigiraf + Ursaluna-B. Overheat is appreciated as a single target nuke, hitting almost twice as hard as Heat Wave.</p> </li> <li> <p>Choice Specs is used to give Chi-Yu maximum offensive pressure and allow it to pick up OHKOes on Amoonguss and Kingambit with Heat Wave. Alternatively, Chi-Yu can opt for Choice Scarf to outspeed threats like Landorus, Chien-Pao, and Flutter Mane.</p> </li> <li> <p>The HP EVs allow for Chi-Yu to avoid the 2HKO from Flutter Mane's Moonblast and once Terastallized into the Ghost-type, almost always survive -1 Adamant Chien-Pao's Sucker Punch. The Speed EVs allow Chi-Yu to outspeed the Adamant Urshifu formes.</p> </li> <li> <p>Chi-Yu prefers Tera Ghost to remove its Fighting weakness and be immune to common priority moves like Fake Out and Extreme Speed, which is crucial to preserve momentum. Although Chi-Yu can utilize Tera Fire to significantly increase its damage output, allowing Choice Scarf Chi-Yu to OHKO Ogerpon-W and Flutter Mane with Overheat and Choice Specs variants to remove Assault Vest Kingambit and Rillaboom with Heat Wave.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641287, "username": "LovelyLuna"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 646006, "username": "Choruto"}, {"user_id": 558405, "username": "SoulboyVGC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Roaring Moon": {
    "overview": "<ul> <li> <p>Roaring Moon provides a niche as either a fast speed control option or setup sweeper thanks to the Prankster immunity provided by its Dark typing and access to Attack and Speed Booster Energy, further bolstered by its superb movepool. Roaring Moon's Dark-type STAB moves and excellent elemental resistances make it a great answer to Iron Crown and Gholdengo, as well as the Ogerpon formes.</p> </li> <li> <p>Roaring Moon appreciates partners such as Ogerpon-W, Amoonguss, and Incineroar, which help it to set up Tailwind or Dragon Dance through free turns, the former two handle threats like Urshifu-R and Flutter Mane exceptionally well. Ogerpon-W greatly benefits from Tailwind, while Amoonguss has superb defensive synergy with Roaring Moon; all partners enjoy Breaking Swipe as well. With Acrobatics, Dragon Dance Roaring Moon can help the former two by removing the powder-immune Grass-types and help Incineroar by threatening both Urshfiu formes. Flutter Mane is also a great beneficiary of Roaring Moon, handling opposing Flutter Mane and both Urshifu formes with Tailwind support, and Breaking Swipe protecting it from the physical attackers it's weak to.</p> </li> <li> <p>Roaring Moon's typing, while welcoming fantastic resistances, also invites weaknesses to some of the metagame's most popular threats like the aforementioned Flutter Mane, both Urshifu formes, and Chien-Pao. Roaring Moon can notably mitigate the latter two's damage output if running Breaking Swipe and break Urshifu-S and Chien-Pao's Focus Sash in the process but requires support against them. Incineroar also poses an issue for Roaring Moon, as it resists Knock Off and weakens Roaring Moon with Intimidate. Incineroar's Fake Out can also be used to stall Tailwind turns.</p> </li> </ul>",
    "sets": {
      "Dragon Dance Sweeper": {"description": "<ul> <li> <p>Dragon Dance allows Roaring Moon to be an effective sweeper and helps reset Intimidate Attack drops, making it harder to slow down.</p> </li> <li> <p>Roaring Moon utilizes Attack Booster Energy to activate Acrobatics, allowing for an OHKO on many centralizing Fighting- and Grass-types, such as the various Urshifu and Ogerpon formes, as well as Amoonguss after Terastalization.</p> </li> <li> <p>After Terastalization, the bulk investment allows Roaring Moon to always survive a Tera Water-boosted Surging Strikes from Urshifu-R and a Thunderclap from a Special Attack Booster Energy Raging Bolt. The Speed investment allows Roaring Moon to outspeed Adamant Urshifu formes.</p> </li> <li> <p>Roaring Moon uses Tera Flying to obtain a resistance to Fighting-type moves and to gain STAB on Acrobatics.</p> </li> </ul>"},
      "Tailwind Support": {"description": "<ul> <li> <p>Roaring Moon utilizes Breaking Swipe to weaken the metagame's plethora of physical attackers such as the Ogerpon formes and Rillaboom.</p> </li> <li> <p>Roaring Moon uses Speed Booster Energy to outspeed the entire unboosted metagame and get off Tailwind and Breaking Swipe more consistently.</p> </li> <li> <p>The HP combined with the Defense EVs allow for Roaring Moon to take Adamant Chien-Pao's Icicle Crash at -1. The Special Defense EVs allow Roaring Moon to almost always survive unboosted Flutter Mane's Dazzling Gleam, as well as a Dragon Pulse from Raging Bolt. The Speed investment lets Roaring Moon outspeed Speed Booster Energy Iron Crown, as well as Adamant Dragonite under Tailwind,</p> </li> <li> <p>Roaring Moon uses Tera Poison to obtain resistances to Fairy- and Fighting-type moves it was originally weak to, which is also a great neutral typing into the metagame.</p> </li> </ul>"}
    },
    "credits": {"writtenBy": [{"user_id": 641287, "username": "LovelyLuna"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 646006, "username": "Choruto"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Walking Wake": {
    "overview": "<ul> <li> <p>With an excellent typing and respectable stats, Walking Wake finds a place on sun teams using Protosynthesis to make up for its Speed tier while also 2HKOing most neutral targets with sun= boosted Hydro Steam and threatening common Pokemon like Incineroar and Landorus.</p> </li> <li> <p>Walking Wake pairs well with Torkoal, which can set up sun and support it through moves like Helping Hand. It is commonly sighted with Ogerpon-C, which provides redirection, and Farigiraf, which blocks priority.</p> </li> <li> <p>Walking Wake struggles against a common threat, Flutter Mane which threatens it with its Fairy-type STAB moves and outspeeds it. Ogerpon-W also has a good matchup, since it can redirect Hydro Steam and threaten a 2HKO on Walking Wake with Horn Leech. It also consistently needs sun up, which can be advantageous to opposing Flutter Mane and Raging Bolt, as they can then threaten an OHKO on it.</p> </li> </ul>",
    "sets": {
      "Sun Sweeper": {
        "description": "<ul> <li> <p>The EV spread allows Walking Wake to survive Special Attack Booster Energy Flutter Mane's Dazzling Gleam and Adamant Miracle Seed Rillaboom's Wood Hammer. It can also pick an OHKO on Amoonguss with Life Orb-boosted Flamethrower in sun.</p> </li> <li> <p>Hydro Steam and Draco Meteor are Walking Wake's main STAB moves, while Flamethrower can threaten Pokemon that resist them, like Amoonguss and Kingambit. Dragon Pulse is a more spammable STAB move thanks to lack of drawbacks. Tera Blast can provide additional coverage when utilised with Tera Steel, threatening massive damage on Fairy-types like Flutter Mane.</p> </li> <li> <p>Tera Fire and Steel are preferred to gain a resistance to Flutter Mane's and Rillaboom's STAB moves. Tera Fire also resists Ogerpon-H's STAB moves and boosts Flamethrower, which can threaten huge damage combined with the sun boost. On the other hand, Tera Steel grants crucial resistances, such as against Raging Bolt's Dragon-type STAB attacks, which normally threatens Walking Wake.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641757, "username": "fyfyy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}, {"user_id": 558405, "username": "SoulboyVGC"}]}, {"name": "Grammar checked by", "members": [{"user_id": 527276, "username": "Techno"}, {"user_id": 594478, "username": "ken"}]}]}
  },
  "Ogerpon": {
    "overview": "<ul> <li> <p>Ogerpon is a strong offensive Pokemon that is unique in being able to check many top Pokemon such as Incineroar and Flutter Mane thanks to its ability Defiant and Speed-boosting Embody Aspect after Terastallization. Combined with access to Follow Me and natural immunity to Spore, Ogerpon is capable of being a constant threat while still providing good supportive value.</p> </li> <li> <p>Ogerpon is almost exclusively used on teams built around Dondozo. With its ability Defiant, Ogerpon can be used to punish Incineroar and Gouging Fire, disincentivizing them from weakening both Dondozo and Chien-Pao and even picking up a clean OHKO on Incineroar with Superpower. Once Terastallized, It can outspeed and OHKO Flutter Mane and both Urshifu formes, which are difficult for Dondozo and Chien-pao or Dragonite to handle.</p> </li> <li> <p>Ogerpon struggles against Pokemon that resist Grass STAB as Tornadus and Raging Bolt as well as foes that outspeed it, either forcing Ogerpon to Terastallize or be unable to attack before fainting, such as Chien-Pao, which outspeeds and can survive one hit thanks to it usually holding a Focus Sash. Ogerpon's Grass typing means it's weak to common threats such as Chien-Pao and Gouging Fire, and its middling bulk makes it unable to take more than two attacks most of the time.</p> </li> </ul>",
    "sets": {
      "Offensive Redirector": {
        "description": "<ul> <li> <p>Superpower is used as coverage to hit Steel- and the plethora of Dark-types that resist Ivy Cudgel, such as Kingambit or Chi-yu. Follow Me can be used to redirect attention from the frailer Chien-Pao and Glimmora, making both exponentially harder to deal with, especially so considering Ogerpon resists Urshifu-R Surging Strike's, one of the best counters to Chien-Pao and Glimmora</p> </li> <li> <p>Covert Cloak is used to prevent a flinch from Fake Out, allowing Ogerpon to pressure Incineroar and its partner turn one. Additionally, blocking certain secondary effects such as Icy Wind's Speed drops from opposing Flutter Manes is useful.</p> </li> <li> <p>The Attack investment is necessary to guarantee an OHKO on Incineroar with Superpower, on Flutter Mane once Ogerpon Terastallizes, and to have the highest chance of an OHKO on Urshifu-R. The Speed investment allows Ogerpon to outspeed Choice Scarf Landorus-T after Terastallization. The rest of the EVs are used to round out Ogerpon's bulk.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 646006, "username": "Choruto"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Ogerpon-Wellspring": {
    "overview": "<ul> <li> <p>Ogerpon-W has a very well-rounded stat spread, a solid typing, and an amazing movepool with great STAB moves, Spiky Shield, and Follow Me which helps it support frailer teammates.</p> </li> <li> <p>A great example of a less-bulky teammate is Flutter Mane; Ogerpon-W's ability to redirect moves away from Flutter Mane can help it break through the opposing team with its strong Tera Fairy Dazzling Gleam in just a few turns.</p> </li> <li> <p>Another great partner for Ogerpon-W is Kingambit, as it discourages Intimidate, which is one of the few ways to slow down Ogerpon-W's offensive capabilities, and Kingambit can even run a Swords Dance set to set-up with Follow Me support from Ogerpon-W.</p> </li> <li> <p>Ogerpon-W is also already a big threat on its own, as it pressures top threats such as Landorus, Incineroar, Flutter Mane, and Urshifu-R, being especially dangerous with Tera. Ogerpon-W does struggle against Rillaboom and Raging Bolt, which resist both  STAB types and can hit it super effectively after Tera.</p> </li> </ul>",
    "sets": {"Offensive Redirector": {"description": "<ul> <li> <p>Horn Leech is the Grass-type move of choice, as Ogerpon-W appreciates the extra longevity, which becomes especially notable when combined with the Special Defense boost provided by Terastallizing.</p> </li> <li> <p>The EV spread outspeeds Modest Landorus, OHKOes bulky Flutter Mane after Tera, and survives Rillaboom's terrain-boosted Wood Hammer.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"user_id": 562330, "username": "Robbie35646"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Ogerpon-Hearthflame": {
    "overview": "<ul> <li> <p>With a solid stat spread, incredible damage output with Terastallization, a unique typing and access to utility such as Follow Me, Ogerpon-H can provide some unique assets to a team.</p> </li> <li> <p>Ogerpon-H has a strong STAB combination that is only walled by Fire- and Dragon-types. Because of this, some of its best partners include Urshifu-R, Landorus and Flutter Mane, which are all powerful attackers that pair well with Ogerpon-H and enjoy Follow Me support. Another strong partner is Kingambit, which dissuades Intimidate from weakening Ogerpon-H, while Follow Me provides an opportunity for Swords Dance Kingambit to set up.</p> </li> <li> <p>Ogerpon-H becomes an extremely powerful offensive threat once Terastallized, being able to OHKO metagame staples like Flutter Mane, Urshifu-R, Rillaboom, and Landorus. Ogerpon-H also has a fantastic matchup against Amoonguss; not only is it able to completely ignore Amoongus's Spore and Rage Powder, but it is also able to OHKO it with Ivy Cudgel or with Wood Hammer should Amoonguss Terastallize into a Water-type. Additionally, Mystic Water variants of Urshifu-R get outsped and OHKOed.</p> </li> <li> <p>Bad matchups for Ogerpon-H include Pokemon such as Entei and Raging Bolt that can wall its STAB combation. For this reason, as well as Intimidate hampering Ogerpon-H's offensive capabilities, Incineroar is a very stable check to it. Lastly, despite having solid bulk, powerful threats that can outspeed Ogerpon-H can OHKO it such as Choice Scarf Urshifu-R. However, with speed control or Fake Out support from Pokemon like Rillaboom, Ogerpon-H can take on Choice Scarf Urshifu-R.</p> </li> </ul>",
    "sets": {"Offensive": {"description": "<ul> <li> <p>Horn Leech trades Wood Hammer's power for greater longevity.</p> </li> <li> <p>Follow Me is by far the best third move on this Pokemon, but if the team does not require a redirector, Ogerpon-H can use Grassy Glide; if this is the case, it is almost always paired with Rillaboom to ensure Grassy Glide is a priority move. Alternatively, Stomping Tantrum allows it to hit opposing Fire-types such as Entei and Chi-Yu.</p> </li> <li> <p>The Speed EVs allow Ogerpon-H to outspeed Modest Landorus and Adamant Urshifu-R. The Attack EVs with the Adamant nature allow it to OHKO Flutter Mane after Terastallization even when Ogerpon-H is Intimidated.</p> </li> <li> <p>The bulk investment allows Ogerpon-H to live most Choice Scarf Urshifu-R's Tera Water Surging Strikes while having a favorable roll to survive Timid Landorus's Sludge Bomb.</p> </li> </ul>"}},
    "credits": {"writtenBy": [{"user_id": 558405, "username": "SoulboyVGC"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 518634, "username": "Sole Survivor"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Ogerpon-Cornerstone": {
    "overview": "<ul> <li> <p>Ogerpon-C is a great offensive support Pokemon thanks to its high Attack, good offensive typing, access to Follow Me when paired with its solid defenses and ability, and great Speed, having great matchups into Pokemon like Tornadus and Entei.</p> </li> <li> <p>Ogerpon-C can pair well with offensive Pokemon like Landorus, Choice Scarf Urshifu-R, and Iron Hands that help deal with the Fighting-, Ice-, and Steel-types that threaten it like the Urshifu formes, Chien-Pao, and Archaludon. Ogerpon-C can also support Trick Room setters like Farigiriaf, as they have a much easier time setting Trick Room with Ogerpon-C redirecting moves away from them.</p> </li> <li> <p>Ogerpon-C can be overwhelmed by Pokemon like Gholdengo, Chien-Pao, and especially Urshifu-R, which bypasses its Sturdy ability by using Surging Strikes. Therefore it appreciates partners like Incineroar, Iron Hands, and Amoongus that check these Pokemon. In addition to this, they can also provide it with Fake Out support and redirection.</p> </li> </ul>",
    "sets": {"Redirection Support": {"description": "<ul> <li> <p>Ivy Cudgel synergizes well with Ogerpon-C's Grass-type moves, hitting Fire- and Flying-types like Tornadus, Incineroar, and Chi-Yu.</p> </li> <li> <p>Horn Leech provides Ogerpon-C with recovery, while Power Whip hits targets harder, threatening an OHKO on Urshifu-R.</p> </li> <li> <p>Follow Me lets it redirect moves away from its teammates like Sucker Punch and Spore from Chien-Pao and Amoonguss, respectively.</p> </li> <li> <p>Tera Rock bolsters Ivy Cudgel's damage, letting it guarantee an OHKO on Entei, and the Defense boost thanks to Embody Aspect can let it almost always survive Close Combat from Choice Scarf Urshifu-R.</p> </li> </ul>"}},
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Archaludon": {
    "comments": "<h3>Teambuilding</h3> <ul> <li>Assault Vest Archaludon is commonly used on rain-reliant teams, allowing it to use Electro Shot every turn. Rain teams also utilize powerful Water-types such as Basculegion-M, which threatens Ground-types like Ursaluna that threaten Archaludon. Assault Vest Archaludon also appreciates redirection and damage reduction, allowing it to set up freely while gaining boosts from Stamina. Power Herb Archaludon needs to deal as much damage as possible before fainting, so it is best paired with fast or priority-boosted forms of speed control like Whimsicott.</li> <li>When it's used with rain, common partners alongside Archaludon are Pelipper, Basculegion-M and Amoonguss. Pelipper and Basculegion-M cover Archaludon's Ground- and Fighting-type weaknesses, while Amoonguss redirects damage with Rage Powder and can heal Archaludon with Pollen Puff. When using the Power Herb set, Archaludon is commonly paired with priority Tailwind users such as Whimsicott and Talonflame, allowing it to attack before its foes can, and it is used on balance teams paired with partners such as Rillaboom and Primarina that threaten Ground- and Fighting-types. Rillaboom can also disrupt opponents with Fake Out as well as healing Archaludon with Grassy Terrain. Incineroar also pairs well with both Archaludon sets, as it can disrupt opponents with Fake Out while providing damage reduction with Intimidate.</li> <li>Before Terastallizing, Archaludon takes severe damage from Ground- and Fighting-types such as Ursaluna and Flamigo. Water- and Grass-type partners such as Pelipper, Primarina, and Rillaboom mitigate the Ground-type weakness, with Pelipper and Primarina also threatening Fighting-types. Archaludon struggles to damage Ghost-types, in particular Gholdengo with its additional Steel typing, so Dark- and Ghost-type partners such as Incineroar and Basculegion-M can threaten them. Haze is another great roadblock to Archaludon. With Primarina being the most common Haze user, Rillaboom can threaten Primarina before it is able to use it.</li> </ul> <h3>Strategy Comments</h3> <ul> <li>Archaludon is a sweeper capable of dealing significant damage to most foes after a +1 Special Attack boost from Electro Shot or with Body Press after gaining multiple Defense boosts from Stamina. Archaludon should often be sent out first in order to start setting up early when using the Assault Vest set, and it functions best when it's used on rain teams.</li> <li>The Power Herb set can be used either early- or late-game. It mostly requires speed control through Tailwind in order to deal significant damage before fainting, making this set ideal on hyper offense teams. It can also be slotted onto balance teams that require a powerful special attacker or Steel- and Dragon-type coverage.</li> <li>Ursaluna is a huge check to Archaludon, as it's capable of OHKOing it before it Terastallizes, while Archaludon can't OHKO it back. Archaludon is therefore reliant on partners that can KO or weaken Ursaluna such as Basculegion-M and Incineroar. Gholdengo walls Archaludon, so it relies on partners like Incineroar to survive attacks from Gholdengo and threaten it back. Removing rain prevents Assault Vest Archaludon from freely gaining boosts and attacking with Electro Shot, greatly hindering its setup. This forces Pelipper to be brought back onto the field to reset the weather. Haze also counters Assault Vest Archaludon, severly weakening its damage output and bulk, so partners such as Rillaboom that can KO Haze users like Primarina before they can attack help to mitigate this.</li> </ul>",
    "sets": {
      "Bulky Setup Sweeper": {
        "description": "<ul> <li>When used as a bulky setup sweeper, Archaludon increases its Special Attack with Electro Shot, allowing it to easily snowball. Archaludon also aims to survive for a long time on the field while dealing significant damage by relying on Stamina to boost its Defense stat, increasing its longevity and the damage dealt by Body Press.</li> <li>Electro Shot and Body Press are essential for Archaludon, with Electro Shot threatening Water-types such as Primarina and Basculegion-M. Body Press threatens Dark-types like Incineroar and Kingambit. Flash Cannon and Draco Meteor are used for consistent STAB attacks, with Dragon Pulse sometimes being used over Draco Meteor for more consistency at the cost of lower damage. Snarl, while less common, is used to hinder special threats such as Gholdengo and opposing Archaludon.</li> <li>Tera Grass lets Archaludon resist Headlong Rush from Ursaluna as well as providing an immunity to Spore and Rage Powder. Tera Fairy inverts Archaludon's weakness to Close Combat from Sneasler, makes Archaludon immune to Draco Meteor from opposing Archaludon, and provides a solid overall defensive typing.</li> <li>Archaludon's physical bulk investment lets it survive Close Combat from Sneasler, Headlong Rush and Facade from Ursaluna after Archaludon has Terastallized into a Grass-type, and Outrage from Choice Band Dragonite and Dragapult, with a high chance to survive Tera Dragon Choice Band Outrage from Dragapult. With the given special bulk investment, Archaludon can comfortably survive +2 Shadow Ball from Gholdengo, Draco Meteor from opposing Archaludon, and Earth Power from Ursaluna-B as well as allowing Archaludon to survive Ursaluna-B's Life Orb-boosted Tera Normal Blood Moon after Terastallizing.</li> <li>This Archaludon set requires being on the field for the majority of the game in order to become fully set up, so it is not immediately threatening. Being on the field for a long time makes Archaludon susceptible to being double targeted and KOed easily, as the set lacks Protect or a way to heal itself. It can also be set back while attempting to set up by Haze as well as Parting Shot and Snarl.</li> </ul>"
      },
      "Glass Cannon": {
        "description": "<ul> <li>The objective of glass cannon Archaludon is to attack once with Electro Shot to increase its Special Attack and proceed to deal as much damage as possible before it is KOed. With the help of Sturdy, Archaludon is guaranteed to survive one powerful attack, allowing it to deal significant damage before being KOed.</li> <li>Electro Shot is mandatory for boosting Archaludon's Special Attack stat as well as dealing devastating damage to Water-types such as Primarina and Basculegion. Draco Meteor can be used over Dragon Pulse for more damage at the cost of weakening Archaludon's damage and lower accuracy. STAB Flash Cannon allows Archaludon to significantly damage Fairy-types like Clefable. Aura Sphere is sometimes used instead of Protect to significantly damage Dark-types such as Incineroar and Kingambit.</li> <li>Power Herb allows Archaludon to use Electro Shot within a single turn without requiring rain.</li> <li>Tera Stellar takes advantage of Archaludon's array of coverage attacks, increasing Archaludon's damage. This allows Archaludon to pick up vital OHKOs against Pokemon such as Ursaluna with +1 Draco Meteor.</li> <li>This Archaludon set is significantly better at dealing a lot of damage early-game with the drawback of being unable to remain in play for a long time, since it is less bulky than Assault Vest sets and can't increase its defenses.</li> </ul>"
      },
      "Rain Sweeper": {
        "outdated": true,
        "description": "<ul> <li> <p>Archaludon's Defense EVs allow it to survive Adamant Choice Scarf Urshifu-R's and Urshifu-S's Close Combat, meaning it can take a hit, boost itself with Electro Shot, and OHKO Urshifu-R on the same turn, provided rain is currently active. The Special Defense investment prevents it from being 2HKOed by Special Attack Booster Energy Flutter Mane's Moonblast.</p> </li> <li> <p>Archaludon does not particularly require Special Attack investment thanks to Electro Shot boosting this stat, but 36 Special Attack EVs with a Modest nature give Archaludon an extra point in Special Attack because of how stat calculation works.</p> </li> <li> <p>28 Speed EVs are to outspeed Choice Scarf Urshifu-R, Urshifu-S and Landorus-T when Archaludon is under Tailwind.</p> </li> <li> <p>Draco Meteor and Electro Shot OHKO Pokemon such as Raging Bolt, Urshifu-R, and Tornadus. Flash Cannon OHKOes Flutter Mane after one Electro Shot boost, and Body Press is good to threaten an OHKO on Chien-Pao, and significant damage on Incineroar, especially after a Stamina boost.</p> </li> <li> <p>Tera Grass gives Archaludon a resistance to Ground-type moves such as Landorus's Sandsear Storm and Earth Power, and immunity to Spore and Rage Powder. Meanwhile, Tera Fairy gives it a Fighting resistance and Dragon immunity to beat Urshifu and opposing Dragon-types respectively.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589964, "username": "RauVGC"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 558405, "username": "SoulboyVGC"}, {"user_id": 645750, "username": "iPetBigfoot"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Gouging Fire": {
    "overview": "<ul> <li> <p>Gouging Fire is a solid offensive support Pokemon with a good defensive typing. Breaking Swipe and Burning Bulwark give it a great matchup against physical attackers such as Rillaboom and Chien-Pao.</p> </li> <li> <p>Kingambit is one of the most prominent partners for Gouging Fire, because it prevents Incineroar from crippling Gouging Fire with Intimidate. Ogerpon-W fits well with Gouging Fire as well, as with Follow Me it can protect Gouging Fire from Ground- and Water-type moves, both of which Ogerpon-W resists.</p> </li> <li> <p>The Urshifu formes counter Gouging Fire, since they ignore Burning Bulwark and Breaking Swipe. Incineroar is also a good counter to Gouging Fire, cycling Intimidate and Parting Shot repeatedly until Gouging Fire is a sitting duck. Gouging Fire also struggles against special attackers like Flutter Mane and Landorus, which can hit it for big damage, the latter threatening it for an OHKO.</p> </li> </ul>",
    "sets": {
      "Offensive Support": {
        "description": "<ul> <li> <p>Heat Crash is a reliable way of dealing damage, and because Gouging Fire is so heavy, it will almost always do good damage against most of the metagame. Howl can be used to take advantage of passive playstyles and partially negate Intimidate, and with a Speed Booster Energy, it can support the Kingambit and Ogerpon-W in return.</p> </li> <li> <p>252 HP and 20 Defense EVs allow you to always live two Wicked Blows from Adamant Urshifu-S, and 164 Speed EVs with a Jolly Nature allow you to and outspeed Adamant Choice Scarf Landorus-T and Chien-Pao once the Booster Energy has been consumed.</p> </li> <li> <p>Tera Grass is a good defensive Tera type for Gouging Fire, as it lets Gouging Fire resist Ground-type moves like Landorus's Earth Power and makes it immune to Spore, which is crucial since Burning Bulwark doesn't Protect Gouging Fire from status moves. Tera Fairy is also a good option as well, as it lets Gouging Fire resist both of Urshifu-S's STAB moves and take neutral damage from the majority of the metagame.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 651372, "username": "4Kuser"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 646006, "username": "Choruto"}, {"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Raging Bolt": {
    "overview": "<ul> <li> <p>Raging Bolt, with a higher Special Attack than Flutter Mane, massive HP, and good defenses, serves its role as a bulky damage dealer exceptionally well.</p> </li> <li> <p>Don't let Raging Bolt's middling Speed fool you; its signature move, Thunderclap, prevents it from being an issue in a lot of situations and makes the Tornadus + Urshifu-R matchup virtually trivial. Raging Bolt is also really strong into the Ogerpon formes and Rillaboom, as it resists all of their STAB moves except Ogerpon-C's, unless the Ogerpon-H and Rillaboom are carrying Stomping Tantrum and High Horsepower as coverage, respectively.</p> </li> <li> <p>Raging Bolt pairs insanely well with Rillaboom and Incineroar, as they provide Fake Out pressure for Raging Bolt to take advantage of by lowering the foe's Special Attack or Speed on the Assault Vest set, set up with the Calm Mind set or deal massive damage with the three attacks set. Rillaboom also provides more longevity in Grassy Terrain for Raging Bolt, which can make it immensely difficult to KO. Chien-Pao and Choice Scarf Urshifu-R are also excellent partners thanks to dealing with Raging Bolt's worst matchup, Landorus.</p> </li> <li> <p>That said, Raging Bolt does still have bad matchups, one of which is the aforementioned Landorus due to it being able to threaten an OHKO against Raging Bolt with Earth Power. Chien-Pao can also be a tricky matchup, as it can deal massive damage with its Ice-type STAB move and cause mindgames with Sucker Punch. Flutter Mane is able to deal huge damage to Raging Bolt even when it Terastallizes and can very comfortably take unboosted Thunderclaps.</p> </li> </ul>",
    "sets": {
      "Assault Vest": {
        "description": "<ul> <li> <p>Electroweb is sometimes run over Thunderbolt for speed control. Volt Switch allows for Raging Bolt to become a bulky pivot and pairs well with Draco Meteor, allowing it to switch out after the Special Attack drop. Snarl weakens opposing special attackers, enabling it to sit on the field for longer and deal damage. Tera Blast gives Raging Bolt a strong option into bulky Dark-types and Fighting-types like Ting-Lu and Iron Hands.</p> </li> <li> <p>Assault Vest allows Raging Bolt to fully take advantage of its amazing bulk, letting it sit on the field and tank hit after hit all while dealing respectable damage and disrupting the foe with moves like Snarl and Electroweb.</p> </li> <li> <p>The defensive investment allows Raging Bolt to always survive Icicle Crash from Adamant Chien-Pao and Moonblast from Choice Specs Flutter Mane. The Speed investment allows Raging Bolt to outspeed Glimmora and Modest Chi-Yu after an Electroweb. The rest of the EVs were put into offensive investment.</p> </li> <li> <p>Tera Fairy is just an incredibly strong neutral Tera type, especially for a Pokemon with as much bulk as Raging Bolt has, and provides a resistance to Urshifu-S's STAB moves.</p> </li> </ul>"
      },
      "Calm Mind": {
        "description": "<ul> <li> <p>Thunderclap is a good main STAB move, as it allows Raging Bolt to focus less on Speed and go all out on bulk investment, as it will be able to boost up then hit most foes before they can retaliate.</p> </li> <li> <p>While Dragon Pulse is usually an underwhelming move, it serves as a strong neutral STAB move into Pokemon that resist Electric-type attacks when paired with Calm Mind.</p> </li> <li> <p>In some situations, Thunderbolt can be used over Protect, due to Raging Bolt being bulky enough to where Protect isn't mandatory on Calm Mind sets, and for consistency against support Pokmon such as Follow Me Ogerpon-W where Thunderclap would fail.</p> </li> <li> <p>Leftovers is preferred on the Calm Mind set, providing immense longevity with Grassy Terrain from Rillaboom.</p> </li> <li> <p>The Defense EVs with the HP EVs allow Raging Bolt to live Icicle Crash from Adamant Chien-Pao. The HP EVs make the HP optimized for Leftovers and Grassy Terrain recovery. The bulk investment ensures that Raging Bolt is able to tank 2 unboosted Moonblasts from Timid Flutter Mane at +1 Special Defense after Leftovers and Grassy Terrain recovery combined with Protect. The Special Defense EVs hit an even number to be optimal for the Calm Mind boost.</p> </li> <li> <p>Raging Bolt utilizes Tera Fairy for the resistance to Urshifu-S's STAB moves and neutral matchup against the majority of the metagame.</p> </li> </ul>"
      },
      "3 Attacks": {
        "description": "<ul> <li> <p>Thunderbolt provides good consistent damage, especially with Tera Electric, while Thunderclap helps make up for Raging Bolt's middling Speed. Draco Meteor is a more powerful option, being able to OHKO Pokmon like Landorus when used with Booster Energy. However, it can be forced to switch out after a Special Attack drop and lose the boost.</p> </li> <li> <p>Booster Energy is a strong option, as boosting Raging Bolt's already huge base Special Attack even further turns it into an absolute nuke. Safety Goggles prevents Amoonguss from redirecting Thunderclaps away from Urshifu-R.</p> </li> <li> <p>The Speed investment allows Raging Bolt to outspeed Dragapult, Flutter Mane, and Chien-Pao while under Tailwind, allowing it to hit them with its stronger options like Thunderbolt and Draco Meteor.</p> </li> <li> <p>Tera Grass is a good option to not only resist Ground-type moves from Landorus but also ignore Amoonguss's Spore and redirection with Rage Powder without running Safety Goggles. Tera Electric will often be a consistent option for just raw damage output.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 615665, "username": "CbuttyVGC"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Iron Crown": {
    "overview": "<ul> <li> <p>Iron Crown is an excellent choice for offensive teams looking to take advantage of the powerful move Expanding Force thanks to its well-rounded stats and access to Booster Energy. It performs best against frailer offensive teams consisting of Pokemon that do not resist Expanding Force, such as Tornadus, Landorus, and Urshifu-R.</p> </li> <li> <p>Although it can be used as a sweeper early-game to soften opposing teams, it is usually better to save Iron Crown for the late-game when its checks have been sufficiently weakened for it to sweep.</p> </li> <li> <p>Indeedee-F is by far Iron Crown's best teammate, offering role compression as a Psychic Terrain setter and redirector. Access to Helping Hand also further amplifies its partner's ridiculous damage output.</p> </li> <li> <p>Iron Crown's best counters are Dark- and Steel-types, namely Incineroar, Kingambit, Archaludon, and Gholdengo, all of which resist both of Iron Crown's STAB moves.</p> </li> <li> <p>Therefore, Iron Crown appreciates Pokemon that can help remove these threats consistently, such as Landorus, Entei, and Urshifu-R. In return, Iron Crown can pressure opposing Urshifu-R and Amoonguss.</p> </li> <li> <p>Rillaboom is another noteworthy check, as it is able to safely pivot in and override Psychic Terrain, weakening Expanding Force significantly. Other Pokemon with access to Ice Spinner like Chien-Pao and Dragonite can also be used to remove Psychic Terrain.</p> </li> <li> <p>Faster Pokemon like Chien-Pao and Flutter Mane serve as good checks as well, but they have to watch out for Follow Me from Indeedee-F as they are vulnerable to Tachyon Cutter.</p> </li> </ul>",
    "sets": {
      "Booster Energy": {
        "description": "<ul> <li> <p>Expanding Force is Iron Crown's go-to STAB move, allowing it to devastate foes under Psychic Terrain.</p> </li> <li> <p>Tachyon Cutter helps secure the OHKO on Pokemon like Chien-Pao and Whimsicott, which commonly hold Focus Sash.</p> </li> <li> <p>Tera Water is a naturally good defensive typing that, when coupled with Tera Blast, gives Iron Crown an out against the aforementioned Dark- and Steel-type Pokemon, which otherwise counter it. Focus Blast can be used over Tera Blast to secure the OHKO on Kingambit, but is rather inconsistent and is unable to hit Gholdengo.</p> </li> <li> <p>An alternative spread of 76 HP / 4 Def / 172 SpA / 4 SpD / 252 Spe allows Iron Crown to outspeed Flutter Mane and Chien-Pao thanks to Speed Booster Energy.</p> </li> <li> <p>This set can also be run with a Modest nature to maximize Iron Crown's damage output, at the risk of underspeeding opposing Pokemon in the same Speed tier such as Modest Landorus and both Urshifu formes.</p> </li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 435812, "username": "Yuichi"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641287, "username": "LovelyLuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  }
}