{
  "Arcanine-Hisui": {
    "sets": [
      {
        "name": "Magic Guard",
        "description": "<p>Hisuian Arcanine is a strong wallbreaker, capable of denting many physically defensive Pokemon such as Scream Tail while taking advantage of Magic Guard by using Head Smash and Flare Blitz in combination with Life Orb without any drawbacks. Close Combat allows Hisuian Arcanine to hit Ting-Lu and Well-Baked Body Iron Treads, while Will-O-Wisp threatens burns on checks like physically defensive Quaquaval and Garchomp. Extreme Speed is useful priority that picks off weakened targets, Stealth Rock allows Hisuian Arcanine to act as an offensive entry hazard setter that pressures Corviknight and Iron Treads, and Flame Charge boosts its Speed to thwart potential revenge killers. As Hisuian Arcanine places a lot of pressure on physical walls, other physical cleaners like Meowscarada and Chien-Pao can be partnered with Hisuian Arcanine to clean up after it has broken those walls while providing speed control. Since Hisuian Arcanine is checked by Garchomp and bulky Water-types like Quaquaval, Refrigerate Regieleki makes a good partner for it by forcing these Pokemon out, pivoting Hisuian Arcanine in, and helping to deal with faster threats through its raw Speed. Hisuian Arcanine's middling Speed makes slow pivots like Corviknight good partners due to their ability to bring it in safely; alternatively, Corviknight's dual screens set allows Arcanine to take a hit and strike back.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Muk-Alola": {
    "sets": [
      {
        "name": "RegenVest",
        "description": "<p>With a great defensive typing, solid special bulk, and Knock Off, Alolan Muk is a great RegenVest user, repeatedly entering the battle and disrupting fierce special attackers like Iron Moth and Zapdos. Knock Off provides critical utility and disruption, deters potential answers from switching into it, and provides decent uninvested damage output against neutral targets. Poison Fang semi-reliably spreads Toxic poison onto opposing walls, while Poison Jab can 2HKO Enamorus-T and Meowscarada. Rock Slide hits Zapdos, Volcanion, Talonflame, and Volcarona hard, punishing them for switching in. Ice Punch nails common switch-ins like Landorus-T and Garchomp, while Thunderbolt snipes Corviknight. Physical walls like Corviknight, Unaware Scream Tail, and Quaquaval are a natural pairing, as they can better deal with the physical attackers that threaten Alolan Muk like Garchomp, Chien-Pao, and Galarian Zapdos. Mixed attackers like Magic Guard Volcanion and Heatran threaten Alolan Muk out, so offensive answers to these like Sword of Ruin Garchomp, Chien-Pao, and Galarian Zapdos are recommended. Entry hazards wear down Alolan Muk over the course of the game and prevent it from properly dealing with repeated attacks from threats like Iron Moth and Iron Jugulis, so hazard removers like Iron Treads, Quaquaval, and Corviknight are all recommended teammates.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Cloyster": {"sets": [{"name": "Technician"}]},
  "Gengar": {
    "sets": [
      {"name": "Sheer Force"},
      {
        "name": "Hadron Engine",
        "description": "<p>Hadron Engine Gengar uses its excellent Special Attack, good Speed, and good coverage options to function as a dangerous wallbreaker, pressuring physical and special walls alike. Hadron Engine-boosted Thunderbolt threatens an OHKO on Water- and Flying-types such as Empoleon and Mandibuzz and 2HKOes RegenVest Manaphy, while Focus Blast threatens an OHKO on Heatran and a 2HKO on Blissey, RegenVest Hisuian Goodra, and Roaring Moon. Trick can be used to cripple more defensive switch-ins such as Blissey and RegenVest users, while Sludge Bomb threatens an OHKO on Primordial Sea Zapdos and Ogerpon-C while also potentially crippling switch-ins with poison. Fast wallbreakers such as Barraskewda, Azelf, and Meowscarada appreciate Gengar's ability to pressure their walls like Kommo-o, Empoleon, and Corviknight, allowing them to clean late-game, while in return they can safely let in Gengar by pivoting out of such walls as they switch in. Azelf's Psychic Terrain blocking priority is appreciated by Gengar, as it allows it to avoid an OHKO from Dragonite's Extreme Speed and 2HKO it back with Sludge Bomb. Gengar's ability to absorb Toxic Spikes and OHKO Toxic Debris Great Tusk is greatly appreciated by offensive teams especially, as they can otherwise be crippled by them. Gengar is OHKOed by most Pokemon faster than it, such as Azelf, Barraskewda, and Roaring Moon, and takes takes heavy damage from most priority moves, so defensive teammates such as Corviknight, Great Tusk, and Empoleon are appreciated, with Corviknight and Great Tusk being able to remove the entry hazards that Gengar is prone to being chipped down by. Gengar also appreciates Corviknight and Empoleon being able to safely pivot it in due to their low Speed.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Kinetic1000", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Electrode-Hisui": {
    "sets": [
      {
        "name": "Magic Guard",
        "description": "<p>Hisuian Electrode's excellent Speed tier, powerful Volt Switch, and ability to nail Ground-types like Garchomp and Iron Treads make it an outstanding offensive pivot. Leech Seed lets Hisuian Electrode chip down targets it can't meaningfully damage like Hisuian Goodra and Blissey, while Worry Seed directly forces out these Pokemon and can generate momentum for Hisuian Electrode by denying its checks of their Regenerator, wearing them down. Hisuian Electrode works best with strong physically offensive pivots like Cinderace and Galarian Zapdos that can wear down shared checks like Garchomp; in return, Hisuian Electrode can force in Pokemon they take advantage of like Meloetta, Hisuian Goodra, and Blissey. Entry hazards setters like Landorus-T and Garchomp make solid partners, as the residual damage they provide greatly helps to wear down Hisuian Electrode's switch-ins, such as Hisuain Goodra. In return, Landorus-T can use its slow U-Turn to pivot Hisuian Electrode in, while Garchomp can come in on Pokemon like Heatran for Hisuian Electrode.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Hera", "user_id": 414072}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Tauros-Paldea-Blaze": {
    "sets": [
      {"name": "Bulk Up"},
      {
        "name": "Wallbreaker",
        "description": "<p>Paldean Tauros-F secures a niche in AAA thanks to Desolate Land, which allows it to take advantage of its powerful STAB moves, decent Speed tier, and great Attack. Raging Bull is a consistent STAB option with no drawbacks, whereas Flare Blitz provides the power necessary to 2HKO particularly sturdy foes like Ting-Lu. Earthquake lets Paldean Tauros-F hit Skeledirge, which otherwise blanks it. Paldean Tauros-F is limited by its good but not great Speed tier and bulky Fire-resistant foes like Dondozo and Gyarados, so ways to deal with its offensive and defensive counterplay are important. Fast Pokemon like Chien-Pao and Iron Moth can force out foes like Kilowattrel and Sandy Shocks. Speed control via Thunder Wave from allies like Blissey and Scream Tail is useful in deterring faster foes like Greninja. Electric-types like Rotom-W and Kilowattrel can consistently force out the sturdy Water-types that threaten Paldean Tauros-F while bringing it in on their switch-ins like Roaring Moon and Ting-Lu.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Hera", "user_id": 414072}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Alexender", "user_id": 313542}]}, {"name": "Grammar checked by", "members": [{"username": "Sabelette", "user_id": 583793}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Tauros-Paldea-Aqua": {"sets": [{"name": "Choice Band"}]},
  "Gyarados": {"sets": [{"name": "Dragon Dance"}]},
  "Vaporeon": {"sets": [{"name": "Defensive"}]},
  "Zapdos": {
    "sets": [
      {
        "name": "Primordial Sea",
        "description": "<p>Zapdos, with its solid defensive typing and strong Special Attack, is a potent pivot that is able to check Corviknight, Galarian Zapdos, and Talonflame, as well as potent offensive Fire-types like Cinderace and Ceruledge thanks to Primordial Sea. Primordial Sea also enables Zapdos to spam its strong STAB moves in Hurricane and Thunder, which allow it to OHKO offensive threats such as Meowscarada, Quaquaval, and Talonflame; Zapdos also pressures common RegenVest users like Meloetta with U-turn. Zapdos can opt to go for a more bulky spread of 252 HP / 4 SpA / 252 Spe to better check strong Fighting-types like Slither Wing and Galarian Zapdos. Zapdos is a good partner for offensive Pokemon like Slither Wing, Meowscarada, and Zamazenta-C, as it can bait in targets like Hisuian Goodra and Meloetta that they can take advantage of. Zapdos also pairs well with Corviknight, as Primordial Sea's Fire immunity allows Corviknight to run more physically defensive abilities such as Fluffy and Intimidate. Zapdos can struggle against bulky Ground-types like Regenerator Garchomp and Landorus-T, so pairing it with an attacker like Chien-Pao is recommended.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Zapdos-Galar": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Galarian Zapdos is a fearsome wallbreaker that can overwhelm common defensive cores. Close Combat and Brave Bird have fantastic neutral coverage and power, OHKOing virtually everything short of a physical wall and 2HKOing those, further amplified by Choice Band. Thunderous Kick overpowers some of its few checks like Fluffy Corviknight, which could otherwise stall it out. Adamant is the preferred nature to have a high chance to 2HKO Intimidate Corviknight after Leftovers recovery, but Jolly is an option to Speed tie Zapdos and outspeed Jolly Hisuian Arcanine. Galarian Zapdos pairs exceptionally well with special pivots like Hisuian Electrode and Kilowattrel, as they can draw in special walls like Hisuian Goodra and Meloetta for it. Fast physical cleaners like Chien-Pao and Meowscarada appreciate Galarian Zapdos blowing through physical walls for them. Since Galarian Zapdos is prone to Stealth Rock, opposing Rocky Helmet, and Brave Bird recoil wearing it down, it appreciates pivots like Iron Treads and Corviknight that can also clear Stealth Rock and Wish passers like Scream Tail. Galarian Zapdos is relatively slow and easily revenge killed, so it relies on a sturdy defensive core like Intimidate Corviknight and RegenVest Hisuian Goodra to switch out to.</p> "
      },
      {
        "name": "Magic Guard",
        "description": "<p>Magic Guard Galarian Zapdos serves as a potent physical threat that can either wear down and outlast its checks with U-turn or set up and serve as an excellent wincon with Bulk Up or Agility. U-turn allows Galarian Zapdos to maintain momentum in face of switch-ins like Fluffy Corviknight, while Taunt allows Galarian Zapdos to deny defensive walls recovery and outlast them. Bulk Up provides immediate wallbreaking power, while Agility allows Galarian Zapdos to outpace would-be revenge killers; Adamant is the preferred nature on Agility sets. Offensive special threats like Refridgerate Regieleki and Primordial Sea Inteleon serve well as teammates, appreciating Galarian Zapdos's ability to threaten special walls like Hisuian Goodra while also threatening Galarian Zapdos's own checks like Fluffy Corviknight and Zapdos, both able to pivot on their respective walls to create opportunities to wallbreak or accumulate entry hazard chip. Fast physical threats like Chien-Pao and Meowscarada also serve well as teammates to pressure and overload physical walls as well as handle faster offensive threats that Galarian Zapdos cannot. Galarian Zapdos also partners well with defensive pivots like Intimidate Corviknight and RegenVest Meloetta which can safely pivot Galarian Zapdos in. Entry hazard setters like Garchomp that help wear down its help wear down Galarian Zapdos's checks and can take hits from faster offensive Pokemon; alternatively, Galarian Zapdos can partner well with dual screens support from the likes of Prankster Mew and Corviknight to help facilitate setup sets.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "UT", "user_id": 523866}, {"username": "LordBox", "user_id": 611238}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "Isaiah", "user_id": 375662}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Moltres": {"sets": [{"name": "Magic Guard"}, {"name": "Desolate Land"}]},
  "Moltres-Galar": {"sets": [{"name": "Double Dance"}]},
  "Dragonite": {"sets": [{"name": "Dragon Dance"}]},
  "Mew": {
    "sets": [
      {
        "name": "Choice Scarf Regenerator",
        "description": "<p>Choice Scarf Regenerator Mew is a strong utility pivot that checks fast physical attackers with the combination of Will-O-Wisp + Volt Switch while still pressuring defensive cores with entry hazards and Trick. Ice Beam can be used as an alternative to Spikes to pressure Pokemon like Garchomp and Landorus-T. Trick can be used to neutralize support Pokemon and defensive pivots like Corviknight while serving as an emergency stop to bulky setup sweepers like Calm Mind Enamorus-T. 136 Speed EVs with a Timid nature ensure that Mew outspeeds Chien Pao, Hisuian Electrode, and +1 Jolly Quaquaval, as well as positive natured Slither Wing and Heatran after Trick. Bulky teammates like Corviknight, Garganacl, Zapdos, and Skeledirge benefit from Mew's ability to spread burns and set hazards, allowing them to absorb more hits from physical attackers and whittle down these attackers more quickly; Mew can also pressure fast attackers like Meowscarada and Talonflame that they struggle with. Additionally, late-game cleaners like Chien-Pao, Hisuian Arcanine, and Quaquaval benefit from Mew's ability to chip defensive switch-ins and hinder walls by giving them a Choice Scarf.</p> "
      },
      {
        "name": "Prankster",
        "description": "<p>Prankster Mew is a good dual screens lead for hyper offense teams thanks to its good bulk, Speed, and movepool. Taunt blocks foes such as Garchomp, Landorus-T, and Iron Treads from setting entry hazards, Corviknight from clearing screens with Defog, and opposing setup sweepers like Volcarona from taking advantage of free turns. U-turn lets it pivot into its teammates and potentially re-set screens later in the game. Stealth Rock or Spikes can be used over U-turn to chip foes for teammates to KO. 96 Speed EVs and a Jolly Nature ensure that Mew always moves first against opposing leads like Prankster Corviknight and Masquerain, allowing Mew to hinder them with Taunt. Prankster Mew should only be used as a dual screens lead on hyper offense teams. Teammates such as Chien-Pao, Polteageist, Volcarona, and Roaring Moon all appreciate screens, which allow them to easily set up and make them less susceptible to revenge killers. The aforementioned Pokemon also provide good options for Mew to pivot into and gain momentum. Dark-type Pokemon such as Ting-Lu, Meowscarada, and Chien-Pao are immune to Prankster Taunt and can take advantage of Mew, so counters to them such as Zamazenta-C and Triage users, like Enamorus-T and Ursaluna, are good teammates.</p> "
      },
      {
        "name": "All-Out Attacker",
        "description": "<p>Life Orb Mew is a very dangerous mixed wallbreaker that can decimate various walls with its colorful coverage. Ice Beam hits Ground- and Flying-types such as Garchomp, Landorus-T, and Zapdos. Gunk Shot 2HKOes Scream Tail, which otherwise switches into Mew freely. Close Combat takes care of Blissey and Steel-types such as Hisuian Goodra, Kingambit, and Heatran. Flamethrower 2HKOes non-Well-Baked Body Corviknight and Zamazenta-C, dissuading the latter from using Mew as setup fodder. A Mild nature helps Mew exert as much pressure as possible with Ice Beam and Flamethrower, while a Hasty nature most notably lets it outspeed Hydreigon and Speed tie Zapdos. Magic Guard negates chip damage from Life Orb and entry hazards, helping Mew stay healthy for longer and allowing it to better utilize its natural bulk to come into play. Sheer Force is an alternative particularly if Mew is used alongside a teammate with Magic Guard, such as Hisuian Electrode. It greatly increases Mew's power, notably letting it OHKO Garchomp and Iron Treads and pressure otherwise solid checks such as Meloetta, at the cost of its longevity. Bulky pivots such as Corviknight, Quaquaval, Iron Treads, and Meloetta can take on fast threats to Mew such as Chien-Pao, Roaring Moon, and Iron Moth and switch Mew in safely. Fast offensive pivots such as Meowscarada and Sandy Shocks are also strong partners that can give Mew opportunities to come into play and clean up late-game after it softens up their checks. Garchomp and Ting-Lu can set entry hazards to help Mew break down its checks over time.</p> "
      },
      {"name": "Setup Sweeper"}
    ],
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}, {"username": "Frozoid", "user_id": 532881}, {"username": "memesketch", "user_id": 537558}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}, {"username": "Adeleine", "user_id": 517429}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Typhlosion-Hisui": {
    "sets": [
      {
        "name": "Desolate Land",
        "description": "<p>Hisuian Typhlosion is a solid wallbreaker, exerting great offensive pressure with its great typing and offensive STAB move combinations. Eruption is Hisuian Typhlosion's go-to move, as Choice Specs boosts it enough to 2HKO common specially defensive walls such as Meloetta, Blissey, and Hisuian Goodra. Shadow Ball hits Fire-immune foes like Well-Baked Body Corviknight as well as Primordial Sea users like Volcanion, Zapdos, and Kilowattrel. Focus Blast notably 2HKOes RegenVest Roaring Moon and OHKOes Well-Baked Body Steel-types like Kingambit and Iron Treads. A Modest nature guarantees that Choice Specs Hisuian Typhlosion can 2HKO the previously mentioned special walls, but Timid can be used to outspeed max speed Quaquaval and Ceruledge. Choice Scarf and a Timid nature can turn Hisuian Typhlosion from a wallbreaker into a potent revenge killer that outspeeds and OHKOes other fast targets like Chien-Pao, Meowscarada, and Hisuian Electrode. Hisuian Typhlosion is very frail and struggles greatly against entry hazards, which also reduce Eruption's base power, so teammates that can clear hazards and pivot into it safely like Corviknight and Iron Treads are essential. Hisuian Typhlosion also has a mediocre Speed stat without Choice Scarf, so partners that can provide speed control like Regieleki, Chien-Pao, and Hisuian Electrode are also appreciated.</p> "
      },
      {"name": "Magic Guard"}
    ],
    "credits": {"writtenBy": [{"username": "I am BONK", "user_id": 603931}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Slowking": {
    "sets": [
      {
        "name": "Defensive Pivot",
        "description": "<p>Slowking serves as a decent defensive wall due to its overall good bulk and support movepool, switching into various physical attackers such as Talonflame, Cinderace, and Quaquaval. Chilly Reception lets Slowking pivot into teammates in order to gain momentum, notably Chien-Pao. Slowking's low Speed stat with 0 Speed IVs allows it to switch into a favorable teammate after pivoting. Surf is a reliable STAB move that most notably deals huge damage to Sandy Shocks, Talonflame, and Iron Moth. Ice Beam threatens Garchomp and stops it from using Slowking as a setup fodder. Thunder Wave can be used in order to cripple Iron Moth and Roaring Moon that usually switch into Slowking and can pressure it. Intimidate is the preferred choice of ability, as it combines well with Slowking's ability to pivot, making it difficult to KO. Fluffy can be used as an alternative in order to deal with Roaring Moon better. Rocky Helmet punishes U-turn users such as Cinderace and Quaquaval from freely pivoting against Slowking, while Heavy-Duty Boots keeps Slowking healthy. Slowking fits best on balance teams where it can switch into aforementioned Pokemon while also being able to pivot into teammates like Chien-Pao and Kingambit, providing them a good setup opportunity.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Frozoid", "user_id": 532881}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Alexender", "user_id": 313542}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Slowking-Galar": {"sets": [{"name": "Specially Defensive Pivot"}]},
  "Donphan": {
    "sets": [{"name": "RegenVest", "description": "<p>Assault Vest Donphan is a solid special pivot that can check the likes of Sandy Shocks while also removing entry hazards with Rapid Spin. Knock Off cripples switch-ins and can support offensive teammates. Body Press is used as a coverage option for Earth Eater Kingambit and Iron Treads, which would otherwise wall Donphan. Offensive Pokemon susceptible to hazards such as Chien-Pao and Dragonite appreciate Donphan's spinning capabilities. Physically defensive Pokemon like Corviknight and Garganacl also pair well with Donphan, as it can handle special attackers like Sandy Shocks that threaten them. Donphan can be prone to residual damage, so it's recommended to pair it with a Wish user like Scream Tail or Florges to extend its longevity.</p> "}],
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Alexender", "user_id": 313542}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Blissey": {
    "sets": [
      {
        "name": "Special Wall",
        "description": "<p>Magic Guard Blissey is a solid wall and utility Pokemon that can effectively shrug off most viable special attackers, but it struggles against the tier's premier physically offensive options. Although it excels at switching into special attacks, it is left with rather passive options mainly chosen to maximize the potential of its teammates. Soft-Boiled is its essential recovery option that keeps it healthy to continue absorbing damage in the future. Heal Bell, Stealth Rock, and Thunder Wave are Blissey's utility options, allowing it to act as a cleric, entry hazard setter, or status spreader, respectively, to set up its teammates for success. Finally, Shadow Ball is a niche option that prevents Blissey from being passive against Ghost-types like Skeledirge, Hisuian Typhlosion, and Ceruledge. Well-Baked Body can be used instead of Magic Guard, improving its matchup against Fire-types like Magic Guard Volcanion and Heatran, as well as completely walling Skeledirge. Teams that use Blissey should also opt to carry a physical wall like Corviknight, Quaquaval, or Fluffy Landorus-T, as their ability to absorb physical attacks is valuable for preserving it as a special wall. Blissey can offer offensive teammates the ability to thwart their revenge killers with its switching unimpeded by entry hazards and damaging status conditions.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "KarpeChan", "user_id": 536333}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Gardevoir": {
    "sets": [
      {
        "name": "Tinted Lens",
        "description": "<p>Gardevoir is a good special wallbreaker due to a combination of its good Special Attack and Choice Specs. Tinted Lens allows Gardevoir to 2HKO Steel-types such as Iron Treads and Corviknight. Moonblast is its strongest STAB option and OHKOes a plethora of Pokemon such as Garchomp and RegenVest Roaring Moon while also 2HKOing walls such as RegenVest Ting-Lu and Corviknight. Psyshock OHKOes specially defensive Iron Moth and Clodsire and deals huge damage to Blissey. Healing Wish is an useful late-game move that lets Gardevoir gain momentum for its team by healing one of its teammates. Gardevoir can be easily revenge killed by Pokemon such as Slither Wing and Cinderace due to its low Speed, so Pokemon such as Corviknight and Gargancl are good teammates. U-turn users such as Corviknight, Cinderace, and Greninja can pivot and provide Gardevoir with a good opportunity to put huge dents in opposing teams. Entry hazard setters such as Garchomp and Clodsire provide additional chip damage, allowing Gardevoir to wallbreak efficiently.</p> "
      },
      {"name": "Prankster"}
    ],
    "credits": {"writtenBy": [{"username": "Frozoid", "user_id": 532881}], "teams": [{"name": "Quality checked by", "members": [{"username": "Atha", "user_id": 450411}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Masquerain": {"sets": [{"name": "Sticky Web Lead"}]},
  "Salamence": {"sets": [{"name": "Aerilate"}]},
  "Empoleon": {"sets": [{"name": "Immunity Ability"}]},
  "Gastrodon": {"sets": [{"name": "Fluffy"}]},
  "Mismagius": {"sets": [{"name": "Normalize"}, {"name": "Triage"}]},
  "Garchomp": {
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Garchomp is a sterling special wall capable of pivoting into dangerous threats such as Heatran, Iron Moth, Sandy Shocks, and Zapdos. Swords Dance reduces Garchomp's passivity, allowing it to break down walls such as Quaquaval and Landorus-T over time. Garchomp's strong matchup against common entry hazard removers such as Quaquaval, Cinderace, and Well-Baked Body Iron Treads makes it an excellent Stealth Rock setter. Alternatively, if a teammate already carries Stealth Rock, Garchomp can use Spikes to apply more pressure to offensive teams. Dragon Tail deters setup sweepers such as Zamazenta-C and walls such as Corviknight and Ground immunity Iron Treads from taking advantage of Garchomp, while Rock Slide allows Garchomp to hit threats such as Enamorus-T, Zapdos, and Earth Eater Skeledirge. Corviknight is a brilliant partner for Garchomp, taking on dangerous physical attackers such as Galarian Zapdos and Chien-Pao for it, while Garchomp covers its Fire and Electric weaknesses. Blissey can take on the special attackers that can overwhelm Garchomp, such as Sheer Force Iron Moth, Choice Specs Zapdos, and Greninja. Iron Moth checks various threats to Garchomp, such as Corviknight, Scream Tail, and Enamorus-T, and it appreciates Garchomp's ability to beat Hisuian Arcanine and RegenVest users such as Meloetta. Other powerful wallbreakers such as Zapdos, Slither Wing, Hisuian Arcanine, and Volcanion appreciate Garchomp's phazing and entry hazard support to wear down their checks over time.</p> "
      },
      {
        "name": "Mixed Attacker",
        "description": "<p>Mixed Garchomp, with its naturally great coverage, good Speed tier, and high-Base Power STAB moves, is a reliable entry hazard setter that deters common removal options from switching in. Life Orb is an option over Leftovers for a harder hit on hazard removers. Draco Meteor provides immediate power against Quaquaval, Earthquake hits non-Earth Eater Iron Treads, and Fire Blast chips Corviknight. A Naive nature allows Garchomp to offensively check Sandy Shocks, Thundurus-T, and the crowded base 100 Speed tier without weakening its attacks. A Naive nature is preferred over Hasty to allow Garchomp to better switch in on common hazard removers. Offensive threats like Iron Moth, Chien-Pao, and Galarian Zapdos greatly appreciate the presence of mixed Garchomp, which disincentivizes common defensive pieces from entering the battle, and for its entry hazards. Similarly, more defensive Pokemon like Corviknight and Unaware Scream Tail also appreciate Garchomp outspeeding and heavily damaging offensive threats like non-Choice Scarf Slither Wing, Hisuian Arcanine, and Galarian Zapdos. Mixed Garchomp is vulnerable to faster threats that force it out with super effective moves, like Chien-Pao and Pixilate Scream Tail, and U-turn users that swing momentum in their favor, such as Meowscarada, Iron Moth, and Roaring Moon: slow, bulky pivots that help combat these weaknesses and turn momentum back in your favor, such as Corviknight, RegenVest Meloetta, and slow Iron Treads, are recommended.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>Garchomp is an excellent wallbreaker with its great stats and typing, allowing it to set up on many Pokemon like Corviknight, Fluffy Quaquaval, and Zapdos. Stone Edge can be used to OHKO Zapdos and Enamorus-T, while Liquidation can be ran to hit Landorus-T and Earth Eater Iron Treads. Garchomp can provide excellent Stealth Rock support to an offensive team that otherwise would not be able to fit it, especially given it pressures Corviknight and common spinners; alternatively, it can use Poison Jab to 2HKO Unaware Scream Tail. Life Orb provides extra power for benchmarks like 2HKOing Galarian Zapdos with Stone Edge and Fluffy Garchomp with Earthquake, as well as chunking Corviknight harder for its teammates. A Jolly nature is necessary to outspeed key targets like Zapdos, Galarian Zapdos, and Jolly Hisuian Arcanine. Other physically offensive Pokemon like Chien-Pao and Quaquaval appreciate Garchomp weakening shared checks in Scream Tail and Intimidate Corviknight. Garchomp also appreciates screens support from Mew and Corviknight, which allow to set up more easily and beat more Pokemon in a one-on-one; the latter can also slow pivot Garchomp in to preserve its health for later.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "memesketch", "user_id": 537558}, {"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "KarpeChan", "user_id": 536333}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Lucario": {
    "sets": [
      {
        "name": "Magic Guard",
        "description": "<p>Lucario is a devastating mixed wallbreaker, capable of tearing apart most defensive cores with ease thanks to its strong STAB moves and great mixed attacking stats. Close Combat and Steel Beam have excellent neutral coverage together and hit common walls like Hisuian Goodra and Scream Tail on their weaker defensive stat. Focus Blast 2HKOes standard Corviknight, while Aura Sphere provides a more consistent special attack. In the final moveslot, Nasty Plot allows Lucario to overwhelm slower teams, while Stone Edge provides coverage for Skeledirge and Zapdos. Bullet Punch is also an option that can turn the tables on would-be revenge killers such as Chien-Pao and Meowscarada after some chip damage. Naive is the recommended nature due to its ability to always outspeed Quaquaval and at worst Speed tie with Hisuian Arcanine. Lucario is best used as a mid-game wallbreaker that can pave the way for sweepers like Zamazenta-C and Hisuian Electrode by breaking through Pokemon like Corviknight and Garchomp. Lucario also heavily benefits from slow pivots like Meloetta, Corviknight, and Landorus-T; in return, they switch into Pokemon that threaten Lucario out, like Zapdos, Iron Treads, and Cinderace. While Lucario has limited switch-ins, the ones it does have, like Toxapex and Skeledirge, are very effective without using niche coverage options, so partners that can threaten them, like Zapdos and Quaquaval, are recommended; they can also bring Lucario in on their checks, like Goodra and Corviknight, with U-turn.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Hera", "user_id": 414072}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Hippowdon": {
    "sets": [{"name": "Fluffy", "description": "<p>Fluffy Hippowdon is a remarkable physical wall thanks to its defensive stats, reliable recovery in Slack Off, and pure Ground typing, letting it check offensive threats like Ceruledge, Kingambit, and Slither Wing. Whirlwind prevents foes like Talonflame from setting up. Rocky Helmet punishes the physical attackers it checks and lets it pseudo-spinblock Cyclizar and Iron Treads; alternatively, Leftovers gives it extra recovery without having to waste Slack Off PP. 25 Speed IVs let it underspeed Corviknight, allowing it to punish its Roost with Earthquake. Specially defensive walls like Corviknight, Florges, and Blissey can compensate for Hippowdon's poor Special Defense and check foes like Chi-Yu and Greninja. In return, they appreciate Hippowdon dealing with Ceruledge, Kingambit, and Slither Wing.</p> "}],
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Weavile": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}]},
  "Glaceon": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Glaceon is a potent special attacker that can pressure common specially defensive threats like Garchomp, Roaring Moon, and Toxapex with Ice Beam + Freeze-Dry. Shadow Ball is used for Skeledirge and Scream Tail, while Mud Shot hits Steel-types like Regenerator Tinkaton and can OHKO Iron Moth. 22 Speed EVs allow Glaceon to outspeed Corviknight, and the rest are invested into bulk to better take hits from Body Press Corviknight and Torch Song Skeledirge. Special attackers like Choice Scarf Sandy Shocks and Iron Moth benefit from Glaceon breaking through special walls like Garchomp and Roaring Moon that they could otherwise struggle with. Glaceon can have a hard time switching in due its poor defensive typing and susceptibility to entry hazards, so having a teammate that can remove hazards and safely pivot it in like Corviknight or Iron Treads is recommended. Glaceon can struggle with bulky Steel-types like Kingambit, so pairing it with a Fighting-type like Lucario or Slither Wing is advised. Glaceon is also slow and would benefit from faster teammates like Choice Scarf Meowscarada that can pressure offensive threats that may threaten it.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "royalfluxh", "user_id": 493260}]}]}
  },
  "Rotom-Wash": {
    "sets": [
      {
        "name": "Choice Item Attacker",
        "description": "<p>Rotom-W can either serve as a strong offensive pivot, revenge killer, and potential late-game cleaner with Choice Scarf or as an immediately powerful wallbreaker with Choice Specs. With its dangerous type combination, it dissuades Pokemon that are immune to Water-type attacks such as Desolate Land Iron Moth from switching in through its powerful Electric-type moves while Hydro Pump scares off Ground-types like Ting-Lu. Hadron Engine affords a powerful boost to all its attacks, while Primordial Sea boosts its Water-type attacks even further and grants it an immunity to Fire. Trick and Will-O-Wisp allow Rotom-W to cripple and irritate defensive switch-ins such as Blissey and RegenVest Roaring Moon, while Will-O-Wisp can also provide utility against offensive threats such as Meowscarada. Volt Switch allows Rotom-W to pivot on and maintain momentum against common defensive answers like Regenerator Roaring Moon and pairs well with offensive threats like Choice Band Slither Wing and Chien-Pao. Rotom-W also can partner well with other powerful special threats like Hydreigon and Hadron Engine Iron Moth, which can combine with it to overload common special walls. Being mainly an offensive pivot, Rotom-W also appreciates entry hazard removal from the likes of Iron Treads and Corviknight, which both double as pivots that allow Rotom-W to safely get in.</p> "
      },
      {"name": "Nasty Plot"}
    ],
    "credits": {"writtenBy": [{"username": "LordBox", "user_id": 611238}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Alexender", "user_id": 313542}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Lumii", "user_id": 493772}]}]}
  },
  "Azelf": {
    "sets": [
      {"name": "Choice Scarf"},
      {
        "name": "Choice Specs",
        "description": "<p>A combination of excellent Special Attack, high Speed, Psychic Surge, Expanding Force, and good coverage allows Choice Specs Azelf to function as a powerful threat that can OHKO many of the tier's dangerous offensive threats and sweep weakened teams with ease. Knock Off lets Azelf reliably 2HKO RegenVest Manaphy with Expanding Force and cripple switch-ins such as Empoleon, Heatran, and RegenVest Hisuian Goodra, while U-turn allows Azelf to pivot out of the aforementioned switch-ins. Dazzling Gleam threatens an OHKO on RegenVest Roaring Moon after a Knock Off and 2HKOes Mandibuzz. Trick can be used instead to more permanently cripple defensive switch-ins such as Blissey, Empoleon, and Mandibuzz, while Flamethrower can be used to threaten Steel-types, allowing Azelf to OHKO Kingambit and 2HKO Corviknight. Choice Specs allows Azelf to threaten an OHKO against Pokemon such as Dragonite, Primordial Sea Zapdos, and non-specially defensive Garchomp. Azelf pairs up well with fast and frail offensive Pokemon such as Barraskewda, Meowscarada, and Hisuian Electrode, as they appreciate the Psychic Terrain Azelf sets up. Azelf also appreciates pivots such as the previously mentioned teammates, Galarian Zapdos, and Roaring Moon, as they help pressure switch-ins such as Empoleon, Heatran, and RegenVest Hisuian Goodra, while also forming a VoltTurn core with Azelf to generate momentum. Defensive teammates such as Corviknight, RegenVest Manaphy, and Kommo-o are appreciated as they can check the faster threats that force Azelf out such as Roaring Moon, Meowscarada, and Chien-Pao. Pokemon that can remove the entry hazards Azelf is prone to, such as the aforementioned Corviknight, make great teammates as well.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Kinetic1000", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Heatran": {
    "sets": [
      {
        "name": "Magic Guard",
        "description": "<p>Magic Guard Heatran is a strong mixed attacker that threatens massive damage to the format's defensive pivots with its powerful Steel- and Fire-type attacks. Steel Beam is Heatran's best offensive option, as Magic Guard negates its massive recoil, while Flare Blitz acts as a strong secondary STAB attack that breaks down Steel-types and special walls like Hisuian Goodra. Power Gem acts as a strong coverage option, targeting common Fire- and Steel-type switch-ins like Skeledirge and Primordial Sea Zapdos. A Hasty nature is chosen to maximize both Heatran's physical and special power, and 96 Attack EVs let it 2HKO common RegenVest users like Meloetta and Hisuian Goodra after Stealth Rock damage. 200 Speed EVs let Heatran outspeed Slither Wing, Volcanion, and defensive Garchomp; the rest of the available EVs are put into Special Attack to maximize Steel Beam's power. Heatran relies on being able to consistently force foes out to make progress, so bulky entry hazard setters like Garchomp and Ting-Lu can help set up Spikes alongside Heatran's Stealth Rock to consistently chip and punish the opponent's switches. Additionally, to help seal the deal against bulky pivots like Garchomp and fast revenge killers like Chien-Pao, Heatran appreciates teammates like Scream Tail to absorb their hits and have a chance to make progress against them. Finally, offensive teammates like Chien-Pao can take advantage of Heatran's ability to chip switch-ins early-game, as well as defeating Goodra, leading to a more threatening end-game presence.</p> "
      },
      {
        "name": "IronPress",
        "description": "<p>IronPress Heatran trades immediate damage for more defensive utility and sweeping potential, being able to handle common Ground-types like Garchomp, Landorus-T, and Ting-Lu. Lava Plume is preferred over Flamethrower to spread burns against switch-ins like Hisuian Goodra, Magic Guard Quaquaval, and Ting-Lu. IronPress allows Heatran to better take on RegenVest users such as Alolan Muk and Meloetta, Garchomp, and Well-Baked Body Steel-types, most notably Kingambit. Substitute blocks Dragon Tail from Garchomp and Knock Off from Iron Treads, takes advantage of the switches Heatran forces versus foes like Blissey, and also benefits from Iron Defense boosts. 200 Speed EVs and a Timid nature make Heatran outrun Timid Volcanion and Adamant Slither Wing. This Heatran variant is very vulnerable to common Primordial Sea users in Zapdos, Kilowattrel, and Inteleon, so partners that can take them on like Hisuian Goodra and Meloetta are mandatory. Primordial Sea Zapdos can switch in against Fire-types such as Iron Moth, Skeledirge, and Ceruledge that threaten Heatran. In return, Heatran takes on RegenVest users that Zapdos struggles to break through. Another Fire-type teammate with Desolate Land like Cinderace, Iron Moth, or Ceruledge appreciates Heatran taking on Ground-types for it, while they can punish Water-types and the aforementioned Primordial Sea users.</p> "
      },
      {"name": "Desolate Land", "description": "<p>A set with maximum Special Attack investment and a Modest nature can be used instead for more offensive pressure.</p> "}
    ],
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}, {"username": "longhiep341", "user_id": 500884}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Tranquility", "user_id": 475288}, {"username": "KarpeChan", "user_id": 536333}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Cresselia": {
    "sets": [
      {
        "name": "Unaware",
        "description": "<p>Unaware Cresselia is an effective mixed wall and unorthodox setup sweeper with the ability to surprise opponents with its combination of Calm Mind and Stored Power. Cresselia is a reliable stop to powerful setup sweepers like Zamazenta-C and Garchomp, which can even be setup fodder for Cresselia. Once set up, Stored Power is Cresselia's main offensive option, dealing ridiculous damage against any non-Psychic-immune foes after two or three Calm Mind boosts. Additionally, Moonblast lets Cresselia threaten Dark- and Dragon-types like Chien-Pao and Garchomp. Because of Cresselia's passive stature and inability to make progress early-game, it shouldn't attempt to set up Calm Mind and sweep until physical attackers with super effective moves like Chien-Pao, Kingambit, and Slither Wing have been removed from play. Additionally, Cresselia fails to effectively defeat some special walls like Unaware Scream Tail and RegenVest Meloetta and Alolan Muk, making offensive teammates that threaten a 2HKO on either of these foes like Kingambit necessary to create openings for Cresselia to sweep. In addition to offensive pairings, this Pokemon appreciates defensive teammates like Intimidate Corviknight that can prevent it from being overwhelmed by Choice item users. Finally, Cresselia appreciates entry hazard removal from teammates like Corviknight, letting it preserve Moonlight's PP for the late-game.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Manaphy": {"sets": [{"name": "RegenVest"}, {"name": "Tail Glow"}]},
  "Samurott-Hisui": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Hisuian Samurott is a decent wallbreaker due to Adaptability, Choice Band, and a great STAB combination that also pressures the ever-present Corviknight to choose between recovery and Defogging. Ceaseless Edge is a versatile move that deals good damage to foes while also setting up Spikes, helping Hisuian Samurott's teammates or even itself to pick off chipped foes later in the game. Knock Off provides utility by removing items from switch-ins such as Corviknight and Quaquaval. Sucker Punch is a good priority move that lets Hisuian Samurott deal heavy damage to faster foes such as Cinderace, Iron Moth, and Zapdos. Brick Break can be used instead to deal with dual screens leads such as Corviknight and Mew. Hisuian Samurott's ability to set up Spikes and pester defensive Pokemon such as Corviknight and Scream Tail by removing their items is appreciated by various offensive teammates such as Chien-Pao and Galarian Zapdos that can take advantage of chipped foes. Fluffy and Intimidate Quaquaval wall Hisuian Samurott very easily, so spinblockers such as Desolate Land Skeledirge and Ceruledge are good partners as they can pressure Quaquaval and block it from removing Spikes set by Hisuian Samurott. Hisuian Samurott is susceptible to getting revenge killed due to low Speed and bulk, so robust walls such as Corviknight and Meloetta that can pivot and provide safe switch in opportunities to it are appreciated.</p> "
      },
      {"name": "Swords Dance", "description": "<p>After a Swords Dance boost, Hisuian Samurott becomes a terrifying wallbreaker that can dent physically defensive walls like Corviknight. Sucker Punch acts as speed control against Pokemon like Zapdos and Iron Moth. Ceaseless Edge forces defensive Pokemon, such as Corviknight, to switch in and choose between entry hazard removal or healing. Black Glasses is the item of choice, boosting its Dark-type moves without the recoil of Life Orb. Pokemon like Thundurus and Iron Moth are very useful teammates, as they compensate for Hisuian Samurott's average Speed tier and can heavily damage physical walls that counter Hisuian Samurott like Quaquaval and Zamazenta-C. In return, Hisuian Samurott wears down special walls with its ability to set up a layer of Spikes. Additionally, due to its unimpressive bulk, Hisuian Samurott relies on walls such as Corviknight and Hisuian Goodra to compensate for the lack of defensive utility it brings.</p> "}
    ],
    "credits": {"writtenBy": [{"username": "LOrd Fernado", "user_id": 629794}, {"username": "Frozoid", "user_id": 532881}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Atha", "user_id": 450411}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Lilligant-Hisui": {"sets": [{"name": "Fluffy"}, {"name": "Sword of Ruin"}]},
  "Haxorus": {"sets": [{"name": "Protean"}]},
  "Hydreigon": {
    "sets": [
      {"name": "Nasty Plot"},
      {
        "name": "The Clicker (Choice Specs)",
        "description": "<p>Utilizing its high Special Attack, Beads of Ruin, powerful STAB attacks, and solid coverage options, Hydreigon is a formidable wallbreaker that can tear down the tiers most robust special walls like Hisuian Goodra, Meloetta, and Blissey over the course of a game. Focus Blast is a powerful option to muscle past Hisuian Goodra, Blissey and Zamazenta-C. U-turn allows Hydreigon to provide additional utility as a pivot, ease prediction, and maintain momentum against switch-ins like Blissey and Diancie, while Flash Cannon serves as an option to handle the Fairy-type switch-ins like Enamorus-T and Diancie that Hydreigon would otherwise struggle to beat. Hydreigon has unimpressive Speed and can be revenge killed quite easily by threats such as Slither Wing, Chien-Pao, and Pixilate Scream Tail, so walls that can handle these like RegenVest users, Corviknight, and Quaquaval are appreciated, with the latter two being able to pivot Hydreigon in. Powerful physical wallbreakers like Galarian Zapdos and Slither Wing are appreciated, forming a potent VoltTurn core with Hydreigon if it opts for U-turn, handling the special walls that Hydreigon can struggle against, and pivoting in Hydreigon to break the physical walls they may struggle with.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "Tranquility", "user_id": 475288}, {"username": "KarpeChan", "user_id": 536333}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Volcarona": {
    "sets": [
      {
        "name": "Fast Support",
        "description": "<p>Volcarona serves as a solid support pokemon with valuable defensive utility to check the likes of Hariyama and Glaceon. Fiery Dance lets Volcarona increase its Special Attack without having to setup, while Flamethrower has more PP and immediate power. U-turn allows Volcarona to maintain momentum, while Quiver Dance serves as an option to go for a potential late-game sweep. Will-O-Wisp cripples switch-ins like Garganacl and is generally great for weakening physical attackers like Quaquaval. Teammates such as Meowscarada and Roaring Moon appreciate Volcarona's ability to sponge priority moves from Slither Wing and Hatterene. Bulky Ground-types like Ting-Lu and Donphan also benefit from Volcarona ability to somewhat safely switch into offensive Water-types such as Inteleon and non-Brave Bird Quaquaval. Volcarona is walled by common Well-Baked Body users like Kingambit and Corviknight, so attackers like Quaquaval and Sandy Shocks are helpful for breaking through them. Volcarona can also have trouble getting past Fire-resistant specially defensive walls that resist fire like Roaring Moon and Garganacl, so a physical wallbreaker such as Slither Wing is recommended.</p> "
      },
      {
        "name": "Offensive",
        "description": "<p>Volcarona serves as a passable late-game sweeper after checks such as Well-Baked Body Corviknight and special walls such as Garganacl, Blissey, and Clodsire have been eliminated from the game. Volcarona wants to quickly rack up stat boosts with Quiver Dance and Fiery Dance to sweep the enemy team while also providing a Water immunity in the form of Desolate Land. Alternatively, Volcarona can opt for Storm Drain to turn fast Primordial Sea users such as Greninja and Barraskewda into setup fodder. Will-O-Wisp is preferred on the last slot to cripple physical attackers such as Garchomp and Quaquaval, which seek to exploit Volcarona's low Defense, but Volcarona can run Bug Buzz to threaten bulky phazers such as Ting-Lu and RegenVest Roaring Moon or Psychic to chunk Haze users such as Toxapex and Clodsire. Volcarona is completely walled by Well-Baked Body Steel-types such as Corviknight and Kingambit; thus, partners such as Sandy Shocks help to eliminate them in the early-game. While Giga Drain can hurt Garganacl, Volcarona's massive weakness to Rock means it doesn't want to stay into Garganacl at all; thus, teammates such as Magic Guard Quaquaval are particularly helpful. Lastly, Volcarona appreciates entry hazard setters such as Garchomp and Clodsire, as the chip damage allows Volcarona to sweep more effectively.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}, {"username": "Alexender", "user_id": 313542}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Sabelette", "user_id": 583793}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Thundurus": {"sets": [{"name": "Sheer Force"}, {"name": "Magic Guard"}]},
  "Thundurus-Therian": {
    "sets": [
      {
        "name": "Sheer Force",
        "description": "<p>Thundurus-T is one of the strongest wallbreakers in the tier, boasting a massive Special Attack stat and a variety of coverage moves. Nasty Plot is its main source of pressure, letting it muscle past passive walls and RegenVest users. Focus Blast nails special walls like Hisuian Goodra and Blissey while also threatening Iron Treads. Grass Knot can be used as a more reliable option to hit Ground-types such as Garchomp and Ting-Lu, but Taunt allows Thundurus-T to beat Scream Tail, clearing a major roadblock for other setup teammates. Thundurus-T appreciates having Spikes support to pick up the OHKO on Hisuian Goodra without having to run Modest and to further weaken other RegenVest users such as Alolan Muk and Meloetta. Thundurus-Ts weakness to Stealth Rock warrants good entry hazard control, notably Quaquaval and Corviknight, which can pivot into Thundurus-T. Speed control from the likes of Hisuian Electrode and Regieleki is helpful, as Thundurus-Ts middling Speed leaves it prone to getting revenge killed.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "GlalieGoesBoom", "user_id": 539679}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Landorus": {"sets": [{"name": "Sheer Force"}, {"name": "Desolate Land"}]},
  "Landorus-Therian": {
    "sets": [
      {
        "name": "RegenVest",
        "description": "<p>RegenVest Landorus-T is a specially defensive pivot with respectable offensive power to boot. Earthquake is its main STAB move, threatening offensive Steel- and Fire-types like Heatran and Iron Moth that fail to OHKO Landorus-T. U-turn allows Landorus-T to gain momentum and switch out, giving powerful-but-frail attackers like Chien-Pao and Iron Moth the ability to switch in for free. Rock Tomb and Sludge Bomb are used to whittle down Earth Eater Fire-types like Skeledirge and defensive Fairy-types like Scream Tail, respectively, with Rock Tomb being able to heavily damage Zapdos. Alternatively, Smack Down can be used to threaten switch-ins like Corviknight, (add comma) while Sandsear Storm can burn pivots like Garchomp. A Sassy nature with 0 Speed IVs lets Landorus-T underspeed defensive pivots like Garchomp, Scream Tail, and non-minimum Speed Corviknight with U-turn. RegenVest Landorus-T can form a powerful defensive VoltTurn core with physically defensive pivots like Corviknight and Iron Treads. Additionally, fast revenge killers and late-game sweepers like Chien-Pao and Hisuian Electrode benefit from slow pivots that can get them on the field without having to absorb an attack themselves. Due to its typing, Landorus-T does not act as an adequate switch-in to Water-type attackers like Volcanion; Water-resistant teammates like Dondozo and Water Absorb Iron Treads help mitigate this weakness.</p> "
      },
      {
        "name": "Fluffy",
        "description": "<p>Fluffy makes Landorus-T a decent defensive pivot that can take hits from physical attackers such as Slither Wing, Kingambit, and Ursaluna. Stealth Rock + Smack Down makes Landorus-T a decent entry hazard setter against Corviknight, the most common hazard removal option; Smack Down also ensures that Talonflame can't use Landorus-T as setup fodder. Taunt can also be used to deny recovery to Corviknight and Scream Tail and setup opportunities to foes, such as Talonflame and Roaring Moon. Landorus-T best fits on balance and bulky offense teams, where it can provide defensive support against the aforementioned physical attackers. Common defensive Pokemon such as Corviknight, Hisuian Goodra, and Scream Tail are good teammates that can switch into Pokemon that threaten Landorus-T, such as Chien-Pao, Zapdos, and Quaquaval; Scream Tail can also provide Wish support. Landorus-T struggles to beat offensive Pokemon one-on-one, but its ability to safely pivot into teammates benefits fast offensive Pokemon such as Iron Moth, Greninja, and Chien-Pao.</p> "
      },
      {
        "name": "Well-Baked Body",
        "description": "<p>With an added immunity to Fire, Landorus-T becomes a fantastic check to many of the Fire-types in the tier such as Cinderace, Ceruledge, and Iron Moth that also doubles as an entry hazards setter and a pivot. It differentiates itself from Garchomp as a Fire-type answer with its immunity to Will-O-Wisp as well as access to U-turn and Smack Down, allowing it to generate momentum and pressure Corviknight and other Flying-types. It can further capitalize on this added offensive presence with Swords Dance, especially if it has activated Well-Baked Body beforehand. Alternatively, running Hammer Arm over Smack Down allows it to still beat Earth Eater Heatran by itself and potentially hit Earth Eater Iron Treads hard on the switch. As a Fire-type answer, it makes a fantastic partner for Corviknight, which also appreciates its Fighting resistance to help against Pokemon like Slither Wing and in turn can handle many strong wallbreakers such as Roaring Moon and Chien-Pao that Landorus-T lacks the bulk and recovery to answer. Landorus-T also benefits RegenVest Pokemon such as Hisuian Goodra and Meloetta by preventing them from getting overwhelmed by strong Fire-type attacks and, in the case of Hisuian Goodra, helping against Ground-types such as Sandy Shocks and Landorus, while in return they handle the many special attackers in the tier. Water-immune partners, such as Desolate Land Heatran and Ceruledge, make good teammates for Landorus-T as well. Frail wallbreakers such as Chien-Pao and Cinderace also benefit from its pivoting ability to enter the battlefield safely as well as the hazards its sets to wear down their checks.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}, {"username": "Frozoid", "user_id": 532881}, {"username": "Don Vascus", "user_id": 322272}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "Isaiah", "user_id": 375662}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Adeleine", "user_id": 517429}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Meloetta": {
    "sets": [
      {
        "name": "RegenVest",
        "description": "<p>With a good typing, solid special bulk, and access to a slow U-turn, Meloetta is a solid RegenVest user for more offensively-oriented teams that want to keep up momentum while also being able to check prominent special attacking threats like Thundurus, Skeledirge, and Choice Specs Volcanion. Low Kick is used to chip Hisuian Goodra as well as severely dent Iron Treads and Heatran that may be looking to switch in on it. Frail wallbreakers such as Chien-Pao and Galarian Zapdos appreciate Meloetta's ability to slow pivot, ensuring they get in safely. Physically defensive walls like Corviknight and Quaquaval pair well with Meloetta, as they can shore up its Knock Off weakness and vulnerability to strong physical attackers like Slither Wing. Meloetta is prone to entry hazards that impede its ability to take repeated attacks from Zapdos, Thundurus, and Inteleon, so hazard removers like Corviknight and Iron Treads make for good teammates. Meloetta can also struggle with mixed attackers like Magic Guard Volcanion and Heatran, so paring it with offensive pokemon like Regieleki and Galarian Zapdos that can threaten them out is advised. Meloetta also appreciates hazard support from setters like Garchomp and Ting-Lu so that attackers like Inteleon, Greninja, and Rotom-W cannot pivot for free.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Chesnaught": {"sets": [{"name": "Triage"}, {"name": "Well-Baked Body"}]},
  "Greninja": {
    "sets": [
      {
        "name": "Choiced Attacker",
        "description": "<p>Primordial Sea Greninja can use its rain-boosted attacks to wallbreak with Choice Specs or serve as a valuable revenge killer and late-game cleaner with Choice Scarf, outspeeding boosted threats such as Choice Scarf Chi-Yu and Sandy Shocks, and +1 Volcarona. Choice Specs-boosted Hydro Pump's higher power 2HKOes even Water-resistant foes such as Dondozo, and Quaquaval. U-turn lets it act as a solid offensive pivot, pairing extremely well with other offensive teammates like Hatterene and Armarouge that threaten its switch-in such as Toxapex, Desolate Land Iron Moth, and Roaring Moon. Greninja can run an entry hazard of choice since it forces multiple switches and threatens common hazard removers like Great Tusk and Corviknight, whittling down its checks in the long run. Switcheroo immediately cripples its defensive checks as well as bulky setup sweepers like Calm Mind Scream Tail and Florges, especially for Choice Scarf variants that can't immediately harm them. Water Shuriken is a fringe option that can pick off weakened foes like Sandy Shocks and Chien-Pao. VoltTurn support from Pokemon such as Cinderace and Iron Moth is appreciated to bring Greninja in safely on foes like Garganacl.</p> "
      },
      {"name": "Magic Guard + Life Orb", "description": "<p>With high Speed that allows it to outspeed most of the unboosted metagame and Life Orb-boosted Special Attack, Greninja is a powerful special threat that uses its fantastic STAB combination to threaten common metagame threats like Ceruledge and Garganacl. Water Shuriken allows Greninja to reliably revenge kill weakened opponents and break through Substitute, while Ice Beam gives coverage against Pokemon like Roaring Moon and Garchomp. Greninja struggles against special walls like Florges and Desolate Land users like Iron Moth, so physically offensive Pokemon like Well Baked Body Kingambit and Ceruledge that can threaten them are good teammates. Due to its defensive frailty, Greninja also appreciates teammates like Corviknight and Cinderace that can safely pivot it in. Thanks to its immunity to entry hazards, Greninja fits well on offensive entry hazard stacking teams with little or no entry hazard removers.</p> "}
    ],
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}, {"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Talonflame": {
    "sets": [
      {
        "name": "Magic Guard",
        "description": "<p>Magic Guard Talonflame utilizes its great Speed tier, good power, and bevy of utility moves to function as one of the best late-game sweepers in the tier. Brave Bird's excellent power and neutral coverage allow Talonflame to effectively run mono-attacking sets while still forcing out most offensive Pokemon, like Meowscarada and Galarian Zapdos. Bulk Up provides insurance against revenge killers like Chien-Pao and Choice Scarf users, while Swords Dance offers faster setup. Taunt is the preferred last move to take advantage of passive foes like Unaware Scream Tail and Well-Baked Body Corviknight, turning them into setup fodder; Will-O-Wisp provides team support by crippling bulky foes like Garganacl and Garchomp. Flare Blitz is a final option to provide coverage for Steel-types like Kingambit and Iron Treads. Talonflame struggles with special Choice Scarf users like Sandy Shocks and Greninja, as they can force it out no matter how much it has set up, so teammates like Hisuian Goodra are excellent partners. Bulky Flying-resistant foes like Glimmora and Zapdos frustrate Talonflame, making teammates like Greninja and Garchomp that threaten them valuable. Talonflame truly shines in long games, as it can outlast its checks, so bulkier teammates like Intimidate Corviknight, RegenVest Meloetta, and Unaware Scream Tail that can help it get in multiple times are recommended.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "UT", "user_id": 523866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Florges": {
    "sets": [
      {
        "name": "Defensive",
        "description": "<p>Florges's extremely high Special Defense stat makes it an effective wall that also provides utility in the form of Wishpassing. With Unaware, Florges is able to comfortably set up on and check Pokemon such as Quiver Dance Volcarona, Fiery Dance Iron Moth, and Hatterene. Tablets of Ruin is also a viable option that allows Florges to easily switch into and threaten Pokemon such as Chien-Pao. Calm Mind + Wish and Synthesis give Florges the longevity necessary to serve a bulky sweeper. Wish + Protect provides guaranteed healing and can be used to scout options from foes; it also synergizes well with chip damage from other sources, like Garganacl's Salt Cure and poison damage from Toxic Spikes. Despite its naturally high Special Defense, Florges is threatened by special attackers that can muscle through it, such as Shell Smash Polteageist. Florges thus appreciates teammates that can handle these threats such as RegenVest Roaring Moon and Blissey. To compensate for its relatively low physical bulk, Florges can be paired with teammates who are more physically defensive, such as Dondozo and Corviknight.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Alexender", "user_id": 313542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Isaiah", "user_id": 375662}]}]}
  },
  "Sylveon": {"sets": [{"name": "Unaware"}]},
  "Hawlucha": {"sets": [{"name": "Magic Guard"}]},
  "Goodra": {"sets": [{"name": "RegenVest"}]},
  "Goodra-Hisui": {
    "sets": [
      {
        "name": "RegenVest",
        "description": "<p>Hisuian Goodra, with its excellent defensive typing and enormous special bulk, is a premier RegenVest user that is able to check common special attackers such as Zapdos, Hisuian Electrode, and Greninja while also being able to phase setup sweepers like Volcarona and Polteageist with Dragon Tail. Earthquake hits opposing Hisuian Goodra and can also OHKO Fire-types like Iron Moth, while Flamethrower can threaten Steel-types like Corviknight. Thunderbolt provides coverage for offensive Water-types like Greninja, Volcanion, and Inteleon while denying minimum Speed Corviknight an opportunity to use Roost; Draco Meteor is a strong STAB move for threats like Garchomp, and Ice Beam provides coverage against prominent special attackers like Zapdos, Hisuian Electrode, and Kilowattrel. Hisuian Goodra is a great teammate for frail offensive Pokemon like Galarian Zapdos and Talonflame, as it can soak up hits from Choice Scarf revenge killers like Greninja and Azelf; in return, Zapdos and Talonflame can revenge kill strong special wallbreakers such as Thundurus-T and Hoopa, which could otherwise threaten Goodra. Goodra is vulnerable to strong physical attackers like Galarian Zapdos and Landorus-T, so pairing it with a physical wall such as Corviknight is recommended. Goodra can also be chipped down by entry hazards, which limit its walling prowess, so spinners like Quaquaval and Iron Treads make for good teammates to provide Goodra with more longevity.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Diancie": {"sets": [{"name": "Defensive"}, {"name": "Triage"}]},
  "Hoopa": {
    "sets": [
      {
        "name": "Special Wallbreaker",
        "description": "<p>Hoopa is a passable wallbreaker that fits on offensive teams, particularly when paired with Sticky Web support from Masquerain and Spidops and teammates that can pivot it in safely. Psyshock allows Hoopa to hit special walls like Blissey on their weaker physical bulk, while Knock Off cripples RegenVest users like Alolan Muk and Meloetta that can otherwise take a hit and threaten a KO or pivot out to a faster offensive threat like Chien-Pao. Focus Blast 2HKOes Hisuian Goodra and KOes Kingambit that would attempt to switch in. Defensive pivots that can take a hit and pivot out like Corviknight and Meloetta can get Hoopa in safely. Dual screens setters like Prankster Corviknight and Mew also make for a good partner, as they allow Hoopa to have an easier time setting up with Nasty Plot or tank a hit in a pinch and retaliate. Offensive pivots like Slither Wing and Galarian Zapdos pair well with Hoopa with their ability to bait in and pivot out on checks like Corviknight and defensive Zapdos, allowing Hoopa to set up and threaten a KO; faster offensive threats like Chien-Pao and Barraskewda also pair well with it by making up for its lackluster Speed while Hoopa threatens out their checks like defensive Quaquaval.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Volcanion": {
    "sets": [
      {
        "name": "Primordial Sea",
        "description": "<p>Primordial Sea Volcanion excels as a fantastic wallbreaker with its great Special Attack and offensive typing. Rain-boosted Steam Eruption combined with Choice Specs allows Volcanion to 2HKO most Pokemon in tier, including most specially defensive walls such as RegenVest Garchomp, Meloetta, and Alolan Muk. Weather Ball dissuades promient Desolate Land users that might want to switch in to Volcanion such as Cinderace and Iron Moth. Earth Power is a more reliable way to deal with Desolate Land users like Iron Moth and Heatran, and it's a reliable way to hit Hisuian Goodra without missing. Focus Blast 2HKOes a would-be check in RegenVest Roaring Moon, as well as Hisuian Goodra after Spikes chip. Volcanion pairs well with entry hazard setters like Ting-Lu and Garchomp, which help wear down common RegenVest Pokemon like Goodra and Hisuian Goodra, and hazards also guarantee a 2HKO on Meloetta. Due to Volcanion's Stealth Rock weakness it pairs well with hazard removers like Corviknight and Quaquaval, which can also help pivot it in safely. Volcanion also pairs well with offensive pivots like Zapdos and Roaring Moon, which can help bring it in on targets like Corviknight.</p> "
      },
      {
        "name": "Magic Guard",
        "description": "<p>Magic Guard Volcanion serves as a great mixed wallbreaker with a typing that also offers defensive utility. Flare Blitz is notably able to 2HKO RegenVest users like Hisuian Goodra and Meloetta, and Steam Eruption's burn chance deters would-be switch-ins like defensive Quaquaval and Garchomp. Earth Power reliably threatens Toxapex and Desolate Land users such as Iron Moth, Skeledirge, and Cinderace. Taunt can be used to hinder defensive walls with recovery such as Scream Tail and Quaquaval, while Will-O-Wisp is able to reliably burn switch-ins like defensive Quaquaval and Garchomp. Flame Charge is also a niche option to outspeed common revenge killers to Volcanion like Zapdos, Hisuian Arcanine, and Choice Band Galarian Zapdos. Magic Guard helps Volcanion with its weakness to entry hazards while also negating recoil from Flare Blitz and Life Orb. Offensive pivots such as Slither Wing and Iron Moth can bring Volcanion in against defensive cores featuring staples like Intimidate Corviknight and RegenVest users. Fast late-game cleaners like Chien-Pao and Regieleki also appreciate Volcanion's ability to weaken defensive checks like Quaquaval and common RegenVest users, which can allow them to take over games, while also providing speed control against faster threats to Volcanion like Zapdos, Hisuian Electrode, and Roaring Moon. Volcanion's susceptibility to being revenge killed by aformetioned threats makes defensive partners such as Corviknight and Meloetta essential, as they can tank hits and also help pivot to bring in Volcanion safely. Despite being immune to hazards, Volcanion still lacks recovery, so a teammate that can grant it longevity like Wish Scream Tail is also appreciated.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "yokoisop", "user_id": 617542}, {"username": "I am BONK", "user_id": 603931}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Decidueye": {"sets": [{"name": "Defensive"}]},
  "Lycanroc": {"sets": [{"name": "Rocky Payload"}]},
  "Toxapex": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Toxapex is a stout physically defensive wall that deters common physical attackers like Galarian Zapdos and Ceruledge. Toxic targets foes that commonly run Heavy-Duty Boots or are Ground immune like Cinderace and Galarian Zapdos, while Toxic Spikes provides excellent team support; Corrosion variants should always run Toxic to punish common switch-ins like Corviknight and Hisuian Goodra that otherwise might use Toxapex as free recovery. Prankster + Haze, on the other hand, is an excellent tool to frustrate hyper offense teams and stop dangerous setup sweepers like Chien-Pao, Polteageist, and Chesnaught. While the consistent recovery of Black Sludge is generally preferred, Rocky Helmet allows Toxapex to annoy non-Magic Guard Galarian Zapdos and Chien-Pao even when it is forced to use Recover. Toxapex is utterly unable to threaten most Magic Guard users, like Galarian Zapdos and especially Water-resistant ones like Hisuian Electrode and Quaquaval, so reliable checks to them like Hisuian Goodra and Fluffy Corviknight are recommended. Toxic Spikes variants appreciate spinners like Iron Treads, as they can provide entry hazard removal without removing Toxic Spikes as well. Toxapex can easily be overwhelmed by multiple attackers, so it should always have a secondary physically defensive teammate, especially one that handles Ground-types, like Intimidate Corviknight; this also relieves some of the pressure off of Toxapex of checking pivots without Regenerator.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "UT", "user_id": 523866}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Palossand": {"sets": [{"name": "Physically Defensive"}]},
  "Kommo-o": {"sets": [{"name": "Defensive"}, {"name": "Triage"}, {"name": "Galvanize"}]},
  "Cinderace": {
    "sets": [
      {"name": "Heavy-Duty Boots"},
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Cinderace is a potent wallbreaker that can OHKO or 2HKO common defensive Pokemon like Ting-Lu, Corviknight, and Kingambit. While Mold Breaker beats Well-Baked Body users like Corviknight, Desolate Land allows Cinderace to 2HKO even Fire-resistant Pokemon like Roaring Moon with Pyro Ball. Gunk Shot is a good option to hit Fairy-types like Scream Tail and Florges, while Sucker Punch allows Cinderace to revenge kill weakened opponents that outspeed it, such as Kilowattrel. Cinderace struggles against Primordial Sea users like Barraskewda and certain physical walls like Dondozo, so it appreciates teammates like Rotom-W that can threaten these Pokemon. Due to its low defensive stats and weakness to entry hazards, Cinderace appreciates pivoting and entry hazard removal from teammates like Corviknight and Iron Treads. Cinderace also pairs well with offensive pivots like Greninja, as they can easily maneuver around and threaten each other's checks.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Isaiah", "user_id": 375662}]}]}
  },
  "Inteleon": {
    "sets": [
      {
        "name": "Primordial Sea",
        "description": "<p>Inteleon is a strong wallbreaker that fits well on balance and bulky offense teams. U-turn allows it to pivot out on switch-ins like Hisuian Goodra and Blissey while also forming strong VoltTurn cores with other pivots like Galarian Zapdos and Slither Wing that can wear down each other's checks with entry hazards up. Mud Shot allows it to threaten Desolate Land Fire-types like Iron Moth and Cinderace that would otherwise switch into Inteleon freely. Ice Beam allows it to chip specially bulky Dragon-types like RegenVest Roaring Moon and Goodra, while Surf acts as a more reliable option late-game when the opposing team has been heavily chipped or to snipe frailer or slower targets like Azelf and both Zapdos formes. Physical wallbreakers like Chien-Pao and Roaring Moon appreciate Inteleon pivoting into them on its switch-ins like the aforementioned Hisuian Goodra and Blissey as well as Inteleon's ability to threaten physical walls like Corviknight and defensive Quaquaval. Inteleon brings close to no defensive utility bar a Fire-type move immunity, which means that walls like Corviknight and Goodra are a must-have to make up for the lack of defensive utility; these Pokemon also switch into revenge killing attempts from Slither Wing and Regieleki. Inteleon appreciates Spikes support from Pokemon like Garchomp and Ting-Lu that helps it to wear down RegenVest Pokemon like Meloetta and Alolan Muk.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Tranquility", "user_id": 475288}]}]}
  },
  "Corviknight": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Corviknight is simultaneously the best physical wall and Defogger in AAA, making it a staple on most teams. Intimidate is the preferred ability to better check Chien-Pao and potentially pass off a weakened attacker to a teammate, while Fluffy offers more overall walling potential against Galarian Zapdos and Kingambit; more rarely, immunity abilities like Well-Baked Body and Volt Absorb can be used, but they lack walling capabilities against neutral attackers. Brave Bird is its strongest available attack and threatens Galarian Zapdos, Slither Wing, and Quaquaval, while Body Press beats Kingambit and Chien-Pao. Corviknight is exceedingly passive on its own, but minimum Speed investment + U-turn allows it to bring in powerful offensive teammates like Slither Wing, Iron Moth, and Cinderace easily. RegenVest teammates like Meloetta and Hisuian Goodra cover the special attackers that like to come in on Corviknight, and they appreciate U-turn's extra chances to cycle in safely and gain additional Regenerator recovery. Corviknight is powerless to check dangerous physical Fire-types like Talonflame, Cinderace, and Ceruledge, making a secondary physical check like Garchomp or Well-Baked Body Iron Treads a good pairing. Corviknight needs to be at nearly 100% health to check foes like Galarian Zapdos and Chien-Pao, making secondary hazard removal options like Iron Treads and Quaquaval useful.</p> "
      },
      {"name": "Dual Screens", "description": "<p>Prankster Corviknights excellent typing, solid bulk, and tailor-made movepool make it a premier dual screens lead for hyper offense teams. Taunt blocks entry hazards and denies setup attempts from opposing leads looking to capitalize on Corviknights passivity, while U-turn lets Corviknight, with its relatively low Speed, usually bring in a teammate safely. 64 Speed EVs outpace Prankster Spidops, allowing Corviknight to deny Sticky Web. Prankster Corviknight should be found exclusively on hyper offense teams with teammates like Volcarona, Zamazenta-C, and Chien-Pao that can take advantage of dual screens support to set up safely. Corviknight is unable to prevent Dark-types like Ting-Lu and Chien-Pao from setting hazards or setting up, so strong Fighting-type anti-leads like Slither Wing make excellent teammates.</p> "}
    ],
    "credits": {"writtenBy": [{"username": "UT", "user_id": 523866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Drednaw": {"sets": [{"name": "Shell Smash"}]},
  "Barraskewda": {
    "sets": [
      {
        "name": "Primordial Sea",
        "description": "<p>Barraskewda, with its fantastic Speed tier that surpasses nearly the entire unboosted metagame, great Attack, and Primordial Sea-boosted STAB moves, is a premier offensive pivot and cleaner, running circles around most of the tier. Close Combat provides fantastic coverage, threatening an OHKO on Hisuian Goodra and incoming Desolate Land Heatran while 2HKOing Zamazenta-C. Aqua Jet provides strong priority to revenge kill weakened Choice Scarf users such as Sandy Shocks, Slither Wing, and Volcarona, while Psychic Fangs or Drill Run provides coverage against Water-resistant foes, with Psychic Fangs targeting Kommo-o, Quaquaval, and Toxapex, and Drill Run being stronger against Iron Moth, Ceruledge, and Cinderace. Barraskewda is very frail and appreciates bulky pivots such as Corviknight, Zapdos, and Manaphy, which can take a hit such as Dragonite's Extreme Speed or Azelf's Expanding Force and bring it in safely to threaten the foe. Barraskewda performs well alongside specially offensive pivots such as Walking Wake and Iron Moth, threatening the checks such as Hisuian Goodra and Garchomp that they would otherwise struggle to break, while in return they threaten Barraskewda'schecks such as Fluffy Corviknight and Zapdos. Due to its frailty, Barraskewda appreciates entry hazard removers such as Great Tusk, Corviknight, and Quaquaval, ensuring it can come in as many times as possible to threaten the foe without fainting to hazard chip. Likewise, Barraskewda appreciates hazard setters such as Garchomp and Kommo-o wearing down checks such as Scream Tail and Desolate Land users over the course of a game, also securing a 2HKO on Manaphy lacking Defense investment with Close Combat after Stealth Rock damage.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Toxtricity": {"sets": [{"name": "Shift Gear"}, {"name": "Choiced Attacker"}]},
  "Polteageist": {
    "sets": [
      {
        "name": "Shell Smash",
        "description": "<p>Polteageist is a dangerous setup sweeper and cleaner thanks to Shell Smash, Stored Power, and its excellent Special Attack, allowing it to sweep with a single turn of setup. Giga Drain provides coverage for Ting-Lu and Garganacl, Strength Sap gives Polteageist a way to restore its Focus Sash after chip damage and set up on weaker physical attackers, while Substitute allows for safe setup on status-reliant walls like Blissey. Focus Sash the preferred item to safely ensure Polteageist can use Shell Smash. Polteageist can often struggle to get itself onto the field safely, so it appreciates a slow pivot from Corviknight or Shed Tail Cyclizar who can also facilitate Polteageist's setup with screens or a passed Substitute. Polteageist pairs well with physical wallbreakers like Swords Dance Cinderace that can break through opposing walls. Due to its reliance on Focus Sash, Polteageist needs reliable entry hazard removal like Cyclizar and Iron Treads.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "LordBox", "user_id": 611238}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Hatterene": {
    "sets": [
      {
        "name": "Triage",
        "description": "<p>Hatterene is a decent Triage user that can successfully check dangerous attackers like Meowscarada, Greninja, and most Chien-Pao. Calm Mind and its good bulk allow it to set up and beat bulkier foes as well. Psyshock provides effectively mixed coverage, most notably beating Blissey. For the last moveslot, Mystical Fire beats non-Well-Baked Body Corviknight, Nuzzle cripples switch-ins like Kingambit, and Giga Drain hits Garganacl hard while providing more recovery and priority. Other sweepers benefit greatly from the dents placed by Hatterene, such as Shell Smash Polteageist and Quaquaval. Hatterene is weak to mainly priority-immune Chien-Pao and Shell Smash Polteageist. Kingambit, with or without RegenVest, is a reliable check to Polteageist. Corviknight is a solid partner, as it provides entry hazard removal and pivoting to safely bring Hatterene in. Hatterene also struggles with Fire-type Pokemon, making teammates like Garchomp and Well-Baked Body Kingambit naturally good partners.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Zarude": {"sets": [{"name": "Adaptability"}, {"name": "Fluffy"}]},
  "Regieleki": {
    "sets": [
      {
        "name": "Special Refrigerate",
        "description": "<p>Regieleki makes use of its amazing Speed along with Refrigerate to be a solid offensive spinner and pivot that cannot be spinblocked; it also threatens Ground-types that could otherwise switch in and block Volt Switch such as Garchomp, Landorus-T, and Sandy Shocks with Tera Blast. Thunderbolt is a stronger STAB option to use on switch-ins such as Iron Moth and Skeledirge, forcing them to use their recovery moves while Regieleki can pivot out, while Explosion can be used to heavily chip common RegenVest users like Hisuian Goodra and Meloetta, opening up opportunities for Regieleki's teammates like Iron Moth and Enamorus-T. Heavy-Duty Boots is the preferred item, as it allows Regieleki to have better longevity for spinning and pivoting, but Never-Melt Ice and Life Orb can also be used to make Tera Blast and Explosion more potent. Since Regieleki has a very high natural Speed tier, an alternative EV spread of 244 HP / 252 SpA / 12 Spe can be ran with a Mild nature to have more bulk while still being able to outspeed every unboosted Pokemon in the tier. Due to its frail bulk, it is highly recommended to pair Regieleki with another spinner such as Quaquaval or Iron Treads, as they can take hits from common hazard setters like Garchomp and allow Regieleki to pivot in teammates more freely with Volt Switch. Regieleki also pairs up well with physical pivots like Galarian Zapdos, Slither Wing, and Meowscarada, as they can create a strong VoltTurn duo and threaten the Pokemon that Regieleki lures in such as Hisuian Goodra and Meloetta while Regieleki can pivot them in safely. Regieleki can struggle with breaking through bulky Pokemon such as Iron Treads and Scream Tail, so pairing it with a Pokemon that can break through both of them such as Zamazenta-C, Magic Guard Volcanion, or Heatran is advised.</p> "
      },
      {"name": "Physical"}
    ],
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "KarpeChan", "user_id": 536333}, {"username": "cat", "user_id": 580765}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Enamorus-Therian": {
    "sets": [
      {
        "name": "Triage",
        "description": "<p>With decent bulk and high Special Attack, Enamorus-T can become a fearsome setup sweeper and revenge killer in spite of its low Speed, including OHKOing Chien-Pao and Quaquaval and 2HKOing specially defensive Garchomp variants while staying healthy thanks to Triage. Enamorus-T also acts as a decent wall that can easily stand up to attacks from the likes of Barraskewda and Meloetta after a boost from Iron Defense or Calm Mind. Earth Power lets Enamorus-T hit Steel-types like Zamazenta-C and non-Earth Eater Iron Treads, and it can OHKO Fire-types like Iron Moth and Cinderace. Enamorus-T benefits from physically offensive teammates like Meowscarada and Chien-Pao that can remove specially defensive Pokemon like Blissey and RegenVest Hisuian Goodra that it would otherwise struggle with. Enamorus-T also needs teammates like Cinderace and Ceruledge that can remove Ground-immune Steel-types, as these otherwise wall it. Powerful wallbreakers like Iron Moth and Galarian Zapdos synergize well with Enarmorus-T, weakening opposing Pokemon for it to easily revenge kill.</p> "
      },
      {
        "name": "Sheer Force",
        "description": "<p>Enamorus-T's high Special Attack and access to great coverage moves make it a powerful wallbreaker that can easily OHKO common specially defensive foes like Garchomp with Moonblast. Mystical Fire covers non-Well-Baked Body Steel-types such as Corviknight, while Earth Power threatens non-Earth Eater Steel-types and Fire-types like Heatran and Skeledirge. Superpower lets Enamorus-T attack Steel-types without guessing which type immunity ability they are running and can more effectively damage RegenVest foes and Blissey. Enamorus-T pairs well with defensive teammates like Hisuian Goodra and Ting-Lu that can switch into attacks for it, as well as entry hazard removers like Regieleki and Iron Treads, as Enarmorus-T is relatively frail without investment and needs support to stay healthy. Enamorus-T also benefits from entry hazard setters like Garchomp and Iron Treads that can help weaken defensive foes like Blissey for Enamorus-T to be able to OHKO them. Fast offensive teammates like Meowscarada and Inteleon also take great advantage of the holes that Enamorus-T creates in opposing teams.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Meowscarada": {
    "sets": [
      {
        "name": "Choice Item",
        "description": "<p>With its great Speed and good coverage, Meowscarada is one of the best offense pivots in the tier, as Flower Trick + Knock Off provide excellent power, with Knock Off also frustrating common switch-ins like Corviknight. Alternatively, Choice Scarf sets let Meowscarada outspeed Pokemon like Chien-Pao, Hisuian Electrode, and Regieleki. Dazzling is a option over Sword of Ruin on Choice Scarf sets, letting Meowscarada deal with Slither Wing's First Impression and Ice Shard from Chien-Pao. For the last moveslot, Low Kick targets Kingambit, while Play Rough can potentially break Slither Wing; Power Gem is also a niche option on Choice Scarf sets to revenge kill Bulk Up Talonflame. Wallbreakers like Ceruledge and Iron Moth pair well with Meowscarada by punching holes into the opposing team so that Meowscarada can take over the game later on. Corviknight is also a fantastic partner for Meowscarada, tanking all of the Bug- and Ice-type moves, especially U-turn that threaten Meowscarada while also being able to pivot in Meowscarada safely. Meowscarada also pairs well with Pokemon such as Kingambit and Enamorus-T which appriciate Corviknight being weakened.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "yokoisop", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Skeledirge": {
    "sets": [
      {
        "name": "Spinblocker",
        "description": "<p>Thanks to its typing and good physical bulk, Skeledirge serves as an excellent spinblocker that can wall common spinners such as Iron Treads with Earth Eater and Quaquaval with Desolate Land. It also walls threats like Choice Band Cinderace and Zamazenta-C and, depending on its ability, Garchomp and Primordial Sea Zapdos. Skeledirge can then use Torch Song to set up on passive opponents like Scream Tail and non-Well-Baked Body Blissey or Will-O-Wisp to burn an incoming foe, including switch-ins like Hisuian Goodra and Alolan Muk. Hex alongside Will-O-Wisp does more damage, but Shadow Ball can be used for more consistent damage. Skeledirge pairs well with hazard setters such as Garchomp and Iron Treads, as it allows them to keep their hazards on the field, and they can in turn handle opposing Well-Baked Body Pokemon. Due to its middling Special Defense, Skeledirge appreciates specially defensive teammates like Blissey and Hisuian Goodra. Additionally, a teammate that covers the type that Skeledirge chooses not to be immune to, such as Quaquaval for Earth Eater variants and Corviknight for Desolate Land variants, helps form a strong defensive core. Dark-types like Meowscarada and Chien-Pao also OHKO Skeledirge with a bit of chip damage, so Pokemon like Galarian Zapdos and Slither Wing that can threaten them are appreciated.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "cat", "user_id": 580765}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Quaquaval": {
    "sets": [
      {
        "name": "Magic Guard",
        "description": "<p>Magic Guard Quaquaval is a formidable offensive Pokemon that also uses its excellent typing and movepool to serve as the premier offensive entry hazard remover in the tier. Wave Crash is a powerful, drawback-free STAB move that deals heavy damage to foes lacking resistance to Water. Brave Bird is used to hit common Water move switch-ins, like Desolate Land users and opposing Quaquaval. Close Combat can be used as a powerful secondary STAB move and is useful for hitting Steel types like Heatran and Hisuian Goodra, but its drawbacks and typing leave Quaquaval vulnerable to Desolate Land users like Iron Moth, Ceruledge, and Volcarona. Rapid Spin has fantastic synergy with Quaquaval's immunity to passive damage and ability to force out common hazard setters like Garchomp and Landorus-T; Quaquaval also appreciates the Speed boost and can use it in conjunction with Swords Dance to sweep later in the game. Roost greatly improves Quaquaval's longevity, allowing it to repeatedly check threats like Chien-Pao and Kingambit, while U-turn is used to safely bring in teammates after Quaquaval forces a switch. Quaquaval is hard to wear down thanks to Magic Guard, but its middling Speed and bulk leave it vulnerable to faster threats like Iron Moth, Zapdos, and Meowscarada. Fast, offensive teammates like Chien-Pao and Iron Moth appreciate Quaquaval's wallbreaking prowress and ability to remove hazards. Thanks to the passive damage immunity, Quaquaval excels as an offensive rapid spinner on hazard stacking teams, where teammates like Garchomp, Ting-Lu, and Glimmora can set hazards without worrying about enemy hazards wearing them down.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>Defensive Quaquaval uses its good physical bulk and typing to act as a physically defensive pivot, checking dangerous threats like Kingambit, Chien-Pao, and Hisuian Arcanine. Intimidate allows Quaquaval to weaken foes like Chien-Pao and Cinderace for its teammates, while Fluffy grants better bulk to better check Slither Wing and Roaring Moon. U-turn allows Quaquaval to maintain momentum and allows frailer teammates like Slither Wing and Hydreigon to pivot in safely while Rapid Spin offers role compression by allowing it to remove hazards while having a good matchup against entry hazard setters like Iron Treads and Garchomp. A Relaxed nature and 0 Speed IVs allow it to pivot out as slow as possible. Meloetta is a valuable teammate that can switch in on special threats such as Iron Moth and Zapdos that force Quaquaval out. Physical wallbreakers like Meowscarada and Talonflame have a good type matchup against Quaquaval, hence teammates that can force them out like Zamazenta-C and Regieleki make solid partners.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Eggs", "user_id": 517099}, {"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "Isaiah", "user_id": 375662}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Spidops": {
    "sets": [
      {
        "name": "Sticky Web Setter",
        "description": "<p>Prankster Spidops is the optimal Sticky Web setter for hyper offense teams. Spikes and Toxic Spikes add more residual damage for opposing switch-ins, which can be valuable for securing KOs. Taunt is used to block setup and Defog, while Circle Throw forces switches and can rack up residual damage in combination with Spikes. Focus Sash is used to ensure that Spidops can get up Sticky Web and at least one layer of Spikes before fainting. Slow wallbreakers like Chi-Yu and Quaquaval appreciate the opportunities provided by Sticky Web support. Setup attackers such as Chien-Pao and Ceruledge also pair well with Spidops, as it enables them to outspeed would-be revenge killers. Spidops struggles to set Sticky Web against spinners, so it's recommended to pair Spidops with a Ghost-type like Earth Eater Skeledirge that can beat spinners like Iron Treads. Additionally, common Dark-types like Kingambit and Roaring Moon can set up on Spidops lacking Circle Throw, so pairing it with a strong Fighting type like Slither Wing is advised.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Isaiah", "user_id": 375662}]}]}
  },
  "Pawmot": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Pawmot leverages its potent typing that hits popular defensive staples such as Corviknight and Ting-Lu to serve as a powerful wallbreaker. Expert Belt capitalizes on Pawmot's great coverage, while Choice Band allows 2HKOs on neutral targets like Scream Tail and Skeledirge; alternatively, Magic Guard + Life Orb with Double Shock and Thunder Punch can also be used for similar neutral damage and the freedom to switch moves. Mach Punch allows Pawmot to beat faster offensive mons such as Chien-Pao, Meowscarada, and Greninja. Ice Punch allows Pawmot to reliably OHKO Garchomp and beat Clodsire, while Volt Switch can keep up momentum against defensive switch-ins such as Scream Tail and Fluffy Brambleghast. Jolly lets Pawmot outspeed Garchomp and non-Choice Scarf Sandy Shocks, while an Adamant nature bolsters its 2HKO chances on targets such as Scream Tail and Skeledirge with Choice Band Wild Charge. Pawmot often struggles to switch in safely, so it appreciates teammates like Corviknight and Iron Treads that can safely pivot Pawmot in.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "LordBox", "user_id": 611238}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Garganacl": {
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>Garganacl finds itself as a Stealth Rock setter that fits on balance and stall teams with its ability to force progress through passive damage and maintain entry hazards by annoying popular hazard removal options with Salt Cure. Toxic Debris allows Garganacl to punish weak physical attacks like U-turn from Corviknight and Meloetta, while Earth Eater allows it to check and set up with Iron Defense or Curse on Ground-types like Iron Treads, Landorus-T, and Garchomp, and Water Absorb allows it to check Greninja, Inteleon, and Quaquaval lacking Close Combat. Stealth Rock pairs well with Salt Cure, as Salt Cure heavily chips common hazard removal options like Iron Treads and Corviknight, while Iron Defense and Curse allow Garganacl to act as a bulky cleaner late-game. Protect allows Garganacl to scout the opponent's move, heal with Leftovers, and force more passive damage on foes, while Earthquake and Body Press hit Magic Guard Pokemon like Quaquaval and Heatran that otherwise switch in freely. Garganacl's inability to check common special wallbreakers like Sheer Force Iron Moth and Enamorus-T makes pivots like Regieleki and Slither Wing and physical wallbreakers like Chien-Pao great partners; in return, they appreciate Garganacl's ability to maintain Stealth Rock on the field and annoy their checks like Hisuian Goodra and Corviknight with Salt Cure. Garganacl gets rapidly worn down by entry hazards when carrying Leftovers, making physically defensive hazard removal options like Corviknight and defensive Quaquaval good partners; these Pokemon also check physical wallbreakers that threaten Garganacl like Galarian Zapdos, while it checks the special wallbreakers that threaten them. The aforementioned Magic Guard Quaquaval checks Garganacl lacking Iron Defense + Body Press and can spin away Garganacl's Stealth Rock; Desolate Land Skeledirge can spinblock Quaquaval effectively, making it a good partner for Garganacl.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Armarouge": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Armarouge is a passable revenge killer that outspeeds naturally fast Pokemon like Cinderace and Chien-Pao, threatening them with its high-Base Power STAB attacks. Moreover, it can clean up late-game easily thanks to Psychic Surge, which protects it from common priority attacks such as Slither Wing's First Impression and Kingambit's Sucker Punch. Trick cripples bulky foes it can't immediately threaten like Blissey, Florges, and Garganacl. Focus Blast hits Chi-Yu and Roaring Moon, while Psyshock 2HKOes Clodsire. Utility moves in Destiny Bond and Will-O-Wisp can also be used, with the former checking setup sweepers like Talonflame and the latter punishing switch-ins. Wallbreakers like Greninja can overwhelm shared checks and appreciate Armarouge's Psychic Terrain protecting them from the likes of Ceruledge's Shadow Sneak. Armarouge's susceptibility to entry hazards makes teammates like Defog Corviknight and Rapid Spin Iron Treads valuable options.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Ceruledge": {
    "sets": [
      {"name": "Desolate Land"},
      {
        "name": "Sword of Ruin",
        "description": "<p>Sword of Ruin Ceruledge is a potent wallbreaker, thanks to its excellent coverage hitting almost everything in the tier for neutral damage, a high Attack stat, and Bitter Blade offsetting Life Orb recoil. Shadow Sneak picks off faster foes like Gengar and weakened Iron Moth, Hisuian Electrode, and Barraskewda, while Swords Dance can be used to boost Ceruledge's already high damage, letting it OHKO defensive Kommo-o, physically defensive Garchomp, and Zapdos. Close Combat OHKOes Roaring Moon, Well-Baked Body Kingambit, and Garganacl. Fast Pokemon such as Sandy Shocks, Walking Wake, and Chien-Pao force Ceruledge out, so it pairs excellently with bulky Pokemon that can wall them like RegenVest Roaring Moon, Empoleon, and Quaquaval, respectively; in return, Ceruledge can threaten their checks such as Scream Tail and Heatran. Ceruledge can quicky be worn down by Life Orb and entry hazard chip damage, so it appreciates hazard removal from the likes of Great Tusk, Corviknight, and Mandibuzz. Due to Ceruledge's frail defenses and several weaknesses, it often struggles to switch in, so pivots like Corviknight, Zapdos, and Manaphy pair excellently with it, being able to pivot it in on Pokemon it threatens.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "yokoisop", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Kinetic1000", "user_id": 552227}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Kilowattrel": {
    "sets": [
      {
        "name": "Primordial Sea",
        "description": "<p>Choice Specs Primordial Sea Kilowattrel is an explosive special attacker that takes advantage of Hurricane's and Thunder's accuracy buff in rain to rain down terror on unprepared while also checking Desolate Land users like Iron Moth and Cinderace. Weather Ball is Kilowattrel's best option against Ground-types like Iron Treads and Landorus-T which shrug off its other offensive options while also chipping Desolate Land Heatran and Cinderace. Pivoting partners like Landorus-T and Corviknight pair with Killowattrel to create a potent VoltTurn core, constantly creating momentum to easily bring each other in and deal big damage. Because of its ability to force switches, Kilowattrel appreciates teammates like Garchomp and Scream Tail that can both set entry hazards and mitigate its own frailty by switching in. Additionally, because of its weakness to Stealth Rock and inability to heal itself, hazard removers like Corviknight and Iron Treads are required to prolong its life and maximize the amount of times it can switch in. Finally, RegenVest users like Hisuian Goodra and Meloetta both comfortably shrug off Kilowattrel's attacks, so physically offensive teammates like Slither Wing and Chien-Pao can chip or remove them, escalating Kilowattrel's potency as a sweeper.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Brambleghast": {
    "sets": [{"name": "Physically Defensive", "description": "<p>Brambleghast boasts several attributes that make it a ideal choice on hazard stacking teams; its typing is ideal for spinblocking in the face of Donphan, Iron Treads, and Quaquaval, and it offers role compression in Spikes and Rapid Spin. Giga Drain allows Brambleghast to force out Dondozo as well as the aforementioned Rapid Spin users, and Fluffy further enhances its ability to beat such threats. Alternatively, Triage lets it pick off weakened sweepers like Greninja and Sandy Shocks, as well safely use Strength Sap against faster foes. Brambleghast appreciates partners such as Kilowattrel and Sandy Shocks, who threaten Corviknight and dissuade it from using Defog, letting Brambleghast's team maintain entry hazards in the face of both Rapid Spin and Defog. Poison-types like Iron Moth removing Toxic Spikes let Brambleghast not have to worry about switching into Knock Off and getting its Heavy-Duty Boots removed.</p> "}],
    "credits": {"writtenBy": [{"username": "Tanny89k", "user_id": 546606}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "UT", "user_id": 523866}, {"username": "Alexender", "user_id": 313542}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Tinkaton": {
    "sets": [
      {"name": "Well-Baked Body"},
      {
        "name": "Tinted Lens",
        "description": "<p>Tinted Lens Tinkaton is a solid physical wallbreaker that provides utility while using Tinted Lens to bypass resistances to Gigaton Hammer, turning the tables on defensive Quaquaval and Corviknight, activating teammates like Choice Band Chien-Pao that are hindered by these Pokemon. Metal Coat can be considered as it grants Tinkaton a boosting option for Gigaton Hammer without recoil, granting good odds of OHKOing frailer offensive Pokemon like Ceruledge and Magic Guard Quaquaval after minor chip. Swords Dance allows Tinkaton to more effectively wallbreak, Knock Off is excellent utility that cripples switch-ins like Magic Guard Heatran and Volcanion while annoying switch-ins like Corviknight and Iron Treads, Stealth Rock allows it to act as an offensive entry hazard setter, Protect allows it to gain more Leftovers recovery on Gigaton Hammer's cooldown turn, and Thunder Wave cripples setup sweepers that may try to capitalize on Gigaton Hammer's cooldown turn. Tinkaton appreciates slow pivots like Corviknight and Meloetta that can live a hit and pivot in Tinkaton safely. Tinkaton also appreciates faster teammates that make up for its lackluster Speed like Roaring Moon and Hisuian Electrode. Entry hazard setters like Garchomp and Ting-Lu pair well with Tinkaton, as it forces numerous switches and removes Heavy-Duty Boots.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Palafin": {
    "sets": [
      {
        "name": "Palafin",
        "description": "<p>Palafin's powerful priority offense and pivoting make it a dangerous threat even with its standard ability. Jet Punch from Palafin-H easily revenge kills dangerous threats like Kilowattrel, Sandy Shocks, and Talonflame, as well as Chien-Pao after minor chip damage. Palafin is heavily hampered by Desolate Land; to take down their users, Zen Headbutt from Palafin-H easily OHKOes Iron Moth and 2HKOes Ceruledge, while Close Combat flings Cinderace into the sun. Pivoting teammates such as Kilowattrel, Meowscarada, and Corviknight not only form dangerous pivoting cores with Palafin, but also position it to both activate Zero to Hero and fire off its powerful Jet Punch. Due to its frequent need to switch and reliance on a recoil move to wallbreak, Palafin requires effective entry hazard removers like Corviknight and Donphan; WishPass Scream Tail is also a great teammate to heal off chip damage. Even with its strong coverage moves, Palafin struggles mightily against opposing Desolate Land, so reliable switch-ins like Well-Baked Body Slither Wing are strongly recommended. Palafin struggles against Dondozo, making teammates that can punish it like Meowscarada and Spikes Garchomp good additions.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "UT", "user_id": 523866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Alexender", "user_id": 313542}, {"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Glimmora": {"sets": [{"name": "Defensive"}]},
  "Dondozo": {
    "sets": [
      {
        "name": "Curse",
        "description": "<p>A pure Water typing, titanic physical bulk, and Tablets of Ruin make Dondozo a nearly impenetrable physical wall that can blanket check common physical attackers including Cinderace, Roaring Moon, and Chien-Pao. Other options like Unaware can be used to ignore setup sweepers and wallbreakers that attempts to boost past Dondozo, while Magic Guard prevents it from being overwhelmed by entry hazards, Toxic, and Wave Crash recoil. Aside from turning it into a bulky setup sweeper, Curse also lets Dondozo contest with opposing setup from the likes of Talonflame and Kingambit, especially on non-Unaware variants. Earthquake is a necessary coverage move to hit Toxapex and Desolate Land users like Iron Moth, Cinderace, and Ceruledge. Rest + Leftovers provide much needed longevity, with Rest preventing Dondozo from being permanently crippled by Clodsire's Toxic, Iron Moth's Toxic Spikes, and Volcarona and Skeledirge's Will-O-Wisp. Special walls such as Clodsire, Ting-Lu, Garganacl, and Corviknight are necessary to deal with special attackers like Iron Moth, Sandy Shocks, and Chi-Yu respectively; the former three spread further passive damage onto foes between entry hazards, Toxic, Ruination, and Salt Cure, slowly whittling down foes for Dondozo to sweep easier. In return, Dondozo covers the likes of Quaquaval and Cinderace for them.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Tatsugiri": {
    "sets": [
      {
        "name": "Nasty Plot",
        "description": "<p>Tatsugiri is a decent Nasty Plot user that is able to threaten slower foes with its powerful STAB moves and it provides further utility by functioning as a spinner for teams that appreciate more hazard control. Magic Guard affords Tatsugiri some additional safety from entry hazards and chip damage from the likes of Salt Cure and Toxic. Instead of Hydro Pump, Surf can be used for more reliability. Tatsugiri is able to come in on and threaten spinblockers such as Skeledirge and Brambleghast, allowing it to use Nasty Plot or Rapid Spin on prediction. If left unchecked, Tatsugiri may be able to rack up enough boosts from Nasty Plot + Rapid Spin to serve as a frail sweeper. Due to its mediocre physical bulk, Tatsugiri appreciates physical walls such as Corviknight, which can also serve as a slow pivot to bring Tatsugiri safely into a favorable matchup. Tatsugiri also pairs well with physical attackers, such as Cinderace, that can threaten special walls such as Florges and Blissey, which Tatsugiri struggles against. Tatsugiri also appreciates entry hazards or other chip damage to secure KOs that it would typically miss, so Garganacl, with its ability to use Salt Cure and Stealth Rock, is a helpful teammate. Due to its low Speed, Tatsugiri appreciates faster teammates that can act as speed control, such as Chien-Pao or priority users such as Hatterene.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Alexender", "user_id": 313542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Atha", "user_id": 450411}]}, {"name": "Grammar checked by", "members": [{"username": "P Squared", "user_id": 168392}]}]}
  },
  "Clodsire": {
    "sets": [
      {
        "name": "Specially Defensive",
        "description": "<p>A unique defensive typing, reliable recovery, and remarkable special bulk enhanced by Vessel of Ruin allow Clodsire to check prominent special attackers like Iron Moth and Hydreigon. Toxic can cripple Heavy-Duty Boots users like Volcarona and Kilowattrel. Corrosion + Toxic notably hits Corviknight and Toxapex, which are common switch ins and wears them down. Toxic Spikes and Poison Jab are better on Prankster sets to punish Dark-types such as Meowscarada, Roaring Moon, and Ting-Lu; in particular, Toxic Spikes lets Clodsire match up well against hyper offense teams filled with setup sweepers. Prankster + Haze allows Clodsire to shut down setup sweepers, like Volcarona and Polteageist, while they whittle down from poison damage. Pokemon like Garganacl and Scream Tail form a hazard-stacking core with Clodsire. Physical walls like the aforementioned Pokemon, Corviknight, and Dondozo handle physical threats such as Quaquaval and Earth Eater Kingambit that can exploit Clodsire's poor physical bulk.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "skippergamez", "user_id": 620268}]}]}
  },
  "Kingambit": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Swords Dance Kingambit excels as a mid-game wallbreaker that can boost on passive foes and tear through the opponent's team with its Adaptability-boosted STAB attacks. Kowtow Cleave and Iron Head are Kingambit's main attacks, heavily damaging defensive pivots like Corviknight, Hisuian Goodra, Scream Tail, and Garganacl. Sucker Punch lets it predict and punish faster attackers like Quaquaval, Volcarona, and Slither Wing that try and come in to revenge kill. 140 Speed EVs let Kingambit outspeed uninvested Corviknight and Skeledirge. Black Glasses lets Kingambit OHKO Iron Moth with Sucker Punch. Immunity abilities like Well-Baked Body and Earth Eater are options to pick up additional setup chances. Fast endgame sweepers like Chien-Pao, Meowscarada, and Hisuian Electrode benefit from Kingambit's early-game presence, capitalizing on chipped foes and scoring easy KOs. Defensive pivots like Intimidate Corviknight, RegenVest Meloetta, and Fluffy Landorus-T can thwart revenge killers targeting Kingambit and use U-turn to bring it in safely again. Finally, Primordial Sea Zapdos can help Kingambit by forcing Corviknight and Quaquaval, two of its most consistent checks, letting it chip them on their switch-in repeatedly.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Great Tusk": {"sets": [{"name": "Physically Defensive"}, {"name": "Offensive Bulk Up", "description": "<p>Other viable abilities include: Scrappy, Sword of Ruin, Well-Baked Body, Water Absorb, Sap Sipper.</p> "}]},
  "Scream Tail": {
    "sets": [
      {
        "name": "Unaware",
        "description": "<p>Unaware Scream Tail is a premier defensive threat in the metagame, capable of walling foes such as Azelf, Roaring Moon, and Quaquaval, stonewalling most setup attempts, and being a powerful wincon. Wish + Protect is vital to ensure Scream Tail's health throughout the match, and it is also useful for healing teammates like Kingambit and Slither Wing, which often lack recovery of their own and are prone to being chipped down throughout a match. Calm Mind is suggested to ensure Scream Tail can become a late-game wincon, but Thunder Wave can be run instead as further team support for Hex users like Skeledirge and Hisuian Typhlosion. Encore and Stealth Rock can also be used for further protection against setup sweepers and role compression, respectively. Unaware ensures it can check boosted foes like Chien-Pao and opposing Calm Mind users like Triage Enamorus-T. 20 Speed EVs ensure it will always outspeed Hoopa, Volcanion, and Adamant Slither Wing. Scream Tail is taken advantage of by common Steel-, Fire-, and Poison-types like Hisuian Goodra, Hisuan Arcanine, and Iron Moth, so switch-ins to them like Heatran, Garchomp, and Alolan Muk are recommended; they also benefit from Scream Tail's Wish. Teammates that are weak to Fighting- and Psychic-type attacks like Iron Treads and Galarian Zapdos greatly appreciate Scream Tail's ability to switch into them.</p> "
      },
      {
        "name": "Pixilate",
        "description": "<p>Pixilate Scream Tail uses its excellent bulk and Speed to set up Calm Minds, while the power of Pixilate Boomburst makes up for its lackluster Special Attack stat. Wish + Protect provides Scream Tail with longevity and excellent defensive utility on a team, allowing it to help check threats like Galarian Zapdos, Garchomp, and Choice Band Slither Wing,. It can also opt to beat more of its checks with coverage; Psyshock 2HKOes Iron Moth at +1, and Focus Blast OHKOes Kingambit and 2HKOes non-RegenVest Iron Treads at +1. Scream Tail can also opt for Stealth Rock or Thunder Wave to cripple checks such as Corviknight and Heatran. Scream Tail struggles to break through common Fire-types like Heatran, Hisuian Arcanine, and Iron Moth without coverage, so it appreciates teammates like RegenVest Goodra, Primordial Sea Zapdos, and Well-Baked Body Iron Treads handling these threats. The latter two can also pivot Scream Tail into their switch-ins like Garchomp and Corviknight. Scream Tail also struggles against Unaware Pokemon like Cresselia and opposing Scream Tail; as such, teammates like Dragon Tail Hisuian Goodra, Toxapex, and Alolan Muk are appreciated to force them out.</p> "
      },
      {
        "name": "Regenerator",
        "description": "<p>Scream Tail is a solid defensive pivot for strong physical attackers such as Slither Wing and Chien-Pao that is able to have great longevity thanks to Regenerator. Scream Tail also makes for a good Wish passer for bulky teammates that lack reliable recovery such as Garchomp, Volcanion, and Zamazenta-C as it can pass Wish to them while also recovering on its own with Regenerator. Encore is used to stop set up threats like Quaquaval and Kingambit, while also being able to waste PP on Corviknight's and Zapdos's Roosts. Thunder Wave can be used to cripple fast threats like Chien-Pao and Talonflame, making it easier for them to be revenge killed, while Stealth Rock can provide entry hazard support for a team. Scream Tail can opt to run Rocky Helmet to more punish Sword of Ruin Galarian Zapdos, Meloetta, and Corviknight, Heavy-Duty Boots provides better longevity against hazards, while Choice Scarf can be used in conjunction with Trick to cripple defensive walls like Corviknight and Hisuian Goodra while also being able to stop potential set up attempts. Iron Treads makes for a good partner with Scream Tail as it can remove hazards while Scream Tail can switch-in on incoming Fighting-type moves and also Wish pass to Iron Treads, allowing it to last much longer. Slower offensive Pokemon such as Hoopa and Volcanion also appreciate Scream Tail, as its able to spread paralysis on faster offensive Pokemon, making it easier for them to sweep. Scream Tail is vulnerable to strong special attackers like Thundurus-T, Iron Moth, and Magic Guard Heatran and since it also takes up the Regenerator ability slot, it is highly recommended to run a special wall with reliable recovery like Blissey or specially defensive Iron Moth that can withstand strong special attackers.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Hera", "user_id": 414072}, {"username": "KarpeChan", "user_id": 536333}, {"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Tranquility", "user_id": 475288}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}, {"username": "cat", "user_id": 580765}, {"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Atha", "user_id": 450411}, {"username": "KarpeChan", "user_id": 536333}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Adeleine", "user_id": 517429}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Slither Wing": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Slither Wing leverages its large base Attack and STAB Close Combat, U-turn, and First Impression to serve as an extremely potent wallbreaker, revenge killer, and offensive pivot. Flare Blitz is preferred on Tinted Lens sets, allowing it to 2HKO Intimidate and Fluffy Corviknight, while Earthquake is an option to hit checks like non-Earth Eater Skeledirge and Toxapex when running Sword of Ruin. Tinted Lens better allows Slither Wing to revenge kill foes, do more damage to switch-ins with U-turn, and more easily break potential checks like Zapdos and Toxapex while Sword of Ruin grants more overall power for neutral targets such as Fluffy Quaquaval. Slither Wing pairs well with special wallbreakers like Magic Guard Hisuian Electrode and Hydreigon, which can threaten Slither Wing's checks and pivot it in on special walls for it to break. Faster offensive cleaners like Chien-Pao and Meowscarada also pair well with Slither Wing for their ability to handle fast threats and overload physical walls. Defensive pivots like Corviknight and Iron Treads also partner well with Slither Wing, as they're able to safely pivot Slither Wing it in to break wallbreak, and they also absorb revenge killing attempts; furthermore, they are particularly useful for their ability to remove entry hazards, which wear down Slither Wing quickly throughout a game as it pivots frequently.</p> "
      },
      {
        "name": "Magic Guard",
        "description": "<p>Magic Guard Slither Wing serves as a revenge killer that aims to wear down and outlast its checks. Slither Wing possesses a unique combination of a strong STAB First Impression, U-turn, and Close Combat that is further boosted by a recoilless Life Orb with Magic Guard, which also allows it to switch in freely without racking up chip damage from entry hazards. Flare Blitz allows Slither Wing to hit checks like Intimidate Corviknight harder, while Earthquake hits walls like Toxapex and Skeledirge effectively, Will-O-Wisp can cripple checks like Fluffy Quaquaval and help to wear down defensive checks with added chip damage, and Morning Sun allows Slither Wing to remain healthy throughout a game. Specially offensive threats like Hisuian Electrode and Primordial Sea Inteleon pair well with Slither Wing for its ability to pivot and bring them in on physical walls to force them out and wear them down as well as for opportunities to wallbreak; together, they form a deadly VoltTurn core. Fast physical threats like Meowscarada and Chien-Pao also work well in combination Slither Wing to continuously wear down and overwhelm common physical walls like Corviknight, Quaquaval, and Scream Tail. Reliable hazard setters like Garchomp and Heatran are also appreciated to help wear down checks like Corviknight over the game and take advantage of the plethora of switches Slither Wing forces. Defensive pivots like Corviknight and RegenVest Meloetta are recommended to help pivot Slither Wing in to wallbreak and also absorb revenge killing attempts from the likes of Galarian Zapdos and Iron Moth.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "LordBox", "user_id": 611238}, {"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "UT", "user_id": 523866}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Sandy Shocks": {
    "sets": [
      {
        "name": "Hadron Engine",
        "description": "<p>Hadron Engine Sandy Shocks is a powerful attacker with good STAB coverage and utility in Spikes. Choice Scarf outspeeds major threats like Cinderace, Choice Scarf Chi-Yu, and +2 Modest Polteageist, while Choice Specs better pressures opposing walls like Corviknight and Iron Treads. Spikes forces progress even when the opponent has a solid answer to Sandy Shocks, such as Ting-Lu. Sandy Shocks pairs well with strong attackers like Iron Moth and Hydreigon, as they take advantage of weakened special walls and the former can also fire off Terrain-boosted Discharge. Sandy Shocks also appreciates Pokemon that can switch into Ground-type attacks, such as Corviknight, which also gives a slow U-turn to bring Sandy Shocks in safely, and Garchomp, which can also help with stacking entry hazards. Entry hazard removal is particularly helpful, as the Pokemon that usually switch into Sandy Shocks, like Ting-Lu, will often use the opportunity to set entry hazards.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "SparksBlade", "user_id": 225217}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Isaiah", "user_id": 375662}]}]}
  },
  "Iron Treads": {
    "sets": [
      {
        "name": "Ground Immunity",
        "description": "<p>Iron Treads is an excellent spinner that is able to switch into common entry hazard setters such as Garchomp and Landorus-T with its own Levitate while also being able to use Knock Off on common switch-ins such as Corviknight. Iron Treads can opt to be a hazard setter itself with Stealth Rock, keep up momentum with Volt Switch on targets like Corviknight, or use Heavy Slam as a strong STAB option for Scream Tail and Chien-Pao. Levitate allows Iron Treads to be immune to Spikes while also being able to spin them away, whereas Earth Eater can be used as an alternative for better longevity against hazard setters like Garchomp and Smack Down Landorus-T. Offensive Pokemon that are weak to hazards such as Chien-Pao and Thundurus-T appreciate Iron Treads's ability to keep hazards off the field, as well as being able to pivot them in safely with Volt Switch. Strong physical attackers like Galarian Zapdos and Kingambit also are good teammates for Iron Treads, as they can more easily break through Corviknight with Knock Off support from Iron Treads. Iron Treads can be overwhelmed by coverage options from hazard setters such as Liquidation Garchomp, so running Wish Scream Tail, which can increase Iron Treads's longevity, or a secondary hazard remover like Corviknight and Quaquaval, which can also stave off hits, is recommended. Iron Treads is also vulnerable to strong Fighting-type attackers such as Galarian Zapdos and Slither Wing, so it is advised to pair it with a Fighting-resistant teammate such as Scream Tail or Fluffy Zapdos.</p> "
      },
      {
        "name": "Fire Immunity",
        "description": "<p>Well-Baked Body Iron Treads is a spinner with a great defensive typing in addition to a Fire immunity and ability to compress several roles such as item and entry hazard removal into one Pokemon. It is notably able to threaten the tier's premier spinblocker in Skeledirge, allowing it to remove hazards freely. If there is already a Stealth Rock user on the team, Iron Treads can instead use Heavy Slam to check Calm Mind Scream Tail and Enamorus-T, Rock Slide to OHKO Talonflame and Volcarona, or Volt Switch to bring in teammates safely. 236 Speed EVs are used to outspeed and threaten an OHKO on Jolly Hisuian Arcanine. Pixilate Scream Tail and Primordial Sea users like Inteleon, Greninja, and Quaquaval all appreciate Iron Treads switching into their checks in Desolate Land Fire-types like Iron Moth and Ceruledge. Physical wallbreakers like Chien-Pao and Hisuian Arcanine appreciate Iron Treads removing items from shared switch-ins like Corviknight and Quaquaval. Fighting- and Ground- types like Galarian Zapdos, Slither Wing, and Garchomp threaten Iron Treads, so defensive partners like Scream Tail, Quaquaval, and Corviknight are recommended. Iron Treads's Rapid Spin also supports the hazard stacking effort from partners like Garchomp and Ting-Lu. Certain Fire-types like Cinderace and Ceruledge can still threaten Iron Treads with their coverage moves, so it appreciates a secondary check to them like Primordial Sea Zapdos.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}, {"username": "KarpeChan", "user_id": 536333}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "cat", "user_id": 580765}, {"username": "UT", "user_id": 523866}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "berry", "user_id": 226455}, {"username": "ken", "user_id": 594478}, {"username": "Lumari", "user_id": 232216}]}]}
  },
  "Iron Jugulis": {
    "sets": [
      {"name": "Sheer Force", "description": "<p>With high-Base Power moves and decent Special Attack and Speed, Iron Jugulis is a solid wallbreaker that can outspeed and threaten common specially defensive foes, like Garchomp and Garganacl. Iron Jugulis offers a notable niche, as Hurricane + Dark Pulse + Focus Blast can hit every viable Pokemon for neutral damage. Taunt disrupts attempts to heal, set up, or set entry hazards, allowing Iron Jugulis to better handle Pokemon such as Blissey and Clodsire. Iron Jugulis struggles against special walls like Florges and Scream Tail, so physically offensive teammates like Cinderace and Ceruledge are necessary to break through them. Due to its frailty, it enjoys teammates like Slither Wing and Corviknight that can pivot it in, the latter of which can also remove hazards with Defog. Iron Jugulis also appreciates entry hazard setters such as Ting-Lu, which can enable it to secure KOs that it would typically miss, such as Garganacl.</p> "}
    ],
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "Alexender", "user_id": 313542}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Iron Moth": {
    "sets": [
      {
        "name": "All Out Attacker",
        "description": "<p>Iron Moth is a potent and aggressive special attacker with access to relevant STAB attacks and convenient coverage options. Flamethrower and Sludge Wave help Iron Moth dispatch of Almost Any Ability's staple Steel- and Fairy-types like Corviknight and Scream Tail as well as outputting massive damage to anything that doesn't resist its attacks. Fire Blast can be used for more damage output, outdamaging RegenVest Meloetta and Hisuian Goodra's Regenerator healing. Energy Ball can be used instead of Sludge Wave to help Iron Moth's matchup with Well-Baked Body Iron Treads and Regenerator Ting-Lu. Dazzling Gleam improves Iron Moth's offensive chances against Dragon-types like Garchomp and Roaring Moon. Discharge is a coverage alternative that hits Well-Baked Body Corviknight as well as becoming a monstrously strong offensive option when combined with Iron Moth's alternate ability, Hadron Engine. Additionally, Hadron Engine helps Iron Moth score a 2HKO on specially defensive Garchomp with Dazzling Gleam. Balance and offense teams that appreciate explosive offensive power look forward to having Iron Moth as a teammate, as it can easily wipe some defensive pivots like Corviknight and Scream Tail off of the opponent's team. Additionally, Iron Moth struggles heavily against special walls like Garchomp, Garganacl, and RegenVest Hisuian Goodra, so heavy hitters like Kingambit and Slither Wing can be used to make progress against these, making it easier for Iron Moth to sweep late-game. Finally, tools found on hyper offense teams like dual screens, Sticky Web, and entry hazard stacking help Iron Moth more effectively avoid revenge killers and more easily eliminate any of its switch-ins.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "ken", "user_id": 594478}]}]}
  },
  "Iron Thorns": {"sets": [{"name": "Dragon Dance"}]},
  "Chien-Pao": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Chien-Pao is a fast and hard-hitting attacker able to burst through many weakened teams with little struggle, with its strong Ice- and Dark-type STAB moves and a Choice Band to increase its already good Attack to threaten many popular defensive Pokemon such as Great Tusk, Mandibuzz, and Zapdos. Chien-Pao uses Sacred Sword in order to guarantee an OHKO on Pokemon like Kingambit, Heatran, and Hisuian Goodra, as well as heavily chipping Zamazenta-C. It can also use Lash Out over Crunch, which can 2HKO Intimidate Corviknight after Stealth Rock damage, though getting extra chip on Corviknight can help to guarantee the 2HKO. With Chien-Pao having one of the highest Speed tiers, it's able to pick up OHKOs on many frailer offensive Pokemon like Ogerpon-C and Gengar, it also works excellently as a revenge killer because of Ice Shard and it's its aforementioned high Speed able to take down weakened Pokemon or force out Pokemon like Ceruledge, Zapdos, and Azelf. Offensive Pivots such as Barraskewda and Hisuian Electrode appreciate Chien-Pao's presence, as they like being able to pivot into Chien-Pao to deal with Hisuian Goodra or Corviknight. Chien-Pao is weak to entry hazards, limiting how many times it can come in, so teammates like Corviknight, Mandibuzz, and Great Tusk can all help with it whilst also taking hits that Chien-Pao can't take and pivoting to get it in safely. Even with help from pivoting, Chien-Pao does have a hard time breaking through common foes such as defensive Corviknight, Unaware Scream Tail, and Quaquaval, which can all switch in on it fairly easily, but the help of teammates like Mixed Garchomp, Magic Guard Heatran, and Hisuian Electrode can help deal with its checks.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Hiusi guy", "user_id": 603640}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Ting-Lu": {
    "sets": [
      {"name": "Specially Defensive", "description": "<p>Ting-Lu's absurd mixed bulk and unusual typing make it a formidable mixed wall, capable of checking several key threats such as Kingambit, Ceruledge, and Iron Moth. Ting-Lu's best entry hazard depends on its team, as it can form a strong hazard-stacking core with Stealth Rock and/or Spikes setters like Garganacl and Glimmora. Ruination spreads consistent damage, especially against Ground-immune foes like Earth Eater Kingambit, and forces defensive Pokemon like Corviknight, Hippowdon, and Blissey to waste their recovery PP. Whirlwind forces entry hazard damage onto foes and ensures Ting-Lu isn't setup fodder for threats like Talonflame and Quaquaval. The Speed IVs let it underspeed Corviknight to punish its Roost with Earthquake. Foes like Scream Tail and Lucario can endanger Ting-Lu by targeting its weaknesses, so Corviknight is a good teammate that also provides Defog.</p> "},
      {"name": "RegenVest Wall", "description": "<p>Ting-Lu's excellent defensive stats and useful typing let it check a plethora of special attackers such as Hydreigon and Iron Moth. Throat Chop provides STAB damage and lets it beat Boomburst users, Ruination + Sand Tomb traps and eliminates opposing Ting-Lu and Skeledirge, while also draining recovery PP from Hippowdon and Blissey. Some special attackers like Scream Tail can prove dangerous, so pairing Ting-Lu with Corviknight and Desolate Land Iron Moth are good options. Ting-Lu can switch into weaker physical attackers like Roaring Moon, but it should be used as help for the main physical wall on the team. Ting-Lu is vulnerable to opposing setup sweepers, so teammates like Unaware Corviknight are greatly appreciated. Corviknight can also reduce Ting-Lu's weakness to entry hazards.</p> "}
    ],
    "credits": {"writtenBy": [{"username": "royalfluxh", "user_id": 493260}, {"username": "PociekMociek", "user_id": 345494}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Isaiah", "user_id": 375662}, {"username": "Lunaflare", "user_id": 430518}]}]}
  },
  "Chi-Yu": {
    "sets": [
      {
        "name": "Choice Item Attacker",
        "description": "<p>Chi-Yu's strong base stats and excellent STAB coverage make it a flexible offensive threat. Choice Specs provides maximum wallbreaking power, notably allowing it to OHKO physically defensive Ting-Lu with Desolate Land + Overheat, whereas Choice Scarf gives it the Speed to clean late-game and chase out faster threats like Cinderace and Chien-Pao. Desolate Land provides the most damage amplification and comes with an immunity to Water, whereas No Guard enables Chi-Yu to liberally spread burns with Inferno. Psychic is useful coverage to hit Clodsire and Iron Moth super effectively; alternatively, Will-O-Wisp allows Desolate Land sets to reliably spread burn, however Chi-Yu's poor bulk means it can be dangerous to use. Chi-Yu's best fit is on balance and offense teams that appreciate its high damage output, as well as its good matchups against common special walls like RegenVest Iron Treads. Bulky pivots, like the aforementioned Corviknight and Iron Treads, make particularly good Chi-Yu partners because both can clear entry hazards, particularly Stealth Rock.</p> "
      },
      {
        "name": "Nasty Plot",
        "description": "<p>Thanks to its high Special Attack and decent Speed, Chi-Yu is a potent wallbreaker that makes use of Nasty Plot and its unresisted STAB combination to tear through common walls like Sand Stream Garganacl and non-Unaware Florges. Chi-Yu generally prefers to run Heavy-Duty Boots to avoid entry hazard damage, but Life Orb can be run on Sheer Force sets for extra power. Chi-Yu also has several Fire-type STAB moves to choose from: Fire Blast is the most powerful, Flamethrower is the most consistent option, and Inferno is used on No Guard sets to punish switch-ins like Garganacl and Ting-Lu with a burn. Chi-Yu does struggle against special walls like Clodsire and Blissey, so physically offensive Pokemon like Meowscarada and Kingambit make good teammates. Chi-Yu is also physically frail, so it appreciates teammates like Corviknight and Avalugg that can switch into strong physical attacks and Wish passers like Florges and Scream Tail that can help it stay healthy.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Isaiah", "user_id": 375662}]}]}
  },
  "Roaring Moon": {
    "sets": [
      {"name": "Fluffy"},
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Roaring Moon is a fierce wallbreaker that dents large holes in balance teams and has specific coverage to beat its would-be checks. Strong Jaw-boosted Fire Fang threatens Zamazenta-C and Fluffy Corviknight attempting to tank Crunch while Thunder Fang OHKOes Galarian Zapdos and 2HKOes defensive Quaquaval. U-turn allows it to maintain momentum in the face of hard counters like Hippowdon and a healthy Corviknight while also being a midground option for predicted switch-ins. An Adamant nature gives Roaring Moon a chance of OHKOing Hisuian Goodra and is guaranteed to 2HKO Corviknight and Quaquaval, while a Jolly nature allows it to outspeed and threaten Azelf and Iron Moth. Roaring Moon pairs well with other physical wallbreakers like Swords Dance Chien-Pao and Meowscarada that can clean up teams after checks like Zamazenta-C and Quaquaval have been removed. Pivots like Zapdos, Regieleki, and Hisuian Electrode form a VoltTurn core with Roaring Moon that wears down each other's checks. Roaring Moon's unimpressive physical bulk and weakness-laden typing mean that it is a prime target of revenge killers like Slither Wing and Triage Enamorus-T; walls like Corviknight and Hisuian Goodra pair well with Roaring Moon, as they absorb revenge killing attempts while providing defensive utility that Roaring Moon lacks.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Walking Wake": {
    "sets": [
      {
        "name": "Choice Item",
        "description": "<p>Walking Wake's excellent Special Attack, good Speed, and nearly unresisted STAB combination allow it to stand out as either a threatening wallbreaker or powerful speed control depending on its choice of item. Knock Off cripples switch-ins such as Empoleon and RegenVest Manaphy, Scald provides a more reliable STAB option on non-Primordial Sea sets while also threatening a burn on potential switch-ins, while Dragon Pulse provides a more reliable Dragon-type STAB move. Flip Turn is used in order to gain momentum for Walking Wake's teammates while also pivoting out of unfavorable matchups such as against Empoleon and Blissey. Primordial Sea allows Walking Wake to run Weather Ball instead of Hydro Pump, trading power for accuracy while also giving Walking Wake an easier time switching into Fire-types thanks to the Fire-type immunity. Dragon's Maw significantly boosts the power of Walking Wake's Dragon-type attacks, notably allowing it to OHKO RegenVest Manaphy after a Knock Off and one layer of entry hazards, at the cost of not increasing the power of its Water-type attacks and providing no additional defensive benefit. A Choice Specs can be used in order to increase Walking Wake's effectiveness as a wallbreaker, notably allowing non-Primordial Sea sets to 2HKO RegenVest Manaphy and Hisuian Goodra with Draco Meteor after a Knock Off, while a Choice Scarf can be used to outspeed and threaten an OHKO against would-be offensive checks, such as Weavile, Chien-Pao, and Roaring Moon. Walking Wake appreciates offensive teammates such as Galarian Zapdos, Meowscarada, and Ogerpon-C, which can pressure switch-ins like Empoleon, RegenVest Manaphy, and Desolate Land Heatran. Fast teammates such as Barraskewda and Choice Scarf Azelf also pair well with Walking Wake, as they appreciate the holes it breaks in the opponent's team while forming a VoltTurn core with the momentum they generate, potentially allowing them to sweep late-game. These teammates can also force out Walking Wake's offensive checks, such as Weavile, Chien-Pao, and Roaring Moon, which can outspeed it and threaten it with an OHKO.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Kinetic1000", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Iron Leaves": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>With its high Attack stat and variety of Sharpness-boosted moves, Iron Leaves is a decent wallbreaker that can OHKO common metagame threats like Garganacl and Quaquaval. Sacred Sword allows Iron Leaves to hit Grass- and Psychic-resistant foes like Kingambit and Hydreigon, while Wild Charge threatens Flying-types like Talonflame and Corviknight. Iron Leaves struggles with being prediction-reliant and having low physical bulk, especially with its 4x weakness to the extremely prevalent U-turn, which makes wrong predictions very punishing. Therefore, having defensive teammates like Ting-Lu and Corviknight that can repeatedly pivot it in safely are necessary. Due to its lack of recovery and need for repeated switching, Iron Leaves appreciates entry hazard removers like Iron Treads to keep it from getting worn down. Hadron Engine users like Sandy Shocks are also great teammates that power up both Psyblade and Wild Charge with Electric Terrain.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "Alexender", "user_id": 313542}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Ogerpon-Hearthflame": {"sets": [{"name": "Swords Dance"}]},
  "Ogerpon-Cornerstone": {"sets": [{"name": "Swords Dance"}]}
}