{
  "Ditto": {
    "sets": {
      "Choice Scarf": {
        "description": "<ul> <li>Choice Scarf Ditto fills a role as a revenge killer with a chance to reverse sweep entire teams. Its presence discourages setup from foes such as Zacian-C, Mega Salamence, and Primal Groudon. Its ability to generate endless PP also helps against stall teams.</li> <li>In the rare case there is a Ditto mirror, the EVs, IVs, and nature maximize the chance that the opposing Ditto’s Imposter ability activates first, thus causing it to run out of PP first.</li> <li>Tera Ghost allows Ditto to block Extreme Speed from Arceus, since it cannot OHKO Arceus with Extreme Speed or Tera Ghost Arceus with Shadow Claw at +2 from full, while Arceus can at the expense of Tera Normal thanks to Ditto’s low HP stat.</li> <li>Tera Fairy provides a resistance to Sucker Punch and Foul Play, making it harder for Yveltal and Arceus-Dark to revenge kill Ditto. Tera Fairy also provides a useful immunity to Dragon-type moves, letting Ditto soft check Eternatus and Palkia-O.</li> <li>Tera Dark also resists Sucker Punch and Foul Play while also providing a resistance to Marshadow’s Shadow Sneak. Thanks to Tera Dark’s immunity to Psychic, it allows Ditto to absorb powerful attacks such as +1 Light that Burns the Sky from Ultra Necrozma and Psycho Boost from Deoxys-A.</li> <li>Hidden Power Ice allows Ditto to hit Zygarde and Mega Salamence with a super effective move in the rare case Ditto copies a Marshadow with Hidden Power.</li> <li>Ditto should be swapped in carefully, as any unnecessary damage can compromise its role. Due to its low HP stat, Ditto struggles defensively even when transforming into walls such as Chansey.</li> <li>Ditto greatly helps in the hyper offense matchup by restricting the opponent from setting up in addition to Imposter taking away Sticky Web's Speed drop, keeping teammates such as Eternatus, Ho-Oh and Yveltal from being overwhelmed by boosting threats such as Primal Groudon, Zacian-C, and Ultra Necrozma.</li> <li>Ditto can be used to greatly help in the stall matchup thanks to its ability to generate endless PP. Ditto stays healthy by copying recovery moves from Chansey, Dondozo, and Arceus-Dark. Ditto also increases its longevity by copying abilities such as Natural Cure from Chansey and Regenerator from Ho-Oh, and Alomomola.</li> <li>Ditto is a good fit on balance teams, as it helps Defoggers such as Ho-Oh and Yveltal from being overwhelmed by hyper offense threats such as Primal Groudon and Ultra Necrozma. In return, Ho-Oh and Yveltal keep entry hazards off the field, since Ditto can easily get worn down by them.</li> <li>Teammates such as Primal Groudon and Zygarde are free to use more offensive sets thanks to Ditto being able to check threats such as Zacian-C, Eternatus, and opposing Primal Groudon for them. In addition, Zygarde appreciates Ditto allowing it to run a specially defensive set for Arceus-Water instead.</li> <li>Due to being locked into one move, Ditto can be countered by a surprise Tera from threats such as Tera Fairy Eternatus and Tera Ghost Arceus, so another form of reliable revenge killing such as Arceus and Choice Band Marshadow is appreciated.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652323, "username": "Anchor9"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 529732, "username": "adem"}]}, {"name": "Grammar checked by", "members": [{"user_id": 327515, "username": "Zrp200"}, {"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Mewtwo": {"sets": {"Setup Sweeper": {}}},
  "Ho-Oh": {
    "sets": {
      "Defensive": {
        "description": "<ul> <li>Ho-Oh shines as an entry hazard control option that can cripple and scout a sizable portion of the metagame with little risk while also keeping itself healthy with Regenerator. Its Fire / Flying typing and solid mixed bulk enable it to come into a variety of foes such as Arceus-Ground, Arceus-Fairy, and Mega Salamence. Its typing specifically grants it an immunity to burns from the likes of Giratina-O and Arceus-Dark and Toxic Spikes from Eternatus.</li> <li>Sacred Fire acts as a solid STAB option that also lets Ho-Oh apply pressure on Steel-types—which are immune to Toxic—like Necrozma-DM and Zacian-C while also potentially crippling foes with a burn, rendering it difficult to switch into.</li> <li>Toxic allows Ho-Oh to cripple switch-ins such as Zygarde, Primal Groudon, Primal Kyogre, Giratina-O, opposing Ho-Oh, and support Arceus formes without Refresh.</li> <li>Whirlwind provides a phazing option to disrupt setup sweepers such as Necrozma-DM and Zygarde.</li> <li>The physical bulk avoids an OHKO from Zacian-C's Wild Charge at +2 Attack and Choice Band Tera Flying Rayquaza's Dragon Ascent while also letting it never be 2HKOed by a +1 Eternatus Dynamax Cannon.</li> <li>Tera Grass helps against foes such as Marshadow, Arceus-Ground, and especially Zygarde, as Zygarde's Thousand Arrows hits the entire metagame for neutral or super effective damage otherwise. Tera Grass also makes it a good check for Water-types such as Palkia-O, Primal Kyogre, and Arceus-Water.</li> <li>Tera Ground gives Ho-Oh the option to outplay foes that try to hit it with super effective Rock- and Electric-type coverage like Marshadow and Flutter Mane and also eases the matchup against Eternatus and Zekrom.</li> <li>Tera Dark provides Ho-Oh with the capability to easily check Psychic-, Dark-, and Ghost-types like Mega Mewtwo Y, Ultra Necrozma, Yveltal, and Lunala. With it, Ho-Oh can also ignore Taunt from Grimmsnarl, allowing it to remove dual screens with Defog.</li> <li>By Terastallizing, Ho-Oh minds Stealth Rock significantly less, which can be crucial if it loses its Heavy-Duty Boots, with Tera Ground in particular giving the most longevity via resisting the Rock-type. However, it also becomes vulnerable to other entry hazards such as Spikes and Toxic Spikes.</li> <li>Ho-Oh's utility and defensive traits let it fit well on balance and more defensive team structures that appreciate a hazard control option, pivot, and phazer.</li> <li>Avoid keeping Ho-Oh on targets that can use Knock Off to remove its Heavy-Duty Boots. Otherwise, Ho-Oh will be forced to either compromise its longevity and utility or Terastallize.</li> <li>Ho-Oh should be preserved at good health if the other team has strong threats that it's meant to check, such as Arceus-Ground and Zygarde. When handling setup sweepers, it's more consistently reliable for Ho-Oh to use Whirlwind than to inflict a burn with Sacred Fire. However, this strategy shouldn't be relied on too much late-game, as Whirlwind fails when only a single foe remains.</li> <li>As it's tasked with answering many different threats, Ho-Oh can get overwhelmed if heavily relied on. Therefore, Pokemon such as Primal Groudon, Arceus-Poison, and Necrozma-DM help Ho-Oh as secondary answers to foes such as Zacian-C.</li> <li>Pokemon such as Marshadow, Zacian-C, Eternatus, and Primal Groudon often run super effective coverage that can KO Ho-Oh; as such, it appreciates allies that can come into them, which include Giratina-O, Arceus-Ground, and Necrozma-DM.</li> <li>Ho-Oh appreciates hazard setters because Sacred Fire, Toxic, and Whirlwind can force a lot of switches and thus deal massive amounts of chip damage, so Pokemon such as Primal Groudon and Eternatus are great allies in this regard.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 434487, "username": "Bobsican"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 434487, "username": "Bobsican"}]}, {"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 611966, "username": "Weirdhamster"}]}, {"name": "Grammar checked by", "members": [{"user_id": 229690, "username": "queez"}]}]}
  },
  "Salamence": {
    "sets": {
      "Dragon Dance": {
        "description": "<ul> <li>Mega Salamence excels as an offensive powerhouse due to its formidable Attack stat, access to Dragon Dance, and its potent ability, Aerilate, achieving multiple roles like wallbreaker, sweeper, and late-game cleaner.</li> <li>Double-Edge is Mega Salamence's most powerful STAB move, being able to 2HKO most defensive Pokemon such as Yveltal and Ferrothorn. Return serves as a weaker but safer STAB move, although it misses out on the 2HKO on foes like Ho-Oh and offensive Primal Groudon.</li> <li>Earthquake is Mega Salamence's best coverage move to hit Steel-types like Zacian-C and Necrozma-DM and to hit Primal Groudon almost as hard as Double-Edge without the recoil damage. At +1, it can OHKO Zacian-C and additionally OHKO Zekrom after Stealth Rock.</li> <li>Roost provides Mega Salamence with reliable recovery and helps it find more setup opportunities throughout the battle, while Facade punishes foes that try to status it like Ho-Oh, Primal Groudon, Arceus-Water, and Arceus-Dark at the cost of making Mega Salamence more sensitive to chip damage while setting up.</li> <li>Mega Salamence, especially when not running Roost, should aim to switch in after a foe has fainted or on a predicted Earthquake from foes like Primal Groudon, Necrozma-DM, and Arceus. By pressuring these Pokemon to switch out, it can take on the opportunity to set up and start wearing down its checks.</li> <li>In certain scenarios, retaining access to Salamence's Intimidate can prove advantageous due to its capability to mitigate foes that threaten to set up such as Rayquaza and Necrozma-DM. Additionally, the Attack drop can let Mega Salamence avoid a 2HKO from Choice Band Marshadow's Poltergeist, offensive Necrozma-DM's Sunsteel Strike, and Rayquaza's Dragon Ascent and set up on them.</li> <li>Having weaknesses to Fairy and Ice, Mega Salamence appreciates Fire- and Steel-type teammates such as Primal Groudon, Necrozma-DM, and Zacian-C that can threaten the likes of opposing Zacian-C, Arceus-Fairy, and Calyrex-I.</li> <li>Fairy-type teammates like Zacian-C and Arceus-Fairy love Mega Salamence's ability to check Steel- and Fire-types such as Magearna and Primal Groudon and threaten them with Earthquake.</li> <li>Mega Salamence works well on hyper offense teams, and suicide entry hazard leads such as Deoxys-S and Glimmora are invaluable in helping it sweep; the aforementioned Pokemon can also prevent hazards. Mega Salamence also appreciates dual screens support from Deoxys-S and Grimmsnarl to make it harder to knock out.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"user_id": 652323, "username": "Anchor9"}, {"user_id": 434487, "username": "Bobsican"}, {"user_id": 327515, "username": "Zrp200"}]}, {"name": "Grammar checked by", "members": [{"user_id": 327515, "username": "Zrp200"}, {"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Kyogre": {
    "sets": {
      "Wallbreaker": {
        "description": "<ul> <li>Primal Kyogre is a great wallbreaker thanks to an amazing movepool, high Special Attack, and a great ability in Primordial Sea.</li> <li>Water Spout is recommended due to its preposterous damage output, especially at full health under rain as it is able to 2HKO foes that resist it like Ferrothorn and OHKO neutral targets like Necrozma-DM.</li> <li>Origin Pulse is an alternative that can be used for more consistent damage, especially when Primal Kyogre is chipped, but it has worse accuracy and also doesn't deal as much damage as Water Spout, as it fails to meet most of the benchmarks above.</li> <li>Ice Beam deals reliable damage against Zygarde-C, Eternatus, Mega Salamence, Giratina-O, and Primal Groudon on the switch in, and also can be used as a backup option if Primal Kyogre is chipped.</li> <li>Thunder is recommended to deal with opposing Primal Kyogre and Arceus-Water, which Primal Kyogre would otherwise struggle against.</li> <li>Calm Mind allows Primal Kyogre to 2HKO on walls like Ferrothorn, Primal Groudon, and specially defensive Eternatus as well as avoid the 2HKO from Meteor Beam Eternatus and opposing Primal Kyogre's Thunder.</li> <li>Primal Kyogre should be used early-game to blow holes in an opponents' defensive cores and it can easily use Calm Mind on Pokemon like Ho-Oh and Zygarde.</li> <li>Primal Kyogre best fits on bulky and hyper offense teams that appreciate its great bulk and monstrous Special Attack.</li> <li>Primal Kyogre has a shaky matchup against Primal Groudon, due to the unique interaction between Desolate Land and Primordial Sea as well as not switching into Primal Groudon very well. Therefore, Pokemon that Primal Groudon struggles against, like Zygarde-C and Arceus-Ground, are appreciated as teammates.</li> <li>Primal Kyogre also has average physical bulk and is threatened by strong physical attackers like Marshadow and Zacian-C. Therefore, defensive checks like Yveltal, Zygarde-C, and Ho-Oh are also beneficial as teammates. Yveltal and Ho-Oh can also remove entry hazards, a big obstacle for Primal Kyogre.</li> </ul>"
      },
      "Defensive": {
        "description": "<ul> <li>Defensive Primal Kyogre is an oppressive force against bulkier teams, as it is able to shrug off weak attacks and passive damage that significantly hinder wallbreaker sets. Additionally, its base 180 Special Attack in conjunction with Scald and Ice Beam enables Primal Kyogre to trade with many offensive threats such as Arceus-Ground and Mega Salamence, even without offensive investment. These traits make Primal Kyogre an essential component of the defensive backbone on many balance teams.</li> <li>Aside from powering up Primal Kyogre's attacks, Calm Mind enables Primal Kyogre to turn the tables on some switch-ins that typically check wallbreaker sets, such as Eternatus, Ferrothorn, and Ditto, by turning them into setup fodder. It can also be used to gain a free boost on Primal Groudon that switches in to sacrifice itself to entry hazards and reset the weather.</li> <li>Sleep Talk can be used instead of Calm Mind to alleviate some of Primal Kyogre's issues against offensive teams where it would otherwise be unable to use Rest. However, this does come at the cost of diminished utility against defensive teams, as Primal Kyogre is reliant on Calm Mind to break through Pokemon such as Giratina and Chansey.</li> <li>Scald is Primal Kyogre's STAB move of choice due to its higher PP, accuracy, and ability to hinder physical attackers such as Arceus and Calyrex-I.</li> <li>Ice Beam provides Primal Kyogre the ability to hit Primal Groudon, which is its primary switch-in on most teams. While it only 4HKOes Primal Groudon, it will be quickly worn down due to its vulnerability to all entry hazards and its lack of reliable recovery. Furthermore, Ice Beam prevents Primal Kyogre from being set up on by the many threatening Dragon-types of the tier, such as Ultra Necrozma, Eternatus, and Mega Salamence. Ice Beam also plays a role in enabling Primal Kyogre to function as a wincon against stall teams, as it would otherwise run out of Scald PP.</li> <li>Rest is primarily used against bulkier balance and stall teams to help accumulate Calm Mind boosts, as most of the Pokemon found on these teams cannot meaningfully damage it. Rest generally should not used against more offensive teams, as the two free turns are highly exploitable and will likely be leveraged by Pokemon such as Mega Salamence, Xerneas, and Arceus to boost into a range where they are able to sweep. As such, Primal Kyogre is better off attempting to trade with or weaken a Pokemon on more offensive teams.</li> <li>This EV spread allows Primal Kyogre to survive some very powerful attacks that one would assume would knock it out. For example, Primal Kyogre is 2HKOed by +1 Mega Salamence's Double Edge and +1 Zacian-C's Wild Charge and 3HKOed by uninvested Primal Groudon's Precipice Blades. Additionally, unboosted Primal Kyogre is 3HKOed by Xerneas's Moonblast before Geomancy and Life Orb Yveltal's Dark Pulse with this EV spread.</li> <li>Defensive Primal Kyogre generally should not be used early-game, though it can be used as a lead against hyper offense teams, as Scald provides the chance to OHKO dedicated leads such as Shuckle, Smeargle, and Glimmora due to its burn chance, preventing them from setting multiple entry hazards. Primal Kyogre generally struggles against more offensive structures due to its limited hit-taking capabilities and often trades against a singular Pokemon at best. Defensive Primal Kyogre usually finds its first entry point mid-game, and it can use Ice Beam to heavily chip Primal Groudon that switches in for the benefit of teammates such as Xerneas and Zacian-C. Against balance teams, Primal Kyogre plays a critical role in dismantling or weakening the defensive backbone of the opposing team to allow more offensively inclined teammates such as Power Herb Eternatus and Arceus-Ground to sweep.</li> <li>Primal Kyogre has the tendency to be overwhelmed by powerful attackers, especially Swords Dance Primal Groudon, which capitalizes on the free turn where Primal Kyogre is forced out. Zygarde, Arceus-Ground, and Arceus-Dark can check powerful physical attackers while also appreciating Primal Kyogre's ability to deal with Ho-Oh especially since Zygarde specifically can be frustrated by Ho-Oh's phazing. Additionally, due to Primal Kyogre's middling matchup into offensive structures, Marshadow and Ditto make good teammates due to their ability to revenge kill many of the most threatening Pokemon found on these structures, such as Ultra Necrozma and Zacian-C.</li> <li>Primal Kyogre also appreciates both entry hazard support and removal, as both Primal Kyogre and Pokemon that threaten it are pushed into KO range with the presence of entry hazards. Consequently, Ho-Oh and defensive Primal Groudon with Overheat are excellent teammates. Ho-Oh is the best Defogger and defensive pivot in the tier and also phazes many Pokemon that may view Primal Kyogre as a setup opportunity, such as Xerneas and Zacian-C. Primal Groudon provides entry hazard support in the form of Stealth Rock or Spikes.</li> <li>Although Primal Kyogre will not sweep stall teams by itself, it requires little support to achieve a gamestate where it is able to do so. As in other matchups, Primal Kyogre generally does not have an early-game presence, as it relies on teammates such as Overheat Primal Groudon and Ho-Oh to set and remove entry hazards. Overheat Primal Groudon eases the burden on Primal Kyogre against stall teams, as it 2HKOes Dondozo, a staple on stall teams, after Stealth Rock. Additionally, Primal Kyogre requires some help against Confide Chansey. Consequently, Eternatus is an excellent teammate, as Pressure in conjunction with bulk allows it to absorb Confide and Seismic Toss, which allows Primal Kyogre to make progress.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523420, "username": "bumboclaat"}, {"user_id": 629794, "username": "LOrd Fernado"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 527276, "username": "Techno"}, {"user_id": 594478, "username": "ken"}]}]}
  },
  "Groudon": {
    "sets": {
      "Defensive": {
        "description": "<ul> <li>Primal Groudon is among the best support Pokemon in National Dex Ubers thanks to its great typing, impressive base stats, wide movepool, and incredible ability in Desolate Land.</li> <li>Stealth Rock provides chip damage to many staples of the tier like Arceus-Fairy, Primal Kyogre, and opposing Primal Groudon. Spikes is an option that deals more damage to Rock-resistant foes, like Arceus-Ground and Zygarde.</li> <li>Precipice Blade 2HKOes neutral targets like Primal Kyogre, and it has a solid chance to OHKO Eternatus as well as a small chance to OHKO opposing offensive Primal Groudon after one layer of Spikes.</li> <li>Rock Tomb hits Ho-Oh and Yveltal for super effective damage and is a great tool to cripple Speed-boosting foes like Mega Salamence, Ultra Necrozma, and Scale Shot and Dragon Dance Zygarde. Overheat is an option that hits neutral and Fire-weak targets like Arceus-Ground, Tera Grass Ho-Oh, and Ferrothorn for heavy damage. It is also Primal Groudon's best option against Dondozo, 3HKOing it while Unaware makes Dondozo ignore Overheat's Special Attack drop.</li> <li>Toxic cripples common switch-ins to Primal Groudon such as Arceus-Ground, Zygarde, and Arceus-Dark and puts them on a timer. Roar can be used instead to phaze setup sweepers that would try to use Primal Groudon as setup fodder, like Dragon Dance and Calm Mind Arceus-Ground, Dragon Dance and trapper Zygarde, and Mega Salamence. If entry hazards are up, it can also be used to rack up damage against the opposing team.</li> <li>The given EV spread lets Primal Groudon avoid being OHKOed by Life Orb Deoxys-A's Psycho Boost, with the rest being used to augment Primal Groudon's physical bulk, notably allowing it to survive +2 Tera Ground Zacian-C's Tera Blast. An Impish nature is prefered if Primal Groudon is running Rock Tomb, while Relaxed is preferred if Primal Groudon is running Overheat.</li> <li>This set fits best on bulky offensive teams that need a solid entry hazard setter that is not passive against common Defoggers like Ho-Oh and Yveltal.</li> <li>Tera Grass Ho-Oh can help Primal Groudon to deal with Primal Kyogre, which can be somewhat tricky for Primal Groudon to handle alone. Most of the time, trading HP against the opposing Primal Groudon is not wanted, so solid answers to it like Zygarde and Giratina-O are welcome additions. Good answers to Arceus-Ground are also recommended, such as defensive Primal Kyogre and the aforementioned Ho-Oh.</li> </ul>"
      },
      "Double Dance": {
        "description": "<ul> <li>Primal Groudon's huge Attack and great defensive profile make it a fantastic wallbreaker and sweeper with Swords Dance and Rock Polish.</li> <li>Stone Edge hits Flying-types such as Ho-Oh and Mega Salamence. Heat Crash is an alternative that provides a perfectly accurate Desolate Land-boosted STAB option that hits certain foes harder than Precipice Blades, such as Ferrothorn, though running it leaves Primal Groudon unable to hit foes such as Giratina-O for neutral damage. However, most Fire-resistant Flying-types, like Ho-Oh and Mega Salamence, still take heavy damage from Heat Crash.</li> <li>The given EV spread maximizes Primal Groudon's Attack while providing just enough Speed to outspeed Choice Scarf Yveltal after using Rock Polish, with the rest being dumped into HP to increase its bulk.</li> <li>Primal Groudon best fits on offense teams looking for a powerful threat that can act as a sweeper or wallbreaker depending on the situation. Typically, it should use Swords Dance against defensive teams and Rock Polish against offensive teams. Primal Groudon's ability, typing, and bulk also let it check some foes in a pinch, like Primal Kyogre and Arceus.</li> <li>Entry hazard setters such as Deoxys-S can help chip Primal Groudon's checks, such as Zygarde-C and Arceus-Ground, into KO range. Grimmsnarl can provide dual screens support to help Primal Groudon set up, sometimes even allowing it to set up both Swords Dance and Rock Polish. Both of those teammates carry Taunt, which can stop the opposing team from setting up hazards, making it easier for Primal Groudon to set up.</li> <li>Offensive teammates such as Mega Salamence and Zacian-C can help Primal Groudon's team maintain offensive pressure, either by breaking holes for it or by taking advantage of the holes it makes.</li> <li>Certain physically bulky Ground-types, such as Arceus-Ground and Zygarde-C, can beat Primal Groudon one-on-one and sometimes even set up alongside it. Primal Kyogre is effective at handling these foes, while Flying-types like Yveltal and Mega Salamence can switch into them in a pinch.</li> </ul>"
      },
      "Utility Swords Dance": {},
      "Offensive Support": {},
      "Eruption": {
        "description": "<ul> <li>Primal Groudon is a potent mixed attacker thanks to its amazing stat spread, its Ground / Fire typing, and its expansive movepool. It switches into many staples, like Ferrothorn, Necrozma-DM, and Eternatus, and this breaks holes in many teams early-game if healthy enough.</li> <li>Eruption allows Primal Groudon to deal strong damage to foes that don't take as much damage from Precipice Blades, such as support Arceus formes like Arceus-Ground and Arceus-Dark, as well as Ferrothorn. Eruption can also 2HKO foes that resist Fire, like non-defensive Eternatus and Zygarde before Power Construct.</li> <li>Precipice Blades is Primal Groudon's secondary STAB move, hitting Zacian-C, Primal Kyogre, and Necrozma-DM more reliably than Eruption when Primal Groudon is chipped.</li> <li>Rock Tomb can be used to deal super effective damage to common switch-ins, such as Ho-Oh and Mega Salamence, while also giving Primal Groudon a form of speed control against foes like Eternatus and Yveltal. Alternatively, Stone Edge can be used to deal heavier damage against Giratina-O and OHKO Ho-Oh after minimal chip damage.</li> <li>Swords Dance is recommended to reliably OHKO Necrozma-DM, Primal Kyogre, and Eternatus with Precipice Blades after a boost while also 2HKOing the majority of its checks, like Arceus-Ground and Zygarde-C.</li> <li>Stealth Rock is an alternative that can be used to soften up opposing staples like Arceus-Fairy, Arceus-Ground, and opposing Primal Groudon while also heavily damaging Mega Salamence and Yveltal. It also allows Primal Groudon to reliably OHKO Marshadow and Rayquaza after Stealth Rock damage.</li> <li>Eruption Primal Groudon fits best on bulky offense teams that appreciate a mixed wallbreaker that can blow holes in the opposing team early-game.</li> <li>Although Primal Groudon is a threatening early-game wallbreaker, it still cannot deal with the likes of Arceus-Ground, Zygarde-C, and Palkia-O, so it appreciates teammates that can deal with them, like Primal Kyogre, Palkia-O, and Arceus-Fairy.</li> <li>Primal Groudon appreciates entry hazard support from Eternatus and support Arceus formes like Arceus-Dark and Arceus-Ground, as they can chip most of Primal Groudon's aforementioned checks. In return, Primal Groudon can deal with Zacian-C and Primal Kyogre for them, respectively.</li> <li>It's important to keep Primal Groudon from needlessly being chipped, so having a teammate with entry hazard control such as Ho-Oh or Yveltal, is beneficial.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 415367, "username": "Eledyr"}, {"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 629794, "username": "LOrd Fernado"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 434487, "username": "Bobsican"}]}, {"name": "Quality checked by", "members": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 558636, "username": "zastra"}, {"user_id": 611966, "username": "Weirdhamster"}]}, {"name": "Grammar checked by", "members": [{"user_id": 558636, "username": "zastra"}, {"user_id": 594478, "username": "ken"}, {"user_id": 633500, "username": "StupidFlandrs48"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Rayquaza": {"sets": {"Setup Sweeper": {}, "Choice Band": {}}},
  "Deoxys-Attack": {
    "sets": {
      "Mixed Attacker": {
        "description": "<ul> <li>Deoxys-A's unrivaled power, great coverage, and amazing Speed tier let it serve as an almost unwallable mid-to-late-game wallbreaker that can also double as a revenge killer.</li> <li>Psycho Boost OHKOes offensive Pokemon such as Primal Groudon, Eternatus, Rayquaza, and Zygarde, while being able to OHKO Terastallized offensive Eternatus and Zygarde after slight chip damage.</li> <li>Low Kick has consistently high Base Power thanks to the high general weight of Pokemon in National Dex Ubers, and it 2HKOes Dark-type Pokemon like Arceus-Dark and offensive Yveltal without any drawbacks. Low Kick also hits Necrozma-DM for a reasonable amount of damage and does large amounts of damage into certain specially bulky Pokemon like Primal Kyogre.</li> <li>Shadow Ball has virtually perfect neutral coverage with Low Kick and hits Necrozma-DM, which otherwise is not particularly threatened by Deoxys-A's moves, for a 2HKO. With Tera Ghost, Shadow Ball becomes genuinely powerful, allowing it to OHKO Mega Mewtwo Y, Ultra Necrozma, and Necrozma-DM after a layer of Spikes, and 2HKO almost everything it hits neutrally. It should be noted, however, that a super effective Shadow Ball is weaker than a neutral Psycho Boost unless Terastallization is used, which can make Deoxys-A a bit reliant on such a mechanic to act as a proper wallbreaker in these matchups.</li> <li>At the cost of making Deoxys-A reliant on Terastallization to use Ghost-type coverage, running Tera Blast over Shadow Ball makes Deoxys-A much less exploitable overall. Due to becoming physical after Psycho Boost is used and coming off of Deoxys-A's base 180 Attack, Tera Blast is barely weakened, and it can confirm a KO on a badly poisoned Ho-Oh switching into Psycho Boost—making running dedicated coverage for Ho-Oh much less necessary—while still being incredibly difficult to switch into. Necrozma-DM and Zacian-C are still 2HKOed by a physical Tera Blast Ghost, and physical Tera Blast also retains the ability to OHKO Ultra Necrozma, Mega Mewtwo Y, and offensive Lunala, preventing these threats from exploiting Deoxys-A.</li> <li>Running Rock Slide allows Deoxys-A to potentially OHKO defensive Ho-Oh, dissuading it from consistently sponging attacks from Deoxys-A and allowing Deoxys-A to defeat it one-on-one. Because Rock Slide is physical, it can safely be used after Psycho Boost is used, increasing its general consistency. It also hits Yveltal harder than Low Kick, notably 2HKOing defensive variants.</li> <li>Ice Beam hits Yveltal harder than Rock Slide, OHKOing all variants after Stealth Rock, while relieving Deoxys-A of the need to use Psycho Boost to OHKO targets like Zygarde, Mega Salamence, and Rayquaza.</li> <li>Extreme Speed is a third option over Rock Slide that gives Deoxys-A more play against offensive teams. Not only does it allow Deoxys-A to revenge kill weakened Speed boosters like Ultra Necrozma and Mega Salamence, but it also allows Deoxys-A to prevent Ditto from revenge killing it via Tera Ghost + Extreme Speed and gives Deoxys-A counterplay against Sucker Punch Yveltal.</li> <li>A Naive nature with 252 Speed EVs is ran to ensure that Deoxys-A outspeeds Zacian-C and Mega Mewtwo Y, allowing it to threaten them. The Speed also allows Deoxys-A Speed tie opposing Deoxys-A and outspeed slower foes at +1, such as Necrozma-DM and Zygarde. 29 HP IVs reduce Life Orb recoil.</li> <li>In addition to the offensive power boost to Deoxys-A's Ghost-type coverage, Tera Ghost gives Deoxys-A an immunity to Extreme Speed, allowing it to check Arceus and Rayquaza. In certain cases, however, Tera Normal may be considered to blank Marshadow while allowing Psycho Boost + Extreme Speed to often KO Ho-Oh from full health, but the immunity is otherwise useless and doing this denies Deoxys-A the option of having powerful Ghost-type coverage, making it easier to handle overall.</li> <li>Because Deoxys-A is absurdly frail, it should never be brought into an attack, lest it get OHKOed. Instead, it should be brought in via the use of double switches, after a Pokemon is KOed, or via a slow pivot. It should also only be attacking if it can OHKO the target or if a switch is predicted.</li> <li>Deoxys-A can be extremely reliant on entry hazards and general chip damage to secure many notable OHKOs, so hazard setters like Primal Groudon, Necrozma-DM, Arceus-Ground, and Eternatus are good partners. * Deoxys-A is easily revenge killed by Marshadow and checked by Dark-types like Yveltal—particularly Sucker Punch variants—and Arceus-Dark, so Pokemon that handle them well like Arceus-Fairy and support variants of Yveltal are useful teammates. The former can also be handy against Arceus-Dark and Yveltal, which can otherwise be a great hinderance to Deoxys-A, while the latter is a rare source of pivoting in U-turn, which can be used to give Deoxys-A additional wallbreaking opportunities.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 327515, "username": "Zrp200"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 528036, "username": "Sulo"}]}]}
  },
  "Deoxys-Speed": {
    "sets": {
      "Entry Hazard Setter": {
        "description": "<ul> <li>Deoxys-S clocks in at a blistering base 180 Speed, making it the naturally fastest viable Pokemon in the tier. With a diverse support movepool and passable bulk, Deoxys-S establishes itself as the premier entry hazard setter for hyper offense teams.</li> <li>Magic Coat allows Deoxys-S to bounce opposing Taunt from Grimmsnarl and entry hazards from other suicide leads like Shuckle and Smeargle.</li> <li>Psycho Boost is an alternative to Spikes, giving Deoxys-S a powerful STAB move that can heavily damage anything that tries to take advantage of its relatively passive nature, like Marshadow and Flutter Mane.</li> <li>Rocky Helmet is an alternative to Focus Sash, providing valuable chip damage against foes like Zacian-C, which puts it within OHKO range of Necrozma-DM's Earthquake.</li> <li>While Deoxys-S normally runs a maximum HP and Speed EV spread, it can also opt for a bulkier spread; 16 Speed EVs and a Timid nature allow Deoxys-S to outspeed Deoxys-A and Zacian-C, while the HP and Defense EVs avoid a 2HKO from Arceus's Extreme Speed and Rayquaza's combination of Dragon Ascent + Extreme Speed.</li> <li>Tera Steel allows Deoxys-S to block Mortal Spin from Glimmora, keeping up hazards, as well as giving a crucial resistance to Extreme Speed from Arceus. However, Deoxys-S generally wants to avoid Terastallizing, saving the slot for one of its teammates instead.</li> <li>Deoxys-S is best used as a lead, since it provides little defensive or offensive options to its team, so it is usually worth sacrificing early-game for an extra layer of entry hazards or a fast Taunt to deny opposing sweepers from setting up, such as Mega Salamence and Zygarde-C.</li> <li>The hazards Deoxys-S lays serve as an excellent enabler for powerful sweepers like Arceus-Ground, Zacian-C, Mega Mewtwo Y, Primal Kyogre, and Ultra Necrozma, and teammates like Primal Groudon and Meteor Beam Eternatus can threaten hazard removers, especially Ho-Oh.</li> </ul>"
      },
      "Dual Screens": {
        "description": "<ul> <li>Being the naturally fastest viable Pokemon in the tier, Deoxys-S establishes itself as an excellent dual screens setter for hyper offense teams.</li> <li>Magic Coat allows Deoxys-S to beat other leads, bouncing back opposing Taunt from Grimmsnarl, entry hazards from setters like Shuckle and Glimmora, and Spore from Smeargle.</li> <li>Taunt is invaluable to Deoxys-S, not only giving it another way to prevent opposing leads from setting entry hazards, but also denying Defog from Pokemon like Arceus-Water and Giratina-O, which would otherwise remove its dual screens.</li> <li>Deoxys-S can use Tera Ghost to avoid trapping from Zygarde-C and Gothitelle as well as blank Extreme Speed from Arceus. However, it is generally best to avoid Terastallizing Deoxys-S, saving the slot for one of its teammates instead.</li> <li>Deoxys-S is best used as a lead, since it provides little defensive or offensive options to its team, so it is usually worth sacrificing early-game for a second layer of dual screens or a fast Taunt to stop opposing sweepers such as Arceus-Ground and Mega Mewtwo Y from setting up. Against physical threats like Rayquaza and Marshadow, Deoxys-S should set Reflect first, while against special threats like Flutter Mane and Palkia-O, it should set Light Screen to ensure it can survive a hit and set Reflect.</li> <li>Dual screens Deoxys-S sets are perfect enablers for bulkier sweepers like Zygarde-C, Necrozma-DM, Zacian-C, Arceus-Fairy, Arceus-Water, and Primal Groudon. Deoxys-S also appreciates teammates like Primal Kyogre and Meteor Beam Eternatus, which threaten Defoggers, especially Ho-Oh.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 616497, "username": "FayaWizard"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 652323, "username": "Anchor9"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 569291, "username": "zinnias"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Palkia-Origin": {
    "sets": {
      "Wallbreaker": {
        "description": "<ul> <li>Palkia-O uses its powerful Water / Dragon STAB combination, further bolstered by Lustrous Globe, its high Special Attack, supplemented with Fire-type coverage, to become a nuclear wallbreaker that excels at eviscerating the defensive backbone of many balance teams. Palkia-O is capable of 2HKOing defensive stalwarts such as Ho-Oh, Primal Groudon, Eternatus, and support Arceus formes.</li> <li>Fire Blast roasts Ferrothorn while also hitting Tera Grass Ho-Oh for slightly more damage than Spacial Rend.</li> <li>Palkia-O's last moveslot is rather flexible. Substitute takes advantage of the many switches Palkia-O forces and protects it from status moves. Alternatively, Draco Meteor enables Palkia-O to nab some OHKOs on Pokemon that Spacial Rend cannot, such as defensive Eternatus, Zygarde-C, and Eruption Primal Groudon after Stealth Rock.</li> <li>A Modest nature is preferred to enhance Palkia-O's wallbreaking capabilities. A Timid nature is usable if outspeeding Adamant Ultra Necrozma and Speed tying Calm Mind Arceus formes is desired. However, running a Timid nature comes at the cost of never OHKOing defensive Eternatus, turning defensive Primal Groudon into a roll to 2HKO, and rarely 2HKOing Primal Kyogre with Spacial Rend.</li> <li>Tera Water is used over Tera Dragon, since Primal Groudon is 2HKOed by Spacial Rend regardless. Tera Water Hydro Pump is capable of OHKOing Ho-Oh, Dragon Dance Necrozma-DM after a single layer of Spikes, and support Arceus formes after Stealth Rock and a layer of Spikes.</li> <li>Palkia-O is best used as an early- or mid-game wallbreaker on balance and bulky offense teams to tear through the defensive backbone of balance teams. It struggles against hyper offense teams, as it can be outsped or set up on, limiting the damage it can do. Against these teams, Palkia-O is often limited to trading. Additionally, Palkia-O completely thuds into stall, as it is fully walled by Chansey.</li> <li>Choice Band Marshadow is an excellent teammate, as it is able to revenge kill many Pokemon that use Palkia-O as setup fodder on hyper offense teams, such as Ultra Necrozma, Deoxys-A, Arceus, and Zacian-C.</li> <li>Ho-Oh makes an excellent partner, as it is able to switch in on Pokemon that scare Palkia-O out, such as Arceus-Fairy, Deoxys-A, and Zacian-C. Furthermore, Palkia-O greatly appreciates Defog support from Ho-Oh due to its vulnerability to every entry hazard and lack of recovery.</li> <li>Palkia-O also appreciates teammates that match up well into stall, such as specially offensive Yveltal and Overheat Primal Groudon.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523420, "username": "bumboclaat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 652323, "username": "Anchor9"}]}, {"name": "Grammar checked by", "members": [{"user_id": 527276, "username": "Techno"}, {"user_id": 594478, "username": "ken"}]}]}
  },
  "Giratina-Origin": {
    "sets": {
      "Physical Utility": {
        "description": "<ul> <li>Levitate, paired with a unique typing, solid bulk, and access to various status moves, allows Giratina-O to be a reliable Defogger while also having a good offensive presence, discouraging opposing Pokemon from setting entry hazards. Giratina-O also serves as one of the most reliable switch-ins to Primal Groudon, as well as Primal Kyogre, Mega Salamence, Swords Dance Arceus formes, and Ho-Oh.</li> <li>Poltergeist is Giratina-O's main source of damage, allowing it to do solid damage against non-resistant targets.</li> <li>Dragon Tail can phaze foes, ensuring setup threats like Swords Dance Arceus can't boost for free, although this doesn't work against Fairy-types like Zacian-C and Arceus-Fairy.</li> <li>Defog allows Giratina-O to remove entry hazards for teammates such as Mega Salamence; with its solid defensive profile combined with good status moves and even decent offenses, it is difficult to stop Giratina-O from freely removing hazards, making it an effective Defogger. Alternatively, Rest lets Giratina-O stay healthy throughout a game and removes any status conditions it may have, such as burn and Toxic, if there is already a reliable Defogger on the team.</li> <li>The fourth moveslot is very flexible for Giratina-O. Will-O-Wisp and Toxic are useful status moves, both crippling opposing Pokemon. Will-O-Wisp targets physical attackers like Swords Dance Arceus formes, Zacian-C, and offensive Necrozma-DM, while Toxic limits the effectiveness of Primal Groudon, Ho-Oh, and Zygarde by reducing their longevity. Shadow Sneak can revenge kill frailer Pokemon like Mega Mewtwo Y and Deoxys-A, while Stone Edge 2HKOes both Yveltal, which can OHKO Giratina-O with Dark Pulse, and Ho-Oh, which can inflict status such as Toxic onto Giratina-O.</li> <li>20 Defense EVs allow Giratina-O to avoid a 2HKO from Mega Mewtwo Y's Psystrike, while 228 Attack EVs ensure that Shadow Sneak is a 2HKO on Mega Mewtwo Y and Ultra Necrozma after taking Stealth Rock damage as Necrozma-DM and that Poltergeist can 3HKO defensive Primal Groudon after Stealth Rock damage. 12 Speed EVs are necessary to always outspeed Calyrex-I and Kingambit. Note that an EV spread of 248 HP / 56 Atk / 192 Def / 12 Spe with an Impish nature can be used if not running Shadow Sneak to avoid the 2HKO from Mega Salamence's Double Edge while still 2HKOing defensive Necrozma-DM with Poltergeist.</li> <li>Tera Poison on Giratina-O provides it with a Fairy resistance against Pokemon like Arceus-Fairy and Zacian-C while also providing it with a Toxic immunity, helping its longevity. Tera Poison is the best option to use with the second EV spread, as it allows Giratina-O to act as a Zacian-C check by letting it avoid the 2HKO from +1 Tera Electric Wild Charge after Stealth Rock damage, allowing Giratina-O to freely phaze it with Dragon Tail or burn it with Will-O-Wisp. Tera Steel has a similar role while also providing resistances to Dragon and Ice for foes such as Eternatus and Calyrex-I, at the cost of giving Giratina-O a weakness to Fire-type attacks such as Primal Groudon's Heat Crash and Ho-Oh's Sacred Fire and Fighting-type attacks such as Zacian-C's Close Combat and Marshadow's Low Kick. Tera Rock keeps the Fire resistance while giving Stone Edge variants a boost, allowing Giratina-O to OHKO Ho-Oh from full health and have a chance to OHKO specially offensive Yveltal. It also allows Giratina-O to handle Flying-types like Mega Salamence and Rayquaza better.</li> <li>Health management is crucial, as it determines Giratina-O's effectiveness at checking certain threats, especially since it has no reliable recovery outside of Rest, so avoiding unnecessary damage, whether it be stray super effective damage like Primal Kyogre's Ice Beam or status conditions like Toxic from Ho-Oh, is key.</li> <li>Giratina-O's typing leaves it weak against common Fairy-, Dark-, Ghost- and Dragon-types, such as Arceus-Fairy, Yveltal, Marshadow, and Eternatus; as such, Necrozma-DM for Fairy- and Dragon-types, Yveltal for Dark- and Ghost-types, and Arceus-Fairy for Dark- and Dragon-types are all good partners.</li> <li>Support Arceus formes like Arceus-Fairy and Pokemon such as Zygarde and Ho-Oh can help Giratina-O more comfortably wall physical threats like Primal Groudon in case it becomes too weakened to effectively serve as a check.</li> </ul>"
      },
      "Special Utility": {}
    },
    "credits": {"writtenBy": [{"user_id": 604820, "username": "S0A0M0I0"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 434487, "username": "Bobsican"}]}, {"name": "Quality checked by", "members": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 327515, "username": "Zrp200"}]}, {"name": "Grammar checked by", "members": [{"user_id": 569291, "username": "zinnias"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Arceus": {
    "sets": {
      "Extreme Killer": {
        "description": "<ul> <li>Arceus's great stats and amazing movepool make it one of the tier's most effective wallbreakers and sweepers.</li> <li>Swords Dance pairs excellently with Extreme Speed almost always bypassing the target's Speed. Dragon Dance is fairly niche because Arceus generally needs +2 Attack to OHKO most foes like Mega Mewtwo Y and Ultra Necrozma, but it offers benefits like letting Arceus move before opposing Arceus and Steel-types such as Zacian-C and boosted Necrozma-DM.</li> <li>Shadow Claw targets Giratina-O, which is immune to both Extreme Speed and Earthquake, and it has the added benefit of hitting Necrozma-DM and Marshadow for super effective damage.</li> <li>Earthquake hits Steel-types such as Zacian-C and Necrozma-DM and serves as coverage against Primal Groudon.</li> <li>In the place of coverage, Taunt can be used to stop status, recovery moves, and entry hazards from foes like Zygarde, Giratina-O, and Ferrothorn. Recover is another alternative that allows Arceus to stay healthy while taking weaker hits from foes like Ferrothorn and support Arceus formes.</li> <li>Leftovers is the preferred item, since it gives Arceus more staying power. Lum Berry lets Arceus avoid status one time, letting it more easily forgo Taunt and take on Ho-Oh better. Silk Scarf increases the power of Extreme Speed, letting +2 Arceus OHKO foes like wallbreaker Primal Kyogre and Ultra Necrozma. Life Orb augments the power of all Arceus's moves; for example, at +2 it can OHKO offensive variants of Yveltal with Extreme Speed and Necrozma-DM with Earthquake,though it gets worn down faster by the recoil damage.</li> <li>The given EV spread maximizes Arceus's Attack while letting it outspeed 252 Speed EV Primal Groudon and Primal Kyogre with a neutral nature, with the remaining EVs being dumped into HP to maximize its bulk. 56 Speed EVs should be used with Dragon Dance to allow Arceus to outspeed Zacian-C at +1.</li> <li>Tera Ghost providing an immunity to Arceus's only weakness in Fighting as well as Normal can give it an extra turn against foes such as Marshadow, Zacian-C, and opposing Arceus. It also increases the power of Shadow Claw against Ghost-types, notably giving it good odds to OHKO Giratina-O at +2 and always letting it do so with Life Orb. However, this leaves Arceus more vulnerable to Marshadow's Shadow Sneak and Dark-types that can tank Extreme Speed like Yveltal and Arceus-Dark.</li> <li>Tera Normal increases the power of Extreme Speed to unspeakable levels, giving it a chance to OHKO foes such as bulky Primal Kyogre and defensive Ho-Oh when boosted by Life Orb at +2.</li> <li>Tera Fire is niche, but it lets Arceus become immune to burn and resist Fire, notably helping it when faced with Ho-Oh. Tera Fire granting resistances to Zacian-C's STAB moves and removing Arceus's Fighting-type weakness also lets the latter reliably beat the former.</li> <li>Arceus best fits on offense teams, notably hyper offense teams, looking for a powerful sweeper that isn't stopped by fast revenge killers like Mega Mewtwo Y, Deoxys-A, and Choice Scarf users like Yveltal.</li> <li>Arceus struggles with physically bulky foes such as Zygarde and Ho-Oh, which can trade hits with and status it. It is also notably walled by Dondozo. Fellow wallbreaking and sweeping teammates such as Ultra Necrozma and Meteor Beam Eternatus can form offensive cores with Arceus, which are effective at pressuring these foes.</li> <li>Dual screens support from Deoxys-S and Grimmsnarl is great for hyper offense teams, letting Arceus set up more easily. This is especially important if Arceus is running Dragon Dance, which usually needs two turns to set up. Entry hazard setters like Deoxys-S and Shuckle can weaken the opposing team, letting Arceus KO them more easily.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 604820, "username": "S0A0M0I0"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arceus-Dark": {
    "sets": {
      "Utility": {
        "description": "<ul> <li>With access to STAB Foul Play, high defensive stats, and its mono-Dark typing, Arceus-Dark effectively checks Pokemon such as Primal Groudon, Arceus, Necrozma-DM, Ultra Necrozma, and Mega Salamence, making it one of the most reliable defensive Arceus formes in NatDex Ubers.</li> <li>Foul Play is absolutely essential for Arceus-Dark, as it serves two crucial roles: first, it allows Arceus-Dark to effectively revenge kill boosted threats such as Primal Groudon, Arceus, Ultra Necrozma, and Mega Salamence. Second, it acts as a deterrent, dissuading these threats from setting up until Arceus-Dark has been sufficiently weakened.</li> <li>Toxic is the preferred status move for Arceus-Dark, primarily to cripple common switch-ins such as Ho-Oh, Yveltal, Primal Kyogre, and Arceus-Fairy. Will-O-Wisp presents a viable alternative for hitting Zacian-C and Marshadow, which is particularly relevant given Zacian-C's resistance to Foul Play.</li> <li>Refresh is a solid choice when Arceus-Dark is utilized as a primary Knock Off and status absorber for the team, since it can reliably  switch into Toxic Yveltal or Eternatus. However, in other scenarios, it's not recommended since it would render Arceus-Dark too passive against the aforementioned threats.</li> <li>Taunt allows Arceus-Dark to greatly limit most of the entry hazard setters in the tier, namely Primal Groudon, Defensive Necrozma-DM, and Ferrothorn. Additionally, it can neutralize status spreaders like Toxic Yveltal, Ferrothorn, and Giratina-Origin, while also restricting the former's ability to use Defog. Taunt Arceus-Dark is also one of the best checks to Zygarde-C, as it can completely shut down its ability to spread paralysis and set up.</li> <li>Defog serves as a good filler move when Arceus-Dark acts as hazard control over common Defoggers like Ho-Oh and Giratina-O. Stealth Rock can be a viable option to free up teammates to fulfill other roles; for example, it alows Primal Groudon to run more offensive sets such as Swords Dance, or fit Spikes on defensive set. In addition, Arceus-Dark's typing and movepool allow it to set up Stealth Rock on common Defoggers such as Ho-Oh, Giratina-O, and most opposing Arceus formes, all of which are threatened by Arceus-Dark's status moves. Arceus-Dark's EV spread enables it to be faster than common base 90 Speed foes and also facilitates its role as a revenge killer against offensive Primal Groudon and Primal Kyogre. Alternatively, investing in Speed with EVs of 248 HP / 164 Def / 96 Spe and a Timid nature allows Arceus-Dark to outspeed Pokémon like Yveltal, Zekrom, and Rayquaza, and still survive a Life Orb Low Kick from Marshadow.</li> <li>Tera Poison lets Arceus Dark acts as an emergency check to boosted Marshadow and Tera Fighting Zacian-C, making it possible to safely revenge kill them. Moreover, by becoming a Poison-type, Arceus-Dark becomes immune to Toxic, making it possible for non-Taunt versions to beat Toxic Yveltal one-on-one. However, Tera Poison makes Arceus-Dark extremely vulnerable to Photon Geyser Ultra Necrozma, Primal Groudon, Arceus-Ground, and Deoxys-A, thus trainers should think twice before Terastallizing Arceus-Dark.</li> <li>Utility Arceus-Dark is an excellent fit for balance and defensive teams, offering a check to Zygarde-C and and other common physical sweepers such as Ultra Necrozma. Depending on the set used, some precautions should be taken with Arceus-Dark. Non-Refresh sets need to scout for Toxic before switching into Primal Groudon and Necrozma-DM. Similarly, it is important to scout for Glare Zygarde since Arceus-Dark doesn't enjoy being paralyzed.</li> <li>Stealth Rock from Arceus-Dark itself or a teammate  like Primal Groudon can wear down Fairy-types such as Arceus-Fairy that can switch into Arceus-Dark.</li> <li>Since Necrozma-DM, the premier Toxic absorber of the tier, is heavily threatened by Foul Play, Arceus-Dark can often freely use Toxic on a predicted switch-in.</li> <li>Primal Groudon and Swords Dance Arceus can overwhelm Arceus-Dark. To improve its matchup against these threats, teammates like Zygarde-C, Ferrothorn, and Ditto can provide valuable support.</li> <li>Defensive Primal Groudon serves as a great partner for Arceus-Dark, threatening Eternatus, which walls Arceus-Dark. A similar role is accomplished by Ho-Oh, especially sets carrying Thunder Wave, which can make Arceus-Dark faster than it. Additionally, Ho-Oh appreciates Arceus-Dark's ability to deal with Knock Off Necrozma-DM and Ultra Necrozma.</li> <li>Necrozma-DM is another partner that benefits from Arceus-Dark's ability to cripple Primal Groudon and Yveltal, and it provides a Fairy resistance and Toxic immunity in return.</li> <li>Cleric support from Pokemon such as Magearna and Chansey can mitigate non-Refresh Arceus-Dark's weakness to status conditions.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 399174, "username": "entrocefalo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 633500, "username": "StupidFlandrs48"}]}]}
  },
  "Arceus-Fairy": {"sets": {"Defensive": {}, "Calm Mind": {}}},
  "Arceus-Ghost": {"sets": {"Dragon Dance": {}}},
  "Arceus-Ground": {
    "sets": {
      "Calm Mind": {},
      "Physical Setup Sweeper": {
        "description": "<ul> <li>Physical Arceus-Ground is an excellent wallbreaker and sweeper on hyper and bulky offense teams. It easily finds turns to boost due to scaring out common Pokemon such as Primal Groudon and Necrozma-DM. Additionally, physical Arceus-Ground benefits from the presence of the more common defensive and Calm Mind Arceus-Ground sets, as it is able to beat switch-ins expecting to check other Arceus-Ground sets such as Primal Kyogre and Palkia-O.</li> <li>Dragon Dance is Arceus-Ground's primary boosting move. Alternatively, Swords Dance is a viable option, as Sticky Web support enables Arceus-Ground to outspeed the entire unboosted metagame with the exception of specially offensive Yveltal.</li> <li>Arceus-Ground's last moveslot should be tailored to best support its team. On hyper offense teams, Taunt prevents Pokemon such as Giratina-O and Yveltal from removing entry hazards while also protecting Arceus-Ground from status moves. Recover enables Arceus-Ground to perform the defensive duties expected of it on bulky offense teams, such as switching into Primal Groudon multiple times while remaining healthy enough to sweep late-game. Healing Wish is also an option on hyper offense teams to give a teammate such as Zacian-C or Ultra Necrozma a second chance at sweeping.</li> <li>As Ultra Necrozma is a staple on hyper offense teams, Arceus-Ground typically equips an Earth Plate. Bulky offense teams appreciate Arceus-Ground's ability to OHKO Dragon Dance Necrozma-DM and wallbreaker Primal Kyogre after Stealth Rock with Tectonic Rage. Arceus-Ground's ability to OHKO defensive Primal Groudon and utility Arceus formes with Tectonic Rage after a Swords Dance is appreciated by many Sticky Web teams.</li> <li>The given EV spread maximizes Arceus-Ground's mixed bulk while allowing it to outspeed Primal Groudon and maximize damage output. This ensures that it outspeeds most of the defensive metagame and can revenge kill Pokemon such as Primal Groudon and Primal Kyogre. The defensive investment prevents Arceus-Ground from being OHKOed by Necrozma-DM's Searing Sunraze Smash, Life Orb Deoxys-A's Psycho Boost, and Choice Band Rayquaza's Dragon Ascent after a single layer of Spikes. Arceus-Ground also survives Tectonic Rage and +1 Tera Ground Earthquake from opposing Arceus-Ground. Additionally, the spread allows +2 Arceus-Ground to avoid the OHKO from Choice Scarf Yveltal's Foul Play after Stealth Rock and two layers of Spikes, enabling Arceus-Ground to remove an otherwise dangerous threat to many offensive teams.</li> <li>Tera Ground enables Arceus-Ground to OHKO some targets without a boost, such as Dragon Dance Necrozma-DM after a single layer of Spikes and defensive Primal Groudon after Stealth Rock and a layer of Spikes. Tera Rock is an alternate option to OHKO switch-ins such as Mega Salamence switching in on a Dragon Dance after Stealth Rock with Stone Edge. At +1, Tera Rock Stone Edge OHKOes defensive Yveltal and 2HKOes Giratina-O after Stealth Rock. Tera Rock can also be used defensively to resist common priority move such as Arceus's and Rayquaza's Extreme Speed.</li> <li>On hyper offense teams, Arceus-Ground is best used as a mid-game wallbreaker to remove Pokemon such as Primal Groudon, Ho-Oh, and Necrozma-DM. On bulky offense teams, it is best used early-game due to its positive matchups against both common hazard setters such as Primal Groudon and Defoggers such as Ho-Oh and Yveltal. Arceus-Ground should be kept reasonably healthy, as it is often able to sweep late-game after a boost. It also struggles against stall teams, as it is walled by Dondozo and phazed by Giratina-O, though Taunt is disruptive to many stall teams.</li> <li>Shuckle is a great Sticky Web user to enable Swords Dance Arceus-Ground. Kyurem-B synergizes well with Arceus-Ground, as it is able to break through Dondozo and exploit Tera Grass Ho-Oh, which walls Arceus-Ground. Zacian-C also appreciates Arceus-Ground's efficacy in removing Primal Groudon and Ho-Oh while helping against Arceus-Dark. Specially offensive Yveltal is also a great partner that threatens most of the defensive metagame and dissuades Ditto from using Earthquake after copying Arceus-Ground.</li> <li>On bulky offense teams, utility Swords Dance Primal Groudon provides Stealth Rock support and a switch-in to Primal Kyogre, which scares out an unboosted Arceus-Ground. Choice Band Marshadow is an excellent teammate that is able to revenge kill Pokemon such as Ultra Necrozma and Zacian-C, which threaten a chipped Arceus-Ground.</li> </ul>"
      },
      "Defensive": {
        "description": "<ul> <li>Arceus-Ground covers a wide variety of foes and utility roles, thanks to its solid mixed bulk and wide movepool. Its typing hits some of the most relevant threats in the metagame super effectively while also giving it few weaknesses and relevant resistances, allowing it to answer a variety of foes such as Primal Groudon, Necrozma-DM, Eternatus, and Yveltal and turning it into a versatile pick for a wide variety of team structures.</li> <li>Toxic allows Arceus-Ground to hinder switch-ins immune to Judgment like Ho-Oh, Giratina-O, Mega Salamence, and Yveltal; Ice Beam alternatively complements Judgment to hit all previously mentioned foes but Ho-Oh, as well as Zygarde, super effectively. Taunt prevents entry hazards from Primal Groudon, Necrozma-DM, and Ferrothorn, Defog from Ho-Oh and Giratina-O, disruptive moves such as Glare, Toxic, and Will-O-Wisp from Zygarde, Yveltal, and Giratina-O, and setup and recovery moves from Zygarde, Primal Groudon, and Necrozma-DM, rendering them easier to beat.</li> <li>Stealth Rock provides general utility to support the rest of Arceus-Ground's team, helping wallbreaking allies such as Primal Groudon and Zacian-C to net more OHKOs as they force switches.</li> <li>The given EV spread avoids a 2HKO from Life Orb Marshadow's Low Kick after Stealth Rock and a 2HKO from Zacian-C's Play Rough after Intrepid Sword and Stealth Rock. The Speed investment ensures Arceus-Ground outspeeds fully invested Primal Groudon, and the remaining EVs are used on Special Attack to raise the odds to OHKO Zacian-C and Zekrom after Stealth Rock with Judgment.</li> <li>Arceus-Ground is a Pokemon that doesn't Terastallize often, as its allies usually make better use of the mechanic. Tera Poison renders it unable to check Ground-types such as Primal Groudon, opposing Arceus-Ground, and Zygarde and makes it weaker to Stealth Rock. However, Tera Poison raises the accuracy of Toxic, increases Arceus-Ground's longevity by making it immune to Toxic itself from foes such as Giratina-O, Ho-Oh, and Yveltal, enables it to wall further foes such as Marshadow and Eternatus, and lets it absorb Eternatus's Toxic Spikes, supporting its team with entry hazard control.</li> <li>Arceus-Ground's special bulk can be too lacking at times to handle foes such as Mega Mewtwo Y and Lunala; as such, it appreciates partners to make a defensive core with, such as Ho-Oh, Necrozma-DM, and Yveltal. Water-types such as Primal Kyogre, Palkia-O, and Arceus-Water can easily break past Arceus-Ground; therefore, it appreciates Pokemon on its side like Primal Groudon, Eternatus, and Ferrothorn to handle them.</li> <li>Wallbreakers that can break past foes Arceus-Ground can't do much against on its own are valuable to ease progress. For example, Zacian-C threatens Giratina-O and Mega Mewtwo Y for Arceus-Ground sets without Toxic, Primal Kyogre covers Ho-Oh and Zygarde for variants without both Ice Beam and Toxic, and Marshadow can make progress against Ho-Oh, Giratina-O, and Primal Groudon independently of Arceus-Ground's set, especially with Stealth Rock support from Arceus-Ground to wear down the other team.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 523420, "username": "bumboclaat"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 434487, "username": "Bobsican"}]}, {"name": "Quality checked by", "members": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 558636, "username": "zastra"}, {"user_id": 652323, "username": "Anchor9"}]}, {"name": "Grammar checked by", "members": [{"user_id": 327515, "username": "Zrp200"}, {"user_id": 470115, "username": "SolarBeam"}, {"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Arceus-Water": {
    "sets": {
      "Utility": {},
      "Defensive Calm Mind": {},
      "Offensive Calm Mind": {
        "description": "<ul> <li>With access to Calm Mind and excellent base 120 stats across the board, Arceus-Water is able to act as a strong bulky setup sweeper.</li> <li>Arceus-Water's good typing allows it to break through defensive staples such as Ho-Oh and Arceus-Ground while dealing great damage to Zygarde.</li> <li>Calm Mind allows Arceus-Water to 2HKO walls like Necrozma-DM and Primal Groudon. Aside from boosting Arceus-Water's Special Attack, it also allows it to turn the tables on some switch-ins that typically check it such as Eternatus and Palkia-O; in conjunction with Recover, it provides Arceus-Water with the longevity needed to continuously take on strong special attacks from foes like Eternatus and offensive Yveltal in order to set up on them.</li> <li>Earth Power enables Arceus-Water to threaten foes that can take Water-type moves, 2HKOing Primal Groudon and Eternatus at +1. Grass Knot can also be used instead of Earth Power to hit heavy Water-types like Primal Kyogre, Palkia-O, and opposing Arceus-Water.</li> <li>Arceus-Water's choice of Tera type is determined by the coverage move it runs. Tera Ground boosts Earth Power to muscle through Primal Groudon and Zacian-C with an OHKO on both at +1 whilst granting it an immunity to Electric-type attacks from Zekrom and Primal Kyogre. Tera Grass is used to power up Grass Knot, and at +1 it has a chance to OHKO Primal Kyogre and deal significant damage to Zygarde whilst resisting its Ground-type STAB moves and the aforementioned Electric-type Arceus-Water best fits on bulky and hyper offense teams that appreciate its great bulk and typing.</li> <li>It is preferable to use Arceus-Water early-game to blow holes into the opposing team's defensive core, as it can easily use Calm Mind on the likes of Ho-Oh and Zygarde and force progress, which is appreciated by teammates such as Necrozma-DM and offensive Primal Groudon. It also has good synergy with the aforementioned teammates, as it helps them beat physical walls like Zygarde and opposing Primal Groudon.</li> <li>Although Arceus-Water has good Special Attack, it struggles to beat special walls such as Chansey, Ferrothorn, and Giratina, so teammates like Primal Groudon, Marshadow, and Zacian-C are appreciated.</li> <li>Fairy-types like Zacian-C and Arceus-Fairy help Arceus-Water deal with Dragon-type foes, as it struggles to deal damage to foes such as Ultra Necrozma, Mega Salamence, and Rayquaza. In return, Arceus-Water can beat foes such as Primal Groudon and Ho-Oh for them.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 604820, "username": "S0A0M0I0"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Alomomola": {
    "sets": {
      "Defensive Pivot": {
        "description": "<ul> <li>Thanks to its great physical bulk, utility, and excellent typing, Alomomola fills valuable niches on bulkier balance teams. Alomomola is useful as a defensive pivot that can shrug off damage thanks to Regenerator, as a status spreader, and as a Wish passer that increases the longevity of its teammates.</li> <li>Toxic allows Alomomola to cripple the longevity of Ho-Oh, Primal Groudon, and support Arceus formes lacking Refresh. Toxic is especially useful against Primal Groudon and Zygarde, as it keeps Alomomola from being easily set up on while forcing Zygarde to waste Rest PP.</li> <li>Wish allows Alomomola to increase its longevity as well as the longevity of its teammates by providing recovery for allies such as Primal Groudon, Primal Kyogre, Giratina-O, and Specially Offensive Yveltal that have no reliable recovery options. A slow Flip Turn allows Alomomola to safely pass a Wish to the aforementioned Pokemon. Increased longevity allows these teammates to check Zacian-C, Primal Groudon, Arceus, and Marshadow with more efficiency during the game.</li> <li>Protect allows Alomomola to more easily receive a Wish from itself, scout Choice item sets from Marshadow, Yveltal, and Eternatus, and maximize Toxic damage on the foe.</li> <li>Heavy-Duty Boots allows Alomomola to freely pivot without worrying about entry hazards.</li> <li>The first EV spread maximizes Alomomola's mixed bulk, allowing it to shrug off hits from support Arceus formes and Eternatus. The second EV spread maximizes Alomomola's physical bulk, allowing it to survive a +3 Wild Charge from Zacian-C and two uses of Glacial Lance from Choice Band Calyrex-I. Having 0 Speed IVs allows Alomomola to perform a slow Flip Turn against Chansey and Calyrex-I.</li> <li>Tera Dark allows Alomomola to absorb powerful Psychic-type attacks such as Light that Burns the Sky from Ultra Necrozma and Psycho Boost from Deoxys-A. Tera Dark also makes Alomomola one of the few walls capable of handling Deoxys-A thanks to Alomomola's low weight lessening the power of Low Kick. After switching in, Alomomola can immediately threaten to OHKO Deoxys-A with Flip Turn after Stealth Rock and a turn of Life Orb damage.</li> <li>Tera Poison prevents Alomomola from becoming poisoned, allowing it to serve as a switch-in to Toxic Ho-Oh and utility Arceus formes. Tera Poison also allows Alomomola to absorb Toxic Spikes from Eternatus to keep teammates such as Primal Groudon, Primal Kyogre, and support Arceus formes status-free, although switching into Primal Groudon and Arceus-Ground becomes harder.</li> <li>Alomomola is able to swap into any unboosted physical attack besides Bolt Strike from Zekrom throughout the game consistently, since it can use Regenerator to heal itself back up. It can swap in on Mega Salamence or Arceus-Ground and pivot with Flip Turn to safely bring in an answer such as Arceus-Fairy or Arceus-Dark.</li> <li>Thanks to Alomomola's Wish support, teammates without reliable recovery such as Primal Groudon and Giratina-O can switch into Primal Kyogre and Arceus more aggressively throughout the game without worrying about slowly being chipped down.</li> <li>Wallbreaker Primal Kyogre makes it near impossible for Alomomola to safely pass a Wish, so teammates such as Ferrothorn and Primal Groudon are helpful.</li> <li>Alomomola will often get overwhelmed by physical attackers such as Zacian-C, Mega Salamence, and Arceus, so teammates such as Primal Groudon and Arceus-Dark help ease Alomomola's workload.</li> <li>Alomomola provides excellent slow pivoting, so Pokemon that capitalize on a free switch such as Deoxys-A, Choice Band Marshadow, Choice Band Chien-Pao, and Meteor Beam Eternatus make excellent teammates.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652323, "username": "Anchor9"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 476595, "username": "R8"}]}, {"name": "Quality checked by", "members": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 523420, "username": "bumboclaat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Ferrothorn": {"sets": {"Specially Defensive": {}}},
  "Zekrom": {
    "sets": {
      "Setup Sweeper": {
        "description": "<ul> <li>Being the sole Electric-type of the tier, Zekrom can remove defensive Pokemon such as Ho-Oh, Primal Kyogre, Arceus-Water, and Yveltal. Zekrom's ability, Teravolt, also allows it to break through Dondozo, making it a strong wallbreaker for hyper offense structures.</li> <li>Outrage, when paired with Dragonium Z, becomes a powerful nuke option for Zekrom to use against Pokemon like Primal Groudon, Arceus-Ground, Giratina-O, and Eternatus, all of which resist or are immune to Bolt Strike.</li> <li>Substitute eases predictions, as Zekrom commonly forces switches, and it blocks status moves such as Will-O-Wisp from Giratina-O and Toxic from support Arceus formes. It also helps Zekrom set up more easily against Pokemon like Ho-Oh, which attempts to burn Zekrom with Sacred Fire. Roost can be used to give Zekrom more longevity throughout a match and as it sets up.</li> <li>The given EVs allow Zekrom to always outspeed Deoxys-A after a boost while ensuring it survives uninvested Judgment from Arceus-Fairy and two Earth Powers from utility Arceus formes. Alternatively, the second EV spread allows Zekrom to OHKO Ho-Oh, Mega Mewtwo Y, and Primal Kyogre without any boosts, 2HKO defensive Necrozma-DM and Extreme Killer Arceus, and OHKO Zacian-C and Dondozo at +1. The Adamant nature also gives Zekrom better chances to OHKO Primal Groudon with +1 Devastating Drake after Stealth Rock while always outspeeding Necrozma-DM, but it cannot outspeed Zacian-C after a boost.</li> <li>Zekrom's unique typing allows it to take hits from Mega Salamence, Primal Kyogre, and Necrozma-DM's STAB moves; however, its exploitable weaknesses and lack of ability to serve as a wall make this trait only useful in a pinch, as Zekrom shouldn't be taking many hits if it wants to sweep effectively. In the scenario where Zekrom struggles to set up, unboosted Devastating Drake is a solid option for weakening foes such as Primal Kyogre, Primal Groudon and Giratina-O to let Zekrom's teammates handle them more easily.</li> <li>Primal Kyogre makes a great partner to Zekrom with its ability to check Primal Groudon, wearing it down for Zekrom to clean up with its Z-Move afterwards. Offensive Necrozma-DM breaks through Fairy-types like Arceus-Fairy and Zacian-C for Zekrom to more comfortably use Devastating Drake while also allowing Zekrom to use Outrage once said Fairy-types aren't a factor.</li> <li>Strong physical attackers like Marshadow and Arceus appreciate Zekrom's ability to break through Dondozo, Giratina, and Primal Groudon. Strong special attackers like Calm Mind Arceus formes, Primal Kyogre, and Eternatus also appreciate Zekrom breaking through special walls like Ho-Oh and Chansey, while they can help wear down physical walls like Primal Groudon and Arceus-Ground so Zekrom can break through them more easily with Dragonium Z.</li> <li>Suicide leads like Shuckle and Smeargle can set up Sticky Web for Zekrom, assisting the secondary EV spread with its drop in Speed while also setting additional entry hazards to meet important damage thresholds; in return, Zekrom offensively pressures Ho-Oh and Yveltal and dissuades them from using Defog to remove Sticky Web.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 604820, "username": "S0A0M0I0"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 434487, "username": "Bobsican"}]}, {"name": "Quality checked by", "members": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 523420, "username": "bumboclaat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 327515, "username": "Zrp200"}, {"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Yveltal": {
    "sets": {
      "Defensive": {
        "description": "<ul> <li>With a great defensive typing, respectable bulk, and STAB Foul Play boosted by its ability, Yveltal makes for an excellent defensive wall. Yveltal's immunity to Psychic allows it to check threats such as Deoxys-A, Ultra Necrozma, and Mega Mewtwo Y.</li> <li>Foul Play often forces switches due to its power and deals large amounts of damage to threats such as Extreme Killer Arceus, Primal Groudon, Mega Salamence, Arceus-Ground, and Ultra Necrozma. This also prevents them, as well as Zacian-C, from setting up without massive punishment.</li> <li>Toxic allows Yveltal to chip down Pokemon that resist or have the bulk to tank Foul Play, such as Zygarde, Primal Kyogre, Arceus-Dark, Arceus-Water, and Ho-Oh. U-turn can be used instead, allowing Yveltal to grab momentum against predicted switch-ins such as Arceus-Dark and Ho-Oh while bringing in wallbreakers such as Zacian-C and Primal Kyogre.</li> <li>Taunt prevents Primal Kyogre, Necrozma-DM, and Zygarde from setting up on Yveltal. Additionally, it prevents Arceus-Dark, Arceus-Water, and Ho-Oh from crippling Yveltal with Toxic or Will-O-Wisp while also preventing them from using Refresh and Recover, reducing their longevity.</li> <li>The given EV spread allows Yveltal to outspeed the different support Arceus formes, meaning it can use Taunt to block their Taunt or utility moves. With this, Yveltal also outspeeds Primal Groudon and Primal Kyogre, allowing it to cripple them with Toxic or prevent setup with Taunt.</li> <li>Tera Ghost allows Yveltal to block Extreme Speed from Arceus and Low Kick from Marshadow at the cost of losing the ability to absorb Psychic-type attacks from Ultra Necrozma and Mega Mewtwo Y.</li> <li>Tera Poison allows Yveltal to better check Zacian-C and wall Arceus-Fairy with the help of Taunt, though checking Primal Groudon and Ultra Necrozma becomes significantly harder.</li> <li>Defensive Yveltal is a great fit on teams looking for Pokemon that can check a large variety of physical threats and threaten them out consistently, such as balance and stall teams.</li> <li>Throughout the game, Yveltal should try to look for opportunities to spread Toxic to the opposing team or provide momentum through U-turn. Yveltal can create these opportunities by threatening out various physical attackers such as Arceus, Necrozma-DM, and Mega Salamence with Foul Play, forcing opponents to make unfavorable moves.</li> <li>Yveltal should be able to safely stay in on most support Arceus formes thanks to Taunt, as well as against Giratina-O and Zygarde.</li> <li>Yveltal can often get overwhelmed by threats such as Zacian-C and Arceus-Fairy, so a teammate such as Ho-Oh or Necrozma-DM that can wall these Pokemon greatly helps it.</li> <li>Fast sweepers such as Zacian-C, Extreme Killer Arceus, and Mega Salamence that take advantage of the chip damage Yveltal provides also make great teammates.</li> </ul>"
      },
      "Specially Offensive": {
        "description": "<ul> <li>Dark Pulse is Yveltal's main attacking option. With Dark Aura and a Life Orb, it allows Yveltal to 2HKO many of the tier's defensive options, such as Necrozma-DM, Primal Groudon, and Zygarde.</li> <li>Oblivion Wing has solid neutral coverage with Dark Pulse, being able to hit the Fairy-, Fighting-, and Dark-types that would switch into Dark Pulse, such as Arceus-Dark and opposing Yveltal.</li> <li>Taunt shuts down opposing setup, such as Arceus's Swords Dance, entry hazards, such as Primal Groudon's Stealth Rock, and status moves, such as Ho-Oh's Toxic; when combined with Oblivion Wing, it allows Yveltal to win duels against many Pokemon that would otherwise be able to take on Yveltal's attacks, such as support Arceus formes and defensive Eternatus.</li> <li>Knock Off cripples Pokemon, such as Ho-Oh and Chansey, by removing their item, while Sucker Punch allows Yveltal to punish faster Pokemon such as Deoxys-A, Ultra Necrozma, and Mega Mewtwo Y, making it a solid revenge killer.</li> <li>Tera Dark boosts Dark Pulse's power to ridiculous feats, such as being able to 2HKO specially defensive Eternatus, defensive Primal Kyogre, and Ho-Oh, as well as boosting Sucker Punch and Knock Off's damage. Tera Flying can also be used to increase Oblivion Wing's power, letting it hit Arceus-Dark and opposing Yveltal harder, which in return gives Yveltal more longevity.</li> <li>Yveltal should be used as an offensive check to Pokemon like Primal Groudon, Marshadow, and Necrozma-DM. Switching into resisted moves such as Marshadow's Spectral Thief and Lunala's Moongeist Beam or attacks Yveltal is immune to such as Primal Groudon's Precipice Blades and Ultra Necrozma's Photon Geyser allows Yveltal to stay healthy throughout a game, which is important, as Yveltal can get worn down from Stealth Rock and Life Orb recoil. Oblivion Wing is best suited for use when Yveltal is at low HP, as it should mostly be using Dark Pulse for damage otherwise.</li> <li>Although much of the tier is 2HKOed by Yveltal, most of the metagame is able to 2HKO Yveltal as well, even with neutral moves, such as Necrozma-DM's Sunsteel Strike and Eternatus's Dynamax Cannon.</li> <li>Yveltal should avoid status as much as possible; Toxic from Ho-Oh and Giratina-O ruins its longevity in longer games, paralysis from Zygarde's Glare and Necrozma-DM's Thunder Wave limits its Speed so it's more likely to be KOed by faster threats, and burns from Ho-Oh and Arceus-Dark weaken the strength of Knock Off and Sucker Punch, the latter being problematic against more offensive teams where priority may be necessary for revenge killing.</li> <li>Yveltal's immediate power allows it to be an early-game wallbreaker for its team, which is good for offensive structures.</li> <li>Specially offensive Yveltal fits best on offensive teams. Primal Groudon is a good partner, as it is able to beat Pokemon like Zacian-C and Arceus-Fairy that would be hard for Yveltal to break, while Yveltal can break through Giratina-O and Zygarde for Primal Groudon in return; Yveltal is also able to come in on the Ground-type moves that would threaten Primal Groudon, barring Thousand Arrows from Zygarde, while Primal Groudon comes in on the Fairy- and Electric-type moves that threaten Yveltal, such as Zacian-C's Play Rough and Primal Kyogre's Thunder. Ho-Oh can remove Stealth Rock for Yveltal, which improves its longevity. Necrozma-DM is able to handle Fairy- and Ice-types such as Calyrex-I and Arceus-Fairy, and Yveltal can come into the Ghost-, Dark-, and Ground-type moves that Necrozma-DM struggles with, such as Marshadow's Spectral Thief, opposing Yveltal's Dark Pulse, and Primal Groudon's Precipice Blades.</li> <li>Powerful physical sweepers such as Zacian-C, Mega Salamence, Arceus-Ground, and Ultra Necrozma appreciate Yveltal removing common physical walls such as Zygarde, Giratina, Primal Groudon, and Dondozo, while they handle the special walls such as Ho-Oh and Chansey in return; Zacian-C in particular can break through opposing Yveltal and Arceus-Dark with Play Rough, letting Yveltal spam Dark Pulse more easily.</li> <li>Hazard hyper offense teams using suicide leads such as Deoxys-S, Smeargle, Shuckle, and Glimmora appreciate Yveltal stopping Defog attempts from Ho-Oh, Giratina, and support Arceus formes with Taunt, as well as removing Heavy-Duty Boots from Pokemon like Ho-Oh, defensive Eternatus, and Giratina with Knock Off.</li> </ul>"
      },
      "Choice Scarf": {
        "description": "<ul> <li>Foul Play makes Yveltal an excellent revenge killer against many offensive teams, being able to use the Attack boosts of Pokemon such as Swords Dance Arceus formes, Primal Groudon, and Necrozma-DM against them to break right through them before they have the chance to cause major damage. Dark Pulse is a strong Dark-type STAB move if a more consistent damage output is required to clean late-game.</li> <li>Oblivion Wing allows Yveltal to reliably revenge kill Marshadow and maintain its health somewhat. Roost may be considered to keep itself healthy as well, but locking into it can be risky against many teams.</li> <li>Defog allows Yveltal to be one of the best solutions to hyper offense teams in the tier, clearing entry hazards early-game due to how many switches it forces with Foul Play. Yveltal notably does not have its Speed dropped by Sticky Web. If its team already has a consistent Defogger, Toxic may be chosen to punish support Arceus formes more consistently.</li> <li>U-turn allows Yveltal to better take advantage of Pokemon that switch in like defensive Eternatus, Arceus-Dark, and Arceus-Fairy to maintain momentum for its team.</li> <li>The given EV spread allows Yveltal to outspeed fully invested base 95s such as Rayquaza and Kyurem-B and survive a +1 Outrage from Dragon Dance Ultra Necrozma, and revenge kill it with either Foul Play or Dark Pulse. The rest of the EVs are dumped into Special Attack to strengthen Oblivion Wing.</li> <li>Tera Dark allows Yveltal to OHKO +3 Zacian-C with Foul Play and removes its Stealth Rock weakness; however, Tera Steel is also a good option to allow Yveltal to become much more resilient against the likes of Extreme Killer Arceus while also turning its Stealth Rock and Fairy-type weaknesses into resistances.</li> <li>Because Yveltal is still quite physically bulky and is able to punish foes even if they boost, it is best to use Yveltal proactively rather than reactively to keep setup sweepers in check by bringing it in on predicted setup moves or to take a hit and fire back with Foul Play.</li> <li>Yveltal fits very well on offensive teams where its short-term utility and late-game cleaning prowess are put on full display, being able to almost singlehandedly shut down entire hyper offense teams that such structures otherwise have trouble against and trade blows with surprise sweepers that may otherwise run away with the game.</li> <li>Alternative Defoggers like Arceus-Ground and Giratina-O are great teammates on such teams, matching up very well against the tier's best Stealth Rock setters and keeping hazards off for Yveltal to stay as healthy as possible throughout a game.</li> <li>Offensive Necrozma-DM and Primal Groudon variants are also notable partners, being able to take advantage of the many switches Yveltal forces and the common Fairy-types it will find itself luring in for a safe setup opportunity. This allows Yveltal to clean up later. Furthermore, they are capable of setting up Stealth Rock in order to further facilitate Yveltal late-game, as Yveltal greatly appreciates the prior damage on Pokemon such as support Arceus formes and Eternatus to more easily clean up games.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 568778, "username": "NeonJolteonWasUsed"}, {"user_id": 604820, "username": "S0A0M0I0"}, {"user_id": 652323, "username": "Anchor9"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 604820, "username": "S0A0M0I0"}, {"user_id": 611966, "username": "Weirdhamster"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Zygarde": {
    "sets": {
      "Defensive": {
        "description": "<ul> <li>Between the highest physical bulk in the metagame after triggering Power Construct and the need for only one attacking move to hit most of the tier for neutral damage, Zygarde is the best wall in the tier. It is capable of handling multiple top threats in the tier such as Primal Groudon, Mega Salamence, and Necrozma-DM.</li> <li>Thousand Arrows is a potent Ground-type STAB move that hits airborne foes, leaving only Tera Grass users like defensive Ho-Oh as legitimate switch-ins that can still be played around by Zygarde. Glare allows Zygarde to cripple any foe it can stay in against, rendering them easier to outspeed for itself and its allies, which include offensive Arceus formes and Primal Groudon.</li> <li>Coil enables Zygarde to become a wincon and makes it hard to break past on the physical side. It becomes a bulky sweeper if the other team can't force it out, easily setting up on foes such as Necrozma-DM, Primal Groudon, and Arceus-Dark.</li> <li>Rest provides Zygarde with longevity to not worry as much about being worn down and renders status effects such as Toxic poison from Arceus-Dark and Primal Groudon and burn from the likes of Ho-Oh's Sacred Fire and Arceus-Dark's Will-O-Wisp as ineffective methods to cripple it in the long run.</li> <li>Terastallizing covers Zygarde's 4x weakness to Ice-type moves, rendering it much harder to KO by foes such as Arceus-Water and the uncommon Calyrex-I. Tera Water Zygarde excels at checking the previously mentioned Pokemon while gaining uncommon weaknesses, turning into a good answer to Pokemon like defensive Primal Kyogre, Zacian-C, and Dragon Dance Necrozma-DM. Tera Fairy renders it immune to phazing by Dragon Tail from opposing Zygarde while also becoming a sturdy wall against foes such as Marshadow, Yveltal, and Arceus-Dark. Tera Poison keeps Zygarde as a good check to foes such as Marshadow, Arceus-Fairy, and Eternatus, raises Zygarde's longevity by becoming immune to Toxic from support Arceus formes, and lets it absorb Eternatus's Toxic Spikes, supporting its team with entry hazard control.</li> <li>Before Terastallizing, it's best for Zygarde's base typing to be considered in relation to the opposing team. For example, as Zygarde is among the most solid Primal Groudon answers, Terastallizing will worsen its matchup against it; therefore, it often Terastallizes mid- or late-game when Primal Groudon is no longer an issue.</li> <li>Marshadow's Spectral Thief can steal Zygarde's setup boosts, so it's best to avoid trying to set up while Marshadow remains a threat on the other team.</li> <li>As Zygarde wants to trigger Power Construct to considerably raise its stats, it's often a good idea to bring Zygarde in early-game to cripple and wear down foes and let Zygarde itself get worn down into range for its ability to trigger.</li> <li>Zygarde's special bulk can be lacking even as Zygarde-C against foes like Primal Kyogre, Eternatus, and Yveltal if it cannot Terastallize, so it appreciates special walls to complement it such as Ho-Oh, Necrozma-DM, Primal Groudon, and Arceus-Fairy.</li> <li>Taunt from foes such as support Arceus formes, Gothitelle, and Yveltal considerably shut Zygarde down; therefore, it likes wallbreakers to handle them that don't mind Taunt like Zacian-C and Primal Kyogre.</li> <li>As Zygarde provides speed control by using Glare as much as possible, wallbreakers such as Primal Groudon, Primal Kyogre, and Marshadow benefit from the crippled Speed of foes that would otherwise outspeed them such as Zacian-C, Mega Mewtwo Y, and Eternatus. In return, these teammates threaten Ho-Oh, which can phaze Zygarde with Whirlwind and shrug off the damage with Regenerator. This makes Zygarde a solid option for bulky offense and more defensive team structures ranging from balance to stall.</li> </ul>"
      },
      "Dragon Dance": {
        "description": "<ul> <li>Dragon Dance Zygarde is among the most threatening setup sweepers available, benefitting from its gargantuan bulk and access to the extremely valuable Thousand Arrows to break through the opposing team. Thousand Arrows hits crucial targets like Primal Groudon, Ho-Oh, and Eternatus. Grounding airborne targets is fantastic and renders would-be checks like Ho-Oh and Yveltal unable to fulfill their roles properly. Substitute lets Zygarde set up on passive walls like Chansey, Gothitelle, and Giratina reliably. It also eases the activation of Power Construct and blocks status, which is especially useful against Ho-Oh's Sacred Fire and Primal Groudon's Toxic.</li> <li>Dragon Tail grants a powerful phazing tool to force out what would otherwise be hard checks and counters like Dondozo, defensive Tera Grass Ho-Oh, and Coil Zygarde. Against Ho-Oh in particular, Zygarde outruns it once boosted and can use Dragon Tail before it uses Whirlwind. Glare ruins aggressive switches from Pokemon like Arceus-Ground, Arceus-Dark, and Marshadow that would attempt to offensively check it.</li> <li>Leftovers grants Zygarde appreciated recovery, which is especially useful against passive foes such as defensive Ho-Oh, Chansey, and Blissey that fail to break its Substitute. Zygarde can also opt for Groundium Z to turn Thousand Arrows into Tectonic Rage, which lets it OHKO foes like Primal Groudon, Marshadow, and Ultra Necrozma at +1. At +2, it can even OHKO foes like defensive Arceus-Dark and Arceus-Ground after some chip damage. Alternatively, Dragonium Z with Dragon Tail allows Zygarde to get a surprise OHKO at +1 on Mega Salamence, as well as opposing defensive Zygarde after some chip damage, which would otherwise try to set up on it. Thanks to Devastating Drake having neutral priority, unlike Dragon Tail, Zygarde can easily eliminate Ditto and phazers like Giratina and opposing Dragon Tail Zygarde.</li> <li>Investing 12 EVs in HP maximizes Leftovers recovery. Alongside 48 EVs in Special Defense, it allows Zygarde to survive one Ice Beam from defensive Arceus formes. The even HP spread also allows Zygarde to activate Power Construct after only two Substitutes if using a Z-Crystal. Investing 232 EVs in Speed lets Zygarde outrun Eternatus at +1 after Power Construct.</li> <li>Tera Ground is the premier Tera type when running Leftovers, further boosting Thousand Arrows and allowing it to almost always OHKO Marshadow at +1 while 2HKOing fast support Arceus-Ground. It also turns Zygarde's 4x weakness to Ice into a 2x weakness, which is especially relevant against defensive Arceus formes like Arceus-Ground and Arceus-Water.</li> <li>Zygarde can also opt for a defensive Tera type. With Tera Fairy, it becomes immune to Dragon, blocking any attempt at phazing it from the likes of Giratina and opposing Dragon Tail Zygarde. Tera Water can be used to turn the tables against defensive Primal Kyogre thanks to granting Zygarde a resistance to both Scald and Ice Beam. Removing its weakness to Fairy also allows Zygarde to set up one more time against the likes of Zacian-C and Arceus-Fairy and retaliate harder with a boosted Thousand Arrows.</li> <li>Dragon Dance Zygarde is a good choice on bulky offense teams looking for a good way to disrupt and clean the opposing team once it has been chipped down.</li> <li>It's preferable to keep this Zygarde set unrevealed before attempting to set up. In particular, this set works best if the opponent is forced to Terastallize a non-Tera Fairy Pokemon, like Tera Grass Ho-Oh, so Zygarde can spam Dragon Tail with ease.</li> <li>Another good strategy is to reveal Substitute early to activate Power Construct and then attempt to sweep later in the game once Zygarde has been made much more bulky thanks to its ability.</li> <li>Due to the fact that this set trades off its defensive aspect for more offensive power, a good defensive core is often required to address setup sweepers before Zygarde can find an opportunity to set up itself. Primal Kyogre, defensive Ho-Oh, and Arceus-Dark all help to deal with common setup sweepers like Primal Groudon, Arceus-Ground, and Ultra Necrozma.</li> <li>Wallbreakers like Choice Band Marshadow, special Ultra Necrozma, and Rayquaza can help chip away at Tera Fairy physical walls like Roar Giratina, defensive Zygarde-C, and Dondozo that this set cannot break nor phaze once they have Terastallized.</li> </ul>"
      },
      "Trapper": {}
    },
    "credits": {"writtenBy": [{"user_id": 415367, "username": "Eledyr"}, {"user_id": 434487, "username": "Bobsican"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 415367, "username": "Eledyr"}, {"user_id": 434487, "username": "Bobsican"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}, {"user_id": 470115, "username": "SolarBeam"}, {"user_id": 297659, "username": "deetah"}]}]}
  },
  "Lunala": {"sets": {"Calm Mind": {}, "Power Herb": {}, "Defensive": {}, "Choice Specs": {}}},
  "Necrozma-Dusk-Mane": {
    "sets": {
      "Ultra Dragon Dance": {
        "description": "<ul> <li>Necrozma-DM's incredible stats in both formes, excellent offensive movepool, and powerful boosting option in Dragon Dance make it one of NatDex Ubers's premier sweepers.</li> <li>Earthquake targets Steel-types such as opposing Necrozma-DM and Zacian-C and also hits Primal Groudon for super effective damage.</li> <li>Stone Edge OHKOes Ho-Oh, which can tank any of +1 Necrozma-DM's other moves except Light That Burns the Sky and either phaze it or use Sacred Fire to hit it pre-Ultra Burst for super effective damage and threaten both formes with a burn. Sunsteel Strike targets Fairy-types such as Arceus-Fairy, and it's especially powerful when it has STAB pre-Ultra Burst. Outrage is an alternative, offering Ultra Necrozma a powerful STAB attack that can hit Dark-types like Yveltal and Arceus-Dark for huge damage, but leaving Necrozma locked into the move makes it a niche option.</li> <li>Light That Burns the Sky provides +1 Ultra Necrozma with the means to OHKO foes such as offensive Arceus formes and defensive Ho-Oh, though Necrozma-DM cannot use it before or on the turn it Ultra Bursts.</li> <li>The given EV spread lets Ultra Necrozma always survive Choice Band Marshadow's Shadow Sneak from full HP. An Adamant nature provides Necrozma-DM with better damage ranges against foes such as Arceus formes, though Jolly lets Ultra Necrozma outspeed foes like offensive Arceus formes unboosted.</li> <li>Necrozma-DM best fits on offense teams looking for an exceptionally powerful sweeper that can set up on common offensive threats like Zacian-C.</li> <li>Choosing when to Ultra Burst is essential to letting Necrozma-DM sweep. Doing so provides Ultra Necrozma with the ability to outspeed the entire unboosted metagame and many boosted threats when at +1, such as the likes of Zacian-C and +2 Rock Polish Primal-Groudon, foes a +1 Necrozma-DM fails to outspeed. However, Necrozma-DM's defensive profile becomes considerably worse when it Ultra Bursts, losing bulk, Prism Armor, and many of its resistances, notably exchanging its resistances to Fairy and Ice for weaknesses. However, the loss of its weaknesses to Fire and Ground, notably gaining a resistance to the former, does help Necrozma-DM better take on foes such as Primal Groudon. Gaining a resistance to Water also allows Ultra Necrozma to have an easier time handling Primal Kyogre. Additionally, the increase in Necrozma-DM's power, notably against foes weak to its moves thanks to Neuroforce, and access to Light That Burns the Sky make Ultra Necrozma a more potent wallbreaker.</li> <li>Necrozma-DM enjoys support from entry hazard setters like Deoxys-S, which can wear down foes such as Arceus-Dark and Primal Groudon. Dual screens setters like Grimmsnarl are notably helpful for allowing Necrozma-DM to set up very easily on common attackers like Zacian-C and Eternatus.</li> <li>Fellow wallbreaking and sweeping teammates such as Zacian-C and Arceus can help break holes in the opposing team for Necrozma-DM by eliminating or weakening foes such as Arceus-Dark and Ho-Oh, or they can sweep using the holes it creates breaking through bulky foes such as Primal Groudon and support Arceus formes.</li> </ul>"
      },
      "Dragon Dance": {
        "description": "<ul> <li>Dragon Dance Necrozma-DM is a ferocious wallbreaker and cleaner that finds a home on bulky offense and balance teams. Necrozma-DM is able to leverage its bulk, typing, ability, and the possbility of bluffing the threat of Ultra Necrozma to force a switch or absorb an incoming attack such as Primal Groudon's Precipice Blades or Arceus-Dark's Foul Play and then use Dragon Dance.</li> <li>If Ho-Oh is sufficiently covered, Stone Edge can be substituted for Photon Geyser. This move still hits Ho-Oh hard while enabling Necrozma-DM to beat Dondozo, which would otherwise wall it. It has the added benefit of OHKOing Eternatus without the need to spend a turn stat boosting.</li> <li>Solganium Z allows Necrozma-DM to OHKO common switch-ins such as Arceus-Dark, Yveltal, and Zygarde with +1 Searing Sunraze Smash mid-game, clearing the way for its teammates.</li> <li>The extra bulk provided by 132 HP EVs allows Necrozma-DM to avoid OHKOs from some hits it otherwise wouldn't while still hitting important Speed benchmarks. For example, Necrozma-DM will survive Life Orb Marshadow's Poltergeist after Stealth Rock, defensive Primal Groudon's Precipice Blades after a single layer of Spikes, and defensive Primal Kyogre's +1 Scald. With 124 Speed EVs, Necrozma-DM has the ability to outspeed uninvested base 90s with a neutral nature such as defensive Primal Groudon and Ho-Oh. At +1 Necrozma-DM outspeeds fully invested Yveltal. At +2 Necrozma-DM outspeeds the entire unboosted metagame, only fearing priority moves such as Marshadow's Shadow Sneak or Yveltal's Sucker Punch.</li> <li>Alternatively, investing in 236 Speed EVs allows Necrozma-DM to outspeed fully invested base 120s at +1 such as Arceus-Ground and Mega Salamence. If Necrozma-DM uses Dragon Dance on the switch-in, it retains the ability to OHKO Mega Salamence with Searing Sunraze Smash with minimal chip after Intimidate removes Necrozma-DM's Attack boost.</li> <li>Due to a lack of recovery, Necrozma-DM needs to be cognisant of its HP, as any chip is permanent. Necrozma-DM frequently absorbs large hits while setting up or revenge killing certain threats, and taking chip may render it unable to do so. For example, Necrozma-DM always survives defensive Primal Groudon's Precipice Blades after a layer of Spikes but can be OHKOed if Stealth Rock is also on the field.</li> <li>Dragon Dance Necrozma-DM should not be used to fulfill the defensive duties typically associated with Necrozma-DM such as switching into an unscouted Zacian-C, though it can revenge kill them. It excels when used as a secondary check to them, with teammates such as Ho-Oh and Primal Groudon serving as primary checks.</li> <li>Necrozma-DM struggles heavily against offensive Primal Groudon, Marshadow, and physical Arceus-Ground. Offensive Primal Groudon is able to OHKO Necrozma-DM with its STAB moves. Marshadow is always able to revenge kill Necrozma-DM with Shadow Sneak and OHKO it with Poltergeist. Physical Arceus-Ground OHKOes Necrozma-DM with Tectonic Rage and can threaten to sweep if given the opportunity to use Dragon Dance. Zygarde is an excellent teammate on balance teams that can switch into all three of these Pokemon and provides valuable paralysis support, which allows Necrozma-DM to outspeed the entire unboosted metagame. Giratina-O is a good teammate on bulky offense teams that can switch into Primal Groudon and Arceus-Ground. Necrozma-DM also appreciates the Defog and status support provided by Giratina-O.</li> <li>Arceus-Fairy provides a Dark switch-in on balance teams, which helps mitigate the downside of misfiring Searing Sunraze Smash into the wrong target. It is a good check to Life Orb Yveltal, which is otherwise very threatening to balance teams and can revenge kill Necrozma-DM with Sucker Punch. Arceus-Fairy can also provide Stealth Rock and status support in the form of Will-O-Wisp and Toxic to chip opposing Pokemon into range of Necrozma-DM's attacks such as Primal Groudon, Zacian-C, and Arceus-Ground.</li> </ul>"
      },
      "Defensive": {}
    },
    "credits": {"writtenBy": [{"user_id": 523420, "username": "bumboclaat"}, {"user_id": 535530, "username": "Gangsta Spongebob"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 434487, "username": "Bobsican"}]}, {"name": "Grammar checked by", "members": [{"user_id": 327515, "username": "Zrp200"}, {"user_id": 470115, "username": "SolarBeam"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Marshadow": {
    "sets": {
      "All-Out Attacker": {},
      "Bulk Up": {
        "description": "<ul> <li>With Bulk Up increasing its already great Attack stat; a STAB combination no viable Pokemon resists; great STAB options in Poltergeist, Low Kick, Spectral Thief; and a strong priority move in Shadow Sneak further boosted by Technician, Bulk Up Marshadow is an incredible mid- to late-game wallbreaker and cleaner that can threaten a great majority of the metagame.</li> <li>Spectral Thief is a fantastic tool that not only steals boosts from common boosted threats such as Coil Zygarde, the many Calm Mind Arceus variants, and slow Dragon Dance Necrozma-DM variants but also threatens these targets for huge damage. Alternatively, Poltergeist can be used for its higher Base Power; this comes in handy with Tera Ghost, as it can OHKO defensive Primal Kyogre at +1 after Stealth Rock damage for example.</li> <li>Low Kick perfectly complements Marshadow's Ghost-type attacks and forms a nearly unresisted STAB combination. Due to the heavy weight of Pokemon in Ubers, Low Kick is preferred to Close Combat because it has no drawbacks while still having 120 Base Power against common targets like Primal Groudon, Primal Kyogre, Arceus, and Arceus-Dark.</li> <li>Shadow Sneak is a powerful tool that can eliminate Speed-boosted and naturally faster targets such as Deoxys-A, as well as weakened Dragon Dance Arceus-Ground and Ultra Necrozma.</li> <li>Tera Ghost is the premier choice because it further amplifies Marshadow's damage output. In particular, it allows Poltergeist to OHKO defensive Necrozma-DM at +1, OHKO Dragon Dance Zygarde at +1 and—after Stealth Rock damage—almost always 2HKO defensive Arceus-Fairy when unboosted. Turning into a pure Ghost-type also comes in handy in order to tank one hit from the likes of Arceus-Fairy and Ultra Necrozma.</li> <li>Life Orb is the best item in order to maximize the damage Marshadow can deal. Spell Tag can also be used, granting its Ghost-type attacks a 20% damage boost with no drawbacks. The drop in power is significant, however; for example, Spell Tag Marshadow is not guaranteed to 2HKO defensive Primal Groudon at +1 with Poltergeist.</li> <li>A Jolly nature is generally recommended in order to ensure that Marshadow always outspeeds Arceus formes as well as Mega Salamence. An Adamant nature further boosts Marshadow's Attack, giving it a chance to OHKO defensive Necrozma-DM at +1 with Poltergeist.</li> <li>Marshadow likes entry hazards for their ability to hinder common switch-ins such as Arceus-Fairy, Primal Groudon, and Zygarde-C; thus, Spikes support from Primal Groudon and Toxic Spikes support from Eternatus are welcome.</li> <li>Marshadow hates switching in on entry hazards, as their damage racks up quickly when factoring its poor bulk, lack of recovery, and the possible Life Orb recoil. Thus, a Defogger like Ho-Oh or Giratina-O fits well with Marshadow. On top of that, Ho-Oh and Giratina-O can easily spread status and cripple the likes of Arceus-Fairy and Primal Groudon.</li> </ul>"
      },
      "Choice Band": {}
    },
    "credits": {"writtenBy": [{"user_id": 415367, "username": "Eledyr"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 535530, "username": "Gangsta Spongebob"}, {"user_id": 434487, "username": "Bobsican"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Grimmsnarl": {"sets": {"Dual Screens": {}}},
  "Zacian-Crowned": {
    "sets": {
      "Swords Dance": {
        "description": "<ul> <li>Zacian-C's sky-high Attack and Speed stats, solid coverage, and great defensive typing make it one of the most threatening and metagame-warping Pokemon in National Dex Ubers.</li> <li>Zacian-C's choice of STAB move is flexible. Play Rough allows it to hit Zygarde-C, Arceus-Dark, and Mega Salamence; Behemoth Blade can be opted for instead, hitting opposing Fairy-types like Arceus-Fairy while being an overall more consistent STAB option.</li> <li>Zacian-C's third moveslot is also flexible; Close Combat provides coverage against Pokemon like Necrozma-DM and Ferrothorn and should be ran with Tera Fighting to let Zacian-C hit important damage thresholds like OHKOing Primal Groudon after a Swords Dance.</li> <li>Tera Blast can be opted for instead with Tera Ground, hitting the aforementioned Steel-types as well as Pokemon like Primal Groudon and Necrozma-DM.</li> <li>Finally, Play Rough can be run alongside Behemoth Blade to give Zacian-C a useful alternative STAB move.</li> <li>Wild Charge gives Zacian-C coverage against Ho-Oh, which otherwise completely walls it.</li> <li>Zacian-C fits best on more offensive teams looking for a solid wallbreaker and setup sweeper, also operating as a light check to Pokemon like Extreme Killer Arceus and Yveltal thanks to its naturally great typing. It particularly excels in the hyper offense mirror matchup thanks to its typing and Speed tier.</li> <li>Zacian-C usually struggles against physically defensive walls that resist its STAB moves like Ho-Oh, Primal Groudon, and Necrozma-DM, so Pokemon like Primal Kyogre and Arceus-Ground that can directly threaten these walls are helpful to have.</li> <li>Defog support from the likes of Arceus-Ground, Arceus-Fairy, and Yveltal can help with Zacian-C's vulnerability to entry hazards.</li> <li>Zacian-C oftentimes needs Terastallization to beat its checks, which should be kept in mind. It also needs to pick its targets carefully, as Intrepid Sword only activates once per game.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 399174, "username": "entrocefalo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 327515, "username": "Zrp200"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Eternatus": {
    "sets": {
      "Defensive": {
        "description": "<ul> <li>Defensive Eternatus stands out as a top-tier defensive staple, as it is able to completely wall Arceus-Dark, is immune to Toxic, and can simultaneously serve as one of the few Knock Off absorbers in the tier. Its Speed tier allows it to outpace Arceus formes and Marshadow while maintaining enough bulk to withstand hits and provide a soft check against threats like Ho-Oh and Primal Kyogre. Moreover, Pressure enables Eternatus to PP stall moves like Water Spout from Primal Kyogre, Judgment from Arceus-Fairy, Sacred Fire and Defog from Ho-Oh, and Dynamax Cannon from opposing Eternatus. Finally, its capability to spread status adds another layer of utility, making Eternatus a premier choice for balanced team compositions.</li> <li>Toxic Spikes in conjunction with Pressure gives Eternatus a distinct advantage in breaking opposing teams, thanks to its ability to set entry hazards and PP stall Defog from prevalent Defoggers like Ho-Oh and Giratina-O. Toxic serves as a potent tool for gradually wearing down Pokemon such as Calm Mind Primal Kyogre without Rest, Yveltal, and Arceus. Additionally, it ensures gradual damage against defensive Arceus formes lacking Refresh, Primal Groudon, and Ho-Oh.</li> <li>Sludge Bomb finds its primary utility in targeting Arceus-Fairy. Additionally, it offers the potential to poison Pokemon that are immune to Toxic Spikes, notably Ho-Oh and Giratina-O, which would otherwise clear entry hazards against Eternatus.</li> <li>Flamethrower acts as a countermeasure against Steel-types, such as Zacian-C and Necrozma-DM, that would attempt to take advantage of Eternatus, since they are immune to being poisoned. Alternatively, Mystical Fire serves a similar purpose by punishing Steel-types while also limiting Calm Mind Arceus formes. However, it's important to note that Mystical Fire's damage output is weaker than Flamethrower, and as a result, Mystical Fire fails to secure a 2HKO against Zacian-C after Stealth Rock. Flamethrower is also favored as a tool against Necrozma-DM, since it has the potential to inflict a burn, rendering Mystical Fire less effective.</li> <li>Combining Toxic with Toxic Spikes forms another viable strategy that affects all prevalent Defoggers immune to Toxic Spikes, making it easier to maintain entry hazards throughout the match. However, relying solely on these moves without coverage options can leave Eternatus vulnerable against Steel-types like Necrozma DM, Magearna, and Ferrothorn.</li> <li>Leftovers is the preferred item to help Eternatus handle burns from Ho-Oh and mitigate the damage from attacks such as Ice Beam from Primal Kyogre and most attacks from Marshadow. Heavy-Duty Boots serves as a good alternative to avoid entry hazard damage, particularly if the team lacks Defoggers.</li> <li>Eternatus's EV spread enables it to outspeed a fully invested Yveltal while not being 2HKOed by specially offensive Yveltal's Dark Pulse and Choice Band Marshadow's Spectral Thief. An EV spread of 80 HP / 252 SpD / 176 Spe with a Timid nature makes it possible for Eternatus to outspeed fully invested Arceus formes while still not be 2HKOed by specially offensive Yveltal's Dark Pulse at the cost of physical bulk. An alternative spread of 40 HP / 252 Def / 216 Spe, which is faster than Marshadow, can deal with physical threats such as Ho-Oh, Marshadow, and Arceus. However, another dedicated wall is necessary to check specially offensive threats like Primal Kyogre and Arceus-Fairy.</li> <li>Tera Fairy enhances Eternatus's capability against Palkia-O, Life Orb Yveltal, Giratina-O, and Calm Mind Arceus-Dark, while Tera Water improves Eternatus's matchup against Necrozma-DM, Primal Groudon, and Arceus-Ground.</li> <li>Eternatus should freely switch into Yveltal and Ho-Oh lacking Thunder Wave and aim to set up Toxic Spikes to threaten Primal Groudon and defensive Arceus formes. It's best to reserve Terastallization as a last resort, since it compromises Eternatus's valuable Toxic immunity.</li> <li>Ho-Oh synergizes well with Eternatus, especially in the presence of Toxic Spikes, as it can phaze foes with Whirlwind and provides an immunity to Ground. Arceus-Dark is another good partner since it can deal with Necrozma-DM, which is immune to Toxic, and Mega Mewtwo Y.</li> <li>Zygarde-C is another excellent choice as a teammate, offering the ability to safely switch in against Primal Groudon and Marshadow. Additionally, a specially defensive Zygarde-C can utilize Glare against opposing Eternatus, ensuring that it maintains the speed advantage. Giratina is another valuable teammate that is capable of dealing with Primal Groudon. It also has Pressure, which significantly enhances the PP stall strategy when paired with Eternatus.</li> <li>When utilizing physically defensive Eternatus, it's crucial to include another Primal Kyogre check on the team, such as Primal Groudon, Ferrothorn, or Chansey. Ferrothorn can offer valuable entry hazard support by setting up Spikes and Stealth Rock, and it appreciates Eternatus switching in to handle Ho-Oh. Additionally, Chansey can effectively handle most special attackers and use Heal Bell to cure eventual paralysis on Eternatus, further increasing Eternatus's longevity throughout the match.</li> </ul>"
      },
      "Z-Move": {},
      "Meteor Beam": {
        "description": "<ul> <li>Meteor Beam Eternatus is a very potent threat that fully exploits its offensive potential while keeping some of its good defensive traits thanks to its Poison typing, which allows it to come in and absorb Toxic Spikes and Toxic.</li> <li>Not only does Meteor Beam boost Eternatus's already good Special Attack, it also lures in and removes Ho-Oh while dealing great damage to targets such as Yveltal, Primal Groudon, and Primal Kyogre.</li> <li>Power Herb is required to make Meteor Beam a single-turn attack. This also means that Meteor Beam Eternatus will generally get a single opportunity to set up and make progress.</li> <li>Dynamax Cannon is the premier STAB move of choice for Eternatus, and it's preferred over Draco Meteor and Dragon Pulse because despite its low PP, it has high Base Power and no drawbacks, and it also keeps key KOs. For example, after a Meteor Beam boost, Eternatus can 2HKO specially defensive Primal Groudon with Dynamax Cannon as well as 2HKO Primal Kyogre with the move after Stealth Rock damage.</li> <li>Sludge Bomb is important to remove Fairy-types like Arceus-Fairy, which can otherwise easily survive what Eternatus throws at them and use it as setup fodder. Spreading poison with this move is also useful to hinder some of its soft checks, like Primal Kyogre, Arceus-Ground, and Ho-Oh.</li> <li>Flamethrower covers Steel-types like Necrozma-DM, which takes pitiful damage from Dynamax Cannon and Meteor Beam and can force Eternatus out by setting up with Dragon Dance or crippling it with Thunder Wave. Fire Blast can be used for its higher Base Power in order to take out defensive Necrozma-DM as well as Zacian-C at +1.</li> <li>A Timid nature is crucial in order to outrun unboosted Ultra Necrozma and certain threats like Arceus, Mega Salamence, and Marshadow. It also Speed ties with opposing offensive Eternatus.</li> <li>Tera Dragon further increases Dynamax Cannon's damage output, allowing Eternatus to menace key threats. For example, +1 Tera Dragon Dynamax Cannon can 2HKO Tera Water Zygarde-C and can OHKO it prior to Power Construct after a layer of Spikes. It also 2HKOes Ho-Oh and OHKOes Marshadow, and it additionally OHKOes defensive Arceus-Ground after a layer of Spikes.</li> <li>Tera Dragon also suppresses Eternatus's weaknesses associated with its Poison typing, letting Eternatus survive Primal Groudon's Precipice Blades, Ultra Necrozma's Photon Geyser, and Arceus-Ground's Judgment.</li> <li>Tera Fire turns the tables against Zacian-C, allowing Eternatus to not only survive any hits from it but also OHKO Zacian-C with Fire Blast without a boost. Tera Fire Eternatus can also benefit from its new resistance to Fairy-type attacks to serve as a check in a pinch to other Fairy-types like Calm Mind Arceus-Fairy.</li> <li>Meteor Beam Eternatus fits best on offensive teams that are looking for a mid- to late-game wallbreaker and cleaner with sufficient Speed to outrun common threats to offensive teams like unboosted Ultra Necrozma and Xerneas. Cleaners like Double Dance Primal Groudon and Extreme Killer Arceus as well as wallbreakers like offensive Calm Mind Primal Kyogre and Ultra Necrozma appreciate the support of Eternatus chipping their shared checks like Primal Groudon, Ho-Oh, and Giratina-O.</li> <li>Sticky Web support from teammates like Smeargle, Shuckle, and Ribombee further increases Eternatus's ability to threaten common anti-offense Pokemon like Dragon Dance Ultra Necrozma, allowing it to outrun and remove them.</li> </ul>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 399174, "username": "entrocefalo"}, {"user_id": 415367, "username": "Eledyr"}], "teams": [{"name": "Set(s) by", "members": [{"user_id": 434487, "username": "Bobsican"}]}, {"name": "Quality checked by", "members": [{"user_id": 327515, "username": "Zrp200"}, {"user_id": 434487, "username": "Bobsican"}, {"user_id": 535530, "username": "Gangsta Spongebob"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}, {"user_id": 527276, "username": "Techno"}, {"user_id": 327515, "username": "Zrp200"}, {"user_id": 594478, "username": "ken"}]}]}
  },
  "Flutter Mane": {"sets": {"Calm Mind": {}}}
}