{
  "Muk": {
    "sets": [
      {
        "name": "Utility",
        "description": "<p>Muk serves as a great tank and Haze user in SV NU, checking various special attackers such as Vivillon and Zoroark and threatening them with Poison Jab and Drain Punch respectively. Poison Touch and Poison Jab let Muk effortlessly spread poison, even on Pokemon immune to Toxic Spikes such as Drifblim and Eelektross. Drain Punch hits Steel-types such as Copperajah and Terastallized Appletun that would otherwise wall Muk. Haze stops setup sweepers such as Vivillon and Calm Mind Vaporeon from setting up. Toxic Spikes lets Muk take advantage of free turns and cripple the opposing team with poison. Tera Dark allows Muk to beat threats like Bruxish and Zoroark after baiting them into their powerful Dark- and Psychic-type attacks and retaliate back while also being able to Haze boosted Stored Power users like Veluza and Farigiraf. Alternatively, Tera Water provides an overall better defensive typing, more specifically easing the matchup against offensive Water-types like Calm Mind Vaporeon and Choice Specs Clawitzer. Muk struggles with Pokemon such as Sandaconda, which does not fear its poison due to Shed Skin and can threaten it back with Earthquake. As a result, Muk appreciates teammates such as Rotom, Eelektross, and Cacturne, which can switch into Sandaconda and force it out. Muk is physically frail, making physical walls such as Sandaconda and Drifblim great partners, with the latter also getting rid of entry hazards, which chip Muk down throughout a game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Togkey"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}]}], "writtenBy": [{"user_id": 595639, "username": "plznostep"}]}
  },
  "Electrode": {"sets": [{"name": "Offensive Pivot"}]},
  "Chansey": {"sets": [{"name": "Utility"}]},
  "Scyther": {"sets": [{"name": "Pivot"}, {"name": "Swords Dance"}]},
  "Vaporeon": {"sets": [{"name": "Defensive"}]},
  "Jolteon": {
    "sets": [
      {
        "name": "Calm Mind Sweeper",
        "description": "<p>The fastest Pokemon available in the tier, Jolteon is an amazing setup sweeper thanks to Calm Mind and its great coverage found through Terastallization. Volt Switch whittles down special walls like Chansey and Muk while safely bringing in a teammate better suited to taking them on such as Bruxish or Sandaconda. An Ice-type Tera Blast gives Jolteon a move to hit Ground- and Grass-types like Sandaconda and Appletun super effectively. Heavy-Duty Boots allows Jolteon to safely pivot in and out of battle without being worn down by entry hazards, especially if it's Terastallized, although it may also use a Life Orb for extra damage output. Jolteon is quite frail, making it vulnerable to revenge killing from Choice Scarf users like Passimian, Bruxish, and Mabosstiff. Passimian, Mabosstiff and Bruxish are also great offensive partners that hit Jolteon's defensive checks in Chansey and Muk. A great defensive partner is Drifblim; it switches into Ground- and, when Jolteon has Terastallized, Fighting-type moves.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Togkey"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 399621, "username": "outbackrabbit"}]}
  },
  "Umbreon": {"sets": [{"name": "Utility"}, {"name": "Calm Mind"}]},
  "Medicham": {"sets": [{"name": "Choice Scarf"}, {"name": "All-Out Attacker"}]},
  "Camerupt": {"sets": [{"name": "Defensive Utility", "description": "<p>Fire Spin and Grass Tera Blast can effectively lure otherwise undesirable matchups like Sandaconda and Vaporeon. 88 Speed allows Camerupt to outspeed the likes of Muk, Crocalor, and Perrserker</p> "}]},
  "Cacturne": {"sets": [{"name": "Offensive Spikes"}, {"name": "Swords Dance Sweeper"}]},
  "Zangoose": {"sets": [{"name": "Swords Dance"}]},
  "Whiscash": {"sets": [{"name": "Hazard Lead"}]},
  "Vespiquen": {"sets": [{"name": "Pivot"}]},
  "Spiritomb": {"sets": [{"name": "Calm Mind"}]},
  "Toxicroak": {"sets": [{"name": "Swords Dance"}]},
  "Abomasnow": {"sets": [{"name": "Snow Support"}, {"name": "Swords Dance"}]},
  "Rotom": {"sets": [{"name": "Choice Scarf"}, {"name": "Utility"}, {"name": "Nasty Plot"}]},
  "Rotom-Frost": {"sets": [{"name": "Choice Scarf"}, {"name": "Nasty Plot"}]},
  "Basculin": {"sets": [{"name": "Choice Band"}]},
  "Clawitzer": {"sets": [{"name": "Specs Wallbreaker"}]},
  "Crabominable": {"sets": [{"name": "Assault Vest Tank"}]},
  "Lycanroc": {"sets": [{"name": "Choice Band"}, {"name": "Swords Dance"}]},
  "Passimian": {
    "sets": [{"name": "Choice Scarf", "description": "<p>Choice Scarf Passimian is an elite revenge killer and pivot in NU thanks to its great Speed and excellent offensive prowess. Knock Off cripples item-reliant Pokemon like Oricorio-F, Scyther, and Chansey while also targeting Ghost-types like Haunter and Rotom. U-turn pivots out of bad matchups, such as Sandaconda, Qwilfish, and Terastallized Vespiquen. Earthquake targets Poison-types like Qwilfish, Muk, and Toxicroak, while Rock Slide hits Rotom-S and Vivillon. Defiant allows Passimian to capitalize on Defog users like Drifblim and Braviary. Passimian is quite vulnerable to contact effects from Pokemon like Qwilfish, Rocky Helmet Sandaconda, and Drifblim; special attackers like Jolteon, Rotom, and Zoroark can discourage them from switching in while also forming VoltTurn cores with it.</p> "}],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Togkey"}]}, {"name": "Grammar checked by", "members": [{"user_id": 493260, "username": "royalfluxh"}]}], "writtenBy": [{"user_id": 543866, "username": "5Dots"}]}
  },
  "Bruxish": {
    "sets": [
      {"name": "Choice Band"},
      {
        "name": "Swords Dance",
        "description": "<p>Strong Jaw-boosted Psychic Fangs and Crunch turn Bruxish into a dominant offensive force in NU. It also has Aqua Jet, which lets it revenge kill weakened faster threats like Zoroark and Choice Scarf Passimian and sweep after boosting with Swords Dance. Bruxish's Speed tier is also great, allowing it to outspeed Rotom, Mabosstiff, and Bombirdier. Tera Blast can be used in the fourth moveslot in conjunction with Tera Fairy to give Bruxish a better defensive typing while also being able to beat common walls to it like Cacturne and Tera Dark Toxicroak and Vaporeon. Tera Dark combined with Strong Jaw, however, gives Crunch a deadly bite with it becoming a third STAB move to nail opposing Bruxish and Veluza. Alternatively, Tera Water makes Aqua Jet even more dangerous for the aforementioned faster threats. If Bruxish is not running Tera Fairy + Tera Blast, having a partner like Toxicroak or Rotom to deal with Tera Dark Toxicroak and Vaporeon is appreciated.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Togkey"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}], "writtenBy": [{"user_id": 83980, "username": "Oathkeeper"}]}
  },
  "Appletun": {"sets": [{"name": "Defensive Phaser"}]},
  "Sandaconda": {"sets": [{"name": "Stealth Rock"}, {"name": "Coil"}]},
  "Frosmoth": {"sets": [{"name": "Quiver Dance"}, {"name": "Utility"}]},
  "Copperajah": {
    "sets": [
      {
        "name": "Stealth Rock",
        "description": "<p>Copperajah is a premier Stealth Rock setter in NU. Its Steel typing, respectable overall bulk, and strength give it an easy time keeping Stealth Rock up and let it check prominent threats like Abomasnow and Vivillon. Copperajah is also highly adaptable in its coverage, EV spread, and Tera type, meaning it can be tailored to a team's particular needs without being inefficient. Rock Slide is a notable option over Whirlwind to hit Oricorio-F, which would otherwise use Defog or set up on Copperajah easily. Tera Flying lets Copperajah turn the tables on Fighting-types like Passimian and Toxicroak, comfortably phaze Coil Sandaconda, and surprise foes like Tera Ground Abomasnow and Frosmoth. Tera Fairy helps against Dark-types like Mabosstiff and Cacturne while still allowing Copperajah to sponge Fighting-type attacks. Tera Water patches up Copperajah's Fire weakness and, in a pinch, can also be useful against Bruxish. Wish support, such as from Vaporeon or Umbreon, is very beneficial for Copperajah to compensate for its lack of recovery. Vaporeon can also take on Fire- and Ground-types like Pyroar and Sandaconda, while Umbreon absorbs strong Dark-type attacks and punishes status attempts with Synchronize. Copperajah's phazing capabilities become more potent when paired with Spikes; Qwilfish and Vespiquen are among the best setters, and both form a solid defensive core with Copperajah on top of checking the Fighting-types that threaten it.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Togkey"}]}, {"name": "Grammar checked by", "members": [{"user_id": 493260, "username": "royalfluxh"}]}], "writtenBy": [{"user_id": 400292, "username": "asa"}]}
  },
  "Crocalor": {"sets": [{"name": "Defensive"}]},
  "Dachsbun": {"sets": [{"name": "Defensive"}]},
  "Mabosstiff": {"sets": [{"name": "Choice Scarf"}, {"name": "Choice Band"}]},
  "Bombirdier": {"sets": [{"name": "Dedicated Lead"}, {"name": "Choice user"}]},
  "Farigiraf": {"sets": [{"name": "Stored Power"}]},
  "Dudunsparce": {"sets": [{"name": "Calm Mind"}, {"name": "Coil"}, {"name": "Choice Specs"}]}
}