{
  "Arcanine-Hisui": {
    "outdated": true,
    "sets": {
      "Magic Guard": {
        "description": "<p>Hisuian Arcanine is a fearsome wallbreaker, using Magic Guard to eliminate the recoil from Life Orb and its incredibly high-Base Power STAB moves and prevent chip damage from entry hazards. Morning Sun allows Hisuian Arcanine to have defensive utility, being a useful check to Pokemon like Scream Tail and Iron Moth. Extreme Speed offsets Hisuian Arcanine's middling Speed and allows it to pick off chipped foes. Stealth Rock lets it leverage its good offensive typing against common Defog users like Corviknight and Mandibuzz to function as an offensive entry hazard setter, while Will-O-Wisp debilitates switch-ins like Great Tusk, Swampert, and Zamazenta, greatly dampening their damage output. Hisuian Arcanine greatly struggles with being revenge killed by faster threats like Roaring Moon, Chien-Pao, and Zamazenta, so it appreciates defensive teammates like Corviknight and Manaphy. Slow pivots like the aforementioned Corviknight and Manaphy can help give Hisuian Arcanine more opportunities to wallbreak. Hisuian Arcanine can struggle with Well-Baked Body Steel-types like Gholdengo, Kingambit, and Skarmory, so teammates like Sandy Shocks and Zamazenta can help by breaking through them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 594122, "username": "Evie"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Time2Bonk"}, {"user_id": 475288, "username": "Pandemonium"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Gengar": {
    "sets": {
      "Special Wallbreaker": {},
      "NormGar": {},
      "Sheer Force": {
        "outdated": true,
        "description": "<p>Gengar makes for an amazing wallbreaker, breaking through offensive threats like Gholdengo, Great Tusk, and Enamorus-T, as well as having a decent Speed tier. Focus Blast hits Dark-types that try to switch in such as Chien-Pao and Roaring Moon as well as Steel-types such as Heatran and Hisuian Goodra. Nasty Plot turns Gengar into a threatening wallbreaker, allowing it to 2HKO RegenVest Hisuian Goodra and Manaphy with its coverage options. Sludge Wave hits Fairy- and Grass-types like Enamorus-T, Hisuian Electrode, and Ogerpon-W. Energy Ball hits Ground-types like Swampert and Great Tusk, while Thunderbolt hits non-Volt Absorb Corviknight and Mandibuzz. Gengar is great at threatening physical walls like Corviknight and Deoxys-D, so it partners well with physical wallbreakers like Galarian Zapdos and Chien-Pao; in return, they can pressure special walls that Gengar struggles to break through like Hisuian Goodra and Blissey. Due to Gengar's frailty, it struggles against faster threats such as Azelf, Roaring Moon, and Chien-Pao, so defensive switch-ins to them like Mandibuzz, Great Tusk, and Intimidate Corviknight make for good partners. Gengar greatly appreciates Knock Off support from Pokemon like Swampert, Manaphy, and Deoxys-D to remove Assault Vest from RegenVest Pokemon such as Swampert, Hisuian Goodra, and Meloetta, allowing it to have an easier time breaking past the opposing team.</p>"
      },
      "Normalize": {
        "outdated": true,
        "description": "<p>Normalize Gengar not only threatens to remove opposing RegenVest pivots, often the best check to more conventional Gengar sets, but also reliably sets Toxic Spikes and wins one-on-one against slower setup threats like Swords Dance Iron Hands and Calm Mind Cresselia. Mean Look in conjunction with Skill Swap traps and removes opposing specially defensive walls like Swampert, Manaphy, and Empoleon that are aiming to check it. Skill Swap also reliably forces out and generates a free turn against any Pokemon slower than Gengar such as Sandy Shocks and Beads of Ruin Walking Wake, as they will be unable to hit it through Normalize. This makes Gengar one of the most reliable Toxic Spikes setters, as it threatens most common removal options like Corviknight and Great Tusk. Gengar is an excellent teammate for fast special cleaners like Azelf, Deoxys-S, and Iron Moth, as they benefit tremendously from opposing special walls being removed or weakened with Toxic Spikes. Gengar struggles against teams with fast Dark-types like Roaring Moon, Meowscarada, and Chien-Pao, as it cannot meaningfully damage them and is immensely threatened by them, making Pokemon like Fluffy Corviknight and physically defensive Manaphy great partners; they can also provide a slow pivot to get Gengar in safely. Weather Ball from Pokemon with Primordial Sea or Desolate Land bypasses Normalize, meaning Gengar cannot reliably force out common users like Walking Wake and Volcanion, so sturdy checks to them like RegenVest Swampert and Blissey make solid teammates.</p>"
      }
    }
  },
  "Electrode-Hisui": {
    "sets": {
      "Offensive Pivot": {},
      "Magic Guard": {
        "outdated": true,
        "description": "<p>Hisuian Electrode is a great offensive pivot thanks to its amazing Speed, access to Volt Switch, and powerful STAB Chloroblast for Ground-types like Swampert, Great Tusk, and Sandy Shocks. Thunder Wave cripples switch-ins like Roaring Moon, Hisuian Goodra, and Ogerpon-H, potentially letting Hisuian Electrode's teammates outspeed and threaten them, while Leech Seed lets it chip down walls such as Blissey and Hisuian Goodra and heal. Worry Seed removes Volt Absorb from walls like Corviknight and Empoleon and Regenerator from Hisuian Goodra and Meloetta, letting it chip the latter two, especially with entry hazards on the field. Hisuian Electrode forms a great VoltTurn core with other offensive pivots like Barraskewda, Roaring Moon, and Slither Wing, as they can bring it in on physical walls like Corviknight and Great Tusk, and it can bring them in on special walls like Hisuian Goodra and Meloetta. Entry hazard setters like Heatran, Scream Tail, and Deoxys-D are great teammates thanks to hazards wearing down Hisuian Electrode's switch-ins like Roaring Moon, Hisuian Goodra, and Heatran; in return, it can threaten common hazard removers like Corviknight, Great Tusk, and Mandibuzz. Hisuian Electrode struggles to break through specially defensive walls like Blissey, Hisuian Goodra, and Meloetta, so physical wallbreakers like Ceruledge and Galarian Zapdos are appreciated. Hisuian Electrode is also frail and has a middling defensive typing, so slow, bulky pivots that can take a hit and safely pivot it in like Corviknight and Swampert make good partners.</p>"
      }
    }
  },
  "Chansey": {
    "outdated": true,
    "sets": {
      "Wall": {
        "description": "<p>Chansey acts as an extremely niche special wall and is typically found on fat or stall teams looking for a check to setup sweepers like Volcarona, Cresselia, and Iron Crown. Seismic Toss prevents Chansey from being a sitting duck, limiting its passivity by dealing decent chip damage. Heal Bell provides extremely valuable and rare utility by allowing Chansey to act as a cleric, removing status from teammates like Pecharunt and Mandibuzz. Stealth Rock allows it to provide more general utility for its team, allowing it to wear down offensive threats like Roaring Moon, Azelf, and Deoxys-S over time, whereas Thunder Wave debilitates foes while enabling teammates like Hex Gholdengo and Pecharunt. Protect is a niche option that lets it scout out which move a Choice-locked foe like Ceruledge, Roaring Moon, or Azelf will use, easing prediction and allowing the right play to be made. Unaware lets it comfortably check special setup sweepers like Thundurus, Iron Moth, and the aforementioned Volcarona. Chansey's relatively low Defense and susceptibility to Knock Off from users like Roaring Moon, Galarian Zapdos, and all Ogerpon formes make physically bulky Pokemon that can switch into them like Great Tusk, Fluffy Corviknight, and Iron Hands good teammates. Entry hazard removers like Great Tusk, Mandibuzz, and Corviknight are greatly appreciated due to Chansey's vulnerability to hazards, allowing it to more effectively act as a special wall.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 475288, "username": "Pandemonium"}, {"user_id": 528036, "username": "Sulo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Zapdos": {
    "sets": {
      "Primordial Sea": {},
      "No Guard": {
        "description": "<p>Zapdos is able to take advantage of No Guard to spam its normally inaccurate but powerful STAB moves and reliably spread paralysis with Zap Cannon. U-turn does solid damage to Roaring Moon, and lets Zapdos pivot out against special walls like Swampert and Iron Treads, generating momentum for its team. Roost gives Zapdos longevity, letting it check Great Tusk, while Heat Wave hits Volt Absorb Corviknight and Bulletproof Iron Treads, which normally shut down Zapdos.</p> <p>Zapdos fits on balance and bulky offense teams, where it enables other offensive wallbreakers with paralysis and U-turn support. Zapdos matches up well against physically defensive Corviknight and Manaphy, so it's a great partner to help physical attackers like Kingambit and Chien-Pao wallbreak. The Ogerpon formes are especially good teammates, since they outspeed and threaten paralyzed Roaring Moon, even if it has Choice Scarf, while also handling Swampert and Iron Treads. Zapdos is weak to physical threats like Chien-Pao and Zamazenta, so it needs backup from physically defensive walls like Corviknight and Pecharunt. Zapdos is also threatened by faster special attackers such as Latios and Deoxys-S, so RegenVest users like Swampert and Manaphy are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 539679, "username": "GlalieGoesBoom"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 652656, "username": "Gambit"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Zapdos-Galar": {
    "outdated": true,
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Galarian Zapdos is an excellent wallbreaker whose power is further boosted by Sword of Ruin. Boasting two powerful STAB moves with excellent neutral coverage in Close Combat and Brave Bird, Galarian Zapdos can most notably 2HKO Deoxys-D and Intimidate Corviknight. Knock Off beats Gholdengo and hinders switch-ins like Fluffy Corviknight and defensive Zapdos, while U-turn allows for pivoting against Fluffy users. Adamant is the preferred nature for better odds to 2HKO Intimidate Corviknight, while Jolly allows Galarian Zapdos to Speed tie with the plethora of base 100 Speed Pokemon, at the cost of only 3HKOing Intimidate Corviknight. Galarian Zapdos is a relatively slow and frail wallbreaker and is forced out by offensive threats such as Azelf and Chien-Pao, so it appreciates being brought in by pivots such as Azelf and Iron Moth; in return, it can threaten special walls like Swampert and Hisuian Goodra for them. Slow pivots like Corviknight and Swampert are also appreciated, as they can take a hit for it and pivot it in safely, with the former also providing entry hazard control, extending Galarian Zapdos's longevity. Galarian Zapdos struggles against Fluffy walls such as Corviknight, so Fire-types such as Ceruledge and Iron Moth make for great teammates. Stealth Rock setters such as Great Tusk and Deoxys-D are also good teammates, allowing Galarian Zapdos to always 2HKO Intimidate Corviknight; in return, it can threaten opposing Great Tusk, preventing it from removing entry hazards. Galarian Zapdos's wallbreaking prowess is further empowered when paired with other offensive threats such as Barraskewda and Roaring Moon, as they can wear down shared checks like Fluffy Corviknight.</p>"
      },
      "Magic Guard": {
        "description": "<p>Galarian Zapdos is a threatening physical wallbreaker thanks to its high base Attack and powerful STAB moves in Brave Bird and Thunderous Kick. Magic Guard prevents chip damage from Stealth Rock as well as Rocky Helmet, which is commonly used by Corviknight and Skarmory. Thunderous Kick is used because the Defense drop it causes allows Galarian Zapdos to KO Pokemon like RegenVest Iron Hands with Brave Bird afterwards. Knock Off allows Galarian Zapdos to threaten switch-ins such as Gholdengo and Deoxys-D while OHKOing Iron Boulder. Galarian Zapdos can use U-turn to function as an offensive pivot as well as to switch out on uncomfortable matchups such as Corviknight, Skarmory, and Fluffy Mandibuzz, while Close Combat can be used as a second STAB option that, unlike Thunderous Kick, OHKOes Archaludon and has a very high chance to OHKO specially defensive Garganacl and Chansey. Galarian Zapdos struggles against physical walls such as Gholdengo, Corviknight, and Skarmory; special attacking wallbreakers like Sandy Shocks, Iron Moth, and Heatran are heavily appreciated, since they are able to counter them. Galarian Zapdos is also threatened by fast foes such as Dragonite, Iron Boulder, and Deoxys-S. Teammates like defensive Gholdengo and Fluffy Corviknight are appreciated to counter both Dragonite and Iron Boulder, while special walls like RegenVest Manaphy and Swampert can check Deoxys-S.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543620, "username": "Vertigo"}, {"user_id": 652656, "username": "Gambit"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 552227, "username": "Kinetic"}, {"user_id": 603931, "username": "Time2Bonk"}, {"user_id": 475288, "username": "Pandemonium"}, {"user_id": 540420, "username": "Smashing"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Moltres": {
    "comments": "<h3>Other Options</h3> <p>Scorching Sands is an alternative to Solar Beam or Will-O-Wisp that threatens Iron Moth, Iron Treads, and Well-Baked Body Gholdengo. Magic Guard + Life Orb with Brave Bird and Flare Blitz takes advantage of Moltres's offensive capabilities, and Magic Guard complements Moltres fantasically due to its granting immunity to Stealth Rock. However, this set lacks viability due to Moltres's suboptimal Attack and Speed stats.</p> <h3>Checks and Counters</h3> <p><strong>Special Attackers</strong>: Special attackers like Gholdengo and Latios threaten to 2HKO Moltres.</p> <p><strong>Physical Attackers</strong>: Physical attackers like Zamazenta, Roaring Moon, and Chien-Pao all can OHKO or 2HKO Moltres.</p> <p><strong>Knock Off Users</strong>: Knock Off users like Roaring Moon, Manaphy, and Swampert threaten to remove Heavy-Duty Boots from Moltres, which is very important to keep it immune to Stealth Rock.</p> <p><strong>Electric-types</strong>: Electric-types like Zapdos and Sandy Shocks are able to OHKO Moltres.</p>",
    "sets": {
      "Desolate Land": {
        "description": "<p>Thanks to its solid stats, decent typing, and great utility moves, Moltres can wall the tier's many Water- and Fire-types. Desolate Land lets Moltres wall Ogerpon-W, Primarina, and Swampert lacking Stone Edge, with the latter two being unable to pivot with Flip Turn. Solar Beam threatens Water-types like Manaphy, Swampert, and Primarina, whereas Will-O-Wisp punishes physical attackers like Roaring Moon, Zamazenta, and Iron Hands. U-turn helps generate momentum for Moltres and its allies. Roost gives Moltres longevity against dangerous wallbreakers like Cinderace, Ogerpon-H, and Iron Moth.</p> <p>Moltres works best on bulky offense and balance teams due to its valuable utility and defensive capabilities. Teammates like Great Tusk and Swampert benefit from Moltres being able to check threats like Primarina, Ogerpon-W, and Iron Moth with Solar Beam. Moltres is heavily reliant on its Heavy-Duty Boots due to its massive Stealth Rock weakness, so Knock Off users like Roaring Moon, Swampert, and Great Tusk are very threatening; therefore, it appreciates Knock Off absorbers like Great Tusk, Corviknight, and Skarmory. Special attackers like Gholdengo, Zapdos, and Latios threaten Moltres, so specially defensive partners like Swampert, Manaphy, and Iron Treads are quite helpful. Moltres is also vulnerable to physical attackers like Roaring Moon, Zamazenta, and Chien-Pao; thus, physically defensive allies like the aforementioned Great Tusk and Corviknight work well with it. They also help Moltres by removing Stealth Rock, which is very threatening to it if its Heavy-Duty Boots have been removed.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652656, "username": "Gambit"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 539679, "username": "GlalieGoesBoom"}, {"user_id": 475288, "username": "Pandemonium"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Mew": {
    "outdated": true,
    "sets": {
      "Choice Scarf Regenerator": {
        "description": "<p>Choice Scarf Regenerator Mew is a strong utility pivot that checks fast physical attackers with the combination of Will-O-Wisp + Volt Switch while still pressuring defensive cores with entry hazards and Trick. Ice Beam can be used as an alternative to Spikes to pressure Pokemon like Garchomp and Landorus-T. Trick can be used to neutralize support Pokemon and defensive pivots like Corviknight while serving as an emergency stop to bulky setup sweepers like Calm Mind Enamorus-T. 136 Speed EVs with a Timid nature ensure that Mew outspeeds Chien Pao, Hisuian Electrode, and +1 Jolly Quaquaval, as well as positive natured Slither Wing and Heatran after Trick. Bulky teammates like Corviknight, Garganacl, Zapdos, and Skeledirge benefit from Mew's ability to spread burns and set hazards, allowing them to absorb more hits from physical attackers and whittle down these attackers more quickly; Mew can also pressure fast attackers like Meowscarada and Talonflame that they struggle with. Additionally, late-game cleaners like Chien-Pao, Hisuian Arcanine, and Quaquaval benefit from Mew's ability to chip defensive switch-ins and hinder walls by giving them a Choice Scarf.</p>"
      },
      "Prankster": {
        "description": "<p>Prankster Mew is a good dual screens lead for hyper offense teams thanks to its good bulk, Speed, and movepool. Taunt blocks foes such as Garchomp, Landorus-T, and Iron Treads from setting entry hazards, Corviknight from clearing screens with Defog, and opposing setup sweepers like Volcarona from taking advantage of free turns. U-turn lets it pivot into its teammates and potentially re-set screens later in the game. Stealth Rock or Spikes can be used over U-turn to chip foes for teammates to KO. 96 Speed EVs and a Jolly Nature ensure that Mew always moves first against opposing leads like Prankster Corviknight and Masquerain, allowing Mew to hinder them with Taunt. Prankster Mew should only be used as a dual screens lead on hyper offense teams. Teammates such as Chien-Pao, Polteageist, Volcarona, and Roaring Moon all appreciate screens, which allow them to easily set up and make them less susceptible to revenge killers. The aforementioned Pokemon also provide good options for Mew to pivot into and gain momentum. Dark-type Pokemon such as Ting-Lu, Meowscarada, and Chien-Pao are immune to Prankster Taunt and can take advantage of Mew, so counters to them such as Zamazenta-C and Triage users, like Enamorus-T and Ursaluna, are good teammates.</p>"
      },
      "All-Out Attacker": {
        "description": "<p>Life Orb Mew is a very dangerous mixed wallbreaker that can decimate various walls with its colorful coverage. Ice Beam hits Ground- and Flying-types such as Garchomp, Landorus-T, and Zapdos. Gunk Shot 2HKOes Scream Tail, which otherwise switches into Mew freely. Close Combat takes care of Blissey and Steel-types such as Hisuian Goodra, Kingambit, and Heatran. Flamethrower 2HKOes non-Well-Baked Body Corviknight and Zamazenta-C, dissuading the latter from using Mew as setup fodder. A Mild nature helps Mew exert as much pressure as possible with Ice Beam and Flamethrower, while a Hasty nature most notably lets it outspeed Hydreigon and Speed tie Zapdos. Magic Guard negates chip damage from Life Orb and entry hazards, helping Mew stay healthy for longer and allowing it to better utilize its natural bulk to come into play. Sheer Force is an alternative particularly if Mew is used alongside a teammate with Magic Guard, such as Hisuian Electrode. It greatly increases Mew's power, notably letting it OHKO Garchomp and Iron Treads and pressure otherwise solid checks such as Meloetta, at the cost of its longevity. Bulky pivots such as Corviknight, Quaquaval, Iron Treads, and Meloetta can take on fast threats to Mew such as Chien-Pao, Roaring Moon, and Iron Moth and switch Mew in safely. Fast offensive pivots such as Meowscarada and Sandy Shocks are also strong partners that can give Mew opportunities to come into play and clean up late-game after it softens up their checks. Garchomp and Ting-Lu can set entry hazards to help Mew break down its checks over time.</p>"
      },
      "Setup Sweeper": {}
    },
    "credits": {"writtenBy": [{"user_id": 226455, "username": "berry"}, {"user_id": 532881, "username": "Frozoid"}, {"user_id": 537558, "username": "memesketch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 475288, "username": "Pandemonium"}, {"user_id": 517429, "username": "Adeleine"}, {"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 523866, "username": "UT"}]}]}
  },
  "Skarmory": {
    "comments": "<h3>Other Options</h3> <p>Skarmory can make use of Flame Body or Static to fish for burn or paralysis on Pokemon that commonly make contact with it, such as Roaring Moon, Great Tusk, and Corviknight. Specially defensive variants of Skarmory with max Special Defense instead of Defense can run Water Absorb to better check Manaphy and Ogerpon-W or Volt Absorb to reliably check Zapdos and Sandy Shocks.</p> <h3>Checks and Counters</h3> <p><strong>Special Attackers</strong>: Skarmory's low HP and Special Defense leave it quite weak to special attackers like Gholdengo, Primarina, and Deoxys-S.</p> <p><strong>Fire-types</strong>: If Skarmory isn't using Well-Baked Body, it struggles against Fire-types like Ceruledge, Cinderace, and Ogerpon-H.</p> <p><strong>Electric-types</strong>: Electric-types like Zapdos, Iron Hands, and Sandy Shocks as well as Hadron Engine users like Latios and Deoxys-S can reliably outspeed and threaten an OHKO on Skarmory without Volt Absorb.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<p>Thanks to its high Defense stat, solid utility movepool, and amazing typing, Skarmory functions as a physically defensive wall as well as an entry hazard setter. Fluffy lets Skarmory better check strong physical attackers such as Roaring Moon, Zamazenta, and Kingambit, whereas Intimidate allows it to check Chien-Pao and the Ogerpon formes excluding Ogerpon-H; alternatively, Well-Baked Body enables Skarmory to check Fire-types like Moltres, Ogerpon-H, and Iron Moth lacking Discharge. Body Press hits Steel-types like Heatran, Iron Treads, and Kingambit for a great deal of damage, while Brave Bird is slightly stronger than an unboosted Body Press and nails Zamazenta, Great Tusk, and the Ogerpon formes. Spikes is very useful on hazard stacking team archetypes and can quickly wear down Great Tusk, Manaphy, and Swampert, whereas Stealth Rock gives Skarmory valuable role compression and wears down Chien-Pao and Corviknight. Whirlwind works well in conjunction with Spikes to wear down the opposing team quite fast and forces out setup sweepers like Bulk Up Great Tusk and Iron Defense Zamazenta, while Iron Defense, which should only be used with Body Press, is a move that lets Skarmory set up along with setup sweepers like Zamazenta, Kingambit, and Great Tusk. Otherwise, Taunt can be used to prevent Corviknight from using Defog or Roost as well as Ting-Lu from setting up Spikes or Stealth Rock, Heavily punishing both. Leftovers gives Skarmory extra longevity against Pokemon like Zamazenta, Chien-Pao, and Kingambit, though Rocky Helmet can be used instead to punish Pokemon like Great Tusk, Corviknight, and Zamazenta. Heavy-Duty Boots grants Skarmory immunity to Stealth Rock chip, which is quite helpful when it needs to repeatably switch in with Stealth Rock up.</p> <p>Skarmory functions on more defensively focused teams that tend to slowly wear down the opposing team with Spikes. Partners like Roaring Moon, Zapdos, and Gholdengo appreciate the entry hazards that Skarmory sets up, as it allows them to slowly wear down their checks, like Great Tusk, Swampert, and Manaphy. Skarmory struggles with the tier's many special attackers, so specially defensive teammates like Iron Treads, Swampert, and RegenVest Roaring Moon are much appreciated. Depending on its ability, Skarmory will need teammates to help it on the physical side. If Skarmory is not using Fluffy, Pecharunt is a nice partner to aid against Choice Band Zamazenta, while physically defensive Manaphy can help against Chien-Pao for non-Intimidate Skarmory. Lastly, Skarmory without Well-Baked Body very much appreciates a Fire-resistant or Fire-immune partner like Swampert or Primordial Sea Zapdos. A Ghost-type Pokemon like Pecharunt or Earth Eater Gholdengo works as a great partner for Skarmory, as it can prevent Great Tusk and Iron Treads from using Rapid Spin to remove the entry hazards that Skarmory sets up.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652656, "username": "Gambit"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Time2Bonk"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 144939, "username": "ryan"}]}]}
  },
  "Smeargle": {
    "outdated": true,
    "sets": {
      "Sticky Web": {
        "description": "<p>Smeargle functions incredibly as an entry hazard lead on hyper offense teams thanks to its ability to lay Sticky Web and Stealth Rock via Stone Axe. Taunt can prevent hazards from Deoxys-D and Skarmory and sweepers such as Ogerpon-W and Gholdengo from setting up, while Memento can allow safe switch-ins for other frail Pokemon like Gengar and Chien-Pao. Smeargle is exclusively used on hyper offense teams due to it more or less being a suicide lead. Some notable partners include frail attackers such as Swords Dance Iron Boulder and Sheer Force Gengar, which benefit greatly from Sticky Web and the safe switch-in Memento provides. Some counters to Smeargle include Kingambit and Chien-Pao, since they are both immune to Taunt and Memento, enabling them to use it as setup fodder; as a result, Fighting-types such as offensive Bulk Up Great Tusk and Iron Hands are good partners. Another Pokemon that annoys Smeargle is Great Tusk due to its hazard removal capabilities, making threats such as Polteageist, Ogerpon-C, and Tail Glow Manaphy much appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652656, "username": "Gambit"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Time2Bonk"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Blissey": {
    "sets": {
      "The Blob": {},
      "Special Wall": {
        "outdated": true,
        "description": "<p>Blissey is a decent, albeit niche, wall and utility Pokemon in AAA with its ability to check most special attackers and extremely diverse movepool. Seismic Toss allows Blissey to not be completely passive and gives it consistent damage. Blissey's last two moveslots are flexible. Calm Mind + Shadow Ball is enough to beat the few special attackers that can otherwise defeat Blissey one-on-one such as Sheer Force Gengar and Gholdengo. Stealth Rock provides entry hazard support to free up a moveslot for a teammate, while Thunder Wave spreads status, crippling Pokemon like Azelf and Manaphy, and Heal Bell allows Blissey to operate as a cleric. Unaware allows Blissey to check special attackers attempting to set up on it like Gholdengo, Tail Glow Manaphy, and Iron Moth, while Well-Baked Body allows it to check Iron Moth while also giving it a more favorable matchup into Volcarona and Heatran. Magic Guard allows Blissey to avoid chip damage from entry hazards, letting it function as a better wall. Blissey most commonly runs Leftovers, as the extra healing can be extremely helpful, although on teams with more shaky hazard control, Heavy-Duty Boots can be opted for instead. A Calm nature is used to make Blissey function better as a special wall, notiably allowing it to always avoid the 2HKO from Sheer Force Gengar's Focus Blast. Blissey is most notably a special wall that does not require the use of Regenerator, which allows physical walls such as Great Tusk to run it instead. Blissey is most commonly seen on stall and fat team structures. Physically defensive walls like Corviknight and Deoxys-D are a must, as they help deal with Blissey's weakness to physical attackers and make a potent defensive core with it.</p>"
      }
    }
  },
  "Entei": {"sets": {"Pixilate": {}, "Magic Guard": {}}},
  "Swampert": {"sets": {"RegenVest": {}}},
  "Latios": {
    "sets": {
      "Choice Scarf": {},
      "Choice Specs": {},
      "Wallbreaker": {
        "outdated": true,
        "description": "<p>Choice Specs Latios is a fearsome wallbreaker that can force progress in almost every matchup with its combination of powerful STAB attacks, effectively mixed coverage with Psyshock, and ability to finesse poor matchups with Flip Turn and Trick. Adaptability Luster Purge consistently OHKOes common slower offensive Pokemon like Zapdos without dropping Latios's Special Attack, but Trick can cripple an opposing Chansey or Deoxys-D or disrupt a setup sweeper like Cresselia. Adaptability provides the most overall power to the set, letting it reliably 2HKO common RegenVest pivots like Swampert and Manaphy with Psyshock, while Tinted Lens lets it 2HKO Meloetta and Empoleon with Psyshock and have a good chance to OHKO Corviknight and Gholdengo with Draco Meteor. Latios pairs well with fast cleaners like Deoxys-S and Hisuian Electrode, as they can readily take advantage of the opposing RegenVest user being removed from the match. Strong physical wallbreakers like Iron Boulder and the Ogerpon formes appreciate Latios bringing them in safely with Flip Turn and even chunking their checks like Corviknight that may try to eat a predicted Psyshock. Latios invites in powerful Dark-type revenge killers like Roaring Moon and Chien-Pao, making robust checks to these such as Fluffy Corviknight and Regenerator Primarina mandatory. Latios functions best with frequent entry to the field, making entry hazard removers like Corviknight and Great Tusk excellent partners. Slow pivots like Corviknight and Deoxys-D can help get it onto the field safely.</p>"
      },
      "Speed Control": {
        "outdated": true,
        "description": "<p>Choice Scarf Latios is a reliable source of speed control and offensive pivot that sets itself apart from Azelf with its powerful Draco Meteor. Psyshock allows Latios to effectively have mixed coverage and 2HKO common RegenVest pivots like Swampert and Manaphy after Spikes, while Luster Purge is notably stronger against common offensive Pokemon like Hisuian Electrode, Cinderace, and Barraskewda and is more spammable than Draco Meteor. Adaptability is more consistent, as it is always active and does not announce itself, while Hadron Engine can support Electric-types and Surge Surfer users, disrupt opposing terrain from the likes of Azelf and Deoxys-S, and let Latios OHKO Corviknight with Thunderbolt. Trick is an option in the last slot to shut down bulky setup sweepers like Cresselia and cripple walls like Deoxys-D. Latios works best with slow pivots like Corviknight and Swampert that can get it onto the field in advantageous positions; similarly, Latios often provides easy entry to slow, wallbreaking teammates like Galarian Zapdos and Ceruledge with Flip Turn. Latios is heavily threatened by Chien-Pao and Roaring Moon, as they discourage it from using its Psychic-type moves and can even threaten it thanks to priority moves and Choice Scarf, respectively. Physically defensive Manaphy and Fluffy Corviknight, respectively, can provide insurance against these threats.</p>"
      },
      "Calm Mind": {
        "outdated": true,
        "description": "<p>Latios leverages a good Speed tier, sky-high Special Attack, and Calm Mind to be one of the tier's most dangerous wallbreakers and sweepers. Psyshock greatly threatens common RegenVest users such as Swampert, Manaphy, and Meloetta. Recover provides additional longevity, allowing Latios to switch in against foes such as Heatran and Pecharunt and threaten to wallbreak multiple times in a single game. Calm Mind allows Latios to set up against passive foes such as Corviknight and Skarmory. Soul Dew notably makes Adaptability Draco Meteor a guaranteed 2HKO on Corviknight after a Calm Mind, but Leftovers is an option to give Latios more longevity. Adaptability is the preferred ability for consistent high damage, allowing Latios to reliably 2HKO Blissey and RegenVest Swampert with Psyshock, while Tinted Lens is an option to threaten an OHKO on Corviknight and Gholdengo with Draco Meteor after a Calm Mind and 2HKO Heatran and Hisuian Goodra with Psyshock after a boost. Latios works fantastically with other powerful special attackers such as Iron Moth, Zapdos, and Azelf, as they all appreciate RegenVest users and Blissey being weakened. Latios also appreciates slow, physically bulky pivots such as Corviknight, Mandibuzz, and physically defensive Manaphy, who which can both pivot it in safely and effectively check the offensive Dark-types that threaten Latios such as Roaring Moon, Meowscarada, and Chien-Pao. Latios also appreciates the aforementioned Corviknight and Mandibuzz, along with Great Tusk, for their consistent entry hazard removal, allowing it to enter the field and frequently threaten the foe.</p>"
      }
    }
  },
  "Jirachi": {
    "sets": {
      "RegenVest": {
        "description": "<p>Jirachi sets itself apart from other RegenVest pivots by better checking the prevalent, powerful Psychic-types—Latios, Deoxys-S, Scream Tail, and Azelf—and providing Future Sight support to powerful physical wallbreakers like Zamazenta, Chien-Pao, and Ceruledge. Many of the best physical walls such as Corviknight and Manaphy survive by barely avoiding 2HKOs, which they fail to when switching into Future Sight as well, while others like Iron Hands, Great Tusk, and Pecharunt take far too much damage from Future Sight anyway. Doom Desire is an alternative with no immunities that also hits Scream Tail harder but otherwise has worse coverage against relevant targets. Psychic Noise denies recovery to Empoleon and Corviknight and punishes aggressive Iron Moth and Great Tusk switch ins. The last moveslot is extremely flexible; Thunderbolt for Corviknight, Iron Head for Scream Tail, Ice Punch for Dragonite, and Body Slam to fish for paralysis are some of the most notable options. Jirachi should be paired with physical wallbreakers on more offensive teams, as they best take advantage of its combination of slow pivoting and Future Sight. Fighting-types like Iron Hands and Zamazenta, Ceruledge, and the Ogerpon formes are excellent teammates that also appreciate Jirachi switching into fast Psychic-types like Deoxys-S and Azelf attempting to revenge kill them. Jirachi is weak to several common special attackers, most notably primal weather users like Iron Moth and Primarina, and Ghost-types such as Gengar and Gholdengo, so teammates that can offensively check them like other primal weather users and Roaring Moon are greatly appreciated. Since Jirachi is wholly dependent on Regenerator for recovery, it appreciates entry hazard removers like Great Tusk and Corviknight to maximize that recovery.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523866, "username": "UT"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 603931, "username": "Time2Bonk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Deoxys-Defense": {
    "outdated": true,
    "sets": {
      "Defensive": {
        "description": "<p>Boasting high defensive stats and a plethora of utility moves, Deoxys-D makes for an excellent Unaware wall that can check Iron Hands and setup Great Tusk while also providing additional utility like setting entry hazards and pivoting. Spikes is the preferred hazard, as Deoxys-D can usually set multiple layers, but Stealth Rock is an alternative for teams that lack a Stealth Rock setter otherwise, and Knock Off can be used to limit opposing setup threats like Iron Boulder and Quaquaval while also debilitating walls like Corviknight and Swampert. Teleport can be used in conjunction with Deoxys-D's low Speed to safely switch Pokemon in, while Thunder Wave can be used to cripple Iron Boulder and Dragonite. Leftovers is the preferred item for extra longevity, but Heavy-Duty Boots is an option on Teleport sets to enable easier pivoting. On teams that do not need setup control, Fluffy and Intimidate dramatically increase its physical bulk versus key targets like Iron Boulder. Defensive Pokemon like Corviknight and Mandibuzz appreciate Deoxys-D being able to take on setup threats such as Iron Hands and Iron Boulder, allowing them to better handle Dark-types like Roaring Moon. Offensive Pokemon like Galarian Zapdos, Chien-Pao, and Ceruledge appreciate Deoxys-D being able to weaken opposing walls with hazards or Knock Off, as well as potentially getting them in safely if it's running Teleport. Deoxys-D narrowly avoids 2HKOs from stronger wallbreakers like Iron Boulder, so hazard control options like Scrappy Great Tusk and Corviknight are highly recommended so that Deoxys-D can have more longevity.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 475288, "username": "Pandemonium"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 611238, "username": "LordBox"}, {"user_id": 552227, "username": "Kinetic"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Deoxys-Speed": {
    "sets": {
      "Mixed Attacker": {},
      "All-Out Attacker": {
        "description": "<p>Deoxys-S leverages its colorful offensive movepool to become a formidable wallbreaker and, alongside its superb Speed tier, potentially clean late-game as well. Psychic works well with Sheer Force variants, but Psycho Boost can be used when going with Hadron Engine; the former's reliability and spammability can be forgone for the latter's immediate sheer power, reaching feats such as straight up OHKOing the Ogerpon formes, Moltres, and potentially Garganacl. Ice Beam reliably hits Latios and otherwise problematic Dark-types like Roaring Moon, Ting-Lu, Meowscarada, and Mandibuzz super effectively while additionally being capable of OHKOing Great Tusk, Garchomp, and Zapdos without suffering Psycho Boost drops, especially since the last two can withstand a Psychic. Thunderbolt hits non-Volt Absorb Empoleon and Corviknight, while Energy Ball handles RegenVest Swampert, with either move covering for RegenVest Manaphy and Primarina. Focus Blast hits Steel-types like Hisuian Goodra, Heatran, non-Bulletproof Empoleon, and Kingambit and pressures Dark-types like Roaring Moon and Ting-Lu better than Ice Beam, notably OHKOing the former and potentially the latter. Shadow Ball deals with non-Bullet Proof Gholdengo and Scream Tail. Sheer Force works well in tandem with Life Orb, keeping Deoxys-S healthy to repeatedly wallbreak. On top of the slightly higher power boost, Hadron Engine is an alternative that trades longevity for Electric Terrain-boosted Thunderbolts; notably, it makes sure that the move can OHKO physically defensive Corviknight and Mandibuzz, has significant odds to 2HKO even specially defensive RegenVest Manaphy, and is strong enough to 2HKO Scream Tail after minor chip damage and defensive Gholdengo, especially Bulletproof variants of the latter.</p> <p>Deoxys-S finds a home on bulky offense and offense teams that appreciate its wallbreaking and cleaning prowess. Slow defensive pivots like Swampert, Manaphy, and Corviknight are valuable supporting pieces; aside from bringing Deoxys-S into the field safely, they can switch into and check Choice Scarf and priority users like Roaring Moon, Latios, Chien-Pao, and Kingambit looking to revenge kill it. Additionally, Swampert and Manaphy can use Knock Off to make opposing RegenVest users like Manaphy and Swampert easier for Deoxys-S to break down, while Corviknight provides entry hazard removal to let Deoxys-S come in repeatedly. Other hazard removal options include Great Tusk and Iron Treads; the former can also check Kingambit, Ceruledge, and Choice Scarf Roaring Moon that can revenge kill Deoxys-S, while the latter switches into Gholdengo and Scream Tail if Deoxys-S lacks the appropriate coverage to threaten them. Offensive pivots like Roaring Moon, Cinderace, and Meowscarada are similarly useful to bring Deoxys-S in safely, as they tend to invite in physical walls like Great Tusk, Pecharunt, and Skarmory that it feasts on. What they lack in defensive profile is made up for by their ability to pressure common Deoxys-S checks like Gholdengo, Heatran, and RegenVest Swampert, especially if it lacks the corresponding coverage; other physical wallbreakers like Zamazenta and Chien-Pao are thus similarly helpful in this regard. These offensive threats can also overwhelm shared checks in Scream Tail, Ting-Lu, and Mandibuzz together with Deoxys-S, letting either of them take over the game more easily. Entry hazards from setters like Garchomp, Heatran, and Great Tusk can take advantage of the switches Deoxys-S forces and are great at chipping down its checks, namely the RegenVest users that cannot afford Heavy-Duty Boots.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493260, "username": "Marnie"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 580765, "username": "cat"}, {"user_id": 652656, "username": "Gambit"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Empoleon": {"sets": {"Specially Defensive": {}}},
  "Garchomp": {
    "sets": {
      "Entry Hazard Setter": {},
      "Specially Defensive": {},
      "Double Dance": {
        "outdated": true,
        "description": "<p>Garchomp is a great cleaner and sweeper on offensive teams thanks to its excellent Attack, good bulk, and high-Base Power moves, and it has the ability to outspeed common offensive threats after a Scale Shot such as Iron Boulder, Zamazenta, and Roaring Moon. Stone Edge threatens Flying-types like Mandibuzz and Zapdos and hits Corviknight decently hard, and after using Swords Dance, Garchomp can OHKO offensive Great Tusk with Earthquake and 2HKO Fluffy Corviknight with Stone Edge. Life Orb gives Garchomp a decent chance of 2HKOing Corviknight at +1 and guarantees the OHKO on Choice Band Zamazenta at +2, while Loaded Dice offers more consistency to Scale Shot and avoids recoil from Life Orb. An Adamant nature lets Garchino 2HKO Unaware Scream Tail and Deoxys-D with Life Orb, while a Jolly nature lets it outspeed Choice Scarf Sandy Shocks and Modest Deoxys-S after a Scale Shot. Physical wallbreakers like Chien-Pao and Zamazenta appreciate Garchomp's cleaning ability once it gets set up; in return, they can help chip walls like Deoxys-D and Corviknight that it can struggle to break through, giving it an easier time cleaning. Garchomp's only decent Speed prior to setting up leaves it vulnerable to being KOed by threats like Latios and Roaring Moon, so teammates that can check them on hyper offense teams like Gholdengo and Zamazenta, respectively, are appreciated. Even after setup, faster Pokemon like Choice Scarf Azelf and priority users like Dragonite can threaten massive damage on Garchomp, making teammates that can deal with them like Roaring Moon and Gholdengo, respectively, good partners.</p>"
      }
    }
  },
  "Lucario": {
    "sets": {
      "Magic Guard": {
        "description": "<p>Lucario's niche lies in its great mixed wallbreaking capacity and amazing STAB combination, with Close Combat and Steel Beam hitting the majority of the metagame for good damage and potentially 2HKOing them. Earthquake deals with Toxapex, Dark Pulse smacks Gholdengo, and Stone Edge prevents Zapdos and Iron Moth from switching in safely. Nasty Plot lets it muscle through bulky teams that try to dance around its coverage moves. An alternative EV spread of 252 Atk / 4 SpA / 252 Spe can be used to deal more damage on the physical side. Lucario's excellent wallbreaking abilities make fast offensive partners like Roaring Moon, Deoxys-S, and Chien-Pao good partners, as they can clean up after it has broken holes into the opposing team. Lucario's lack of defensive utility makes walls like Corviknight, RegenVest Manaphy, and Swampert much appreciated; additionally, they can bring it back onto the field with a slow pivot. Lucario greatly struggles with four-moveslot syndrome, so teammates that can deal with Zapdos and Iron Moth like RegenVest or Magic Guard Roaring Moon when not using Stone Edge and teammates that can switch into Gholdengo like Swampert when not running Dark Pulse are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 611238, "username": "LordBox"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Gliscor": {"sets": {"Physically Defensive": {}}},
  "Mamoswine": {"sets": {"Wallbreaker": {}}},
  "Azelf": {"sets": {"Choice Scarf": {}}},
  "Heatran": {"sets": {"Desolate Land": {}}},
  "Cresselia": {
    "outdated": true,
    "sets": {"Unaware": {"description": "<p>Cresselia's titanic bulk and access to Calm Mind allow it to pose a major threat to the opponent's team, turning other setup sweepers into fodder. It can also leverage its Psychic typing to check huge threats such as Azelf and Deoxys-S. Late game, Cresselia can function as a terrifying and offbeat set-up sweeper, boosting and using Moonblast to hit Dark-types such as Chien-Pao and Roaring Moon. Cresselia's ideal opportunity to set up is in front of passive walls like Manaphy, Swampert, and non-Unaware Blissey. Cresselia's best teammates are Pokemon that can take on Dark-Type moves like Corviknight and Great Tusk. Prankster Corviknight and Deoxys-S can set dual screens to make Cresselia's setup easier. Cresselia also appreciates teammates such as Mandibuzz, Blissey, and RegenVest Hisuian Goodra that can switch into Ghost-types.</p>"}},
    "credits": {"writtenBy": [{"user_id": 662581, "username": "aiko's band"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 580765, "username": "cat"}, {"user_id": 594122, "username": "Evie"}, {"user_id": 603931, "username": "Time2Bonk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Manaphy": {
    "comments": "<h3>Other Options</h3> <p>Level 99 Manaphy is a tempting option, guaranteeing a slower U-turn against opposing standard RegenVest Manaphy, but it is generally not worth having an overall less bulky Manaphy. RegenVest Manaphy can afford to use a different EV spread than the maximized ones here if looking to survive specific rolls. A physically defensive set with 200 Speed EVs may be considered to outspeed and better check Great Tusk, but it is usually not worth losing the slower U-turn or the extra bulk investment. Dazzling Gleam is interchangeable with Alluring Voice; the former checks Throat Chop Roaring Moon, and the latter dissuades setup sweepers and hits Substitute users. Psychic is an option in the final moveslot to dissuade Iron Moth and Pecharunt from switching in while still hitting Zamazenta, whereas Ice Beam can be used to hit Zapdos and Desolate Land Landorus, but the other options are generally considered better. Alternatively, a physically defensive Regenerator set with Rocky Helmet and Take Heart is an option to act as a bulky wincon while still checking physical attackers, but this Manaphy set is easily forced out by special attackers without a boost and may struggle to find setup opportunities. Tail Glow sets may consider running Primordial Sea and Weather Ball for the additional power and being able to hit Desolate Land users, but this set becomes extremely slow and easier to switch around or pressure out. Tail Glow sets can also consider running Scald, trading some damage for additional utility and the chance to burn something before fainting, but the drop in power isn't worth sacrificing for. Hydro Pump is another option on these sets for additional power, notably 3HKOing Empoleon after a Tail Glow boost, but the reduced PP and accuracy is usually not worth it. Alternatively, hyper offense teams can run a potent set with Fluffy, Unaware, or an immunity ability alongside Take Heart, Acid Armor, and Stored Power to muscle through checks like even opposing RegenVest users, Heatran, and Empoleon after enough boosts.</p> <h3>Checks and Counters</h3> <p><strong>Electric-type Moves</strong>: Zapdos, Sandy Shocks, and Pokemon with Electric-type moves like Deoxys-S, Latios, and Gholdengo are often able to muscle through non-Motor Drive Manaphy even with an Assault Vest and maximum Special Defense investment.</p> <p><strong>Desolate Land Users</strong>: Aside from Knock Off, most Manaphy sets lack any effective tools against Desolate Land users like Iron Moth, Moltres, and Heatran, giving them free switch-in opportunities to either set up entry hazards or threaten Manaphy with Solar Beam.</p> <p><strong>Grass-types</strong>: Even the most physically defensive Manaphy sets can't reliably deal with Meowscarada or the Ogerpon formes, and Hisuian Electrode is a major annoyance for any spread.</p> <p><strong>Passive Damage</strong>: Without Take Heart, Manaphy is extremely vulnerable to passive damage in the form of Toxic from Iron Moth, Pecharunt, or Mandibuzz. Likewise, Manaphy is worn down extremely quickly by entry hazards set by the likes of Great Tusk, Skarmory, and Scream Tail.</p>",
    "sets": {
      "RegenVest": {
        "description": "<p>Manaphy leverages a great defensive typing, solid mixed bulk, and incredible utility moves including the coveted Scald to be among the tier's premier RegenVest users. Manaphy is able to comfortably switch in and scout dangerous special attackers like Scream Tail, Azelf, and Gholdengo and, when running the more physically bulky spread, powerful wallbreakers like Chien-Pao, Cinderace, and Great Tusk. Knock Off is notable for threatening decent damage against Gholdengo and removing key items like Assault Vest and Heavy-Duty Boots from would-be switch-ins like opposing Manaphy, Iron Moth, and Moltres. While obviously used for slow pivoting, U-turn is also able to threaten an OHKO on Meowscarada, which would otherwise switch in easily. Alluring Voice is the most common final move for its ability to threaten Latios, Zamazenta, and non-Throat Chop Roaring Moon, but Energy Ball is an option to smack opposing Manaphy, Swampert, and Primarina. An EV spread with full Defense investment is the most common spread, turning Manaphy into a potent mixed wall that can check Cinderace, Great Tusk, and non-Choice Band Roaring Moon while still acting as a solid secondary check to special wallbreakers like Deoxys-S, Primarina, and Gholdengo; it can also choose to run a full Special Defense-invested set to more solidly check these nuclear special attackers.</p> <p>RegenVest Manaphy is renowned for being able to sturdy up the defensive backbone of almost any team style, but balance and bulky offense teams tend to benefit the most from its presence. Manaphy is excellent at taking hits from powerful wallbreakers like Roaring Moon, Primarina, and Gholdengo and pivoting out with U-turn, so frail wallbreakers like Chien-Pao, Sandy Shocks, and Deoxys-S naturally appreciate its ability to eat a hit then bring them in damage-free. Similarly, Manaphy can be an asset to slower wallbreakers like Gholdengo and Primarina that appreciate its hit-taking capability. Corviknight is the most classic pairing with Manaphy, with both defensive and specially defensive sets able to shore up Manaphy's less-invested stat. If running physically defensive Manaphy, a sturdier check to powerful Choice Band users like Roaring Moon, Zamazenta, and Meowscarada is necessary; consider Skarmory, Great Tusk, or especially Pecharunt as a teammate. Similarly, any RegenVest Manaphy set appreciates a Steel-type special wall like Heatran, Iron Treads, or specially defensive Gholdengo that can help versus threats like Zapdos, Sheer Force Deoxys-S, and Latios. Manaphy is especially vulnerable to getting worn down by entry hazards and being overwhelmed by foes if it loses its Assault Vest, so hazard removers like Iron Treads, Corviknight, and Great Tusk are mandatory teammates, with the latter two doubling as Knock Off absorbers.</p>"
      },
      "Tail Glow": {
        "description": "<p>Tail Glow Manaphy is a decent setup sweeper, utilizing Tail Glow to boost its mediocre Special Attack to staggering numbers. Alluring Voice smacks Dragon-types like Roaring Moon and Latios while being Manaphy's best move against Meowscarada. Energy Ball allows Manaphy to beat its Water-type checks in RegenVest Swampert, Primarina, and opposing Manaphy, while Psychic invalidates Desolate Land Iron Moth from being a check. Protosynthesis + Booster Energy grants Manaphy a one-time Speed boost, preventing would-be revenge killers in Roaring Moon, Scream Tail, and Zamazenta from forcing it out. Surge Surfer allows Manaphy to gain a greater Speed boost, allowing it to outspeed even Choice Scarf users like Roaring Moon, Meowscarada, and Azelf while electric terrain is active at the caveat of requiring teammates with Hadron Engine. Electric Seed makes it harder to revenge kill Manaphy when using Surge Surfer, while Life Orb boosts Manaphy's damage output. Motor Drive allows Manaphy to surprise and turn the tables on Electric-types like Sandy Shocks and Regieleki and gain a free Speed boost, trading in consistency for the potential of multiple activations and defensive utility.</p> <p>Tail Glow Manaphy fits best on hyper offensive teams due to their nature of being fast-paced and possessing strong setup sweepers. Although Manaphy has immense damage potential, it is unable to muscle past counters like RegenVest Hisuian Goodra, Desolate Land Heatran, and if not using Psychic, Iron Moth. Thus, teammates who can threaten them and use them as setup fodder pair well with Manaphy, making IronPress Zamazenta, Dragon Dance Roaring Moon, and Double Dance Iron Crown good partners. Manaphy also appreciates dedicated leads that hyper offense teams employ, like Ribombee and Dual Screens Corviknight; the former shutting down revenge killing attempts from foes like Choice Scarf Roaring Moon and Azelf, which would outspeed Manaphy even after a Speed boost, and the latter allowing Manaphy to set up safely, allowing it to brute force its way through the opposing team. When using Surge Surfer, Manaphy should always be paired with teammates that use Hadron Engine like Sandy Shocks and Latios.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540420, "username": "Smashing"}, {"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 652656, "username": "Gambit"}, {"user_id": 580765, "username": "cat"}, {"user_id": 611238, "username": "LordBox"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Samurott-Hisui": {
    "sets": {
      "Lead": {},
      "Choice Band": {
        "outdated": true,
        "description": "<p>Hisuian Samurott is a decent wallbreaker due to Adaptability, Choice Band, and a great STAB combination that also pressures the ever-present Corviknight to choose between recovery and Defogging. Ceaseless Edge is a versatile move that deals good damage to foes while also setting up Spikes, helping Hisuian Samurott's teammates or even itself to pick off chipped foes later in the game. Knock Off provides utility by removing items from switch-ins such as Corviknight and Quaquaval. Sucker Punch is a good priority move that lets Hisuian Samurott deal heavy damage to faster foes such as Cinderace, Iron Moth, and Zapdos. Brick Break can be used instead to deal with dual screens leads such as Corviknight and Mew. Hisuian Samurott's ability to set up Spikes and pester defensive Pokemon such as Corviknight and Scream Tail by removing their items is appreciated by various offensive teammates such as Chien-Pao and Galarian Zapdos that can take advantage of chipped foes. Fluffy and Intimidate Quaquaval wall Hisuian Samurott very easily, so spinblockers such as Desolate Land Skeledirge and Ceruledge are good partners as they can pressure Quaquaval and block it from removing Spikes set by Hisuian Samurott. Hisuian Samurott is susceptible to getting revenge killed due to low Speed and bulk, so robust walls such as Corviknight and Meloetta that can pivot and provide safe switch in opportunities to it are appreciated.</p>"
      },
      "Swords Dance": {
        "outdated": true,
        "description": "<p>After a Swords Dance boost, Hisuian Samurott becomes a terrifying wallbreaker that can dent physically defensive walls like Corviknight. Sucker Punch acts as speed control against Pokemon like Zapdos and Iron Moth. Ceaseless Edge forces defensive Pokemon, such as Corviknight, to switch in and choose between entry hazard removal or healing. Black Glasses is the item of choice, boosting its Dark-type moves without the recoil of Life Orb. Pokemon like Thundurus and Iron Moth are very useful teammates, as they compensate for Hisuian Samurott's average Speed tier and can heavily damage physical walls that counter Hisuian Samurott like Quaquaval and Zamazenta-C. In return, Hisuian Samurott wears down special walls with its ability to set up a layer of Spikes. Additionally, due to its unimpressive bulk, Hisuian Samurott relies on walls such as Corviknight and Hisuian Goodra to compensate for the lack of defensive utility it brings.</p>"
      }
    }
  },
  "Zoroark-Hisui": {
    "outdated": true,
    "sets": {
      "Sheer Force": {
        "description": "<p>Hisuian Zoroark serves as a threatening sweeper and wallbreaker thanks to its great Special Attack, good Speed, and incredible moveset. Body Slam allows Hisuian Zoroark to hit specially defensive walls such as Manaphy, Swampert, and Meloetta. Focus Blast hits foes like Hisuian Goodra, Roaring Moon, Chien-Pao, Blissey, and Mandibuzz. Knock Off allows Hisuian Zoroark to remove crucial items like Manaphy's and Swampert's Assault Vests and Mandibuzz's Heavy-Duty Boots, helping it and its teammates break through these Pokemon and allowing it to be more self sufficient, as it does not rely on teammates to get rid of said items. Psychic is an alternative option that dents Iron Hands, Zamazenta, Great Tusk, and Iron Moth. Sheer Force lets Hisuian Zoroark hit harder to achieve feats such as 2HKOing non-Unaware Mandibuzz. A Timid nature should be used on sets with Nasty Plot, as a higher Attack is not needed. Teammates such as Iron Moth and Azelf appreciate Hisuian Zoroark's ability to force chip damage on special walls such as RegenVest Manaphy and Meloetta. Hisuian Zoroark is very frail, leaving it prone to revenge killing attempts from revenge killers like Roaring Moon and Azelf, so it appreciates slow pivots like Corviknight and Manaphy that can help it switch in safely. Hisuian Zoroark appreciates entry hazard setters like Great Tusk and Deoxys-D, as they can help chip walls that would otherwise beat it.</p>"
      },
      "Magic Guard": {
        "description": "<p>Hisuian Zoroark finds a niche on semi-stall and offensive teams as a progress maker or as an offensive pivot with its wide variety of utility options and ability to ignore passive damage thanks to Magic Guard. Knock Off cripples special walls by depraving RegenVest users such as Manaphy and Swampert of their Assault Vests or by limiting Blissey's, Empoleon's, and Mandibuzz's longevity by removing their Leftovers or Heavy-Duty Boots, allowing Hisuian Zoroark or teammates like Iron Moth and Azelf to break past them later in the game. Will-O-Wisp further weakens these special walls, forcing them to be worn down over time and notably enabling Hisuian Zoroark's Hex to break past them; it also cripples physical threats like Great Tusk and Iron Hands. U-turn allows Hisuian Zoroark to generate free momentum for its team while forcing its switch-ins to take chip damage from entry hazards as it pivots out, whereas Taunt denies Blissey and Empoleon recovery. Hisuian Zoroark should be paired with offensive entry hazard setters like Sandy Shocks, Pixilate Scream Tail, and Galvanize Kommo-o that can keep up the pressure on hazard removers to maximize its ability to wear the opposing team down over time. Sturdy checks to offensive threats that force Hisuian Zoroark out like Roaring Moon, Choice Scarf Gholdengo, and Azelf are needed, so good teammates that can stave them off like Great Tusk and Empoleon are recommended.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 580765, "username": "cat"}, {"user_id": 594122, "username": "Evie"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 580765, "username": "cat"}, {"user_id": 594122, "username": "Evie"}, {"user_id": 528036, "username": "Sulo"}, {"user_id": 603931, "username": "Time2Bonk"}, {"user_id": 475288, "username": "Pandemonium"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Mandibuzz": {
    "sets": {
      "Physically Defensive": {},
      "Magic Guard": {
        "outdated": true,
        "description": "<p>Mandibuzz is a solid physical wall with high defensive stats, a useful typing, and valuable utility moves in Defog, Toxic, and Knock Off. Magic Guard circumvents its normally crippling Stealth Rock weakness, letting it act as an excellent Knock Off absorber from the likes of Roaring Moon and Meowscarda, as well as a status absorber from Toxapex, Pecharunt, and opposing Mandibuzz. Foul Play allows Mandibuzz to beat physical setup sweepers such as Dragonite and Ceruledge, while Knock Off can limit the longevity of defensive walls and remove Assault Vests, enabling special attacking teammates like Primarina, Latios, and Azelf. Toxic can cripple walls such as Swampert and Scream Tail and shuts down bulky setup sweepers like Calm Mind Scream Tail and Bulk Up Great Tusk. Defog provides valuable entry hazard control, especially for Stealth Rock-weak wallbreakers Chien-Pao, Ceruledge, and Ogerpon-H, which Mandibuzz can also slow pivot in with U-turn alongside 0 Speed IVs and a Relaxed nature. Leftovers provides passive healing that can't be mitigated by indirect damage, while Rocky Helmet punishes contact moves, most notably U-turn from Corviknight and Roaring Moon. Mandibuzz naturally loses to many of the tier's common physical attackers, including Chien-Pao and Ogerpon-C, exacerbated by the fact that it lacks a true defensive ability or immunity; other physically defensive walls such as Corviknight and Toxapex help shore up these weaknesses. Although Mandibuzz can be an emergency switch-in to Psychic-types like Azelf, Deoxys-S, and Latios, it should generally not be relied on due to its uninvested special bulk and their various super effective coverage moves. Therefore, Mandibuzz appreciates specially defensive walls, such as Empoleon, Manaphy, and Swampert, to check the previously mentioned special attackers along with Gengar and Primarina.</p>"
      }
    }
  },
  "Hydreigon": {
    "outdated": true,
    "sets": {
      "Nasty Plot": {
        "description": "<p>Hydreigon possesses a niche as an extremely potent wallbreaker, as Nasty Plot distinguishes Hydreigon amongst fellow wallbreakers like Latios and Deoxys-S by threatening to OHKO RegenVest Swampert and Manaphy. Flash Cannon chunks Scream Tail attempting to switch into a Draco Meteor; Focus Blast provides a strong option that smacks Steel-types like Kingambit, Iron Treads, and Heatran; and Earth Power provides a weaker but more reliable option to hit those aforementioned Steel-types. With a Modest nature, Hydreigon threatens to OHKO non-Unaware Blissey after slight chip and guarantees the OHKO on the aforementioned RegenVest Swampert and Manaphy with Draco Meteor after a Nasty Plot. A Timid nature can be considered to outspeed Great Tusk and remove the risk of Jolly Ceruledge and Timid Archaludon winning the speed tie. Hydreigon's low Speed and lack of good defensive utility mean that faster threats like Chien-Pao, Zamazenta, and Scream Tail force it out, making teammates like Corviknight, RegenVest Manaphy, and Swampert good partners on balance teams; alternatively, Sticky Web support from Ribombee and Smeargle is much appreciated on hyper offense teams, preventing would-be revenge killers like Zamazenta and Barraskewda from outspeeding it, which invalidates their ability to revenge kill it. Other special wallbreakers like Volcarona, Deoxys-S, and Gengar appreciate Hydreigon's ability to break holes in a team's defensive core, allowing them to clean up later in the game. Fairy-types like Primarina and, to a lesser extent, Scream Tail can check Hydreigon with ease, so teammates that can threaten them like Hisuian Electrode, Ogerpon-C, and Ceruledge are greatly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 611238, "username": "LordBox"}, {"user_id": 603931, "username": "Time2Bonk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}]}]}
  },
  "Cobalion": {"sets": {"Magic Guard": {}}},
  "Terrakion": {
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Terrakion is a fearsome wallbreaker thanks to its good Attack stat, useful offensive typing, high-Base Power STAB moves, and ability to bypass Fluffy. Earthquake allows Terrakion to hit non-Earth Eater Gholdengo and have a slightly stronger and more accurate option against foes like Iron Hands and Pecharunt. Terrakion's last moveslot is very flexible, as it likes to use Close Combat or Stone Edge almost all of the time. Stealth Rock can help wear down the opposing team and chip would-be defensive checks into range of a 2HKO, while Quick Attack can pick off faster, weakened foes, and Poison Jab does more damage to Primarina and Scream Tail. Teammates such as Iron Boulder, Zamazenta, and Roaring Moon appreciate Terrakion's ability to break through Corviknight, which is one of their biggest roadblocks, and can clean up weakened teams. Terrakion is vulnerable to being revenge killed due to its middling Speed stat, so a strong defensive backbone featuring Pokemon like Corviknight, Great Tusk, and Manaphy is recommended. Terrakion fits best on balance and bulky offense teams that need a wallbreaker and can help it switch in safely, so slow pivots like the aforementioned Corviknight and Manaphy make for good teammates. Additionally, special pivots like Azelf and Hisuian Electrode can get it in on special walls such as RegenVest Meloetta and Hisuian Goodra, which it can threaten out.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 594122, "username": "Evie"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Thundurus": {
    "outdated": true,
    "sets": {
      "Nasty Plot": {
        "description": "<p>Thanks to Thundurus's wide variety of coverage, access to Nasty Plot, and high Speed that allows it to outspeed Iron Moth and the Ogerpon formes, it functions as a hard-hitting sweeper. Nasty Plot further boosts Thundurus's high Special Attack, allowing it to OHKO Scream Tail, defensive Gholdengo, and RegenVest Manaphy at +2, while Knock Off can be used on Magic Guard sets to remove Assault Vest from Hisuian Goodra, Meloetta, and Iron Hands. Focus Blast gives Thundurus super effective coverage against Roaring Moon, Heatran, and Volt Absorb Empoleon. Psychic enables Thundurus to hit Iron Hands, Great Tusk, and Landorus; alternatively, Grass Knot consistently 2HKOes Ting-Lu and Swampert while still OHKOing Great Tusk, at the cost of Sheer Force sets taking Life Orb recoil. Sheer Force avoids Life Orb chip damage and boosts Thundurus's power, allowing it to 2HKO Deoxys-D and max HP Scream Tail after Stealth Rock, while Magic Guard also avoids Life Orb damage and chip damage from Stealth Rock. Thundurus struggles to sweep opposing teams possessing fast revenge killers such as Roaring Moon, Azelf, and Choice Scarf Gholdengo; therefore, it requires allies like Corviknight and Empoleon that easily switch into these threats and pivot it in. Fast special attacking pivots such as Azelf and Iron Moth appreciate Thundurus's ability to wallbreak, as it allows them to clean more easily.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652656, "username": "Gambit"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Time2Bonk"}, {"user_id": 540420, "username": "Smashing"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Thundurus-Therian": {
    "outdated": true,
    "sets": {
      "Nasty Plot": {
        "description": "<p>Bolstering an incredible Special Attack stat combined with a great movepool makes Thundurus-T an extremely threatening wallbreaker. Focus Blast nails foes such as Hisuian Goodra, Volt Absorb Empoleon, and Volt Absorb Corviknight. Psychic hits Great Tusk and Iron Hands, while Grass Knot can let Thundurus-T lure in and take out Swampert while still hitting Great Tusk for super effective damage. Nasty Plot boosts Thundurus-T's Special Attack to nuclear levels, allowing it to OHKO Hisuian Goodra and Blissey with Focus Blast after slight chip damage. Fast specially offensive pivots such as Iron Moth, Choice Scarf Azelf, and Latios appreciate Thundurus-T's incredible wallbreaking power, as they can take advantage of weakened special walls such as Swampert, Manaphy, and Meloetta. Thundurus-T loves slow, defensive pivots such as Corviknight, physically defensive Manaphy, and Swampert, as they can take on faster threats such as Iron Boulder, Chien-Pao, and Azelf, which all threaten to KO it, while also being able to safely pivot it in. Entry hazard Removal from the likes of Corviknight, Great Tusk, and Mandibuzz is also helpful, as Thundurus-T is very vulnerable to Stealth Rock. Sticky Web support from a teammate like Smeargle or Ribombee is another option, as it can give Thundurus-T the opportunity to outpace previously mentioned revenge killers.</p>"
      },
      "Choice Scarf": {}
    },
    "credits": {"writtenBy": [{"user_id": 603931, "username": "Time2Bonk"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 552227, "username": "Kinetic"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Landorus": {
    "sets": {
      "Physical Wall": {},
      "Desolate Land": {
        "outdated": true,
        "description": "<p>Landorus is a good wallbreaker, taking advantage of Desolate Land's Water-type protection, Weather Ball's type synergy, and its Ground-type STAB moves to blast through Pokemon such as Corviknight, Iron Moth, and Gholdengo. Earth Power is used for its consistency, while Sandsear Storm provides higher power, allowing it to have a chance to OHKO Jirachi and Pixilate Scream Tail after a Nasty Plot; additionally, Sandsear Storm has the ability to burn foes, which can help if it doesn't take the KO. Grass Knot helps Landorus take on bulky Ground-types such as Swampert and Great Tusk, while Stealth Rock lets Landorus support its teammates, weaken its own checks like Primarina and non-Heavy-Duty Boots Dragonite, and threaten common entry hazard removal options such as Corviknight and the aforementioned Great Tusk. Using Leftovers lets Landorus stay on the field longer, while Life Orb lets it OHKO Swampert and 2HKO Primarina with a +2 Grass Knot. Pokemon like Iron Moth, Azelf, and Deoxys-S appreciate Landorus for being able to take on checks like Swampert, Empoleon, and Iron Treads. Landorus struggles to deal with Pokemon that aren't weak to its moves like Manaphy, Blissey, and RegenVest Roaring Moon, so having teammates like Latios, Great Tusk, and Iron Hands will help with taking them down. Similarly, Landorus enjoys having teammates that can remove items with Knock Off such as Roaring Moon, Manaphy, and Azelf, helping it to break down RegenVest Pokemon like Meloetta and Manaphy as well as Pokemon with Heavy-Duty Boots like Dragonite and Mandibuzz. Landorus struggles to switch in on many Pokemon due to its frailty, so it appreciates slow pivots such as Corviknight and Primarina, which also help it by checking offensive Pokemon like Roaring Moon, Iron Boulder, and Walking Wake.</p>"
      }
    }
  },
  "Landorus-Therian": {
    "sets": {
      "Physical Wall": {},
      "Desolate Land": {
        "outdated": true,
        "description": "<p>Due to its solid offenses and access to U-turn and Stealth Rock, Landorus-T functions as a mixed attacker, decent pivot, and entry hazard setter. Weather Ball + Desolate Land provides Landorus-T a way to hit physically defensive Pokemon such as Corviknight, Great Tusk, and Fluffy Mandibuzz. With U-turn, Landorus-T can switch out of bad matchups against the likes of Dragonite, Well-Baked Body Skarmory, and Primordial Sea Zapdos and bring in Pokemon like Azelf, Iron Hands, and Iron Boulder to check them. Thanks to Desolate Land, Landorus-T is able to successfully wall Empoleon, Barraskewda, and non-Ice Beam Swampert, as well as prevent them from pivoting. Landorus-T helps strong physical attackers such as Roaring Moon and Zamazenta, since they have some trouble breaking through physically defensive Pokemon like Corviknight and Fluffy Mandibuzz. Landorus-T also helps special attackers such as Gengar and Latios that have difficulty breaking through specially defensive Pokemon like Hisuian Goodra and Empoleon, which also don't like the hazard chip damage it provides. However, Landorus-T struggles against Dragonite and Well-Baked Body Pokemon such as Skarmory and Chesnaught; Corviknight and Deoxys-D can be used to check Dragonite, while Zapdos and Primarina are options for beating Skarmory and Chesnaught. Landorus-T also tends to struggle against mixed walls such as Manaphy and Ting-Lu; therefore, Iron Hands and Hisuian Electrode make for good partners.</p>"
      }
    }
  },
  "Meloetta": {
    "outdated": true,
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Meloetta is a capable pivot thanks to its ability to switch into most special attackers like Gholdengo, Scream Tail, Deoxys-S, and Iron Moth. Knock Off gives Meloetta an option to support its teammates by removing key items such as Assault Vest from Swampert and Hisuian Goodra, while Thunderbolt hits Manaphy and non-Volt Absorb Corviknight for high damage. Low Kick lets Meloetta chip Hisuian Goodra and Heatran, but Energy Ball can be used instead to 2HKO Swampert after its Assault Vest has been removed. Good teammates include Pokemon like Roaring Moon, Galarian Zapdos, Barraskewda, and Chien-Pao because Meloetta can safely get them into the field with a slow U-turn. Physical attackers like Roaring Moon and Chien-Pao naturally threaten Meloetta out, so Pokemon that can deal with them, like Corviknight, Great Tusk, and defensive Quaquaval, make for good partners. Lastly, Meloetta appreciates entry hazard removal from the likes of Corviknight, Great Tusk, and Mandibuzz, to keep its HP high enough to switch into strong attackers.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 306317, "username": "katerina"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Time2Bonk"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Chesnaught": {
    "outdated": true,
    "sets": {
      "Flame Body": {
        "description": "<p>Chesnaught's bulk, recovery, and useful resistances let it frustrate several common physical attackers, most notably Roaring Moon, Ogerpon-C, and Barraskewda, and Spikes provides utility in nearly every matchup. Flame Body has a 30% chance to end the usefulness of opposing offensive pivots, again, most notably Roaring Moon, and greatly frustrates Rapid Spin Great Tusk attempting to clear Spikes. Iron Defense is the preferred fourth move to set up alongside Bulk Up Great Tusk and Swords Dance users like Iron Hands and Garchomp, while Knock Off can help remove Heavy-Duty Boots to further accentuate Spikes. The given EV spread lets Chesnaught outpace Corviknight, giving it extra chances to fish for a burn, as Brave Bird will not 2HKO it after Iron Defense. Chesnaught mostly finds its home on stall teams, where it can find plenty of teammates to switch into its common weaknesses, especially Fire and Psychic, and can find multiple switch-in opportunities to try and activate Flame Body, which is one of the few ways for stall teams to punish pivoting. Chesnaught is especially horrified of Fire-types like Ceruledge and Cinderace, as they can obliterate it without fear of a burn, and it cannot touch Ghost-types like Gengar and Hisuian Zoroark without Knock Off, so teammates like Well-Baked Body Mandibuzz are strongly recommended.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523866, "username": "UT"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 539679, "username": "GlalieGoesBoom"}, {"user_id": 603931, "username": "Time2Bonk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Talonflame": {
    "outdated": true,
    "sets": {
      "Magic Guard": {
        "description": "<p>Despite its low Attack stat, Talonflame carves out a niche as a usable wallbreaker and potent stallbreaker. Roost keeps Talonflame healthy throughout the course of a game, allowing it to reliably act as an offensive check to threats like Ogerpon-H, Great Tusk, and Iron Moth. Bulk Up gives revenge killers like Dragonite and Choice Scarf Roaring Moon a harder time at attempting to revenge kill Talonflame while threatening to let it snowball out of control. Flare Blitz smacks Steel-types like Corviknight, Gholdengo, and Iron Treads, while Swords Dance provides greater damage potential, allowing Talonflame to threaten a 2HKO on Pecharunt and OHKO Dragonite from full HP. Taunt allows Talonflame to reliably act as a stallbreaker, preventing would-be checks like Well-Baked Body Corviknight, Unaware Scream Tail, and Deoxys-D from checking it, while Will-O-Wisp provides more utility, burning switch-ins like Garganacl, Primordial Sea Zapdos, and Archaludon. Talonflame requires support from Pokemon that can wear the opposing team down, so entry hazard setters like Great Tusk, Skarmory, and Empoleon are wonderful teammates for it. Talonflame's unimpressive bulk necessitates good teammates that can switch into revenge killers like Azelf, Barraskewda, and Hisuian Electrode; hence, the aforementioned hazard setters, Iron Moth, and Blissey all work as excellent partners for it. Talonflame also notably requires teammates such as RegenVest Swampert and Meloetta that can deal with Fire-immune Electric- and Steel-types like Well-Baked Body Gholdengo, Primordial Sea Zapdos, and Archaludon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 611238, "username": "LordBox"}, {"user_id": 475288, "username": "Pandemonium"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Goodra-Hisui": {"sets": {"RegenVest": {}}},
  "Volcanion": {
    "sets": {
      "Choice Specs": {},
      "Magic Guard": {},
      "Primordial Sea": {
        "outdated": true,
        "description": "<p>Primordial Sea Volcanion excels as a fantastic wallbreaker with its great Special Attack and offensive typing. Rain-boosted Steam Eruption combined with Choice Specs allows Volcanion to 2HKO most Pokemon in tier, including most specially defensive walls such as RegenVest Garchomp, Meloetta, and Alolan Muk. Weather Ball dissuades promient Desolate Land users that might want to switch in to Volcanion such as Cinderace and Iron Moth. Earth Power is a more reliable way to deal with Desolate Land users like Iron Moth and Heatran, and it's a reliable way to hit Hisuian Goodra without missing. Focus Blast 2HKOes a would-be check in RegenVest Roaring Moon, as well as Hisuian Goodra after Spikes chip. Volcanion pairs well with entry hazard setters like Ting-Lu and Garchomp, which help wear down common RegenVest Pokemon like Goodra and Hisuian Goodra, and hazards also guarantee a 2HKO on Meloetta. Due to Volcanion's Stealth Rock weakness it pairs well with hazard removers like Corviknight and Quaquaval, which can also help pivot it in safely. Volcanion also pairs well with offensive pivots like Zapdos and Roaring Moon, which can help bring it in on targets like Corviknight.</p>"
      }
    }
  },
  "Primarina": {
    "comments": "<h3>Other Options</h3> <p>On RegenVest sets, Psychic can be used instead of Psychic Noise for a chance to 2HKO Iron Moth but is generally less useful due to the latter's denial of HP recovery. Hydro Pump can also be considered for more immediate damage on RegenVest sets in place of Energy Ball or Surf. Primarina does have a few niche sets, mainly a physically defensive set with the Stamina ability and Leftovers. This set aims to rack up stat boosts through its ability and the move Calm Mind to sweep with the move Stored Power.</p> <h3>Checks and Counters</h3> <p><strong>Electric Types</strong>: Electric-types like Zapdos and Sandy Shocks force out Primarina with their strong attacks, often 2HKOing RegenVest sets and OHKOing offensive Primarina.</p> <p><strong>Desolate Land Users</strong>: Desolate Land users such as Heatran and Moltres can deny Primarina's Flip Turn and take all of Primarina's attacks relatively easily.</p> <p><strong>Grass-Types</strong>: Primarina is threatened by several Grass-types that are staples on teams in the tier. On the physical side, it is threatened by Power Whip from the Ogerpon formes and Flower Trick from Sword of Ruin Meowscarada. On the special side, Sinistcha threatens Primarina with Matcha Gotcha and can often KO it after a Calm Mind boost.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<p>Primarina is one of the strongest special wallbreakers in the tier, with an excellent typing that gives it opportunities to switch in and spam its powerful and reliable STAB moves. Primordial Sea boosts Weather Ball and lets Primarina check Desolate Land users such as Moltres, non-Discharge Iron Moth, and non-Gunk Shot Cinderace. However, these same threats are also great checks to Primarina if they negate Primordial Sea, so Psychic is helpful as the strongest option against them, particularly Iron Moth, while Psychic Noise is a weaker alternative that prevents recovery moves from Moltres and Iron Moth. Flip Turn lets Primarina pivot on special walls such as Manaphy and Bulletproof Iron Treads, generating momentum for its team.</p> <p>Primarina fits well on balance and bulky offense teams, where its mix of defensive utility and offensive pressure is put to good use. It resists the STAB moves of many common Choice item wallbreakers such as Chien-Pao and Zamazenta, though it still needs backup from physical walls like Corviknight and Pecharunt, especially against the Ogerpon formes. Great Tusk and Corviknight can also provide entry hazard removal, letting Primarina stay healthy so it can threaten out the aforementioned Choice Band wallbreakers. Faster special attackers such as Zapdos, Latios, and Deoxys-S are also problematic, so special walls such as Iron Treads and Swampert are good teammates. In exchange, Primarina can deter Fire-type moves that threaten Corviknight and Iron Treads. Primarina struggles against special walls like Manaphy and the aforementioned Desolate Land users, especially specially defensive Moltres, so it appreciates physical attackers like the Ogerpon formes and Roaring Moon.</p>"
      },
      "RegenVest": {
        "description": "<p>An excellent type combination, good natural bulk and access to Flip Turn allow Primarina to function as a solid RegenVest user . Psychic Noise hits Desolate Land Iron Moth and Moltres for a good chunk of damage and denies recovery as well. Energy Ball is useful against Swampert, Manaphy, and opposing Primarina. This moveslot may also be swapped for Surf or Hydro Pump to provide a second powerful STAB option for more reliable neutral damage against Corviknight and Skarmory. This set runs a Speed-reducing nature and 0 Speed IVs to ensure that Primarina is the slowest Pokemon on the field and can safely pivot to bring in teammates using Flip Turn.</p> <p>RegenVest Primarina performs well as a bulky pivot on offensive archetypes due to its excellent mixed defensive profile, checking tier staples both on the physical and special side. Although it cannot learn Knock Off, unlike other RegenVest Water types, Primarina is able to counter the likes of Roaring Moon, Chien-Pao, Great Tusk, and Zamazenta with its Fairy typing, as well as handling specially offensive threats such as Gholdengo and Latios quite well. This set must be wary of potential Knock Off users as its ability to take special hits is crippled if it loses its Assault Vest. Therefore, Primarina appreciates support from teammates like Great Tusk and Corviknight to absorb Knock Off; they can also aid Primarina with entry hazard removal. Strong Electric-type attackers like offensive Iron Hands, Zapdos, and Sandy Shocks can pressure and break through Primarina, so it could use Electric-immune teammates like Great Tusk, Iron Treads and Volt Absorb Corviknight. Desolate Land users such as Heatran or Moltres can deny Primarina Flip Turn pivots and immediately threaten it with Solar Beam. Primordial Sea Zapdos or Well-Baked Body Gholdengo can switch into these threats and give Primarina safe entry.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 483565, "username": "porcupine21"}, {"user_id": 539679, "username": "GlalieGoesBoom"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 652656, "username": "Gambit"}, {"user_id": 539679, "username": "GlalieGoesBoom"}, {"user_id": 580765, "username": "cat"}, {"user_id": 475288, "username": "Pandemonium"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Ribombee": {"sets": {"The Webber": {}}},
  "Toxapex": {
    "sets": {
      "Physical Wall": {
        "description": "<p>Toxapex leverages its high defensive stats and plethora of useful utility moves to act as a stout defensive wall and disruptor. Prankster + Haze lets Toxapex shut down threatening setup sweepers such as Ogerpon-Wellspring, Manaphy, and Stored Power Iron Crown. Corrosion + Toxic gives Toxapex the ability to punish Steel-types such as Corviknight, Gholdengo, and Desolate Land Heatran, which can otherwise shrug off Toxapex's attacks, while Toxic Spikes can pressure more offensively oriented teams lacking their own Poison-type. Chilling Water deters physical attackers such as Iron Hands and Great Tusk from switching into Toxapex, while Infestation can rack up chip damage on bulkier foes such as Corviknight and Empoleon. Black Sludge give Toxapex greater longevity, while Rocky Helmet punishes physical attackers such as Chien-Pao and Barraskewda, as well as general U-turn spam. Toxapex fits best on stall teams due to its passivity and ability to check setup sweepers that could potentially run rampant. Certain wallbreakers such as Iron Boulder, Garchomp, and Iron Hands are able to power through Toxapex, so teammates that can check these such as Great Tusk and Corviknight are greatly appreciated; Toxapex can in return take on Chien-Pao and Fire-types such as Cinderace and Ogerpon-H. Toxapex is shocked by Electric- and Psychic-types such as Zapdos, Deoxys-S, and Azelf, so teammates that can reliably take these on such as Hisuian Goodra, Mandibuzz, and Meloetta are helpful.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 603931, "username": "Time2Bonk"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 539679, "username": "GlalieGoesBoom"}, {"user_id": 375662, "username": "Isaiah"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Kommo-o": {
    "outdated": true,
    "sets": {
      "Galvanize": {
        "description": "<p>Kommo-o finds a decent niche on offensive teams as a mixed attacker with strong coverage. Boomburst scares off walls such as Mandibuzz, Corviknight, and Manaphy. Clanging Scales threatens Great Tusk, Iron Hands, and Pecharunt, while Close Combat notably allows Kommo-o to smack special walls like Blissey, Swampert, and Volt Absorb Empoleon attempting to check it. Stealth Rock synergizes well with Kommo-o's ability to scare away entry hazard removers like the aforementioned Mandibuzz and Corviknight. Clangorous Soul allows it to act as a passable setup sweeper instead, preventing threats like Roaring Moon and Iron Boulder from revenge killing it while increasing its offensive capabilities. Life Orb is typically preferred for its consistent damage boost, but Throat Spray can be used on Clangorous Soul sets to avoid recoil. Kommo-o's lack of longevity necessitates either teammates that can make up for its absent defensive utility like Corviknight and Manaphy or offensive teammates that can keep up the pressure like Iron Moth and Chien-Pao. Select revenge killers like Dragonite, Choice Scarf Roaring Moon, and Azelf naturally outspeed Kommo-o even after a Clangorous Soul, so answers to them like Kingambit, Great Tusk, and Roaring Moon make for good partners. Kommo-o appreciates pivots like Azelf, Sandy Shocks, and Roaring Moon because they can pivot out on their checks like Blissey, Empoleon, and Corviknight and safely bring it in to start threatening the opposing team. Kommo-o greatly appreciates dual screens support from setters like Corviknight and Deoxys-S allowing it to have an easier time setting up with Clangorous Soul or supporting its teammates with Stealth Rock; alternatively, Sticky Web from Smeargle and Ribombee can help it outspeed Choice Scarf revenge killers like Latios, Azelf, and Roaring Moon after a Clangorous Soul.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 594122, "username": "Evie"}, {"user_id": 475288, "username": "Pandemonium"}, {"user_id": 603931, "username": "Time2Bonk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Cinderace": {
    "sets": {
      "Court Change": {},
      "Choice Band": {},
      "Magic Guard": {
        "outdated": true,
        "description": "<p>Cinderace's high Speed, high Attack, and wide utility movepool make it a versatile attacker that can both dish out substantial damage and disrupt opposing Pokemon indirectly. High Jump Kick hits Garganacl while also being the best option against Well-Baked Body users such as Corviknight and Skarmory, and Gunk Shot hits Scream Tail, Primarina, and Primordial Sea Zapdos. Cinderace can use Will-O-Wisp to cripple would-be switch-ins such as Great Tusk, Garchomp, Swampert, and Dragonite, pivot out on them with U-turn, or carry Gunk Shot for maximum coverage. Swords Dance helps Cinderace wallbreak, while Taunt prevents foes from inflicting status, recovering, or controlling entry hazards, which Cinderace can control itself with Court Change. In particular, Taunt improves Cinderace's matchup against Unaware users such as Mandibuzz and Scream Tail by prohibiting their recovery. Life Orb amplifies Cinderace's damage output, while Focus Sash provides recourse against Pokemon that would otherwise OHKO it, allowing it to score surprise KOs or get off valuable utility moves in a pinch. Magic Guard removes Life Orb recoil, the chance for Focus Sash to be broken by indirect damage, and Cinderace's vulnerability to Entry Hazard damage. Cinderace's ability to pressure Corviknight and Skarmory is appreciated by other wallbreakers that can struggle to deal with them like Roaring Moon, Iron Boulder, and Barraskewda, all of which Cinderace can help enter the field with U-turn. Cinderace is threatened by faster Pokemon like Zamazenta and Deoxys-S, so defensive Pokemon that can switch into these such as Empoleon, Corviknight, and Mandibuzz are helpful partners. Well-Baked Body Gholdengo completely walls Cinderace, making partners that can force out or eliminate it like Roaring Moon, Chien-Pao, and Gengar valuable teammates.</p>"
      }
    }
  },
  "Inteleon": {
    "outdated": true,
    "sets": {
      "Primordial Sea": {
        "description": "<p>Inteleon is a decent cleaner and wallbreaker thanks to its high Special Attack and Speed, threatening many offensive Pokemon like Great Tusk, Scream Tail, and Gholdengo. U-turn lets it pivot out of unfavorable matchups like RegenVest Manaphy and Primarina and forms a VoltTurn core with other pivots like Roaring Moon and Meowscarada. Mud Shot threatens Fire-types like Iron Moth and Cinderace that could otherwise utilize Desolate Land to comfortably switch into a Weather Ball and OHKOes Heatran. Ice Beam snipes Dragon-types like Roaring Moon and Latios. Physical teammates like Zamazenta and Roaring Moon appreciate Inteleon's ability to threaten their switch-ins like Pecharunt and Great Tusk, respectively, letting them rip massive holes in the opponent's team once these foes are removed; in return, they can threaten walls like Empoleon and Manaphy, which Inteleon struggles against. Entry hazard support from the likes of Scream Tail and Ting-Lu helps Inteleon against special walls like Empoleon and RegenVest users like Manaphy and Primarina, which it otherwise struggles to break through. Inteleon is also vulnerable to being worn down by hazards, so teammates that can remove them like Corviknight and Great Tusk are good partners. Furthermore, Inteleon's frailty leaves it severely threatened by faster revenge killers like Chien-Pao and Choice Scarf Roaring Moon, making teammates that can deal with them like the aforementioned Corviknight and Great Tusk greatly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 552227, "username": "Kinetic"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 580765, "username": "cat"}, {"user_id": 603931, "username": "Time2Bonk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}]}]}
  },
  "Corviknight": {
    "sets": {
      "Physically Defensive": {},
      "Dual Screens": {
        "description": "<p>With its remarkable defensive profile and utility options, Prankster Corviknight becomes an effective lead at setting dual screens to support its teammates. Prankster-boosted Taunt allows Corviknight to shut down foes like Great Tusk, Skarmory, and Regieleki from setting their entry hazards or own dual screens; stop Cinderace and opposing Corviknight from removing its dual screens with Court Change and Defog; prevent offensive threats like Zamazenta, all Ogerpon formes, and Iron Boulder from using it as setup fodder; block Trick from Choice item users like Scream Tail and Gholdengo from crippling it; and additionally stop defensive Pokemon like Gholdengo, Scream Tail, and non-Prankster Pecharunt from healing freely, letting its teammates overwhelm them more easily. U-turn makes use of Corviknight's middling Speed tier to support its teammates by bringing them in safely after stomaching an attack, and it's especially valuable against Dark-type foes like Chien-Pao, Kingambit, and Taunt Roaring Moon that can otherwise set up in front of or even shut down Corviknight.</p> <p>Corviknight is exclusively found on dual screens hyper offense teams. As a result, high caliber offensive threats like Tail Glow Manaphy, IronPress Zamazenta, and Dragon Dance Roaring Moon pair well with it, as they appreciate Corviknight bringing them in safely through U-turn and its dual screens to set up more easily. However, Double Dance sweepers such as Iron Crown and Galarian Moltres benefit from said dual screens even more, as they require multiple turns of setup before wreaking havoc. Other setup sweepers like Iron Boulder, Iron Hands, and Kingambit have the added benefit of threatening Cinderace and Defoggers like opposing Corviknight and Mandibuzz—especially since Mandibuzz can use Defog freely even in the face of Corviknight—preventing them any free opportunities of ever removing Corviknight's dual screens. Since other foes like Zapdos, Iron Moth, and Dark-types like Roaring Moon and Kingambit can also use Corviknight as entry points, teammates that can come in afterwards to either threaten or use them as setup fodder are also beneficial, with the aforementioned Iron Boulder, Deoxys-S, Zamazenta, and Great Tusk capable of doing so. Furthermore, Corviknight's ability to prevent Stealth Rock from going up with Taunt also gives setup sweepers like Ogerpon-Hearthflame and Chien-Pao more opportunities to get rolling.</p>"
      },
      "Immunity": {
        "description": "<p>Corviknight's great utility and defensive typing, further bolstered by an immunity-granting ability, make it an excellent special wall and defensive pivot. Volt Absorb lets it counter Electric-types such as Zapdos and Sandy Shocks and helps against special attackers that rely on Electric-type coverage, such as Deoxys-S, Latios, and Iron Crown. Similarly, Well-Baked Body shuts down Ogerpon-H, Moltres, and non-Discharge Iron Moth. Brave Bird is the go-to STAB move, while Body Press is an option on Well-Baked Body sets to take advantage of the Defense boosts. U-turn generates momentum for Corviknight’s teammates, and Defog provides valuable hazard control. A Sassy nature with 0 Speed IVs is crucial for Corviknight's role as a slow pivot.</p> <p>Corviknight fits on balance and bulky offense teams, where its longevity and consistency gives it a niche over Iron Treads. Corviknight can pivot in more offensive teammates like Chien-Pao and Ogerpon-H, which also appreciate its ability to remove entry hazards. Corviknight is threatened by physical wallbreakers such as Zamazenta and Ogerpon-W, making physically defensive walls like Great Tusk and Pecharunt good teammates. Corviknight can also be overwhelmed by neutral special attacks from Gholdengo and Primarina, so it needs backup from RegenVest users like Manaphy and Swampert. In exchange, Volt Absorb Corviknight helps Manaphy answer Electric-types, while Well-Baked Body helps Swampert answer Fire-types carrying Grass-type coverage like Iron Moth and Heatran.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493260, "username": "Marnie"}, {"user_id": 539679, "username": "GlalieGoesBoom"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 580765, "username": "cat"}, {"user_id": 652656, "username": "Gambit"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Barraskewda": {
    "sets": {
      "Offensive Pivot": {},
      "Choice Band": {
        "outdated": true,
        "description": "<p>With great offensive stats and a spammable move in Flip Turn, Barraskewda serves as an excellent offensive pivot that's capable of outpacing the majority of the metagame. Close Combat lets it deal with foes that resist its Water-type moves such as Roaring Moon, Ogerpon-W, and Empoleon, while Aqua Jet lets it pick off weakened foes that normally outspeed it such as Choice Scarf Sandy Shocks and Hisuian Electrode, as well as foes that have set up, such as Volcarona and Great Tusk. Drill Run and Psychic Fangs also threaten Water-resistant foes, with Drill Run OHKOing Desolate Land Fire-types such as Iron Moth, Heatran, and Ceruledge and Psychic Fangs threatening Quaquaval and Kommo-o. Barraskewda takes great advantage of weakened walls such as Corviknight and Deoxys-D, making physical wallbreakers such as Iron Boulder, Galarian Zapdos, and Ceruledge good partners. Specially offensive pivots such as Hisuian Electrode and Azelf form great VoltTurn cores with Barraskewda, since they're able to threaten each other's checks, with Barraskewda forcing out special walls such as Meloetta and Swampert while they threaten physical walls such as Corviknight and Quaquaval in return. Barraskewda is very frail and easily OHKOed by faster foes such as Choice Scarf Roaring Moon and Azelf, which makes defensive pivots such as Corviknight, Mandibuzz, and Swampert necessary. It also struggles a lot with entry hazards, making hazard removers such as Great Tusk and Corviknight appreciated.</p>"
      }
    }
  },
  "Polteageist": {"sets": {"Shell Smash Sweeper": {}}},
  "Zamazenta": {
    "comments": "<h3>Other Options</h3> <p>Howl is an excellent move on all-out attacking variants that trade a coverage option for the ability to set up and punish predicted switches harder. Fire Fang is an option on Choice Band and all-out attacking variants that allows Zamazenta to hit Fluffy Corviknight and Skarmory, with the former variant threatening to 2HKO Fluffy Corviknight with light chip damage. Wild Charge, meanwhile, hits Primarina hard while being a solid midground option due to its non-negligible damage output. Heavy Slam is an option on IronPress variants to deal hefty damage to Scream Tail, which would wall Zamazenta and force it out otherwise, while Substitute allows Zamazenta to set up without fear of status and making it harder to revenge kill. Magic Guard + Life Orb variants can consider using Moonblast to lure in and remove Fluffy Great Tusk, which can otherwise check Zamazenta consistently, but this is niche at best and not worth using over other moves.</p> <h3>Checks and Counters</h3> <p><strong>Physical Walls</strong>: Physical walls such as Fluffy Corviknight, Skarmory, and Great Tusk can consistently switch into Zamazenta and force it out or take the opportunity to set up or remove entry hazards.</p> <p><strong>Physically Defensive Ghost-types</strong>: Pecharunt is a good counter to Zamazenta, being capable of consistently surviving multiple uses of Crunch and threatening it in return with Malignant Chain, while Gholdengo and Sinistcha, when equipped with Fluffy, can threaten Zamazenta out or use it as setup fodder, respectively.</p> <p><strong>Fairy-types</strong>: Scream Tail and Primarina are capable of surviving most of Zamazenta's attacks and force it out in return.</p> <p><strong>Fast Psychic-types</strong>: Deoxys-S, Choice Scarf Latios, and Azelf all outspeed and threaten to OHKO Zamazenta or force it out.</p>",
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Zamazenta leverages its amazing Speed tier, good Attack, great natural bulk, and spammable STAB Close Combat to serve as one of the tier's most consistent and dangerous wallbreakers and revenge killers. Crunch smacks Ghost- and Psychic-types like Pecharunt, Gholdengo, and Latios hard; Stone Edge OHKOes Flying-types like Zapdos and Moltres while being Zamazenta's strongest move against Fluffy Corviknight and Skarmory; and Heavy Slam threatens a would-be check in Scream Tail while dealing hefty damage to Primarina.</p> <p>Zamazenta fits on numerous playstyles that are in need of a fast and deadly wallbreaker that also acts as a stopgap to Dark-types like Roaring Moon, Kingambit, and Chien-Pao. This makes teammates that are scared of them, like Latios, Gholdengo, and Pecharunt, good partners, with the former two helping to alleviate Zamazenta's inability to break past physical walls like Pecharunt, Fluffy Corviknight, and Great Tusk. Furthermore, Zamazenta helps to threaten the special walls Latios and Gholdengo may struggle with, such as RegenVest Swampert, Manaphy, and Iron Treads. Zamazenta appreciates entry hazard support from setters like Garchomp, Scream Tail, and Ting-Lu, allowing it to wear down physical walls faster and overwhelm them.</p>"
      },
      "All-Out Attacker": {},
      "IronPress": {
        "description": "<p>IronPress Zamazenta serves as a deadly wincon that provides great defensive utility, leveraging its excellent bulk and useful Dark resistance to switch into dangerous threats like Chien-Pao, Kingambit, and Roaring Moon and use these opportunities to set up or wallbreak. Stone Edge threatens Flying-types like Zapdos and Moltres and is Zamazenta's strongest move against Fluffy Landorus-T, while Crunch hits Ghost-types like Pecharunt, Gholdengo, and Sinistcha. The given Attack EVs allow Stone Edge to OHKO Moltres without Expert Belt. With Expert Belt, Crunch 2HKOes physically defensive Gholdengo after minimal chip damage and has near-guaranteed odds of 3HKOing non-Intimidate Pecharunt; this item also allows Stone Edge to OHKO offensive Zapdos. The remaining EVs are invested into Defense to power up Body Press and let Zamazenta answer physical threats better.</p> <p>IronPress Zamazenta best fits on both balance and offensive teams that appreciate its defensive utility and potency as a wincon. Offensive Pokemon such as Roaring Moon, Zapdos, and Gholdengo that can lure in setup fodder like Great Tusk, Roaring Moon, Kingambit, and Swampert for Zamazenta pair well with it. Bulky Fighting-resistant foes unafraid of Zamazenta's coverage like Pecharunt, Primarina, and defensive Landorus-I are its biggest roadblocks; thus, teammates that can deal with them such as Roaring Moon, Kingambit, and Latios pair well with it. Kingambit is an especially notable partner, as it complements Zamazenta both offensively and defensively extremely well, with Kingambit switching into and threatening the Ghost- and Psychic-types Zamazenta detests, while Zamazenta deals with Kingambit's checks like Great Tusk, Iron Hands, and Body Press Corviknight. Zamazenta is forced out by threats that can either outspeed and threaten it or survive a hit and attack in return like Latios, Deoxys-S, and Scream Tail; thus, teammates that can deal with them like Iron Treads, Swampert, and Manaphy are greatly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 539679, "username": "GlalieGoesBoom"}, {"user_id": 652656, "username": "Gambit"}, {"user_id": 584685, "username": "Glory"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 593115, "username": "igiveuponaname"}]}]}
  },
  "Zamazenta-Crowned": {
    "sets": {"IronPress": {"description": "<p>Zamazenta-C leverages its Fighting / Steel typing and high Defense and Speed to be a decent Body Press sweeper that's able to switch in and set up on common Pokemon like Corviknight, Chien-Pao, and Roaring Moon. Stone Edge helps against Zapdos, Iron Moth, and Ceruledge, while Substitute helps it set up against would-be switch-ins like Iron Hands and Great Tusk as well as shielding it from status afflictions from moves like Manaphy's Scald and Corrosion Pecharun't Toxic. Zamazenta-C plays best on offensive teams, so it appreciates entry hazards from Pokemon like Skarmory and Deoxys-D and dual screens support from Pokemon like Corviknight and Deoxys-S, which help it take KOs and set up, respectively. Zamazenta-C also appreciates Pokemon like Chien-Pao, Roaring Moon, and Gengar that are able to take down Deoxys-D, Gholdengo, and Pecharunt, as otherwise it is unable to make progress at all.</p>"}},
    "credits": {"writtenBy": [{"user_id": 603640, "username": "Hiusi guy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Time2Bonk"}, {"user_id": 552227, "username": "Kinetic"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Regieleki": {
    "outdated": true,
    "sets": {
      "Dual Screens": {
        "description": "<p>With the highest base Speed in the game, Regieleki can enable high-powered setup sweepers like Manaphy, Kingambit, and Iron Hands on hyper offense teams as a dual screens lead, though it's more niche than other dual screens setters. With Refrigerate, Rapid Spin is a guaranteed way to remove entry hazards even in the face of Ghost-types like Gholdengo and Pecharunt. However, Regieleki isn't the best to rely on for Rapid Spin all of the time, so teammates like Great Tusk and Quaquaval can help as additional spinners. Explosion lets Regieleki get its teammates in safely, do massive damage to foes like Swampert, Great Tusk, and Roaring Moon, and prevent dual screens removal via Defog. Many setup sweepers, most notably Gholdengo and Iron Hands, appreciate Regieleki's dual screens support while also fending off priority from Pokemon like Slither Wing and Prankster Corviknight, which would otherwise prevent it from setting dual screens. Regieleki similarly doesn't enjoy Choice Scarf Roaring Moon and Meowscarada, as they are the only relevant Pokemon able to outspeed it instantly, so having checks to them such as Kingambit, Iron Hands, and Zamazenta can help. As a final note, Regieleki is exclusively a hyper offense lead meant to support Pokemon such as Iron Boulder, Gengar, and Kingambit by providing them with extra opportunities to set up and win the game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 603640, "username": "Hiusi guy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Time2Bonk"}, {"user_id": 540420, "username": "Smashing"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}, {"user_id": 297659, "username": "deetah"}]}]}
  },
  "Ursaluna-Bloodmoon": {
    "sets": {
      "Unaware Calm Mind": {},
      "Offensive Calm Mind": {},
      "Calm Mind": {
        "outdated": true,
        "description": "<p>Ursaluna-B uses its great Special Attack and physical bulk to be a decent Calm Mind sweeper. Calm Mind lets it boost past and break through foes like Corviknight and RegenVest Manaphy and Swampert, while Moonlight provides additional longevity, letting it use the aforementioned walls as setup fodder. Storm Drain turns RegenVest users like Swampert, Manaphy, and Primarina into setup fodder and lets it check Barraskewda; alternatively, Well-Baked Body lets Ursaluna-B counter Fire-types like Ceruledge lacking Close Combat, Iron Moth, and Heatran, letting it safely set up on them, while Fluffy lets it deal with physical attackers, using Dragonite as setup fodder and checking Fighting-types like Iron Hands and Great Tusk. 252 Special Attack EVs and a Modest nature lets Ursaluna-B OHKO Dragonite at +1 and defensive Great Tusk, while 252 Defense EVs and a Bold nature help Ursaluna-B better check physical attackers like Roaring Moon and Iron Boulder. 15 Speed IVs let Ursaluna-B underspeed Corviknight, preventing it from safely using Roost or U-turn to slow pivot to a teammate that can handle Ursaluna-B. Powerful special attackers like Azelf and Latios appreciate Ursaluna-B's ability to handle threats like Roaring Moon and pressure checks like Swampert for them; in return, they can threaten Fighting-types like Zamazenta and Great Tusk that could threaten it. Ursaluna-B's low Speed leaves it susceptible to threats that can OHKO it like Chien-Pao and Latios, so teammates that can deal with them like RegenVest Primarina are appreciated. Ursaluna-B's low Special Defense also lets powerful attackers like Latios and Deoxys-S OHKO it prior to setting up, so specially defensive teammates that can check them like Empoleon and Heatran are good pairings. Earth Eater users like Gholdengo and Empoleon can wall Ursaluna-B, so teammates that can threaten them like Roaring Moon and Scrappy Great Tusk are appreciated.</p>"
      }
    }
  },
  "Enamorus-Therian": {"sets": {"Sheer Force": {}}},
  "Meowscarada": {
    "comments": "<h3>Other Options</h3> <p>Heavy-Duty Boots and Magic Guard + Life Orb sets are niche options that can fit on bulkier teams that appreciate the longevity of such sets given Meowscarada's propensity to pivot often, though the loss in power is often noticeable such as being unable to 2HKO Pecharunt. Mixed sets with Adaptability + Life Orb and Dark Pulse are a niche option to bait checks such as Corviknight. Spikes and Toxic Spikes can also be considered as options to accrue chip damage or force entry hazard removal by Corviknight. Sucker Punch can be considered on Choice Band sets if a team needs priority to check faster threats such as Deoxys-S and Choice Scarf Gholdengo. Lash Out is a niche option that allows Meowscarada to better threaten Intimidate Corviknight and Skarmory.</p> <h3>Checks and Counters</h3> <p><strong>Corviknight and Skarmory</strong>: With their significant bulk and 4x resistance to Grass, Meowscarada can struggle greatly in breaking through these counters alone, particularly Fluffy variants, and so requires support from teammates to weaken or remove these foes.</p> <p><strong>Faster Threats</strong>: Meowscarada's lack of bulk and poor defensive typing means Choice Band sets are vulnerable to most offensive threats that outspeed it such as Chien-Pao, Zamazenta, and Deoxys-S as well as various Choice Scarf users such as Roaring Moon and Azelf. Choice Scarf sets are also vulnerable to priority from the likes of Chien-Pao and Kingambit.</p>",
    "sets": {
      "Choice Item": {
        "description": "<p>With its good Attack and great Speed tier, Meowscarada serves as a strong offensive pivot and wallbreaker that is able to exploit and outspeed common defensive and offensive staples such as Great Tusk, Roaring Moon, and Gholdengo. Choice Band enables Meowscarada to secure OHKOs against foes such as Scream Tail, Pecharunt, and Great Tusk as well as pressure checks such as Corviknight. Choice Scarf guarantees Meowscarada is able to outspeed the entire unboosted metagame and threaten other Choice Scarf users such as Roaring Moon, Latios, and Scream Tail. U-turn lets Meowscarada scout switch-ins and accumulate chip damage against checks such as Corviknight. Triple Axel threatens checks such as Mandibuzz and defensive Zapdos while also OHKOing targets like Landorus and Garchomp. Low Kick alternatively allows Meowscarada to hit bulky Steel-types such as Cobalion, Heatran, and Kingambit. Both Triple Axel and Low Kick OHKO Roaring Moon. Trick cripples checks such as Corviknight or setup sweepers such as Fluffy Roaring Moon, Iron Crown, and Kingambit.</p> <p>Meowscarada can fit on a variety of balanced and more offensive teams that appreciate it as a wallbreaker and value its Speed tier above other dangerous offensive threats. Meowscarada can struggle to get onto the field due to its lack of bulk and so appreciates slow pivots like Corviknight, Swampert, and Pecharunt that can also absorb revenge killing attempts from the likes of Chien-Pao, Deoxys-S, and Zamazenta. Meowscarada can also benefit from the presence of offensive pivots like Cinderace, Moltres, and Azelf that provide it with opportunities against switch-ins like Great Tusk, Manaphy, and Swampert. Meowscarada can struggle with breaking through Corviknight and Skarmory and so pairs well with other strong wallbreakers such as Zamazenta, Chien-Pao, and Ogerpon-W that can pressure and overload them. Similarly, it can benefit from strong hazard setters such as Great Tusk, Landorus, Ting-Lu, and Heatran that can chip and weaken Corviknight and other checks like Iron Hands and Zamazenta. Alternatively, Meowscarada can be paired with other strong wallbreakers such as Choice Specs Gholdengo and that can take advantage of a free switch into Corviknight or Skarmory.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 611238, "username": "LordBox"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 652656, "username": "Gambit"}, {"user_id": 540420, "username": "Smashing"}]}, {"name": "Grammar checked by", "members": [{"user_id": 593115, "username": "igiveuponaname"}, {"user_id": 594972, "username": "Murphy Lawden"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Quaquaval": {"sets": {"Magic Guard": {}, "Physically Defensive": {}}},
  "Garganacl": {
    "sets": {
      "Physically Defensive": {},
      "The Salt Cure": {
        "outdated": true,
        "description": "<p>Garganacl is a tough defensive wall that uses Salt Cure to wear down defensive Pokemon, like Swampert, Great Tusk, and Corviknight, and utilizes its ability selection to check a variety of different Pokemon. Fluffy allows Garganacl to check Kingambit and Iron Boulder, Water Absorb lets it reliably switch in on defensive Manaphy as well as help with checking Choice-locked Water-types like Barraskewda and Primarina, and Earth Eater lets it check Roaring Moon and Dragonite running Earthquake. Stealth Rock lets Garganacl support its teammates by providing entry hazards, while with Iron Defense or Curse, Garganacl can set up on and more easily check Pokemon like Iron Hands, Ceruledge, and Dragonite, and boost Body Press or Earthquake, depending on the set. When using Body Press, Garganacl can more efficiently take on Chien-Pao as well as a majority of other Pokemon, while with Earthquake, it can deal with Iron Boulder and Pecharunt. Protect lets Garganacl deal extra damage with Salt Cure active as well as gain some extra Leftovers recovery. Garganacl can either use Leftovers or Heavy-Duty Boots, the former letting it gain more recovery through Protect and the latter helping Garganacl switch in more often. Garganacl provides great defensive support to frail offensive Pokemon, like Iron Moth, Gengar, and Galarian Zapdos, as a to check faster Pokemon like Roaring Moon, Dragonite, and Iron Boulder. Garganacl can struggle against special attackers, such as Deoxys-S, Azelf, and offensive Gholdengo, so having specially defensive teammates, like Hisuian Goodra, Manaphy, and Blissey, can help. Garganacl enjoys being on more defensive teams for having teammates that can take on physical attackers with it, such as Pecharunt, Mandibuzz, and Primarina, as it struggles to reliably check Pokemon like Chien-Pao, Zamazenta, and Barraskewda.</p>"
      }
    }
  },
  "Tinkaton": {"sets": {"Physical Wall": {}}},
  "Palafin": {
    "outdated": true,
    "sets": {
      "Bulk Up": {
        "description": "<p>Palafin is an extremely niche setup sweeper that has one of the strongest priority moves in the tier and not much else, as it is forced to use Zero to Hero to transform. Substitute prevents it from being statused from Pecharunt, Gholdengo, and Manaphy while allowing it to set up on passive targets like Corviknight, Swampert, and the aforementioned Manaphy. Bulk Up makes up for its lack of power, since it lacks an ability and item that increases its damage output. Drain Punch keeps Palafin healthy against checks like Corviknight and Manaphy and allows it to damage Water-immune foes like Iron Moth and Heatran. Ice Punch smacks Dragon-types like Dragonite and Roaring Moon, while Zen Headbutt OHKOes Iron Moth. Palafin fits on bulkier or balance teams as a late-game sweeper, so partners that can wear the opposing team down over time like Magic Guard Roaring Moon, Hisuian Electrode, and Deoxys-S are appreciated; entry hazard setters like Scream Tail, Heatran, and Great Tusk are also beneficial with their ability to chip down foes over time. Palafin is checked offensively by threats like Dragonite, Desolate Land Ceruledge, and Scream Tail, so teammates like Corviknight, Well-Baked Body Mandibuzz, and Heatran handle these threats. Physical walls like Pecharunt and Skarmory can wall Palafin consistently, so partners that can force them out like Deoxys-S and Sandy Shocks pair well with it. Desolate Land users like Iron Moth Roaring Moon, Primordial Sea Zapdos, and Well-Baked Body Gholdengo can deal with Desolate Land users like Iron Moth, Cinderace, and Heatran, making for great partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 611238, "username": "LordBox"}, {"user_id": 523866, "username": "UT"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Kingambit": {"sets": {"Swords Dance": {}}},
  "Great Tusk": {
    "comments": "<h3>Other Options</h3> <p>Wandering Spirit is a niche ability on physically defensive sets that prevents Regenerator Pokemon like Swampert and Roaring Moon from regaining their HP when they pivot out while also letting Great Tusk gain Regenerator. Magic Guard + Life Orb is a great combination for offensive sets, as this prevents Great Tusk from being chipped down by Rocky Helmet and poison from Malignant Chain or Toxic Spikes; it also lets Great Tusk make use of Supercell Slam to hit Corviknight and Skarmory as well as Head Smash for Zapdos and Moltres without taking any recoil. Mold Breaker is used on offensive sets to allow Great Tusk to bypass Fluffy used on Pokemon like Corviknight, Skarmory, and Great Tusk as well as Levitate and Earth Eater on Gholdengo and Pecharunt. Earth Eater gives Great Tusk immunity to Earthquake from Ting-Lu, Swampert, and opposing Great Tusk while also letting it counter Sandy Shocks. Great Tusk can opt for an EV spread of 252 HP / 4 Atk / 252 Spe to make it a fast utility Pokemon while still retaining its defensive prowess. Eject Button is a niche item that swings the momentum in your favor against Pokemon trying to pivot out with U-turn such as Roaring Moon and Corviknight.</p> <h3>Checks and Counters</h3> <p><strong>Special Attackers</strong>: Great Tusk's incredibly low Special Defense makes it prone to being OHKOed by special attackers like Deoxys-S, Zapdos, Scream Tail, Gholdengo, and Iron Moth.</p> <p><strong>Physical Attackers With Super Effective Moves</strong>: Chien-Pao, Iron Boulder, Meowscarada, and the Ogerpon formes can all 2HKO Great Tusk with their super effective attacks.</p> <p><strong>Residual Damage</strong>: Residual damage like poison, Spikes, and Rocky Helmet all slowly chip away at Great Tusk, which is compounded by it lacking any sort of longevity if it isn't using Regenerator or Leftovers.</p>",
    "sets": {
      "Physically Defensive": {
        "description": "<p>Thanks to its enormous physical bulk, solid utility options, and wide variety of abilities it can use, Great Tusk functions as an excellent physical wall. Earthquake lets Great Tusk hit foes that would otherwise beat it like Pecharunt, Scream Tail, and defensive Gholdengo, whereas Body Press does more damage than Earthquake due to its defensive investment and does solid damage to non-Fluffy Corviknight and Skarmory. Knock Off allows Great Tusk to annoy switch-ins like Corviknight, Skarmory, and opposing Great Tusk by removing their items, while Ice Spinner does good damage to Zapdos. Rapid Spin allows Great Tusk to support its teammates by removing entry hazards. Stealth Rock lets Great Tusk residually chip Pokemon like Chien-Pao, Deoxys-S, and Heatran, while Taunt prevents Corviknight from using Defog, Skarmory from setting up hazards, and both of them from recovering with Roost. Scrappy lets Great Tusk use Rapid Spin against Ghost-types such as Gholdengo and Pecharunt while also being able to hit Gholdengo with Body Press; however, Regenerator gives Great Tusk longevity, which lets it check Roaring Moon and opposing Great Tusk without being scared of getting chipped down, but this means that Great Tusk is forced to be used with non-RegenVest special walls. Alternatively, Fluffy makes Great Tusk incredibly bulky, letting it easily switch in on Choice Band Zamazenta and Roaring Moon. Leftovers is appreciated on Scrappy and Fluffy sets, as Great Tusk lacks longevity, but Rocky Helmet is also an option to punish Corviknight, opposing Great Tusk, Zamazenta, and non-Magic Guard Roaring Moon. Heavy-Duty Boots is a bit more niche, but it lets Great Tusk remove hazards without being affected by them.</p> <p>Defensive Great Tusk is most often used on bulky offense or balance teams. Attackers that are easily chipped down by entry hazards like Chien-Pao, Deoxys-S, and non-Magic Guard Roaring Moon appreciate Great Tusk removing them with Rapid Spin. Teammates like Zapdos, Roaring Moon, and Iron Moth enjoy the Stealth Rock that Great Tusk sets up, as they can pivot out to slowly chip away at switch-ins such as Corviknight and RegenVest Roaring Moon. Great Tusk's low Special Defense requires special walls like RegenVest Manaphy, Swampert, and Roaring Moon as well as Heatran, Iron Treads, and Empoleon for Regenerator variants of Great Tusk. Great Tusk is also vulnerable to physical attackers like Chien-Pao, Iron Boulder, Meowscarada, and the Ogerpon formes; therefore, it appreciates aid from Pokemon such as physically defensive Manaphy, Skarmory, and Moltres.</p>"
      },
      "Offensive": {
        "description": "<p>Offensive Great Tusk is an excellent spinner and wallbreaker due to its ability to threaten common spinblockers like Pecharunt and Gholdengo while serving as a great stopgap to the numerous Dark-types the tier has to offer in Kingambit and Roaring Moon. Knock Off is an extremely spammable move that cripples Great Tusk's switch-ins like Zapdos and Moltres, while Head Smash is an excellent option on Magic Guard sets for its ability to let Great Tusk lure in and remove the aforementioned Flying-types. Rapid Spin allows Great Tusk to provide more utility to its team and potentially snowball out of control when also using Bulk Up. Smack Down allows Great Tusk to deal hefty damage to Zapdos and Moltres as well as ground Flying-types like Corviknight, Skarmory, and the Landorus formes, letting it follow up with Headlong Rush. Taunt denies Roost attempts from Great Tusk's checks like Corviknight and Skarmory, Defog from the former, and setup sweepers like IronPress Zamazenta and Swords Dance Kingambit from setting up. Leftovers provides Great Tusk with much-needed longevity, Earth Plate allows Headlong Rush to 2HKO physically defensive Manaphy after mild chip damage, and Life Orb should exclusively be used with Magic Guard to gain a boost on all of Great Tusk's moves that has no drawbacks. Mold Breaker allows Great Tusk to bypass abilities that would hinder it from its checks like Fluffy Corviknight and Skarmory and Levitate or Earth Eater Gholdengo and Iron Hands. Scrappy allows Great Tusk to guarantee a Rapid Spin even in the face of would-be spinblockers while giving it an immunity to Intimidate, making Intimidate Corviknight and Skarmory much shakier checks to it. Magic Guard allows it to ignore passive chip damage and thus boosts its longevity, allowing it to switch in more consistently throughout a game without fear.</p> <p>Offensive Great Tusk fits best on offensive and bulky offense teams that appreciate its ability to stave off common anti-offense threats like Swords Dance Kingambit and Choice Scarf Roaring Moon while being able to consistently remove entry hazards. Great Tusk dreads special attackers and thus requires good specially defensive partners like RegenVest Roaring Moon, Manaphy, and Swampert. Great Tusk is unable to check many physical threats that can hit it super effectively like the Ogerpon formes and Chien-Pao, making secondary physical walls like Intimidate Pecharunt and the aforementioned Manaphy good teammates. Other physical wallbreakers that appreciate Great Tusk's ability to break through Pecharunt and Fluffy Corviknight and Skarmory, like Zamazenta, Roaring Moon, and Kingambit, pair well with it.</p>"
      },
      "Choice Band": {
        "description": "<p>Great Tusk's powerful STAB moves, massive attack stat, and Choice Band make it one of the strongest wallbreakers in the tier. Knock Off cripples Moltres and Zapdos by removing their Heavy-Duty Boots while helping to make progress against Corviknight and opposing Great Tusk by removing Rocky Helmet or Leftovers. It is also required on Sword of Ruin sets to hit Earth Eater Ghost-types such as Gholdengo and Pecharunt. Ice Spinner handles Flying-types like Zapdos and the Landorus formes that Great Tusk would otherwise struggle with, and Rapid Spin provides useful entry hazard control. Mold Breaker lets Great Tusk completely ignore Earth Eater on the aforementioned Gholdengo and Pecharunt, as well as bypassing Fluffy on Corviknight, Skarmory, and opposing Great Tusk. Sword of Ruin trades these matchups for more power, notably letting Great Tusk potentially 2HKO Corviknight through Intimidate.</p> <p>Choice Band Great Tusk works best on offense and balance teams, where other physical attackers can make up for its subpar Speed and take advantage of weakened physically defensive walls. Great Tusk can tailor its ability to the team's need, such as running Sword of Ruin when paired with Chien-Pao, thus being able to break past Corviknight regardless of whether it has Intimidate or Fluffy. Similarly, Choice Band Zamazenta can handle Intimidate Corviknight, while Mold Breaker Great Tusk helps threaten both Fluffy Corviknight and Pecharunt. Due to its low Speed and Special Defense, Great Tusk is vulnerable to special attackers such as Latios, Deoxys, and Scream Tail; special walls like Manaphy, Iron Treads, and Swampert can check these threats while also pivoting Great Tusk in.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 539679, "username": "GlalieGoesBoom"}, {"user_id": 580765, "username": "cat"}, {"user_id": 652656, "username": "Gambit"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 539679, "username": "GlalieGoesBoom"}, {"user_id": 580765, "username": "cat"}, {"user_id": 652656, "username": "Gambit"}, {"user_id": 603931, "username": "Time2Bonk"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Scream Tail": {
    "comments": "<h3>Other Options</h3> <p>Calm Mind lets Scream Tail become a threatening setup sweeper, letting it 2HKO RegenVest Swampert and Manaphy at +2 while also allowing it to potentially outlast switch-ins like Iron Moth and Moltres. Unaware + Calm Mind is a solid strategy on hyper offense teams to let Scream Tail set up and obliterate the foe with Stored Power and destroy Roaring Moon and Chien-Pao with Dazzling Gleam. Fire Blast or Flamethrower allow Scream Tail to break through Steel-types like Corviknight and Iron Treads that it usually struggles against. Choice Specs lets Scream Tail 3HKO RegenVest Manaphy and Swampert while 2HKOing them without their Assault Vest, but Scream Tail usually prefers not to use a Choice item due to its wide variety of utility moves.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Steel-types like Iron Treads, Heatran, and Gholdengo resist both Boomburst and Psychic Noise and can threaten Scream Tail with their STAB moves.</p> <p><strong>Specially Defensive Pokemon</strong>: RegenVest Swampert and Manaphy can switch into Scream Tail with ease and easily pivot out to an offensive threat.</p> <p><strong>Fast Offensive Threats</strong>: Without a Choice Scarf, Scream Tail gets outsped and OHKOed by Zamazenta, Choice Scarf Gholdengo, and Choice Band Roaring Moon.</p>",
    "sets": {
      "Pixilate": {
        "description": "<p>Thanks to its fantastic utility movepool, solid defensive stats and typing, and access to Boomburst + Pixilate, Scream Tail functions as a strong attacker, Stealth Rock setter, and decent defensive switch-in to threats like Iron Hands, Latios, and Deoxys-S. Boomburst + Pixilate enables Scream Tail to deal considerable damage, 2HKOing common threats like Zapdos, Kingambit, and RegenVest Iron Hands while bypassing Substitute from Zamazenta and OHKOing it. Psychic Noise hits Iron Moth and Pecharunt on top of preventing switch-ins like Corviknight and Gholdengo from healing; however, Stealth Rock is also an option. Wish grants Scream Tail longevity as well as letting it heal partners low on HP. Protect lets it guarantee healing from Wish, heal more from Leftovers, and scout the move that dangerous Choice item attackers like Gholdengo, Roaring Moon, and Zamazenta are using. Trick should be used exclusively on Choice Scarf sets to punish switch-ins like RegenVest Swampert and Manaphy as well as Iron Treads and Corviknight, benefiting other special wallbreakers like Gholdengo and Latios. Leftovers provides Scream Tail with extra longevity, Heavy-Duty Boots prevents chip damage from entry hazards, and Choice Scarf gives it valuable speed control, letting it outspeed non-Choice Scarf Roaring Moon, Zamazenta, and Deoxys-S.</p> <p>Scream Tail is best suited for bulky offense and balance teams that make use of its offensive and defensive utility as well as its ability to set Stealth Rock and threaten or sit on most entry hazard removers with ease. Teammates that lack longevity like non-Regenerator Great Tusk, the Landorus formes, and Iron Treads appreciate Scream Tail for its ability to provide them healing with Wish. Teammates like Gholdengo and Iron moth that struggle with removing RegenVest Iron Hands and Roaring Moon benefit from Scream Tail being able to easily beat them with Boomburst; in return, Gholdengo and Iron Moth can threaten opposing Gholdengo, Iron Treads, and Assault Vest Iron Crown. Knock Off users like Roaring Moon, Great Tusk, and Manaphy can help Scream Tail by removing Assault Vest from Swampert and opposing Manaphy, letting it 3HKO them. Scream Tail is threatened by entry hazards if it is not running Heavy-Duty Boots, so it requires an entry hazard remover like Corviknight, Great Tusk, or Iron Treads.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652656, "username": "Gambit"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 539679, "username": "GlalieGoesBoom"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Slither Wing": {"sets": {"Choice Band": {}}},
  "Sandy Shocks": {"sets": {"Offensive Pivot": {}}},
  "Iron Treads": {
    "comments": "<h3>Other Options</h3> <p>Earth Power can be used over Earthquake to deal more damage to Great Tusk and Pecharunt, but the higher power of Earthquake is generally more appreciated. An mixed attacking set of Magic Guard + Life Orb with Steel Beam and Earthquake can be used due to its potential to break through Great Tusk and Swampert relatively easily, but this is a very niche set that struggles to break through Corviknight and Manaphy. Immunity abilities can be used to cover for some of the weaknesses Iron Treads has: Earth Eater for Great Tusk, Ting-Lu, and the Landorus formes; Water Absorb for Manaphy and Primarina; and Well-Baked Body for Iron Moth and Heatran. Bulletproof sets can run Assault Vest if not running Stealth Rock for the extra bulk against strong special attackers like Zapdos, Deoxys-S, and Latios, but without Leftovers, Iron Treads lacks any form of recovery.</p> <h3>Checks and Counters</h3> <p><strong>Physical Attackers</strong>: Physical attackers like Roaring Moon, Zamazenta, and Chien-Pao easily destroy Iron Treads with their STAB moves.</p> <p><strong>Ground-types</strong>: Great Tusk, Ting-Lu, and the Landorus formes block Volt Switch and can demolish Iron Treads with Earthquake.</p> <p><strong>Strong Special Attackers</strong>: Strong special attackers like Choice Specs Latios, Gholdengo, and Deoxys-S can break through Iron Treads's non-RegenVest set with their STAB moves due to Iron Treads's low special bulk and lack of recovery.</p>",
    "sets": {
      "Specially Defensive": {
        "description": "<p>Iron Treads's amazing defensive typing, access to incredible utility moves, and decent defensive stats let it function as a specially defensive staple for many teams. Rapid Spin lets it support Stealth Rock-weak teammates like Chien-Pao and Ogerpon-H by removing entry hazards. Knock Off punishes switch-ins like Corviknight and Great Tusk by removing their Leftovers or Rocky Helmet, whereas Ice Spinner punishes would-be switch-ins like Garchomp and the Landorus formes. Volt Switch gives Iron Treads the ability to pivot and provide its teammates with momentum, while Stealth Rock offers valuable role compression. Bulletproof grants it immunity to Shadow Ball from Gholdengo, Weather Ball from Moltres and Zapdos, Pyro Ball from Cinderace, and Focus Blast from Deoxys-S, making Iron Treads a great switch-in to those Pokemon. 12 Speed EVs and a Jolly nature let Iron Treads outspeed Zamazenta at +1 and maximum Speed Modest Gholdengo at +0.</p> <p>Iron Treads is best suited for more offense-based teams due to its subpar special bulk and lack of reliable recovery, which it makes up for with much-needed role compression. Iron Treads excellently complements physically defensive RegenVest Manaphy, as Iron Treads can check Zapdos, Latios, and Gholdengo for Manaphy, while it checks Chien-Pao and Great Tusk for Iron Treads. Physical attackers like Zamazenta, Roaring Moon, and Great Tusk pose a problem for Iron Treads; therefore, physically defensive partners like Pecharunt and Skarmory are appreciated. Primordial Sea partners like Zapdos, Ogerpon-W, and Primarina are helpful to deal with Fire-types like Iron Moth, Heatran, and Ogerpon-H that can destroy Iron Treads with ease.</p>"
      },
      "RegenVest": {
        "description": "<p>Due to an amazing defensive typing, decent defensive stats, and an incredible utility movepool, Iron Treads functions as a niche RegenVest user capable of checking many special attackers like Gholdengo, Latios, and Scream Tail. Earthquake is generally preferred as Iron Treads's Ground-type STAB move due to it being the strongest option, but Earth Power deals more damage to Great Tusk and Pecharunt. Knock Off annoys defensive staples like Corviknight and Great Tusk by removing their Leftovers or Rocky Helmet while debilitating Manaphy and Swampert by getting rid of their Assault Vest; alternatively, Ice Spinner hits Zapdos, Garchomp, and the Landorus formes. Rapid Spin supports allies that dislike entry hazards like Chien-Pao and Ogerpon-H. Volt Switch provides Iron Treads with pivoting while chipping Corviknight and Skarmory lacking Volt Absorb.</p> <p>Iron Treads fits best on more defensively oriented team structures such as bulky offense and stall. Physical attackers like Zamazenta, Cinderace, and Garchomp all threaten Iron Treads with their STAB moves, so checks to these Pokemon such as Pecharunt and Skarmory are an important asset. Iron Treads struggles against strong special attackers like Iron Moth, Primarina, and Choice Specs Gholdengo; therefore, partners like Roaring Moon and Moltres can aid it. Since Iron Treads is heavily reliant on Assault Vest to bolster its subpar special bulk, it needs Knock Off absorbers like Skarmory and Scream Tail. Ground-types like Great Tusk, Ting-Lu, and the Landorus formes are especially annoying to Iron Treads, as they prevent it from pivoting out with Volt Switch, so switch-ins to these Ground-types like Skarmory, Moltres, and Zapdos are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 652656, "username": "Gambit"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 539679, "username": "GlalieGoesBoom"}, {"user_id": 475288, "username": "Pandemonium"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Iron Hands": {
    "sets": {
      "Bulky Swords Dance": {},
      "Earth Eater": {
        "outdated": true,
        "description": "<p>Swords Dance, huge bulk, and a good defensive typing allow Iron Hands to become an incredibly threatening wallbreaker. Earth Eater allows it to set up on would-be checks like Swampert, Great Tusk, and Sandy Shocks. Substitute allows it to take advantage of foes like Empoleon, Roaring Moon, and Chien-Pao, which are forced out by it, allowing it valuable turns to set up. 172 Special Defense EVs allow its Substitute and withstand a Scald from RegenVest Manaphy, while 196 Speed EVs let it outspeed Manaphy. It is next to impossible to OHKO a full health Iron Hands behind dual screens, so support from Prankster Corviknight and Deoxys-S on hyper offense teams can help by allowing it extra turns to set up and letting it beat would-be offensive checks like Latios and Primarina. Iron Hands struggles against Unaware Pokemon, in particular Deoxys-D and Scream Tail, so teammates that can threaten them like Gengar and Ceruledge make for good partners. Barraskewda and Chien-Pao are teammates that enjoy the presence of Iron Hands, as it is excellent at trading itself to remove would-be checks to them like physically defensive Primarina and Manaphy, Intimidate Corviknight, and Choice Scarf Roaring Moon. Strong special attackers like Deoxys-S, Azelf, and Latios can be troublesome for Iron Hands, forcing it out; as a result, bulky special walls like Swampert, Manaphy, and Blissey are appreciated by it.</p>"
      },
      "Surge Surfer": {
        "outdated": true,
        "description": "<p>Surge Surfer Iron Hands is a great wallbreaker, leveraging the Speed boost procured by its ability to outspeed almost the entire unboosted metagame and set up with Swords Dance in order to break though opposing teams. It also has a great matchup against a lot of defensive staples such as Corviknight and Gholdengo. Ice Punch allows Iron Hands to hit Garchomp and foes that resist its STAB combination such as Latios, Dragonite, and Landorus-T for greater damage. Since Iron Hands is reliant on Electric Terrain to function, it must be paired with a Hadron Engine pivot such as Latios or Sandy Shocks, both of which can apply additional pressure on Great Tusk; in return, Iron Hands can beat Pokemon that Sandy Shocks is unable to hit such as Landorus-T. Iron Hands is not a conventional wallbreaker, and it can struggle to power through teams on its own; therefore, teammates such as Roaring Moon and Iron Boulder are appreciated, as they can apply pressure on Pokemon such as Deoxys-D and physically defensive Great Tusk, respectively, which Iron Hands struggles against. Pivots such as Roaring Moon and Galarian Zapdos are also great partners, as they can bait in Pokemon that Iron Hands can easily take advantage of to set up, such as Primarina and Corviknight.</p>"
      },
      "RegenVest": {
        "outdated": true,
        "description": "<p>Iron Hands's great natural bulk and typing let it serve as a potent mixed wall and pivot, checking and scouting common threats like Gholdengo, Iron Moth, Chien-Pao, and Dragonite. Drain Punch provides a drawback-free STAB move with recovery, while Close Combat grants more immediate power, being able to 2HKO Swampert. Earthquake allows Iron Hands to threaten offensive wallbreakers like Gengar, Iron Moth, and Gholdengo, while Ice Punch can help to hit Ground-types like Great Tusk that can block Volt Switch and Flying-types like Zapdos and Dragonite. Iron Hands struggles with strong Psychic- and Fairy-type wallbreakers like Azelf and Primarina, so it appreciates partners like Empoleon and Mandibuzz that can help with these matchups. Iron Hands dislikes common defensive Ground-types like Great Tusk and Swampert that can block its attempt to pivot with Volt Switch, and it can struggle against particularly strong physical wallbreakers like Choice Band Galarian Zapdos, so it partners well with walls that can handle them like Corviknight and Deoxys-D. Frail offensive wallbreakers like Chien-Pao and Azelf appreciate Iron Hands's ability to safely pivot them onto the field and wall revenge killers like Choice Scarf Gholdengo and Roaring Moon.</p>"
      }
    }
  },
  "Iron Moth": {
    "comments": "<h3>Other Options</h3> <p>Iron Moth has a deep movepool it can dig into to suit the needs of its team. Overheat is an incredibly powerful nuke on Desolate Land and Hadron Engine sets at the cost of being more punishable by Fire-resistant foes like Roaring Moon. Toxic is an option over Toxic Spikes on Desolate Land sets to directly threaten enemies with debilitating status, but Toxic Spikes is usually preferred for its ability to status multiple foes. Energy Ball is an option over Solar Beam on Desolate Land sets to hit Primordial Sea Primarina and to not get locked in against Primordial Sea Zapdos, but Solar Beam is generally preferred for its power. Both Iron Moth sets can look into their movepool for options like Psychic for opposing Iron Moth and Pecharunt or, on Desolate Land sets, Dazzling Gleam to hit Roaring Moon on the switch in, but these moves are either too risky to use or don't provide enough value compared to the suggested moves. Iron Moth can consider dropping a coverage move for Toxic to threaten checks like Swampert and Blissey, but this is usually less useful than a third attacking move.</p> <h3>Checks and Counters</h3> <p><strong>Primordial Sea Users</strong>: Primordial Sea users like Ogerpon-W, Archaludon, and Zapdos all immensely threaten Iron Moth; Ogerpon-W forces it out with STAB attacks and the threat of a Swords Dance, Archaludon forces it out with Earthquake, and Zapdos forces it out with Weather Ball or its STAB moves. All-out attacking Iron Moth sets struggle less against Primordial Sea users.</p> <p><strong>Roaring Moon</strong>: Roaring Moon, especially its bulkier sets, is particularly apt at switching into, checking, and OHKOing Iron Moth, forcing it out.</p> <p><strong>RegenVest Users</strong>: RegenVest users like Swampert and Meloetta effortlessly sponge Iron Moth's hits while threatening it hard in return.</p> <p><strong>Faster Attackers</strong>: Revenge killers like Chien-Pao, Deoxys-S, and Zamazenta can outspeed and cleanly OHKO Iron Moth.</p>",
    "sets": {
      "Desolate Land": {
        "description": "<p>Iron Moth functions as a great offensive pivot, leveraging its solid typing bolstered by Desolate Land, high Special Attack, solid bulk and Speed, and deep coverage movepool to soft-check powerful threats like Zapdos, Gholdengo, and Moltres. Fiery Dance is preferred to potentially turn Iron Moth into a dangerous setup sweeper, but bulky variants can opt for Flamethrower for more consistent damage overall as well as more PP. Solar Beam is the preferred second move, immediately threatening checks like Manaphy and Swampert. Toxic Spikes allows Iron Moth to wear down bulky RegenVest foes like Roaring Moon and Manaphy over time, while Sludge Wave threatens Zapdos, Scream Tail, and Primarina. U-turn allows Iron Moth to pivot out of disadvantageous matchups like Well-Baked Body Steel-types, incoming Primordial Sea users, and Swampert if lacking Solar Beam. An offensive spread is usually preferred, especially if running coverage moves, but alternatively, a set with maximum HP and Speed can be used to be a more effective switch-in to foes like Zapdos and Primarina.</p> <p>Iron Moth finds itself best suited for balance or bulky offense teams that highly appreciate the combination of defensive utility and offensive firepower it brings. Offensive pivots like Meowscarada, Roaring Moon, and Slither Wing are especially great teammates, forming a potent VoltTurn core with Iron Moth. Roaring Moon threatens Psychic-types like Deoxys-S, Azelf, and Iron Crown while acting as a secondary check to Zapdos, which can otherwise come in on Iron Moth's Fire-type moves for free. Iron Moth, meanwhile, threatens the physical walls that Roaring Moon can struggle to make progress against. Iron Moth is incredibly vulnerable to Knock Off and, if its item gets removed, entry hazards, making Great Tusk and Corviknight amazing teammates. Even with specialized coverage, Iron Moth struggles to make progress against special walls like Swampert, Meloetta, and Chansey, and its Speed stat leaves much to be desired, meaning fast physical wallbreakers that can handle these special walls like Chien-Pao, Roaring Moon, and Zamazenta are near mandatory; these teammates also greatly appreciate Toxic Spikes wearing down checks like Great Tusk and physically defensive Manaphy.</p>"
      },
      "All-Out Attacker": {
        "description": "<p>All-out Attacker Iron Moth serves as an excellent wallbreaker, utilizing its high base Special Attack and good coverage to break down common defensive options in the tier. When using Sheer Force, Fire Blast threatens to OHKO Zamazenta, Pecharunt, and Volcarona. Flamethrower can be opted for instead, trading in the ability to threaten the aforementioned KOs for accuracy. Fiery Dance should exclusively be used on Hadron Engine variants, as it allows Iron Moth to potentially spiral out of control in a single turn. Energy Ball is necessary for would-be checks like RegenVest Swampert and Manaphy. Discharge smacks Well-Baked Body Skarmory and Gholdengo and, hits Manaphy harder than Energy Ball if using Hadron Engine, and dissuades Roaring Moon from switching in with its nasty chance of paralysis, while Dazzling Gleam invalidates Roaring Moon as an answer to Iron Moth. Lastly, U-turn allows Iron Moth to pivot out in the face of checks it cannot beat, like Blissey, RegenVest Hisuian Goodra, and Meloetta. Life Orb pairs perfectly with Sheer Force, granting Iron Moth extra power with no drawback on its Sheer Force-boosted moves. Heavy-Duty Boots can be considered on Hadron Engine sets, allowing Iron Moth to disregard entry hazards.</p> <p>Iron Moth truly shines on balance and more offensive teams looking for a wallbreaker that is near-impossible to switch into safely. Thus, other special wallbreakers and pivots like Azelf, Zapdos, and Hisuian Electrode appreciate Iron Moth's ability to overload their checks like RegenVest Manaphy, Swampert, and Roaring Moon. Defensive pivots like Corviknight, RegenVest Swampert, and Manaphy grant Iron Moth a backbone it can rely on to stomach hits in its place and pivot out; these Pokemon also can thwart revenge killing attempts from faster threats like Roaring Moon, Deoxys-S, and Chien-Pao. Iron Moth appreciates entry hazard removal from options like Great Tusk and Corviknight when not utilizing Heavy-Duty Boots. Iron Moth suffers from four-moveslot syndrome and as a result cannot threaten targets like RegenVest Roaring Moon without Dazzling Gleam and Well-Baked Body Skarmory and Gholdengo without Discharge; hence, teammates that can deal with these targets like Latios, Chien-Pao, and Choice Specs Primarina pair well with it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 540420, "username": "Smashing"}, {"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 523866, "username": "UT"}, {"user_id": 584685, "username": "Glory"}, {"user_id": 580765, "username": "cat"}, {"user_id": 652656, "username": "Gambit"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Gholdengo": {
    "comments": "<h3>Other Options</h3> <p>Focus Blast is an option over any damaging move for its ability to dispatch Kingambit and Heatran effectively, which would otherwise be able to stave Gholdengo's attacks off. A more offensive version of Gholdengo utilizing Nasty Plot with maximum Special Attack and Speed investment and a Timid nature serves as a potent setup sweeper and can be used on teams utilizing Sticky Web to have Gholdengo act as a hard-hitting spinblocker. Choice item sets can run an immunity ability like Well-Baked Body or Levitate to serve as a quick stopgap to Fire- and Ground-type. Psyshock is a niche option on Choice Specs sets that allows Gholdengo to 2HKO the special walls that would usually check it, like Blissey, RegenVest Swampert, and Iron Hands.</p> <h3>Checks and Counters</h3> <p><strong>Special Walls</strong>: Common special walls like RegenVest Roaring Moon, Swampert, and Bulletproof Iron Treads can easily switch into Gholdengo and force it out.</p> <p><strong>Dark-types</strong>: Dark-types like Roaring Moon and Kingambit irritate Gholdengo with their ability to switch into it and force it out.</p> <p><strong>Fire-types and Ground-types</strong>: Gholdengo cannot nullify its weakness to both Fire- and Ground-type moves when opting for an immunity ability, causing it to be weak to one type or the other.</p>",
    "sets": {
      "Choice Item": {
        "description": "<p>Choice item Gholdengo acts a strong wallbreaker and speed control option, boasting a spammable STAB move and nuke in Shadow Ball and Make It Rain, respectively. Recover should exclusively be used on Choice Scarf sets to allow Gholdengo to take advantage of its good natural typing and above-average bulk, allowing it to consistently switch into offensive threats like Scream Tail, Iron Boulder, and Assault Vest Iron Crown, outspeed them, and force them out while offsetting any damage it may have taken in the process. Dazzling Gleam threatens Dark-types like Roaring Moon while still being a solid middle-ground option against Chien-Pao and Kingambit, and it is Gholdengo's strongest attack against Iron Hands. Thunderbolt is a strong coverage option that lets Gholdengo hit RegenVest Manaphy while being the best move against Kingambit. Lastly, Trick is a good option on Choice Scarf sets that allows Gholdengo to cripple would-be checks like Iron Treads, RegenVest Manaphy, and Swampert, debilitating them while opening itself and other special attacking teammates up later in the game. Adaptability is preferred on sets that only use Gholdengo's STAB moves as damaging moves, as it allows Gholdengo to feint other abilities, but Hadron Engine is preferred on sets with Dazzling Gleam or Thunderbolt to increase their damage output. Choice Specs and a Modest nature turn Gholdengo into a ferocious wallbreaker, allowing it to OHKO RegenVest Manaphy and Roaring Moon with Hadron Engine-boosted Thunderbolt and Dazzling Gleam while almost always OHKOing or 2HKOing every Pokemon in the tier that lacks a Steel-resistance or excellent special bulk. Choice Scarf instead allows it to act as a great speed control option and revenge killer, allowing it to outspeed notable threats like Zamazenta, Chien-Pao, and non-Choice Scarf Roaring Moon.</p> <p>Gholdengo best fits on balance and bulky offense teams, where its capabilities of acting as either a potent wallbreaker or speed control option are much appreciated. Gholdengo struggles to break past special walls like Blissey, RegenVest Swampert, and Bulletproof Iron Treads, making physical wallbreakers that can put a dent in them like Zamazenta, Roaring Moon, and Chien-Pao good teammates; these physical wallbreakers may struggle with their inability to break past physical walls as well as their Fairy-type checks, all of which Gholdengo helps to cover, bolstering the effectiveness of using them together. Gholdengo struggles against wallbreakers that either outspeed it or survive a hit and threaten it back in return, notably Choice Scarf Roaring Moon, Kingambit, and Deoxys-S, making defensive partners like Corviknight, RegenVest Manaphy, and Roaring Moon good teammates.</p>"
      },
      "Physically Defensive": {
        "description": "<p>Physically defensive Gholdengo serves as an excellent spinblocker and physical wall, leveraging its great typing and useful movepool to either spread paralysis with Thunder Wave or set up with Nasty Plot and break holes in the opposing team. Dazzling Gleam dispatches Dark-types like Roaring Moon and Chien-Pao while dealing decent damage to Kingambit, while Hex is an option when used with Thunder Wave that also deals good damage to Bulletproof Iron Treads. Nasty Plot turns Gholdengo into a potent bulky wallbreaker, allowing it to potentially OHKO RegenVest Roaring Moon with Dazzling Gleam after a boost. Thunder Wave allows Gholdengo to power up Hex while slowing down threats for its offensive teammates like the Ogerpon formes, Iron Moth, and Kingambit, which appreciate their offensive checks like Roaring Moon and Zamazenta being slowed down and having the opportunity to be broken past. The given EV spread allows Gholdengo to outspeed Great Tusk without Speed investment. Levitate turns Ground-types like Great Tusk, Iron Treads, and the Landorus formes into setup fodder or an opportunity to spread paralysis on an incoming switch-in while also allowing Gholdengo to almost always deny Rapid Spin attempts from the aforementioned Great Tusk and Iron Treads. Fluffy turns Gholdengo into a hard-to-KO threat that can set up with ease or spread paralysis while watching most physical moves bounce off it. Well-Baked Body allows Gholdengo to check Fire-types like Moltres, Ogerpon-H, and Cinderace and turns them into setup or paralysis fodder. Colbur Berry allows Gholdengo to lure in Dark-types like Roaring Moon and Chien-Pao, OHKOing them with a boosted Dazzling Gleam or Make It Rain, while Leftovers provides Gholdengo with passive recovery that grants it with good longevity. Heavy-Duty Boots is an option on non-Levitate sets that allows them to offset entry hazard chip damage, allowing them to switch in more frequently while opening up Earth Eater as a potential ability option that punishes Ground-type moves even further.</p> <p>Gholdengo fits best on bulky offense teams, where its spinblocking capabilities and general utility is much appreciated. Furthermore, bulky offense teams that can stack numerous entry hazards are where Gholdengo can truly shine as a spinblocker that can last throughout the course of a game. Thus, hazard setters like Ting-Lu, Skarmory, and Great Tusk pair well with it. Gholdengo's limit of one ability leaves it prone to Ground-types, Fire-types, or even both depending on its ability, thus, Pokemon that can switch into Ground-types frequently like Corviknight, Zapdos, and the Landorus formes make for good teammates, while Pokemon that can switch into Fire-types like Primordial Sea Zapdos as well as physically defensive Manaphy pair well with it. Gholdengo's mediocre Special Defense leaves it prone to strong special attackers like Zapdos, Thundurus-T, and opposing Gholdengo, making special walls like RegenVest Roaring Moon, Swampert, and Manaphy good partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 652656, "username": "Gambit"}, {"user_id": 539679, "username": "GlalieGoesBoom"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Chien-Pao": {
    "comments": "<h3>Other Options</h3> <p>Adaptability can be used on non-Sacred Sword sets, obtaining a similar power boost while allowing Chien-Pao's teammates like Roaring Moon and Ceruledge to run the ability instead; it has the notable benefit of hiding Chien-Pao's ability from the opponent. Lash Out is an option on the Choice Band set to immediately dent Intimidate users like Corviknight and Skarmory on the switch but lacks power otherwise while missing out on valuable Defense drops. Psychic Fangs is another option for Choice Band variants to punish Zamazenta and Iron Hands on the switch, potentially 2HKO a would-be check in physically defensive Primarina after Stealth Rock, and remove dual screens set by foes like Regieleki and Corviknight, letting its team match up better against dual screens hyper offense teams. Ice Spinner may seem like an appealing option on Swords Dance sets for a little extra consistency, but the additional power, contact avoidance, and flinch chance of Icicle Crash makes it entirely preferable, leaving Ice Spinner unviable. Serene Grace sets are an option to fish for Icicle Crash flinches or Crunch Defense drops, but this set lacks power and is generally inferior to damage amplification abilities.</p> <h3>Checks and Counters</h3> <p><strong>Faster Threats</strong>: Foes like Zamazenta and Psychic Surge Deoxys-S can outspeed and OHKO Chien-Pao while not being particularly afraid of its priority moves.</p> <p><strong>Bulky Fighting-types</strong>: Bulky foes like Iron Hands, Cobalion, and Zamazenta can often easily switch in on Chien-Pao's Dark-type moves and use it to either pivot with Volt Switch or as setup fodder.</p> <p><strong>Primarina</strong>: Bulkier Primarina sets can switch in easily against Chien-Pao's STAB moves and either force it out with Moonblast or use it as Calm Mind fodder.</p> <p><strong>Entry Hazards</strong>: Entry hazard setters like Skarmory, Great Tusk, and Heatran can cause immense problems for non-Magic Guard sets due to their frailty being compounded by their hazard vulnerability.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<p>Chien-Pao's incredible Speed and excellent offensive STAB combination let it function as threatening setup sweeper and late-game cleaner. Magic Guard protects Chien-Pao from Life Orb recoil and nullifies passive damage from Stealth Rock, Rocky Helmet, and poison from Pecharunt. Heavy-Duty Boots is another option to circumvent Chien-Pao's Stealth Rock weakness, along with making it immune to Sticky Web and letting it run Sword of Ruin for a similar power boost to Life Orb. Throat Chop shuts down Boomburst Scream Tail and denies Parting Shot from Pecharunt. Sucker Punch threatens Deoxys-S, Choice Scarf Gholdengo, and Surge Surfer Manaphy, although Ice Shard is usually the preferred option to hit Zamazenta as well as Choice Scarf Roaring Moon and Meowscarada.</p> <p>Chien-Pao fits well on offense and hyper offense teams, where its checks can be worn down with the help of other offensive teammates, letting Chien-Pao sweep or clean up. Partners such as Kingambit, Roaring Moon, and the Ogerpon formes can help weaken physically defensive walls such as Corviknight, Iron Hands, and Primarina, as well as putting Zamazenta in KO range of a Swords Dance-boosted Ice Shard. Chien-Pao is threatened by Kingambit and the aforementioned Zamazenta and Iron Hands, so it needs physically defensive walls such as Great Tusk and Pecharunt. Faster Psychic Surge users like Deoxys-S and Choice Scarf Azelf can threaten Chien-Pao without fear of its priority moves; therefore, specially defensive walls such as Manaphy, Swampert, and Iron Treads are appreciated.</p>"
      },
      "Choice Band": {
        "description": "<p>Thanks to its high Attack boosted further by Sword of Ruin, strong STAB combination, and access to priority moves, Choice Band Chien-Pao is one of the metagame's deadliest wallbreakers and revenge killers. On top of a valuable Speed tier to threaten and chase out common tier staples like Roaring Moon, Cinderace, and Iron Boulder, it has the immediate power to 2HKO walls like physically defensive Manaphy as well as Fluffy Corviknight and Skarmory after Stealth Rock. Sacred Sword immediately threatens Steel-type foes such as Kingambit, Cobalion, Heatran, and Iron Treads. Either priority move allows Chien-Pao to revenge kill faster threats like Hisuian Electrode and Choice Scarf Latios; Sucker Punch is more punishable but targets non-Psychic Surge Deoxys-S, Choice Scarf Gholdengo, and Agility Iron Crown hard, while Ice Shard handles foes like Choice Scarf Roaring Moon, Meowscarada, and weakened Zamazenta.</p> <p>Though it can function on a wide range of team styles, Chien-Pao fits best on fast-paced offensive teams that can best take advantage of its wallbreaking prowess while mitigating its lack of defensive utility. Powerful special wallbreakers like Deoxys-S, Gholdengo, and Primarine stand out as star teammates for their ability to immediately threaten physical walls like physically defensive Manaphy, Skarmory, and Iron Hands that can give Chien-Pao trouble. Also notable are Latios, Iron Moth, and Iron Crown, which are powerful special pivots able to bring Chien-Pao in to threaten their switch-ins like Swampert, Ting-Lu, and Roaring Moon. Chien-Pao also works well in tandem with other powerful wallbreakers like Roaring Moon, Zamazenta, and Iron Boulder, with Chien-Pao wearing down their checks like non-Intimidate Corviknight, Landorus, and Pecharunt, while its teammates pressure Manaphy, Iron Hands, and defensive Primarina. Bulky pivots like Pecharunt, Swampert, and Corviknight can also make good teammates, tanking hits and allowing the frail Chien-Pao to more easily get on the field against foes like Roaring Moon, Zapdos, and Scream Tail; Pecharunt is especially notable for its ability to wall Zamazenta, which is otherwise a great check to Chien-Pao, while Corviknight alongside Great Tusk and Iron Treads are noteworthy for their entry hazard removing capabilities, making it far easier for Chien-Pao to repeatedly hit the field.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 493260, "username": "Marnie"}, {"user_id": 539679, "username": "GlalieGoesBoom"}, {"user_id": 540420, "username": "Smashing"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 652656, "username": "Gambit"}, {"user_id": 580765, "username": "cat"}, {"user_id": 611238, "username": "LordBox"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Ting-Lu": {"sets": {"Physical Wall": {}}},
  "Roaring Moon": {
    "comments": "<h3>Other Options</h3> <p>Dragon Dance sets can be run on dual screens hyper offense structures; Fluffy is a good option to aid in setup, and Weakness Policy takes advantage of slow pivots like Corviknight aiming to pivot with U-turn. Acrobatics is an additional option with Weakness Policy or a Terrain Seed to nail Great Tusk and Zamazenta. Lash Out is an option to punish Intimidate users like Corviknight and Skarmory, while Fire Blast and Fire Fang can heavily threaten Fluffy users, but usually, Knock Off and U-turn threaten them enough with entry hazard support. Offensive sets can run Roost to provide longevity and offset chip damage, Taunt to shut down Corviknight, or Iron Head to nail Scream Tail.</p> <h3>Checks and Counters</h3> <p><strong>Faster Threats</strong>: Zamazenta, Deoxys-S, and Meowscarada outspeed non-Choice Scarf Roaring Moon variants and force it out.</p> <p><strong>Bulky Dark-resistant Foes</strong>: Great Tusk, Iron Hands, and Kingambit all can take Roaring Moon's STAB attacks and threaten it back with their STAB moves.</p> <p><strong>Entry Hazards</strong>: Non-Magic Guard Roaring Moon variants struggle heavily with chip damage, as they frequently switch and typically lack recovery.</p> <p><strong>Burns</strong>: Roaring Moon is crippled by burn and must be exceedingly cautions of switching into Fire-types that may carry Will-O-Wisp such as Heatran and Cinderace, as well as fearing Scald from Manaphy and Steam Eruption from Volcanion. It also fears the rare but punishing Flame Body.</p> <p><strong>Paralysis</strong>: Roaring Moon relies heavily on its Speed tier and can be punished by Thunder Wave from Gholdengo and Hisuian Electrode, which it would otherwise switch in freely on. Zapdos can also threaten it with paralysis from Thunder or Zap Cannon. Roaring Moon is also greatly punished by the rare Static.</p>",
    "sets": {
      "Choice Item": {
        "description": "<p>Roaring Moon's excellent Attack, Speed, and STAB coverage along with U-turn make it the premiere Choice item attacker. With Choice Scarf, Roaring Moon outspeeds every unboosted Pokemon, even Regieleki, and dangerous threats such Choice Scarf Latios and Gholdengo; only Choice Scarf Meowscarada outspeeds it. Choice Band Roaring Moon, on the other hand, is a ferocious wallbreaker that still outspeeds the crowded base 110 Speed tier, forcing out common Pokemon like the Ogerpon formes, Sandy Shocks, and Zapdos. Knock Off threatens to KO most offensive Pokemon while punishing switch-ins like Corviknight and Great Tusk with item removal. Outrage is an excellent late-game sweeping tool once Steel- and Fairy-types like Kingambit and Scream Tail have been weakened or removed. U-turn allows Roaring Moon to pivot out of bad matchups like Corviknight, safely revenge kill weakened offensive threats without prediction, and force switches from the opponent, hopefully through entry hazards after removing their Heavy-Duty Boots. Earthquake hits Iron Hands and Kingambit, while Stone Edge hits Moltres and Zapdos and lets Choice Band sets do non-negligible damage to Fluffy Corviknight. Sword of Ruin provides the most damage and impacts all of Roaring Moon's moves, while Tough Claws retains its power against opposing Sword of Ruin users, namely Zamazenta, and does not reveal itself on the switch in.</p> <p>Roaring Moon fits best on balance and offensive teams that can take advantage of its power, Speed, and pivoting abilities and may also appreciate its defensive profile to help slow down certain key threats like Deoxys-S, Hisuian Electrode, and Gholdengo. Due to its frequent pivoting and lack of recovery, Roaring Moon abhors entry hazards, making Corviknight, Iron Treads, or Great Tusk nearly required as a teammate. Special walls like Manaphy can switch into special attacks aimed at Roaring Moon and appreciate its resistances to Electric, Ghost, and Psychic taking some of the pressure off of them as well. On the flip side, Roaring Moon forces frequent switches and removes Heavy-Duty Boots with Knock Off, making hazard-stacking teammates like Sandy Shocks, Great Tusk, and Skarmory excellent options. Fluffy walls, especially Corviknight, can give Roaring Moon a hard time, so strong Fire-type teammates like Cinderace, Iron Moth, and Ceruledge are excellent options. Roaring Moon does not appreciate bulky Fighting-types like Great Tusk, Iron Hands, and Zamazenta, so it appreciates teammates that threaten them like Scream Tail and Deoxys-S. Roaring Moon pairs extremely well with other offensive pivots; it can team with special pivots like Iron Moth and Latios to bring each other in in favorable matchups or with physical pivots like Meowscarada and Cinderace to wear down their shared checks.</p>"
      },
      "RegenVest": {
        "description": "<p>Roaring Moon leverages a solid defensive typing with plenty of resistances alongside great Speed, Attack, bulk, and access to U-turn to be a great offensive RegenVest pivot, gluing together balance and bulky offense teams while bringing extra utility in the form of Knock Off. Earthquake is a solid coverage option that threatens Steel-type foes like Heatran, Iron Treads, and Hisuian Goodra as well as Iron Hands. Stone Edge is preferred as the final move for its ability to hit Zapdos and Moltres super effectively and Corviknight neutrally, but Dragon Tail gives Roaring Moon extra utility against setup sweepers like Gholdengo, Iron Crown, and Ursaluna-B, forcing them out. Throat Chop is an option as a secondary STAB move that notably disables Boomburst from Pixilate Scream Tail and Parting Shot from Pecharunt. 192 Speed EVs guarantee that Roaring Moon will outspeed Thundurus and non-Choice Scarf Scream Tail, with the rest put into Special Defense to increase Roaring Moon's bulk. Alternatively, a set with maximum Speed investment can be used to Speed tie with Cinderace and opposing Roaring Moon.</p> <p>Roaring Moon fits best on pivot-heavy balance and offense teams that can take advantage of its typing and Speed to form potent VoltTurn cores while making its only decent bulk less of an issue. Roaring Moon struggles to check powerful Dragon- and Fairy-types like Latios, Primarina, and, if not running Throat Chop, Scream Tail, making a secondary specially defensive Pokemon like Iron Treads, Empoleon, or Heatran a great partner; in return, Roaring Moon naturally walls foes like Iron Moth, Gholdengo, and Sandy Shocks that can give these Steel-types issues. Roaring Moon is also easily forced out by powerful physical attackers like Chien-Pao, Great Tusk, and opposing offensive variants of Roaring Moon, making a physical wall like Pecharunt, Corviknight, or your own Great Tusk perfect partners. The last two are also notable for being the tier's best entry hazard removal options, helping to shore up Roaring Moon's relative weakness to entry hazards. Powerful offensive threats like Great Tusk, Latios, and Gholdengo all appreciate Roaring Moon's ability to aggressively scout the opponent's move and pivot them in safely, with the last two especially appreciating Roaring Moon's ability to remove Assault Vest from opposing Manaphy ​and Swampert.</p>"
      },
      "Magic Guard": {
        "description": "<p>Magic Guard Roaring Moon is a fantastic pivot and item remover that has great offensive and defensive prowess alongside stellar longevity. Magic Guard allows Roaring Moon to augment its defensive profile by avoiding all indirect chip damage, such as from Rocky Helmet and entry hazards, which would otherwise hamper it. Magic Guard also has the added benefit of countering Prankster Pecharunt, with Roaring Moon's Dark typing blocking Parting Shot and Magic Guard preventing Toxic chip damage from Malignant Chain. Knock Off removes items like Heavy-Duty Boots, Rocky Helmet, and Leftovers from targets like Corviknight, Zapdos, Great Tusk, and Pecharunt to either make them more susceptible to entry hazards or enable teammates like Zamazenta and Meowscarada. Earthquake pressures Pokemon like Iron Hands, Heatran, and Iron Treads, while Taunt is much more effective on hazard stacking teams to prevent Defog and Roost from the likes of Corviknight, Mandibuzz, and Zapdos. U-turn helps scout moves while further chipping answers to Roaring Moon like Corviknight, Chesnaught, and Great Tusk, while Roost gives it longevity that is especially appreciated in matchups where special attackers like Hisuian Electrode, Sandy Shocks, and Iron Moth are present.</p> <p>Magic Guard Roaring Moon fits on playstyles ranging from bulky offense to stall thanks to it wearing down checks with Knock Off and U-turn while taking advantage of its entry hazard immunity alongside Roost recovery to outlast would-be answers; as a result, Roaring Moon has a wide array of synergetic partners. Entry hazard setters like Skarmory, Sandy Shocks, and Great Tusk pair incredibly with Roaring Moon, since these hazards allow it to pressure would-be answers like Great Tusk, Corviknight, and Iron Hands in conjunction with U-turn. Since Roaring Moon excels at making progress with U-turn, wallbreakers like Zamazenta and Deoxys-S as well as pivots like Sandy Shocks and Cinderace can capitalize on the opportunities provided. Steel-types like Corviknight and Gholdengo appreciate Roaring Moon's ability to absorb Fire-, Electric-, and Ghost-type moves from Pokemon such as Heatran, Sandy Shocks, and opposing Gholdengo for them, and in return they can help patch up Roaring Moon's weakness to Fighting- and Fairy-type attacks. Likewise, Water-type RegenVest users such as Manaphy and Primarina make great partners, as Roaring Moon can switch into Grass- and Electric-type attacks from the likes of Hisuian Electrode and Sandy Shocks, while they can answer or switch into threats like Chien-Pao, opposing Primarina, and Cinderace. Roaring Moon fears Great Tusk, which can easily absorb its hits and is a common hazard clearer, so teammates that can switch into or punish Great Tusk like Corviknight, Zapdos, and Meowscarada are necessary. Roaring Moon also dislikes Knock Off despite resisting the move, since its Life Orb carries a lot of its damage output, so Knock Off absorbers like Corviknight, Ting-Lu, and Great Tusk are appreciated. Lastly, faster threats like Chien-Pao, Zamazenta, and Deoxys-Speed can threaten an OHKO on Roaring Moon, so Pokemon that counter or outspeed these foes like Regenerator Primarina, Bulletproof Iron Treads, and Choice Scarf Scream Tail are essential.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523866, "username": "UT"}, {"user_id": 540420, "username": "Smashing"}, {"user_id": 545372, "username": "Clas"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 652656, "username": "Gambit"}, {"user_id": 539679, "username": "GlalieGoesBoom"}, {"user_id": 540420, "username": "Smashing"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 528364, "username": "adorluigi"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Sinistcha": {"sets": {"Calm Mind Sweeper": {}}},
  "Ogerpon-Wellspring": {
    "sets": {
      "Offensive": {},
      "Swords Dance": {
        "outdated": true,
        "description": "<p>Fantastic STAB coverage, a solid Speed tier, and good coverage options all make Ogerpon-W a force to be reckoned with, being able to shatter most of the tier's physical walls such as Corviknight, Gholdengo, and Mandibuzz after a Swords Dance. Power Whip packs more of a punch, letting it OHKO RegenVest Manaphy without a Swords Dance boost, while Horn Leech grants it more longevity. Knock Off lets it threaten Desolate Land users such as Iron Moth, Ceruledge, and Heatran, while Play Rough picks off Dragon-types such as Roaring Moon, Dragonite, and Latios. Trailblaze enables Ogerpon-W to act as more of a sweeper, letting it outspeed threats such as Iron Boulder, Chien-Pao, and Deoxys-S, while Spikes can be used to help chip down Hisuian Goodra and other walls for its teammates. Ogerpon-W pairs well with fast cleaners such as Iron Boulder and Choice Scarf Roaring Moon, as they appreciate its ability to pressure Fluffy users such as Corviknight and Great Tusk thanks to Ivy Cudgel not making contact. In spite of its solid speed, Ogerpon-W is still threatened by faster targets such as Chien-Pao, Choice Scarf Azelf, and Roaring Moon, making defensive pivots such as Corviknight and Swampert crucial in order to bring it in safely.</p>"
      },
      "All-Out Attacker": {
        "outdated": true,
        "description": "<p>Ogerpon-W is a threatening wallbreaker thanks to its good stats and incredible movepool, featuring high Base Power STAB moves and strong coverage options. Power Whip is the standard Grass-type STAB move of choice due to its power, but Horn Leech can be used to avoid missing and provide Ogerpon-W with healing. Knock Off can hinder switch-ins like Intimidate Corviknight and Dragonite. Play Rough stops Dragonite from being a safe switch-in, as well as surprising Roaring Moon that try to switch in with an OHKO. U-turn allows Ogerpon-W to pivot out on bad matchups like the aforementioned Intimidate Corviknight and Dragonite. Stomping Tantrum hits Water-immune foes such as Water Absorb Heatran and Desolate Land Iron Moth and Ceruledge. Primordial Sea boosts Ogerpon-W's Ivy Cudgel to absurd levels, consistently 2HKOing non-Intimidate Corviknight while also giving Ogerpon-W a Fire immunity. Sword of Ruin is an alternative option to boost the power of all of Ogerpon-W's moves, notably OHKOing physically defensive Manaphy with Power Whip. Ogerpon-W pairs well with teammates like Zamazenta and Iron Boulder that can break through non-Fluffy Corviknight. It also appreciates Stealth Rock setters like Great Tusk and Scream Tail, as they discourage Pokemon like Dragonite from switching in and help chip down defensive Pokemon. While Ogerpon-W's Speed tier is good, it can still get easily revenge killed by Pokemon like Roaring Moon, Deoxys-S, and Zamazenta, so a strong defensive core featuring teammates such as Manaphy and Corviknight is appreciated. Ogerpon-W struggles with switching in safely, so it appreciates slow pivots like the aforementioned Corviknight and Manaphy.</p>"
      }
    }
  },
  "Ogerpon-Hearthflame": {"sets": {"Swords Dance": {}, "All-Out Attacking": {"outdated": true}}},
  "Ogerpon-Cornerstone": {"sets": {"Swords Dance": {}}},
  "Archaludon": {
    "outdated": true,
    "sets": {
      "Physically Defensive": {
        "description": "<p>With Regenerator, a solid defensive typing, and high physical bulk, Archaludon acts as a good physical wall that can wear down the opposing team. Dragon Tail phazes setup sweepers like Iron Hands, Dragonite, and all Ogerpon formes, and Heavy Slam hits Fairy-types such as Scream Tail and Florges. Alternatively, Iron Defense benefits Body Press's damage output and renders Archaludon's matchup against physical setup sweepers better. As Archaludon forces switches with Dragon Tail, Stealth Rock further increases the chip damage it deals to the opposing team. Rocky Helmet lets Archaludon wear down pivots such as Barraskewda, Cinderace, and Roaring Moon. Archaludon covers a variety of physical attackers such as all Ogerpon formes, Roaring Moon, and Barraskewda, but it is overwhelmed by offensive wallbreakers like Great Tusk, Zamazenta, and Galarian Zapdos, so allies such as Fluffy Corviknight and Skarmory are much appreciated. Archaludon also appreciates Pokemon like Hisuian Electrode and the Ogerpon formes beating Swampert, which it can't make much progress against. Archaludon has poor Special Defense, which makes it vulnerable to special wallbreakers such as Heatran, Iron Moth, and Gengar, so it appreciates specially defensive allies like Blissey and Empoleon.</p>"
      },
      "Offensive Entry Hazard Setter": {
        "description": "<p>Archaludon acts as a niche Stealth Rock setter that scares away common entry hazard removal options like Corviknight, Mandibuzz, and Great Tusk with the combination of Electro Shot and Draco Meteor. Furthermore, Electro Shot + Primordial Sea allows Archaludon to threaten to snowball at a moment's notice. Earthquake smacks Desolate Land Iron Moth and Heatran attempting to come in on Electro Shot, while Body Press chunks checks like Blissey and Volt Absorb Empoleon. Primordial Sea allows Archaludon to offensively counter Iron Moth and grants it a one-turn Electro Shot. Additionally, Archaludon's good typing and natural physical bulk allow it to take on Zapdos and all Ogerpon formes in a pinch, but it should never be relied on to check them. Archaludon greatly struggles with its lack of Speed; as a result, fast offensive pivots that can bring it in safely like Roaring Moon, Azelf, and Walking Wake pair well with it, especially considering its ability to force hazard damage on their switch-ins, like Corviknight, Empoleon, and Manaphy. Archaludon's low Special Defense and Speed cause it to be susceptible to special attackers like Walking Wake, Azelf, and Pixilate Scream Tail, making pivots that can safely switch in to them like Empoleon, RegenVest Manaphy, and Swampert good partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 434487, "username": "Bobsican"}, {"user_id": 580765, "username": "cat"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 603931, "username": "Time2Bonk"}, {"user_id": 552227, "username": "Kinetic"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Iron Boulder": {"sets": {"Choice Band": {}, "Swords Dance": {}}},
  "Iron Crown": {"sets": {"Double Dance": {}, "Choice Item": {}}},
  "Pecharunt": {
    "comments": "<h3>Other Options</h3> <p>Pecharunt can run almost any other immunity ability, such as Water Absorb or Well-Baked Body, to patch up a team-wide weakness, as it does not need the extra bulk from Fluffy or Intimidate to check threats that cannot hit it super effectively. Black Sludge is preferred for passive recovery but other items like Heavy-Duty Boots and Colbur Berry can be used to reduce damage from entry hazards and Knock Off from attackers like Roaring Moon, respectively. Nasty Plot is an option to provide a bulky wincon on slower teams, but Pecharunt is extremely easy to force out by most special attackers. Foul Play is an option to punish physical setup attackers and absolutely nuke Iron Boulder, but Toxic, Parting Shot, and Destiny Bond already deter most setup users and have more utility.</p> <h3>Checks and Counters</h3> <p><strong>Dark-type Physical Attackers</strong>: Roaring Moon, Chien-Pao, and Meowscarada can all hit Pecharunt with powerful attacks, and Prankster variants are also unable to pivot against them.</p> <p><strong>Special Attackers</strong>: Most special attackers can take advantage of Pecharunt's lower Special Defense and force it out.</p> <p><strong>Bulky Steel-types</strong>: Bulky Steel-types like Heatran and especially Kingambit do not fear any common move from Pecharunt and can safely come in to set hazards or attack.</p>",
    "sets": {
      "Prankster": {
        "description": "<p>Prankster Pecharunt leverages its excellent bulk, typing, and utility movepool to serve as an aggressive pivot on balance and offensive teams. Pecharunt is able to come in against a myriad of physical threats like Iron Hands, Zamazenta, and the Ogerpon formes to absorb their attacks and then pivot in a teammate safely with Parting Shot. It can even come in aggressively against foes like Great Tusk and Iron Boulder that pack super effective STAB moves; even if they used the correct move and deal significant damage, it can safely pivot out thanks to Prankster and Recover next time it comes in. Destiny Bond provides insurance against setup sweepers, especially Speed-boosting ones like Roaring Moon, and allows Pecharunt to trade itself at low health or in a poor matchup. Malignant Chain is the best attack due to its power and poison chance, which deters Dark-types like Meowscarada and non-Magic Guard Roaring Moon from switching in, but Shadow Ball and Night Shade are options to hit Steel-types and have significantly more PP for longer games. Since it should be pivoting frequently, Heavy-Duty Boots is the best item to dodge entry hazard chip damage. 0 Speed IVs allow Pecharunt to alternate between fast Destiny Bonds and slow attacks to almost always keep the effect active.</p> <p>Prankster Pecharunt works best on balance and offensive teams that want to safely switch in their offensive threats but still have some semblance of a defensive backbone. Frail but powerful teammates like Deoxys-S, Chien-Pao, and Iron Boulder love the relatively free switch ins Pecharunt provides after Parting Shot. Pecharunt pairs very well with RegenVest users like Manaphy and Swampert, as they both provide pivoting and blanket check special attackers; Parting Shot also gives them more opportunities to switch into weak attacks to heal with Regenerator. Pecharunt's bulk, Parting Shot, and Destiny Bond all force frequent switches, making entry hazard setters like Great Tusk and Skarmory good teammates. Pecharunt struggles with Dark-types like Roaring Moon, Meowscarada, and Chien-Pao, as they block Parting Shot and can hit it hard, so a strong physically defensive switch-in like Intimidate Corviknight is recommended; powerful Fighting-types like Zamazenta and Great Tusk can also deter them. It is also worth noting that Prankster Pecharunt has extremely poor synergy with Psychic Surge users like Azelf and Deoxys-S, as they will block Parting Shot, so it should not be run with them.</p>"
      },
      "Physical Wall": {
        "description": "<p>Pecharunt is the tier's premier physical wall, boasting utility in Parting Shot and a massive Defense stat boosted further by Intimidate. Night Shade does solid damage to Steel-types such as Corviknight and Iron Treads, as well as breaking substitutes from IronPress Zamazenta. Hex is an option over Shadow Ball to hit Bulletproof Iron Treads while also hitting Gholdengo harder than Night Shade. Recover gives Pecharunt much-needed longevity, and Parting Shot opens up opportunities for offensive teammates. 252 Speed EVs with a Timid nature let Pecharunt outspeed and pivot on Goldengo and Great Tusk but at the cost of less bulk. Heavy-Duty Boots gives Pecharunt more freedom to repeatedly switch in and pivot out over the course of a game.</p> <p>The need for a physical wall is universal, so Pecharunt fits well on almost every teamstyle that isn’t hyper offense. Wallbreakers like Chien-Pao, Latios, and Deoxys-S appreciate Pecharunt's ability to pivot them in, and special walls like Swampert, Iron Treads, and Manaphy need Pecharunt to answer physical threats like the Ogerpon Forms, Zamazenta, and Iron Hands. In exchange, the aforementioned special walls check special attackers such as Latios, Deoxys-S, and Gholdengo. Pecharunt can get overwhelmed by strong Dark-type physical attackers like Chien-Pao, Kingambit, and Roaring Moon, so it needs backup from other physical walls like Corviknight and Great Tusk.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 523866, "username": "UT"}, {"user_id": 539679, "username": "GlalieGoesBoom"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 475288, "username": "Pandemonium"}, {"user_id": 652656, "username": "Gambit"}, {"user_id": 580765, "username": "cat"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  }
}