{
  "Clefable": {
    "sets": {
      "Unaware Wall": {
        "description": "<p>Clefable carves a niche in Ubers UU as a bulky wall and Wish passer capable of stopping Pokemon like Nasty Plot Mewtwo and Zacian thanks to Unaware and a wincon thanks to Calm Mind. Calm Mind allows Clefable to become extremely bulky on the special side, letting it take on Pokemon it otherwise couldn't like Palkia-O, and also reduces its passivity thanks to the Special Attack boost. The combination of Wish and Protect gives Clefable reliable recovery, allows it to PP stall, and can allow it to help Pokemon that lack reliable recovery like Palafin and Magearna out. Tera Dark allows Clefable to win against Pokemon it otherwise couldn't like Gholdengo and Mewtwo while also providing a useful immunity to Psychic-type attacks from Deoxys and Stored Power Magearna. Clefable best fits on semi-stall as well as full stall and balance teams looking for a solid wall and Wish passer. Pokemon like Kyurem-W, Mewtwo, and Palafin that don't have reliable recovery appreciate Clefable providing Wish support to them, allowing them to excel better as offensive threats. Clefable struggles against Pokemon like Arceus-Poison, Gholdengo, and Dialga that can muscle through it with their super effective STAB moves, so Pokemon that can take these threats on like Landorus and Ogerpon-H can be helpful to have.</p>"
      },
      "Magic Guard": {}
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 626445, "username": "Imperial"}, {"user_id": 642468, "username": "Finchely"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Ninetales-Alola": {
    "sets": {
      "Aurora Veil": {
        "description": "<p>Alolan Ninetales is a decent lead in Ubers UU thanks to having Aurora Veil, a good Speed stat and typing, and useful utility options. Although Freeze-Dry is normally the preferred STAB move because it hits Water-types like Palafin and Walking Wake, Blizzard can be used instead for its greater power. Encore allows Alolan Ninetales to take advantage of opposing leads and setup sweepers attempting to set up entry hazards or use it as setup fodder like Nasty Plot Mewtwo and Dragon Dance Arceus formes. Hypnosis is an option instead, allowing Alolan Ninetales to decommission these foes by putting them to sleep. Although Alolan Ninetales doesn't Terastallize often, Tera Water can be used to flip the matchup against Chi-Yu, Gholdengo, and Ogerpon-H, allowing it to set up Aurora Veil in front of them. Alolan Ninetales fits best on hyper offense teams looking for a dedicated lead to set up Aurora Veil to make their attackers more potent. Setup sweepers like Kingambit, Chien-Pao, and Baxcalibur all appreciate the Aurora Veil Alolan Ninetales sets up, with the latter two also benefitting from the Defense boost from snow. Pokemon like Landorus and Zamazenta-C that can deal with the Fire-, Steel-, and Poison-types Alolan Ninetales can struggle to set up Aurora Veil against are good partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 610920, "username": "vesp"}, {"user_id": 642468, "username": "Finchely"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Moltres": {"sets": {"Physically Defensive": {}}},
  "Dragonite": {"sets": {"Dragon Dance": {"description": "<p>156 Speed outspeeds base 110 Pokemon at +1</p>"}}},
  "Mewtwo": {"sets": {"2A Nasty Plot": {}, "3A Nasty Plot": {}, "Support": {}}},
  "Quagsire": {
    "sets": {
      "Unaware Wall": {
        "description": "<p>Quagsire is an excellent wall and entry hazard setter in Ubers UU, as it has Unaware, a solid defensive typing, and a vast utility movepool, allowing it to check setup sweepers like Roaring Moon and Zacian. Spikes, Stealth Rock, and Toxic Spikes allow Quagsire to support its team with hazards, reducing the team's passivity and forcing chip damage on key threats like Palkia-O and Ogerpon-H. Toxic allows Quagsire to put opposing threats such as Zacian and Great Tusk on a timer. Unaware allows Quagsire to stifle setup sweepers like Swords Dance Zacian and Dragon Dance Arceus-Poison while also allowing it to handle Nasty Plot Mewtwo fairly well. Tera Poison allows Quagsire to handle Fairy- and Grass-type attacks from Pokemon like Zacian and Arceus-Grass, respectively, while also keeping it safe from Poison. Quagsire appreciates help from special walls like Blissey and specially defensive Magearna, as they can patch up its weaker Special Defense, and they fit well alongside it on stall and balance teams, handling threats like Arceus-Dark, Palkia-O, and Dialga. Dragon- and Steel-types like Arceus-Dragon and Skarmory also pair well with Quagsire, as they can relieve it of entry hazard setting duty while also switching in on Grass-types like Rillaboom and Ogerpon formes. Quagsire enables offensive threats like Zacian, Arceus-Poison, and Deoxys with its hazard setting, putting their checks, such as Arceus-Poison and Giratina, into KO range of their attacks.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626445, "username": "Imperial"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 610920, "username": "vesp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Slowking-Galar": {
    "sets": {
      "Specially Defensive Pivot": {
        "description": "<p>Galarian Slowking is a fantastic specially defensive pivot in Ubers UU with Future Sight, a great defensive typing for the tier, Chilly Reception, and an excellent utility movepool. Future Sight makes stallbreaking much easier, amplifying wallbreakers like Chi-Yu due to the extra damage it provides. Flamethrower hits Magearna and Solgaleo, which are immune to Sludge Bomb and resist Future Sight. Toxic allows Galarian Slowking to cripple offensive Pokemon trying to switch in, like Palkia-O and Arceus formes, whereas Toxic Spikes allows it to shut down teams lacking a Poison-type while also crippling entry hazard-weak Pokemon like Arceus-Dark and Kyurem-W. Tera Water allows Galarian Slowking to resist Palafin's Water-type moves and handle Palkia-O better while shedding its Ground-type weakness, making it better at taking on Landorus. Alternatively, Tera Grass makes Galarian Slowking resistant to Ground and Water, meaning it still handles Palafin and Palkia-O well, at the cost of being weak to Kyurem-W and Chi-Yu. Lastly, Tera Fairy allows Galarian Slowking to shed its Dark-type weakness, flipping the matchup against Chi-Yu and Arceus-Dark. Galarian Slowking forms good cores with physical walls, which can mitigate its mediocre physical bulk, and as a result, it pairs well with Great Tusk and Giratina. Galarian Slowking can also support less bulky wallbreakers that can struggle to get on the field safely, like Deoxys and Chi-Yu.</p>"
      },
      "Physically Defensive Pivot": {
        "description": "<p>Galarian Slowking is one of the best physically defensive pivots in Ubers UU, checking threats like Zacian and Sneasler with its wide support movepool and having the coveted combination of Future Sight and a pivoting move in Chilly Reception. Sludge Bomb allows Galarian Slowking to hit Fairy-types like Zacian and Clefable for good damage while also fishing for poison on Pokemon like Arceus formes. Future Sight assists greatly in breaking stall and makes wallbreakers like Kyurem-W more threatening. Flamethrower hits Steel-types like Magearna and Solgaleo that Sludge Bomb cannot. Slack Off allows Galarian Slowking to recover HP without switching out, letting it poison stall Pokemon like Zacian and Palkia-O and offset entry hazard damage if its Heavy-Duty Boots gets removed by Knock Off. Toxic allows Galarian Slowking to put switch-ins like Arceus formes and Mewtwo on a timer, whereas Toxic Spikes can support its team by spreading status, forcing foes to take passive damage, and poisoning Substitute users like Palkia-O. Tera Water allows Galarian Slowking to resist Palafin's Water-type attacks and handle Palkia-O better; it also removes its Ground-type weakness, making it better at handling Landorus-T. Alternatively, Tera Grass makes Galarian Slowking resistant to Ground- and Water-type attacks, meaning it still handles Palafin and Palkia-O well and is better into Landorus-T, at the cost of being weak to Arceus-Poison. Lastly, Tera Fairy allows Galarian Slowking to shed its Dark-type weakness, letting it take Knock Off and Kowtow Cleave from Great Tusk and Kingambit in a pinch. Galarian Slowking pairs well with Pokemon that struggle to switch in safely, such as Kyurem-W and Chi-Yu, as it can slowly pivot them in. Galarian Slowking is relatively passive and is particularly weak to Mewtwo, Deoxys, and Arceus-Dark, so it forms a very strong core with Arceus-Dark and Zacian, which can check those three foes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626445, "username": "Imperial"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 642468, "username": "Finchely"}, {"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Skarmory": {
    "sets": {
      "Physical Wall": {
        "description": "<p>Skarmory is one of the tier's best entry hazard stackers and physical walls thanks to its excellent typing allowing it to check many prominent Pokemon like Zacian and Sneasler. Body Press is preferred on Skarmory over other attacks thanks to its Defense being significantly higher than its attacking stats. Iron Defense is typically run alongside Body Press to allow Skarmory to function as a wincon while also making it a better check to Pokemon like Zacian, Palafin, and Baxcalibur. Whirlwind can be used over Iron Defense to rack up entry hazard damage from the Spikes Skarmory sets and phaze foes trying to set up on it. Tera Water allows Skarmory to beat Pokemon like Tera Fire Zacian and Palafin. Skarmory has trouble with special attackers like Kyurem-W, Arceus-Dark, and Chi-Yu, which can easily OHKO it, so specially defensive walls like Giratina and Arceus-Dark form excellent cores with it. In exchange, Skarmory can check Pokemon like Zacian and Zamazenta-C for its teammates. Pokemon like Life Orb Mewtwo and Palkia-O appreciate Spikes chipping their checks like Solgaleo and Arceus-Dark into KO range of their coverage moves.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 610920, "username": "vesp"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 626445, "username": "Imperial"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Blissey": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Blissey is the best special wall in Ubers UU thanks to Calm Mind and reliable recovery. Shadow Ball hits Mewtwo and Deoxys hard on the switch while also helping it beat Solgaleo and Spectrier. Alternatively, Ice Beam 2HKOes Landorus and Great Tusk. Calm Mind is important for Blissey to keep up with the few special attackers that are too strong for it to stall initially, like Chi-Yu and Palkia-O under rain, while also boosting alongside Pokemon like Calm Mind Hatterene and Arceus-Electric. Seismic Toss provides consistent damage output that Blissey is usually devoid of. Tera Dark is needed for Blissey to resist Arceus-Dark's Judgment and be immune to Stored Power and Psyshock from Hatterene and Psystrike from Mewtwo. Blissey is incredibly specially bulky, which makes it a great teammate for Pokemon like Great Tusk and Dondozo, which are very specially frail. In turn, physical walls like Great Tusk and Giratina help Blissey out immensely, as they can take care of the physical threats to Blissey, like Palafin-H, Great Tusk, and Landorus-T. Giratina is an especially good pairing with Blissey, as it can switch into the Fighting-type moves Blissey is weak to and burn the threat to neutralize it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626445, "username": "Imperial"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 587908, "username": "Leo Justice"}, {"user_id": 610920, "username": "vesp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}, {"user_id": 297659, "username": "deetah"}]}]}
  },
  "Tyranitar": {"sets": {"Sand Setter": {}}},
  "Lugia": {
    "sets": {
      "Specially Defensive": {},
      "Calm Mind": {
        "description": "<p>Lugia is a solid wall and serviceable wincon for the sweeper teams it's placed onto thanks to its monumental bulk and Calm Mind. Air Slash is preferred over the stronger Aeroblast due to having a significantly higher PP count, allowing it to sweep teams without running out of PP against foes like Giratina and Palkia-O, though Psychic Noise is a solid alternative to block walls like Giratina, Blissey, and Arceus formes from healing off the damage it inflicts. Earth Power slams Steel- and Electric-types, like Kingambit, Magearna, and Arceus-Electric for super effective damage. Tera Fairy is a solid defensive typing that replaces Lugia's Dark weakness with a Dark resistance and grants it an immunity to Dragon Tail from Giratina and Dialga, though Tera Ground boosts Earth Power and gives it an immunity to Electric-type moves from Regieleki and Magearna is. Lugia can struggle to break through foes with Encore, status-inducing moves, Taunt, or phazing— like Giratina, Magearna, and Arceus-Dark—so Pokemon like Arceus-Dark, Chi-Yu, and Zacian that can beat these foes are all excellent partners. Lugia is a phenomenal mixed wall, being able to check many of the best wallbreakers in the metagame like Mewtwo, Palkia-O, and Landorus, so Pokemon weak to these threats, like Arceus-Dark, Great Tusk, and Toxapex, all adore its ability to check them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 610920, "username": "vesp"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 587908, "username": "Leo Justice"}, {"user_id": 626445, "username": "Imperial"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Pelipper": {
    "sets": {
      "Rain Setter": {
        "description": "<p>Pelipper is the only viable rain setter in Ubers UU due to its decent bulk, a great Water / Flying typing that allows it to switch into Ground-type moves, and its decent movepool. U-turn allows Pelipper to safely pivot into Palkia-O against threats like Baxcalibur. A Surf boosted by rain and a never-missing Hurricane allow Pelipper to have some offensive presence. Tera Ground grants Pelipper an immunity to Electric and resistance to Rock, its only two weaknesses. It also turns Pelipper's Stealth Rock weakness into a resistance. Pelipper's 0 Speed IVs are designed to make its U-turn as slow as possible so its pivoting is as safe as possible. Valuable teammates that benefit from Pelipper are rain wallbreakers, such as Palkia-O, Palafin, and Barraskewda. The fact that Damp Rock is a mandatory item on Pelipper means it can't run Heavy-Duty Boots to ignore any entry hazards, which means that Pelipper would appreciate hazard removal from a teammate like Corviknight or Giratina. Pelipper also appreciates having Ground-types like Landorus or Great Tusk, which can switch into Electric-type moves that Pelipper fears greatly.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 650155, "username": "OceanicGamer"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 610920, "username": "vesp"}, {"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 527276, "username": "Techno"}, {"user_id": 594478, "username": "ken"}]}]}
  },
  "Torkoal": {
    "sets": {
      "Sun Setter": {
        "description": "<p>Torkoal is the only viable sun setter in Ubers UU, and this combined with its great bulk and deep expansive utility movepool makes it one of the tier's most powerful weather setters. Rapid Spin and Stealth Rock allow Torkoal to operate as both an entry hazard setter and remover for its team, freeing up moveslots on its partners. Yawn gives Torkoal the ability to force switches, help bring in teammates safely, and potentially sleep Pokemon attempting to take advantage of its relatively passivity, but Will-O-Wisp is an option to particularly cripple physical attackers like Zacian and Kingambit. Although Torkoal does not Terastallize much, Tera Ghost gives it the ability to spinblock and potentially spread status to Pokemon like Arceus formes and Great Tusk. Torkoal is the backbone of sun teams, and as a result, it should only be used on them. Sun wallbreakers like Chi-Yu, Walking Wake, Roaring Moon, and Gouging Fire are appreciated partners, as they get their STAB moves boosted and Protosynthesis enabled under sun. Hazard control from Pokemon like Great Tusk can allow Torkoal to not operate as the primary form of hazard control for its team and give it more opportunities to switch in to set up sun multiple times in a game.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 626445, "username": "Imperial"}, {"user_id": 587908, "username": "Leo Justice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Deoxys": {
    "sets": {
      "All-out Attacker": {
        "description": "<p>Deoxys is one of Ubers UU's best wallbreakers thanks to its great mixed attacking and Speed stats and deep coverage movepool that allows it to threaten most of the tier. Superpower deals good damage to Pokemon that resist Psycho Boost such as Arceus-Dark, Dialga, and Magearna. Shadow Ball hits Giratina and Psychic-types like Mewtwo, Hatterene, opposing Deoxys, and Solgaleo. Extreme Speed allows Deoxys to pick off low-health priority and Choice Scarf users such as Palafin, Kyurem-W, and Chi-Yu. Alternatively, Knock Off allows Deoxys to secure KOs on Pokemon like Spectrier and specially defensive Solgaleo. Tera Psychic is generally preferred to boost the power of Deoxys's Psycho Boost, although Tera Ghost and Tera Fighting can be viable options, with the former boosting the power of Shadow Ball and providing a nifty immunity to Extreme Speed and the latter allowing Deoxys to beat Kingambit and Arceus-Dark. Deoxys fits best on offensive teams looking for a strong and reliable revenge killer and wallbreaker. Bulkier walls like Magearna, Giratina, and Solgaleo can take an attack from Deoxys and OHKO it or chip away at it by setting up entry hazards and letting it take Life Orb damage, so Pokemon like Chi-Yu, Arceus-Dark, and Landorus that can deal with these threats are nice. Great Tusk is a notable partner; Deoxys deals with Pokemon like Mewtwo, Kyurem-W, and Clefable that Great Tusk potentially struggles with, and in return, Great Tusk deals with Pokemon like Kingambit and Chi-Yu. Deoxys also appreciates having a teammate that can pivot it into the game safely; thus, Magearna, Solgaleo, Landorus-T, and Palafin all make excellent partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 610920, "username": "vesp"}, {"user_id": 642468, "username": "Finchely"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Deoxys-Speed": {
    "sets": {
      "Entry Hazard Lead": {
        "description": "<p>Deoxys-S finds a niche over other leads like Deoxys and Excadrill thanks to its blistering Speed, decent bulk, and useful utility options. Taunt gives Deoxys-S the ability to stop other leads like opposing Deoxys-S, Landorus-T, and Alolan Ninetales from setting entry hazards and Aurora Veil as well as stop setup sweepers like Mewtwo from using it as setup fodder. While Deoxys-S is normally an entry hazard lead with Stealth Rock and Spikes, Light Screen and Reflect can be run to let it operate as a dual screens lead instead. Psycho Boost is a great one-time nuke, although Superpower can be opted for instead to threaten Pokemon like Kingambit and Arceus-Dark that Deoxys-S is otherwise helpless against, and Teleport can give it the ability to pivot. Focus Sash allows Deoxys-S to guarantee at least one layer of entry hazards. Alternatively, Mental Herb blocks Taunt from opposing Deoxys-S and Arceus formes and Encore from Ogerpon-H and Magearna. Light Clay should be used exclusively with Light Screen and Reflect to extend their duration. While it does not Terastallize much, Deoxys-S can use Tera Ghost to spinblock Pokemon like Great Tusk and Regieleki. Deoxys-S should only be used on hyper offense teams looking for a dedicated lead that sets up hazards or dual screens for the team safely. Wallbreakers like Nasty Plot Mewtwo, Kyurem-W, and Palkia-O appreciate the hazards Deoxys-S sets up to help wear down their switch-ins. Ghost-types like Gholdengo and Spectrier can spinblock to keep Deoxys-S's entry hazards on the field. Pokemon weak to Stealth Rock like Kyurem-W and Iron Bundle like Deoxys-S reliably keeping entry hazards away from the field so they can be more threatening attackers.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 587908, "username": "Leo Justice"}, {"user_id": 626445, "username": "Imperial"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Garchomp": {
    "sets": {
      "Suicide Lead": {
        "description": "<p>Although it faces heavy competition from entry hazard leads like Deoxys-S and Excadrill, Garchomp sets itself apart from them with its solid Attack stat, ability to set up both Stealth Rock and Spikes, and ability to be a potent offensive threat after setting hazards. Dragon Tail allows Garchomp to phaze threats attempting to set up on it like Nasty Plot Mewtwo, Kingambit, and Ogerpon-H, although Scale Shot is an option instead to break Substitutes from the aforementioned Mewtwo and Palkia-O, break Focus Sashes from opposing leads like Deoxys, and boost Garchomp's Speed. Focus Sash allows Garchomp to tank at least one hit to set up hazards. Tera Ghost allows Garchomp to operate as a spinblocker, letting it set up hazards against Pokemon like Great Tusk and Cyclizar. Garchomp should be used exclusively on hyper offense teams looking for a reliable lead. Wallbreakers and offensive threats like Mewtwo, Zacian, Arceus-Poison, and Kyurem-W appreciate Garchomp setting hazards to wear down their checks like Arceus-Dark, Solgaleo, and Magearna. Ghost-types like Gholdengo and Spectrier spinblock for Garchomp if it does not want to Terastallize.</p>"
      },
      "TankChomp": {
        "description": "<p>Garchomp stands out as a bulky entry hazard setter due to its naturally high Attack, allowing it to invest EVs into HP, while still having a good offensive presence after it is done setting hazards. It also has the merits of a solid defensive typing in Ground / Dragon, such as a Electric immunity. Dragon Tail is a great phazing move for Garchomp, as it prevents Pokemon like Mewtwo and Kingambit from setting up while also getting damage on the target and forcing another Pokemon to take hazard damage. Tera Steel allows Garchomp to resist its weaknesses and threaten targets like Solgaleo or Zamazenta-C with Earthquake or Dragon Tail. Tera Ghost allows Garchomp to become a spinblocker for itself, well as gain a Fighting immunity, which can come in handy against Pokemon like Great Tusk and Sneasler. Rocky Helmet synergizes well with Rough Skin, which can punish Pokemon going for a contact move such as U-turn. Garchomp mainly fits on balance and sometimes bulky offense teams. A spinblocker like Giratina or Gholdengo is a great partner for Garchomp, as it allows the hazards to stay on the field, as Garchomp itself can't stop Rapid Spin if it does not Terastallize despite its ability to chip down anyone going for it. Other phazers like Roar Dialga and Roar Zamazenta-C are also good partners, as they can also phaze and make use of Garchomp's hazards. A bulky Steel-type like Magearna and Solgaleo could also be of use, since they give Garchomp a defensive teammate to fall back upon if Garchomp is facing down an Ice-type like Chien-Pao or another Dragon-type like Palkia-O.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}, {"user_id": 650155, "username": "OceanicGamer"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 610920, "username": "vesp"}, {"user_id": 489963, "username": "Hungry Hungry Hippos"}, {"user_id": 642468, "username": "Finchely"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Dialga": {
    "sets": {
      "Mixed Utility": {
        "description": "<p>Mixed Dialga is an excellent utility Pokemon, thanks to its excellent bulk and typing letting it handle Pokemon like Giratina, Magearna, and Palkia-O. Heavy Slam deals heavy damage to Zacian and Hatterene thanks to Dialga's massive weight while also not being affected by Draco Meteor's Special Attack drop. Stealth Rock allows Dialga to aid its teammates, passively chipping their checks. Dragon Tail allows Dialga to stop sweeps from Pokemon like Roaring Moon and Calm Mind Arceus formes, but Roar can be opted for instead, as it ignores Substitutes from Cyclizar and Palkia-O and can phaze Fairy-types like Zacian and Magearna. Tera Flying grants a resistance to both of Dialga's weaknesses, Fighting and Ground, letting it check threats it otherwise couldn't like Great Tusk and Zamazenta-C, though this comes at the cost of increased damage from Stealth Rock. Dialga pairs well with Pokemon like Chi-Yu and Kyurem-W, which can beat many of its checks like Great Tusk, Landorus, and Zamazenta-C. Dialga checks Pokemon like Deoxys, Spectrier, and Hatterene, making it an excellent teammate for Pokemon weak to these threats like Palkia-O, Giratina, and Mewtwo. Dialga is also a solid phazer, with entry hazard setters like Skarmory and Magearna appreciating it forcing foes to take repeated bouts of chip damage from their hazards.</p>"
      },
      "Specially Defensive": {
        "description": "<p>Although it suffers major competition from Magearna and Solgaleo for the Steel-type slot, Dialga's great typing, decent bulk, and useful utility options make it a good wall in Ubers UU. Earth Power gives Dialga a way to hit opposing Steel-types like Solgaleo and Magearna as well as Pokemon like Arceus-Poison and Hatterene, but Thunder Wave is an option to cripple Pokemon attempting to set up on it like Mewtwo, Zacian, and Zamazenta-C. Stealth Rock grants Dialga extra utility, giving Pokemon like Kyurem-W a difficult time switching in. Roar allows Dialga to phaze Pokemon attempting to set up like Sneasler and Zacian while also going through Substitutes from Palkia-O and Cyclizar, but Dragon Tail can phaze Taunt users like Arceus-Dark at the cost of not going through Substitute and being walled by Fairy-types like Hatterene and Magearna. If phazing is not a priority, Heavy Slam can be opted as a secondary STAB move, as it targets Pokemon like Hatterene and Kyurem-W. Tera Flying allows Dialga to flip the matchup against Pokemon like Great Tusk and Landorus and remove all of its weaknesses, although it does give Dialga a weakness to Stealth Rock. Spikes setters like Ogerpon-H can make Dialga's phazing more potent. Dialga struggles against strong physically offensive threats like Zacian, Kingambit, and Palafin, so physically defensive walls like Toxapex and Great Tusk that can take these Pokemon on make great partners. Offensive threats like Deoxys and Choice Scarf Kyurem-W appreciate Dialga crippling switch-ins with Stealth Rock and Thunder Wave.</p>"
      },
      "Trick Room Setter": {
        "description": "<p>Dialga is an excellent pick on Trick Room teams due to its blend of low Speed, sky-high Special Attack, high Base Power moves, and ability to set Trick Room for itself. Draco Meteor does huge damage to Pokemon like Palkia-O and Kyurem-W, while also activating Dialga's Eject Pack, allowing it to bring in a threatening teammate like Ursaluna or Hoopa-U. Earth Power gives Dialga coverage to hit Steel-types like non-Air Balloon Gholdengo, opposing Dialga, and Magearna. Trick Room allows Dialga to outspeed almost every opposing Pokemon while also providing support to teammates like Solgaleo and Kingambit. Eject Pack allows Dialga to switch out when it drops its own stats with Draco Meteor, which lets it bring a teammate like Kingambit in safely. Tera Flying is used so Dialga can flip its only two weaknesses, Fighting and Ground, to a resistance and an immunity, making it much better against Zamazenta-C, Great Tusk, and Landorus, allowing it to set up Trick Room in front of these threats. Dialga sets Trick Room, making it a natural ally to Pokemon like Ursaluna, Kingambit, and Hoopa-U, which it can wallbreak alongside. As a Trick Room setter, it struggles with Pokemon like Taunt Arceus formes and phazers like Dialga, Giratina, and bulky Arceus formes. This means it pairs well with Pokemon like Ursaluna and Hoopa-U, which can break through these obstacles with sheer power, or Fairy-types like Magearna and Zacian, which are immune to Dragon Tail. Other Trick Room setters Dialga is commonly paired with, like Solgaleo and Hatterene, are great partners too, as they can set Trick Room for it, and Hatterene is especially good at this due to being immune to Taunt and phazing.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}, {"user_id": 610920, "username": "vesp"}, {"user_id": 626445, "username": "Imperial"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 626445, "username": "Imperial"}, {"user_id": 610920, "username": "vesp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 226455, "username": "berry"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Palkia": {"sets": {"Choice Scarf": {}, "Trick Room Setter": {}}},
  "Palkia-Origin": {"sets": {"Wallbreaker": {}}},
  "Giratina": {"sets": {"Defog": {}, "Rest": {}, "Stall Wall": {}}},
  "Arceus-Bug": {"sets": {"Calm Mind": {}, "Utility": {}}},
  "Arceus-Dark": {
    "sets": {
      "Calm Mind": {
        "description": "<p>Calm Mind Arceus-Dark is an incredibly potent sweeper and stallbreaker in Ubers UU. Its amazing bulk allows it to set up on the many special attackers in the tier, such as Kyurem-W, Chi-Yu, and Mewtwo, and Taunt stops Blissey and other Arceus formes from setting up alongside it with their own Calm Mind, blocks Encore from Magearna, and prevents phazing from Giratina, Skarmory, and Dialga. Recover allows it to increase its longevity and set up on some physical attackers, such as Solgaleo and Kingambit. Tera Fairy grants Arceus-Dark a resistance to Fighting-type moves from the likes of Urshifu-S, Deoxys, and Mewtwo, along with an immunity to Dragon Tail, the only phazing move that cannot be prevented by Taunt. Tera Poison turns its Fairy, Fighting, and Bug weaknesses into resistances, which is incredible for setting up on Zacian, Magearna, and Zamazenta-C. Arceus-Dark greatly benefits from the help of Pokemon that can deal with physical attackers, as Zacian and Zamazenta-C both offensively check it, so Dondozo, Lugia, Skarmory, physically defensive Solgaleo, and Magearna form good defensive cores with it. Other Pokemon that pair well with Arceus-Dark are Zamazenta-C and Annihilape, as both are Defense-boosting offensive sweepers that can wall and eliminate physical attackers for Arceus-Dark to freely take care of special attackers. Arceus-Dark is very entry hazard weak, so Pokemon like Giratina and Great Tusk that can remove hazards for Arceus-Dark are greatly appreciated. Giratina appreciates Arceus-Dark's ability to check Dark- and Ghost-types like Gholdengo and Spectrier, and Great Tusk appreciates Arceus-Dark beating common checks to it like Giratina, Skarmory, and Deoxys.</p>"
      },
      "Defensive": {
        "description": "<p>Arceus-Dark has extensive options as a defensive Pokemon in Ubers UU checking metagame threats like Palafin-H and Deoxys. Foul Play hits physical attackers like Arceus-Fire and Palafin-H hard while still scoring solid damage versus Psychic-types such as Mewtwo and Lugia. Arceus-Dark can run Will-O-Wisp to cripple physical attackers, like Zacian and Zamazenta-C switching in, or it can run Stealth Rock to give its team entry hazard support if a partner doesn't have the move. Roar phazes many setup sweepers, such as Arceus and Mewtwo, whereas Taunt blocks them from setting up altogether. Taunt also shuts down many lead Pokemon like Smeargle and Galvantula and can force your opponent on the back foot provided it wins a Speed tie against opposing Arceus-Dark. Tera Poison turns Dark's Fairy, Fighting, and Bug weaknesses into resistances, which is especially helpful versus Zacian and Volcarona. Tera Fairy gives similar resistances to Poison, but the neutrality to Psychic and Ground helps against Great Tusk and Deoxys, and the valuable Dragon immunity lets Arceus-Dark beat Kyurem-W. Arceus-Dark benefits from specially defensive partners like Blissey, Calm Mind Clefable, and Giratina due to being weak to special attackers such as Magearna and Palkia-O. Arceus-Dark also pairs well with Corviknight and Regieleki, as both can remove hazards to keep it healthy and pivot it onto the field.</p>"
      },
      "Support": {
        "description": "<p>Arceus-Dark's wide support movepool and good defensive typing make it an excellent support Pokemon for bulkier teams. Roar or Dragon Tail is used to stop setup sweepers such as Nasty Plot Mewtwo and Calm Mind Arceus variants. Roar can be prevented by Taunt; however, unlike Dragon Tail it can phaze Fairy-types and Pokemon behind Substitute. Taunt is an alternative option to prevent opposing Pokemon from boosting and allow Arceus-Dark to chip down passive wall Pokemon like Giratina and Solgaleo by preventing them from healing. The last moveslot is fairly flexible; Arceus-Dark can serve as an effective entry hazard setter with Stealth Rock, while Will-O-Wisp and Thunder Wave let it cripple offensive Pokemon like Palafin and Ogerpon-H. Tera Poison lets Arceus-Dark beat setup sweepers that can otherwise force it out like Zacian and Arceus-Fighting. Tera Fairy provides similar resistances as Poison while also providing an extremely useful immunity to Dragon, letting it better check threats like Palkia-O, while not causing a pesky weakness to the Psychic-type moves fired off from Pokemon such as Mewtwo and Deoxys. Arceus-Dark checks Pokemon like Chi-Yu and Kyurem-W, so it pairs well with Pokemon like Zamazenta-C, Mewtwo, Palkia-O and Solgaleo, which struggle against those threats. Physically defensive Pokemon like Great Tusk and Calm Mind Lugia complement Arceus-Dark well; the former can beat many Dark-resistant Pokemon that pressure it like both Urshifu formes while appreciating its ability to check Psychic-types, and the latter checks Fighting-types well and appreciates other setup sweepers being deterred from setting up. Giratina is another good teammate thanks to its typing letting it check sweepers that Arceus-Dark cannot, such as Arceus-Fire and Sneasler; in exchange, Arceus-Dark checks opposing Ghost- and Dark-types such as Spectrier and Chi-Yu and spreads status so Giratina can fire off powerful Hexes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 236507, "username": "Bice"}, {"user_id": 626445, "username": "Imperial"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 489963, "username": "Hungry Hungry Hippos"}, {"user_id": 587908, "username": "Leo Justice"}, {"user_id": 610920, "username": "vesp"}, {"user_id": 642468, "username": "Finchely"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arceus-Dragon": {
    "sets": {
      "Dragon Dance": {},
      "Support": {
        "description": "<p>Arceus-Dragon carves a small niche as a support Pokemon thanks to its incredible bulk, diverse amount of utility options, and solid typing allowing it to take on Pokemon like Palafin, Ogerpon-H, Arceus-Electric, and Chi-Yu. Draco Meteor is generally preferred as the STAB move, although Judgment is an option to trade off power for consistency and no Special Attack drop. Will-O-Wisp gives Arceus-Dragon the ability to more comfortably take on physical attackers like Kingambit, Great Tusk, and Zacian, but if these threats are not an issue, Thunder Wave can cripple the likes of Mewtwo, Kyurem-W, and Lunala with paralysis. The third moveslot is incredibly flexible; most commonly, Stealth Rock is run to allow Arceus-Dragon to provide support for its team. Dragon Tail and Roar are also options, as both provide phazing capabilities, with Dragon Tail not being affected by Taunt and Roar bypassing Substitutes and hitting Fairy-types like Zacian and Magearna. Flash Cannon is an option to provide coverage for Fairy-types, allowing Arceus-Dragon to not be completely walled by them, but it is extremely difficult to fit. Tera Steel gives Arceus-Dragon a valuable defensive typing, allowing it to take on Pokemon like Iron Bundle, Gholdengo, and Deoxys better while also providing a Toxic immunity. Tera Fairy and Tera Water are alternative Tera types that let Arceus-Dragon take on Pokemon like Great Tusk, Roaring Moon, and Kyurem-W better. The given EV spread allows Arceus-Dragon to be as bulky as possible while still outpacing Ogerpon-H. Arceus-Dragon generally finds use on defensive teams alongside other walls like Magearna and Toxapex. Fairy-types like Magearna, Zacian, and Clefable completely counter Arceus-Dragon, so checks to them like Galarian Slowking and Toxapex are valuable to have. Likewise, Ice-types like Chien-Pao and Kyurem-W beat Arceus-Dragon, so Pokemon like Magearna are helpful teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 626445, "username": "Imperial"}, {"user_id": 610920, "username": "vesp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arceus-Electric": {"sets": {"Calm Mind": {}, "E-killer": {}}},
  "Arceus-Fighting": {"sets": {"Cosmic Power": {}, "Support": {}}},
  "Arceus-Fire": {
    "sets": {
      "Extreme Killer": {
        "description": "<p>Extreme Killer Arceus-Fire is a good early-game wallbreaker and one of the most powerful late-game cleaners in the metagame thanks to its powerful Extreme Speed, which hits foes before they have a chance to revenge kill it. The combination of Swords Dance, Extreme Speed, and Tera Normal makes Arceus-Fire lethal if positioned correctly. Recover allows it to shrug off recoil damage from Flare Blitz with minimal difficulty. Tera Normal is essential for Arceus-Fire to have the necessary damage output to complete a sweep, as it cannot run a boosting item instead of Flame Plate; Tera Normal also removes its weaknesses to Ground- and Water-type attacks from the likes of Great Tusk, Landorus, and Palafin-H. 72 Speed EVs allow it to outspeed Timid Gholdengo. Arceus-Fire fits on a wide variety of teams, but it has a few notable partners. Arceus-Fire pairs especially well with Rillaboom, as it removes bulky Water-types like Dondozo for Arceus-Fire's sweep, and Grassy Terrain weakens Earthquake's damage and provides passive recovery. Hazard control from Great Tusk, Giratina, or Corviknight is also essential when using Arceus-Fire, as it suffers from a crippling weakness to Stealth Rock, greatly limiting its longevity. Arceus-Fire is vulnerable to Taunt and Encore users like Cyclizar, Magearna, and Ogerpon-H and Haze users like Toxapex, which can all prevent it from setting up. Teammates like Gholdengo, which is immune to all status moves, and Rillaboom, which typically does not use status or setup moves, are good partners to remedy this weakness. Arceus-Fire struggles to break through physical walls like Toxapex, Giratina, and Garganacl that resist its powerful Flare Blitz while also being able to take Extreme Speed, so partners like Landorus, Kyurem-W, and Zacian that can break through these threats form potent offensive cores with Arceus-Fire.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 620359, "username": "Paris 2024"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 610920, "username": "vesp"}, {"user_id": 626445, "username": "Imperial"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arceus-Grass": {
    "sets": {
      "Calm Mind + Taunt": {
        "description": "<p>Arceus-Grass is a potent stallbreaker and sweeper in Ubers UU thanks to its excellent bulk and decent typing enabling it to repeatedly Calm Mind. Taunt blocks common anti-setup measures like Roar from Solgaleo and Giratina and Encore from Magearna and Ogerpon-H, allowing Arceus-Grass to stack massive amounts of boosts. Recover allows Arceus-Grass to check Pokemon like Palafin and Palkia-O throughout the course of the game, as well as giving it multiple attempts to sweep. Tera Poison grants Arceus-Grass a resistance to Poison-type attacks from Pokemon like Sneasler and Arceus-Poison, along with removing its other weaknesses like to Ice- and Fire-type moves from Kyurem-W and Chi-Yu. Alternatively, Tera Fairy can be opted for, as its ability to block Dragon Tail from the likes of Dialga and Giratina removes some of the only defensive counterplay to Arceus-Grass that's not covered by Taunt. Arceus-Grass is forced out by foes like Ogerpon-H, Tera Fire Zacian, and Dragon Dance Arceus-Poison, so Pokemon that can handle these threats like Toxapex, Giratina, and Landorus-T are excellent partners. Arceus-Grass can check Pokemon like Palkia-O, Palafin, and Landorus for its teammates, which Pokemon like Chi-Yu, Solgaleo, and Zamazenta-C appreciate. Arceus-Grass can struggle to break through Grass-resistant foes like Dialga and Galarian Slowking, so Pokemon like Chi-Yu and Landorus that can remove them pair excellently with it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 610920, "username": "vesp"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 626445, "username": "Imperial"}, {"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arceus-Ice": {"sets": {"Offensive Calm Mind": {}, "Bulky Calm Mind": {}}},
  "Arceus-Poison": {"sets": {"Dragon Dance": {}, "E-killer": {}, "Defensive Utility": {}}},
  "Arceus-Psychic": {"sets": {"Cosmic Power": {}}},
  "Excadrill": {
    "sets": {
      "Sand Sweeper": {
        "description": "<p>Excadrill is a niche but solid mid-game wallbreaker and late-game cleaner for sand offense teams. Swords Dance allows Excadrill to hit incredibly hard and crucially secure OHKOs against bulky offensive Pokemon such as Tera Ground Zacian and Arceus-Poison, which it could not do otherwise. Rapid Spin allows Excadrill to boost its Speed outside of sand and provide support for its teammates by removing entry hazards. Rock Slide gives it strong neutral EdgeQuake coverage. Air Balloon gives Excadrill many entry points against Earthquake and Earth Power from foes like Great Tusk and Landorus, respectively, which allows it to get off a Swords Dance more easily. Tera Flying acts very similarly, removing its Ground and Water weaknesses and flipping its Fighting weakness into a resistance, which is very valuable against Fighting-type coverage from the likes of Palafin-H, Deoxys, Mewtwo, and Zacian. Excadrill greatly appreciates automatic sand setting from its best teammate, Sand Stream Tyranitar. Excadrill also greatly appreciates Spikes support from Skarmory or Magearna, which gives it an easier time securing KOs. Excadrill is difficult to outspeed, but running Adamant means Booster Energy Iron Boulder and Roaring Moon can outspeed and KO it with Close Combat and Earthquake, respectively, so Excadrill appreciates the support of Clefable and Landorus-T, as they can take said attacks for Excadrill. In terms of defensive counterplay, Pokemon such as Great Tusk and Rillaboom can survive a hit from Excadrill and KO it back, and Skarmory, Corviknight, and Landorus-T all stop it in its tracks due to their solid natural bulk and typing, so consider teammates like Kyurem-W and Chi-Yu, which can form potent wallbreaking cores with Excadrill and create chances for late-game cleaning.</p>"
      },
      "Lead": {
        "description": "<p>Excadrill stands out as a lead due to its rare ability to set and remove Stealth Rock and be offensively threatening to targets like Gholdengo and Regieleki. Rock Slide synergizes well with Earthquake offensively because they create the EdgeQuake combination, and it hits Pokemon like Skamory, Landorus, Corviknight, and Lugia. Rapid Spin is used to remove entry hazards set by other leads, such as Sticky Web from Galvantula or Araquanid, and Stealth Rock breaks any Focus Sashes and chips foes. Tera Ghost spinblocks Pokemon like Great Tusk and Regieleki, as well as granting an immunity to Fighting-type moves from Pokemon like Chien-Pao; however, Excadrill won't always be your best candidate for Terastallization. Lead Excadrill should be used on hyper offense teams. Strong wallbreakers like Mewtwo, Zacian, and Deoxys like Excadrill as a teammate because it is good at setting up hazards to chip down threats into KO range of them. Air Balloon Gholdengo is also a decent teammate, as it is immune to Fighting- and Ground-type attacks, which gives the user a chance to save Excadrill as a potential sacrifice or save its Rapid Spin for later and allow it to set Stealth Rock if it gets removed. Taunt from Arceus formes and Deoxys really ruins Excadrill, so having a Pokemon like Zamazenta-C that can threaten Arceus formes is a good idea.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626445, "username": "Imperial"}, {"user_id": 650155, "username": "OceanicGamer"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 610920, "username": "vesp"}, {"user_id": 626445, "username": "Imperial"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Gothitelle": {"sets": {"Choice Scarf": {}}},
  "Alomomola": {"sets": {"Wish Passer": {}}},
  "Galvantula": {
    "sets": {
      "Sticky Web": {
        "description": "<p>Galvantula carves out a niche in Ubers UU thanks to it being the fastest available Sticky Web setter, having solid offenses, and having the ability to threaten out common forms of entry hazard control like Great Tusk and Mandibuzz. Energy Ball gives Galvantula coverage against Ground-types like Great Tusk and Landorus, although Bug Buzz is an option to give it a secondary STAB option hit Pokemon like Mewtwo, Arceus-Dark, and Deoxys. Thunder Wave allows Galvantula to cripple Pokemon like Zacian, Kyurem-W, and Arceus-Poison after setting up Sticky Web. Although Galvantula will not often Terastallize, Tera Ghost allows it to block Rapid Spin from Great Tusk and Cyclizar. Focus Sash guarantees Galvantula will set up Sticky Web and potentially fire off an attack or paralyze something afterwards. Galvantula should be exclusively used as a Sticky Web lead for hyper offense teams. The most obvious partners for Galvantula are Pokemon that appreciate having their faster offensive counters slowed down, as well as Pokemon commonly revenge killed by faster threats. As a result, Pokemon like Choice Specs Kyurem-W, Mewtwo, and Landorus all make solid teammates. Ghost-types like Gholdengo and Dragapult and Taunt users like Arceus formes can prevent Rapid Spin and Defog and keep Sticky Web up. Counter leads like Taunt Arceus-Dark, Deoxys, and Hatterene can prevent Sticky Web being set up and give Galvantula issues, so Pokemon like Hatterene and Palafin that can deal with these threats are good to have as partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 626445, "username": "Imperial"}, {"user_id": 642468, "username": "Finchely"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Mandibuzz": {
    "sets": {
      "Defensive Pivot": {
        "description": "<p>Mandibuzz's great utility options; good defensive typing that allows it to take on threats like Kingambit, Great Tusk, and Sneasler; and solid physical bulk make it a decent pick in Ubers UU. Toxic puts Pokemon that lack recovery like Zacian and Palkia-O on a timer. Alternatively, Knock Off removes items from switch-ins like Giratina and Landorus-T, while Defog can give Mandibuzz extra utility by removing entry hazards for its teammates. Foul Play allows Mandibuzz to not be completely passive, dealing big damage to Pokemon like Swords Dance or Dragon Dance Arceus and Sneasler. U-turn gives Mandibuzz the ability to pivot out of bad matchups against Pokemon like Zamazenta-C. Tera Poison gives Mandibuzz a useful Fairy-type resistance and is generally an excellent defensive typing, helping it take on Pokemon like Zacian and Magearna. Mandibuzz generally fits on more defensive balance teams looking for a solid switch-in to physical attacks from Pokemon like Kingambit, Ogerpon-H, and Sneasler. Mandibuzz struggles against physical attackers like Kingambit and Zamazenta-C that do not fear Foul Play, so Pokemon like Arceus-Poison and Landorus-T that can take them on are helpful. Pokemon like Landorus-T, Galarian Slowking, and Magearna form a powerful defensive pivot core with Mandibuzz.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 626445, "username": "Imperial"}, {"user_id": 587908, "username": "Leo Justice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Volcarona": {"sets": {"Quiver Dance": {"description": "<p>124 Speed is to outspeed Deoxys at +1</p>"}}},
  "Reshiram": {"sets": {"Choice Specs": {}}},
  "Landorus": {"sets": {"Offensive Utility": {}, "Nasty Plot": {}, "Choice Scarf": {}}},
  "Landorus-Therian": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Landorus-T is an excellent Choice Scarf user and pivot in Ubers UU with its excellent typing, STAB Earthquake, and Intimidate. Stone Edge allows Landorus-T to hit Moltres and Ogerpon-H for super effective damage, while U-turn allows it to pivot out against Pokemon that threaten it, like Kyurem-W and Palkia-O, and bring in a threatening sweeper that beats them, like Arceus-Poison. Crunch gives Landorus-T coverage for Mewtwo, Deoxys, and Lugia. Tera Ground powers up Earthquake, allowing it to OHKO Magearna and Dialga; Tera Ground also lessens Landorus-T's Ice weakness, helping it survive Ice Shard from Baxcalibur. Physically frail Pokemon like Chi-Yu and Deoxys appreciates Intimidate from Landorus helping them stomach a hit, while Pokemon like Calm Mind Arceus formes and Zamazenta-C appreciate it taking out faster threats like Deoxys, Choice Scarf Chi-Yu, and Dragapult. Landorus-T has problems with Palafin and Choice Scarf Kyurem-W, which can outspeed it and OHKO it with their powerful super effective moves, making Toxapex and Solgaleo excellent partners. Magearna and Palafin can form pivoting cores with Landorus-T, gaining momentum and racking up chip damage.</p>"
      },
      "Defensive": {
        "description": "<p>Landorus-T's excellent defensive typing allows it to check threats like Zacian and Great Tusk and, when paired with Intimidate and its solid utility options, makes it a good defensive pivot for bulky offense and balance teams. Stone Edge lets it hit threats such as Kyurem-W and Ogerpon-H, while Crunch hits Giratina and the tier's various Psychic-types, such as Mewtwo and Deoxys. Taunt allows Landorus-T to hinder bulky walls such as Solgaleo, Giratina, and Magearna. Rocky Helmet, in conjunction with Intimidate, lets Landorus-T punish physical attackers, especially U-turn users like Sneasler and opposing Landorus-T. Tera Water is a solid defensive typing that lets Landorus-T beat Palafin and removes its crippling Ice weakness, letting it better check Baxcalibur. Solgaleo forms a fantastic defensive core with Landorus-T, checking threatening special attackers like Palkia-O for it and covering its Ice weakness, notably taking on the dangerous Kyurem-W. In return, Landorus-T absorbs Ground-type moves and checks physical attackers like Great Tusk and Kingambit for Solgaleo. Wallbreakers like the aforementioned Palkia-O and Kyurem-W appreciate Landorus-T being able to safely bring them in with a slow U-turn; in exchange, they can dispatch of Landorus-T's checks like Palafin and Giratina. On bulkier teams, Clefable is able to pass Wish, making up for Landorus-T's lack of reliable recovery, while also checking Pokemon that otherwise take advantage of Landorus-T, like Arceus-Dark and Giratina.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 236507, "username": "Bice"}, {"user_id": 626445, "username": "Imperial"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 626445, "username": "Imperial"}, {"user_id": 610920, "username": "vesp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Kyurem-White": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Kyurem-W is one of the most dangerous Pokemon in Ubers UU thanks to its combination of high Special Attack, good coverage options, and usable defensive profile, making it one of the tier's most dangerous revenge killers and special attackers. Draco Meteor + Ice Beam is a great STAB combination, hitting the majority of the tier. Freeze-Dry gives Kyurem-W coverage for Water-types like Palafin and Toxapex. Fusion Flare gives Kyurem-White coverage for Steel-types like Magearna, Solgaleo, and Zamazenta-C. Tera Fire allows Kyurem-W to boost Fusion Flare as well as provides it with a nifty resistance to Fairy- and Steel-type attacks from the likes of Zacian, Magearna, Dialga, and Solgaleo. Kyurem-W fits best on balance and offensive teams looking for a strong revenge killer and special attacker. Kyurem-W struggles to break through specially defensive walls like Blissey and Solgaleo, so Pokemon that can deal with these walls like Arceus-Fire, Zamazenta-C, and Landorus-T, make good partners. Entry hazard control from Pokemon like Great Tusk and Corviknight increases Kyurem-W's longevity.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Kyurem-W is an unparalleled wallbreaker in Ubers UU. Draco Meteor is an nuclear bomb of an attack, easily OHKOing most neutral targets such as Dialga and Mewtwo. Ice Beam gives Kyurem-W a strong move versus Fairy-types such as Zacian and Clefable while also allowing it to hit Ground- and Flying-types, such as Great Tusk and Landorus, hard. Freeze-Dry allows Kyurem-W to OHKO Palafin and Palkia-O without dropping its Special Attack with Draco Meteor. Fusion Flare allows Kyurem-W to hit the Steel-types that would otherwise resist Ice and Dragon, such as Magearna and Solgaleo. Tera Fire is a must to power up its Fusion Flare while also helping against Zacian and Solgaleo by making its Fairy and Steel weaknesses into resistances. Kyurem-W is incredibly vulnerable to entry hazards due to its Stealth Rock weakness, meaning it appreciates hazard removal from Giratina or Great Tusk. Another great teammate that helps with hazard control is Hatterene, due to its immunity to Dragon-type moves helping against Arceus-Dragon and Garchomp, as its Magic Bounce ability provides a proactive way of preventing hazards. Kyurem-W also pairs well with slower pivots, such as Galarian Slowking and Solgaleo, as they help to get it onto the field safely. Kyurem-W is especially vulnerable to the many faster threats in the metagame, such as Zacian, Zamazenta-C, and Palkia-O, so it likes the support of Sticky Web from Galvantula and Smeargle or paralysis from Magearna and Giratina.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}, {"user_id": 626445, "username": "Imperial"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 587908, "username": "Leo Justice"}, {"user_id": 642468, "username": "Finchely"}, {"user_id": 610920, "username": "vesp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}, {"user_id": 511181, "username": "Rose"}, {"user_id": 594478, "username": "ken"}]}]}
  },
  "Toxapex": {
    "sets": {
      "Defensive": {
        "description": "<p>Toxapex's access to Regenerator, good defensive typing, and formidable bulk lets it excel at keeping physical threats like Zacian and Palafin at bay. Haze prevents foes like Ogerpon-H and Zacian from boosting repeatedly and subsequently breaking past Toxapex. While on the field, Toxic Spikes keep threats like Palkia-O, Kyurem-W, and Palafin from coming in lest they be put on a timer. Alternatively, Toxic is an option to make Toxapex a more threatening presence on the field, although it means Substitute from Pokemon like Palkia-O ruins it. Infestation lets Toxapex trap poisoned foes, forcing them to accumulate passive damage. Alternatively, Sludge Bomb gives Toxapex a means of pressuring Calm Mind + Taunt Arceus formes. If no other check is available, Toxapex can use Tera Dark to absorb a Psystrike or Kowtow Cleave from Mewtwo or Kingambit and neutralize it with Haze or Toxic. In a similar fashion, it can use Tera Grass to stomach a hit from Landorus, Arceus-Electric, or Great Tusk and cripple it with Toxic. Toxapex is a natural fit on bulky balance and is a staple on stall, as its staying power shines best in the long games such teams often face. Being a physical wall, Toxapex can form a strong defensive core with special walls like Solgaleo, Blissey, Arceus-Dark, and Magearna. Pokemon susceptible to passive damage like Landorus-T and Arceus formes appreciate Toxapex absorbing chip damage in their place so that they can be in top shape when they're needed. Toxapex is vulnerable to Pokemon like Great Tusk, Landorus, and Mewtwo; pair it with teammates that can cover these threats, such as Landorus-T, Skarmory, and Solgaleo.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 546606, "username": "Tanny89k"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 642468, "username": "Finchely"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Araquanid": {"sets": {"Sticky Web": {}}},
  "Solgaleo": {
    "sets": {
      "Specially Defensive": {
        "description": "<p>Specially defensive Solgaleo is one of the tier's premier special walls, is an amazing pivot, and is even a solid phazer. Knock Off hits Psychic- and Ghost-type Pokemon like Mewtwo, Deoxys, and Giratina, though Sunsteel Strike can be used instead as strong STAB move, to deal more damage to opposing Arceus and threaten Zacian. Knock Off's item-removing effect synergizes excellently with Roar's phazing, allowing Solgaleo to remove Heavy-Duty Boots and force foes to take repeated entry hazard damage. Roar also prevents sweepers like Zacian, Mewtwo, and Zamazenta-C from setting up on it. Tera Water removes Solgaleo's Fire and Ground weaknesses, allowing it to check Pokemon like Arceus-Fire, Trailblaze Ogerpon-H, and Great Tusk. Tera Dark, on the other hand, allows it to check Dark- and Ghost-types, like Spectrier, Giratina, and Chi-Yu. Teleport assists in getting powerful wallbreakers like Chi-Yu, Deoxys, and Kyurem-W onto the field safely. Solgaleo can have trouble with Pokemon like Chi-Yu, Kingambit, Palafin, and Landorus, so Pokemon like Kyurem-W, Great Tusk, Zamazenta-C, Palkia-O, and Arceus-Dark that can check these threats are excellent partners.</p>"
      },
      "Trick Room Setter": {
        "description": "<p>Solgaleo is one of the tier's best Trick Room setters due to its amazing defenses, pivoting with Teleport that can let it bring in its teammates safely, and good typing. Knock Off can be used instead of Sunsteel Strike to hit Psychic- and Ghost-type Pokemon like Mewtwo and Deoxys; its item-removing effect also makes Solgaleo pair well with entry hazard setters like Great Tusk, as it can remove Heavy-Duty Boots to make hazards more potent. Tera Water removes Solgaleo's Fire and Ground weaknesses, which can let it check Pokemon like Arceus-Fire, Landorus, and Great Tusk. Solgaleo synergizes excellently with Pokemon like Magearna and Dialga, as they can help set up Trick Room for each other. Solgaleo also pairs well with Pokemon that can take advantage of Trick Room like Ursaluna, Kingambit, and Palkia, as it can pivot them in safely to help deal with threats like Chi-Yu, Spectrier, and Arceus-Fire. Solgaleo can often be threatened out by Pokemon like Kingambit, Chi-Yu, and Arceus-Fire, which makes partners like Zamazenta-C, Arceus-Dark, and Palkia appreciated. Solgaleo can also pair well with other slow pivots like Dialga and Galarian Slowking, as they can pivot each other in to help deal with Pokemon like Choice-locked Kyurem-W and Zamazenta-C.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 610920, "username": "vesp"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 626445, "username": "Imperial"}, {"user_id": 567483, "username": "Bella"}, {"user_id": 587908, "username": "Leo Justice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Magearna": {"sets": {"Specially Defensive": {}, "Physically Defensive": {}, "Shift Gear Demon": {}}},
  "Rillaboom": {
    "sets": {
      "Choice Band": {
        "description": "<p>Rillaboom is a fairly powerful physical attacker with solid bulk, setting up Grassy Terrain to aid its teammates and throw off a high-Base Power priority STAB move. High Horsepower provides valuable coverage against otherwise problematic Fire- and Poison-types like Chi-Yu, Arceus-Poison, and Galarian Slowking, as well as dealing with Steel-types such as Solgaleo and Kingambit. Alternatively, Knock Off serves as a valuable utility tool, as well as providing more power against Psychic- and Ghost-types like Mewtwo and Giratina. Tera Grass's power boost gives Rillaboom a 50% chance to OHKO bulky Great Tusk and a guaranteed OHKO on Regieleki with Grassy Glide. In terms of useful teammates, Sneasler is a very strong pick, because Grassy Terrain activates its Grassy Terrain + Unburden combination, raising its Speed to extremely high levels and providing a nice Defense boost; additionally, Grassy Terrain reducing Earthquake's damage improves its survivability even further. Bulky Pokemon without reliable recovery like Magearna and Palkia-O are also aided by the recovery effect of Grassy Terrain. Rillaboom fears strong, faster attackers that it can't threaten with its coverage, such as Chi-Yu, Arceus-Poison, Chien-Pao, and Kyurem-W, so Pokemon that can take these threats on like Zamazenta-C, Zacian, and Choice Scarf Landorus are helpful partners. Grassy Terrain nerfing Earthquake's damage aids many other Pokemon that are vulnerable to Ground-types, such as Arceus-Poison, Solgaleo, and Chi-Yu.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 655922, "username": "AlicieLizzie"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 610920, "username": "vesp"}, {"user_id": 567483, "username": "Bella"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Corviknight": {"sets": {"Physically Defensive": {}}},
  "Dragapult": {
    "sets": {
      "Status Spam": {
        "description": "<p>Dragapult is a solid utility Pokemon thanks to its blistering Speed, strong offensive and defensive typing, and excellent support movepool. Will-O-Wisp cripples physical attackers looking to switch in, like Zacian, Arceus-Poison, and Palafin. Hex capitalizes on Dragapult's status spreading, as well as doing huge damage to sleeping Giratina. Thunder Wave can cripple common switch-ins and setup sweepers, like Dragon Dance Arceus formes and Baxcalibur, as well as the aforementioned Zacian. Substitute allows Dragapult to block Thunder Wave and Will-O-Wisp from Arceus formes and Giratina, and it also capitalizes on its resistances to U-turn and Volt Switch. U-turn allows Dragapult to pivot out on Pokemon like Zacian and Arceus-Dark and bring a threatening teammate in, like Zamazenta-C or Zacian. Tera Fairy flips Dragapult's Dragon-type weakness on its head, making it immune to Dragon-type moves from Palkia-O, Arceus-Dragon, and Dialga; Tera Fairy also lets it resist Dark-type moves from Urshifu-S and Kingambit. Dragapult enables Pokemon like Zacian and Dragon Dance Arceus formes through its endless status spreading, so they partner fantastically with it. Dragapult struggles to break through walls and is particularly annoyed by Garganacl and Gholdengo, as both are immune to its status moves, meaning it appreciates Ground-type partners like Landorus, Chi-Yu, Kyurem-W, and Bulk Up Great Tusk, which can wallbreak for Dragapult and capitalize on the weakened opposing team.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626445, "username": "Imperial"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 610920, "username": "vesp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Zacian": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Zacian is one of Ubers UU's best late-game cleaners and wallbreakers thanks to Intrepid Sword, its good Attack and Speed, decent bulk for an offensive threat, and its deep coverage movepool. Close Combat targets Pokemon like Zamazenta-C and Dialga. Zacian's last moveslot is relatively flexible; Tera Blast is generally preferred with either Tera Fire or Ground to hit Pokemon like Magearna, Solgaleo, Arceus-Fire, and Skarmory, although if they are not an issue, Psychic Fangs to hit Arceus-Poison and Toxapex without having to Terstallize and Crunch to hit Deoxys and Mewtwo are viable options. Tera Fire and Ground also provide immunities to burns and Thunder Wave, respectively. If Zacian is running Crunch, Tera Dark can be used to boost said move and provide an immunity to Psychic-type attacks from the likes of Deoxys and Mewtwo. Heavy-Duty Boots allows Zacian to stay healthy and be great in the Sticky Web matchup. Zacian best fits on offensive teams looking for a solid late-game cleaner. Zacian struggles against bulkier, physically defensive Pokemon like Magearna, Skarmory, and Toxapex, so Pokemon like Chi-Yu, Deoxys, and Arceus-Dark that can handle these threats are helpful to have. Zacian has four-moveslot syndrome, so it also appreciates support from teammates like Landorus-T and Chi-Yu that can deal with the Pokemon that Zacian can't hit, like Arceus-Fire and Skarmory. Pokemon like Choice Specs Kyurem-W, Mewtwo, and Giratina like having Zacian threaten out Pokemon they struggle against like Palkia-O and Kingambit. Entry hazard support from the likes of Deoxys and Dialga helps wear down Zacian's checks, allowing it to function as a more threatening cleaner; in return, Zacian removes Pokemon they have problems with like Kingambit, Palkia-O, and Arceus-Dark for them. Pivoting from the likes of Magearna, Landorus-T, Solgaleo, and Cyclizar gives Zacian a safe opportunity to set up Swords Dance; the later can also potentially pass Zacian a free Substitute with Shed Tail.</p>"
      },
      "Wallbreaker": {
        "description": "<p>Zacian's excellent Speed and power make it both a fantastic revenge killer and wallbreaker. Close Combat helps cover Steel-types switching in, dealing super effective damage to Pokemon like Dialga and Zamazenta-C and hitting Magearna neutrally. Crunch helps remove key targets like Gholdengo, Solgaleo, Mewtwo, and Galarian Slowking. Psychic Fangs is occasionally used to beat Poison-types like Toxapex and Arceus-Poison it otherwise has trouble removing, while Wild Charge allows Zacian to hit Corviknight, Skarmory, and Dondozo. Tera Fighting can boost Close Combat to extreme levels, allowing it to break through Pokemon like Magearna and Solgaleo. Tera Ground is notable for providing an immunity to Thunder Wave and a powerful option to break through checks like Toxapex, Magearna, and Solgaleo in Tera Blast Ground. Zacian best fits as a wallbreaker on bulky offense and balance teams. Great Tusk and Landorus-T are excellent partners for Zacian, being able to set up Stealth Rock to chip down foes and also threaten the Steel- and Poison-type Pokemon like Magearna and Arceus-Poison that it is weak to. Late-game cleaners like Arceus-Fire, Sneasler, and Arceus-Grass enjoy the gaps Zacian creates in defensive cores providing them with opportunities to set up and sweep weakened teams.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}, {"user_id": 620359, "username": "Paris 2024"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 587908, "username": "Leo Justice"}, {"user_id": 610920, "username": "vesp"}, {"user_id": 567483, "username": "Bella"}, {"user_id": 642468, "username": "Finchely"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Zamazenta": {"sets": {"Iron Defense": {}}},
  "Zamazenta-Crowned": {
    "sets": {
      "IronPress": {
        "description": "<p>With its combination of robust defenses and good Attack, Zamazenta-C is an excellent mid- or late-game sweeper for bulkier teams. Body Press synergizes well with Iron Defense and Dauntless Shield, and when combined with Zamazenta-C's brilliant natural bulk, it can quickly clean up weakened teams. Behemoth Bash or Heavy Slam lets it Zamazenta-C answer Fairy-types, like Zacian and Tera Fairy Arceus-Dark, and Crunch lets it tackle Psychic- and Ghost-types, like Mewtwo, Giratina, Lugia, and Deoxys. 200 Speed EVs with a Jolly Nature allow it to outspeed Cyclizar, 112 Attack EVs let it have a favorable roll to 2HKO Mewtwo, and the rest of the EVs go into Defense to maximize Body Press's damage. Tera Water lets Zamazenta-C stay in on more opponents foes like Arceus-Fire, Palafin, Chi-Yu, and Kyurem-W, and Tera Flying lets it resist Fighting-type moves from the likes of Mewtwo, Zacian, and Deoxys and be immune to Ground-type moves from Great Tusk, Landorus, and Ursaluna, though a weakness to Stealth Rock is added. Being able to check Magearna, Zacian, Dialga, Ursaluna-B, Arceus-Dark, Palafin, and Palkia-O, Zamazenta-C is appreciated by Giratina, Chi-Yu, Palkia-O, Arceus-Dark and Mewtwo. Zamazenta-C suffers from being worn down by entry hazards, so a hazard remover like Great Tusk or Giratina is needed. It also appreciates hazard support of its own from setters like Magearna and Dialga. Fighting-, Ground-, and Fire-resistant Pokemon like Arceus-Poison, Rillaboom, and Giratina are also a boon to Zamazenta-C, as they can stomach whatever hits come at it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 275219, "username": "Go make a sandwitch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 610920, "username": "vesp"}, {"user_id": 642468, "username": "Finchely"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Urshifu": {"sets": {"Choice Item": {}, "Wallbreaker": {}}},
  "Urshifu-Rapid-Strike": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Urshifu-R is a decent Choice Scarf user in Ubers UU due to its excellent signature move, pivoting in U-turn, priority in Aqua Jet, and solid offensive typing. Surging Strikes's guaranteed critical hit chance allows Urshifu-R to break through Defense-boosting sweepers like Cosmic Power Arceus formes and Zamazenta-C. Aqua Jet allows Urshifu-R to pick off weakened foes that have a Speed boost, like Ogerpon-H and Sneasler. U-turn allows Urshifu-R to pivot, racking up important chip damage on Pokemon like Zacian and Mewtwo while generating momentum. Tera Water allows Urshifu-R to power up Surging Strikes and Aqua Jet, notably allowing it to OHKO Mewtwo and Ogerpon-H after Stealth Rock damage; Tera Water also removes its Fairy- and Psychic-type weaknesses, helping against Zacian and Mewtwo. Pokemon like Calm Mind Arceus formes and Zamazenta-C appreciate Urshifu-R taking out faster threats like Deoxys, Mewtwo, and Spectrier. Urshifu-R struggles to break through Pokemon that resists its STAB moves like Palkia-O and Giratina, so the support of Dragapult and Choice Scarf Kyurem-W is greatly appreciated. Urshifu-R can also form pivoting cores with Pokemon like Landorus-T and Sneasler, allowing them to pick up on the momentum Urshifu-R generates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626445, "username": "Imperial"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 610920, "username": "vesp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Regieleki": {
    "sets": {
      "Dual Screens": {
        "description": "<p>Thanks to having the highest Speed in Ubers UU and good utility options, Regieleki is a niche but effective dual screens lead. Volt Switch allows Regieleki to bring a partner onto the battlefield. Rapid Spin lets Regieleki remove entry hazards for Pokemon like Kyurem-W, although Explosion is an option to give it a one-time nuke that always brings a partner in safely. Tera Flying gives Regieleki an immunity to Ground-type attacks, which allows it to set up dual screens on Great Tusk and both Landorus formes. Alternatively, Tera Ghost allows Regieleki to be immunity to Extreme Speed from Arceus formes and Deoxys and operate as a spinblocker. Regieleki should only be used on hyper offense teams and should be sent in first or after a Pokemon like Deoxys-S has set up entry hazards. Setup sweepers like Nasty Plot Mewtwo and Zacian appreciate Regieleki setting up dual screens to help them set up more safely. Pokemon like Choice Specs Kyurem-W and Kingambit like Regieleki pivoting them onto the field safely. Gholdengo is a notable partner, as it blocks Defog and can use the dual screens Regieleki sets up to set up as well. Regieleki struggles against counter leads like Defog Giratina, Taunt Arceus, and Deoxys that prevent it from setting up dual screens, so Pokemon that can take these threats on like Zacian, Great Tusk, and Kingambit can be valuable.</p>"
      },
      "Offensive Utility": {
        "description": "<p>Regieleki's blistering Speed, decent offensive stats, and utility options make it one of Ubers UU's fastest cleaners and offensive pivots. Tera Blast Ice OHKOes Ground-type Pokemon like Landorus and Great Tusk, which otherwise completely wall Regieleki, as well as chipping Dragon-types like Giratina. Rapid Spin gives Regieleki utility for its team by acting as a form of entry hazard control for Pokemon like Kyurem-W. Volt Switch allows Regieleki to bring in a partner onto the battlefield, like Mewtwo or Palkia-O. Regieleki fits best on offensive teams looking for a solid pivot. Since it is hard walled by Ground-types if it does not Terastallize, Pokemon like Palafin, Kyurem-W, and Iron Bundle that can take on these Ground-types are good partners, with the latter two also appreciating Regieleki removing Stealth Rock. Pokemon like Landorus-T, Magearna, and Iron Bundle can create a potent pivot core with Regieleki. Regieleki can be walled by specially defensive walls like Dialga, Magearna, and Blissey, so Pokemon that can take these threads on like Zamazenta-C, Palafin, and Kingambit are helpful to have.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 610920, "username": "vesp"}, {"user_id": 626445, "username": "Imperial"}, {"user_id": 642468, "username": "Finchely"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Ursaluna": {
    "sets": {
      "Trick Room Sweeper": {
        "description": "<p>Ursaluna is the metagame's premier Trick Room sweeper. Crunch lets Ursaluna pressure Giratina without fear of being PP stalled. Alternatively, Fire Punch can be used to 2HKO Skarmory and Corviknight, which wall it otherwise. Substitute takes advantage of passive walls like Giratina, Blissey, and Quagsire while also forcing Sucker Punch Kingambit into a guessing game that favors Ursaluna. Minimum Speed investment lets Ursaluna move before a greater range of foes in Trick Room. Tera Normal boosts Facade to the point of OHKOing offensive Great Tusk and maximum HP Arceus formes. Tera Ghost can be utilized to turn Ursaluna's disadvantageous matchups against Zamazenta-C and Skarmory on their heads, though this compromises its matchups against Kingambit and defensive Arceus-Dark. Ursaluna's paltry Speed necessitates Trick Room support from setters such as Magearna, Solgaleo, and Dialga. Kingambit, another staple on Trick Room teams, greatly appreciates having many of its checks, such as Zacian, Zamazenta-C, and Will-O-Wisp users, dealt with by Ursaluna.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 546606, "username": "Tanny89k"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 610920, "username": "vesp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Sneasler": {
    "sets": {
      "Unburden Sweeper": {
        "description": "<p>Thanks to great Attack and Speed stats combined with Unburden and Swords Dance, Sneasler is one of Ubers UU's most threatening late-game sweepers. Dire Claw is generally preferred as the Poison-type STAB move to nail Pokemon like Zacian and Clefable, but Gunk Shot can be opted for instead, trading off consistency for raw power, allowing Sneasler to achieve damage thresholds such as having a chance to OHKO Palafin-H and Arceus-Grass after Stealth Rock. Sneasler has a variety of options for coverage; Throat Chop is its strongest option against Solgaleo, Giratina, and Gholdengo, although Acrobatics naturally synergizes with Unburden and hits Pokemon like Great Tusk. Finally, Shadow Claw targets Annihilape and aformentioned Solgaleo and Giratina. Each Tera type should be paired with a coverage option. Tera Dark gives an immunity to Psychic-type attacks from Pokemon like Mewtwo and boosts Throat Chop, allowing it to beat Pokemon like Giratina. Tera Flying gives an immunity to Ground-type attacks and boosts Acrobatics, letting Sneasler have an easier time against Pokemon like Great Tusk. Tera Ghost gives an immunity to Extreme Speed and boosts Shadow Claw, letting Sneasler take on Extreme Killer Arceus formes and Gholdengo. Grassy Seed, when comsumed, activates Unburden and gives Sneasler an easier time setting up against Pokemon like Zacian. Rillaboom is a required partner for Sneasler, as the Grassy Terrain it sets up activates Sneasler's Grassy Seed, and it can also pivot Sneasler in so it can safely set up to sweep. Sneasler struggles against walls like Giratina and Landorus-T, so Pokemon that can take these threats on like Chi-Yu and Palafin are good to have as partners. Wallbreakers like Kyurem-W and Mewtwo can chip down the opposing team for Sneasler to attempt a sweep late-game.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Sneasler is a great cleaner and revenge killer that's able to take out sweepers like Mewtwo, Zacian, and Ogerpon-H thanks to its highed-powered STAB moves, great Attack and Speed stats, and useful utility options. Gunk Shot is generally preferred as the Poison-type STAB move as it OHKOes foes like Zacian, although Dire Claw trades off power for consistency. U-turn gives Sneasler the ability to set the tempo of the game by generating momentum for its team and helping bring in setup sweepers like Mewtwo and Zacian. Throat Chop provides coverage against Ghost-types like Gholdengo and Giratina, although Switcheroo is an option to cripple walls like Magearna and Dialga. Tera Dark can be used with Throat Chop, boosting the move and giving Sneasler a useful Psychic-type immunity, letting it take on Pokemon like Deoxys. Tera Fighting is a option to boost Close Combat, allowing Sneasler to achieve damage thresholds like OHKOing Dialga and Arceus-Dark. Sneasler generally fits best on offensive teams looking for a reliable cleaner and revenge killer. Pokemon like Palafin, Landorus-T, and Cylizar can make VoltTurn cores with Sneasler. As Sneasler's damage output can be potentially disappointing, it appreciates entry hazards from Pokemon like Great Tusk and Magearna making it more difficult to switch into and more offensively threatening. Sneasler can't do much against Pokemon like Arceus-Poison and Gholdengo, so Pokemon like Landorus-T that can take these threats on are useful teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 626445, "username": "Imperial"}, {"user_id": 610920, "username": "vesp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Meowscarada": {"sets": {"Lead": {}, "Wallbreaker": {}}},
  "Garganacl": {
    "sets": {
      "Setup": {
        "description": "<p>Garganacl acts as an anti-metagame setup sweeper with the potential to clean up games with enough boosts and Salt Cure to punish Steel- and Water-types like Magearna, Solgaleo, and Palkia-O that might try to switch in to deal with it. Garganacl can use Iron Defense to become unbeatable on the physical side, while its stats give it enough bulk to survive most special attacks comfortably. Alternatively, it can use Curse to boost its attack and hit harder with Salt Cure or a coverage move, although this is considerably slower than Iron Defense. Body Press is used to take advantage of Iron Defense's boosts while also hitting Arceus-Dark and Chi-Yu for supereffective, while Earthquake provides better coverage against Pokemon like Giratina and Slowking-Galar if Garganacl is using Curse as its boosting move. Leftovers gives Garganacl some passive healing, allowing it to heal while setting up, although Heavy-Duty Boots can be used instead. Tera Water allows Garganacl to resist Water-type attacks from Pokemon like Palkia-O and Palafin, while Tera Fairy can be used to give it an immunity to Dragon-type attacks, more specifically preventing Dragon Tail from Dialga and Giratina from phazing it. Physical attackers that struggle against Giratina like Zamazenta-C and Palafin appreciate Garganacl's ability to absorb status and resist Ghost. Teammates that struggle against Chi-Yu or Magearna, such as Chien-Pao and Mewtwo, greatly benefit from Garganacl's ability to check these foes. Garganacl struggles against Grass- and Water-type Pokemon like Rillaboom and Palkia-O, so teammates that can switch into their attacks like Arceus-Grass and Dialga form a very solid defensive core with it</p>"
      },
      "Stealth Rock": {
        "description": "<p>Garganacl is a great defensive tool within Ubers UU, being able to comfortably set Stealth Rock against both of the tier's best entry hazard removal options in Giratina and Terapagos. Protect synergizes well with Salt Cure and allows Garganacl to scout moves from Choice-locked Chien-Pao, Landorus, Palafin, and Palkia. Tera Water provides Garganacl with a resistance to Steel- and Water-type moves such as Make It Rain from Gholdengo and Hydro Pump from both Palkia formes and retains its Fire resistance so it can handle Chi-Yu. Tera Fairy allows Garganacl to cover its weakness to Fighting-type moves such as Focus Blast from Landorus and Mewtwo and provides an immunity to Dragon-type moves such as Palkia-O's Spacial Rend, Kyurem-W's Draco Meteor, and Giratina's Dragon Tail. Garganacl can use Heavy-Duty Boots as an alternative to Leftovers on teams lacking hazard removal or to improve the matchup into Spikes Magearna. Garganacl fits best on stall and fat balance teams using Giratina and Toxapex for excellent hazard control and passive damage support. Garganacl loses to two important Ghost-types, Spectrier and Necrozma-DW, due to their combination of setup moves and recovery. Fast physical attackers such as Zacian and Chien-Pao can scare out both Pokemon, and tanky Dark-types such as Arceus-Dark can be used to answer Necrozma-DW regardless of its set.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 587908, "username": "Leo Justice"}, {"user_id": 588983, "username": "Poosh_i"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 626445, "username": "Imperial"}, {"user_id": 642468, "username": "Finchely"}, {"user_id": 610920, "username": "vesp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Espathra": {"sets": {"Calm Mind": {"description": "<p>12 speed EVs allow you to outspeed base 120 Speed Pokemon at +1</p>"}}},
  "Palafin": {"sets": {"Bulky Attacker": {}, "Bulk Up": {}}},
  "Cyclizar": {
    "sets": {
      "Utility": {
        "description": "<p>Cyclizar is a solid support Pokemon with its deep utility movepool including the incredible Shed Tail. Shed Tail allows it to pass Substitutes to teammates like Zacian and Arceus, giving them a free switch-in and a chance to set up and attempt to sweep. Rapid Spin provides entry hazard control, improving the longevity of Pokemon like Ogerpon-H and Chi-Yu. Knock Off can remove a foe's item while also chipping spinblockers like Gholdengo and Giratina. Taunt allows Cylizar to shut down Defog attempts from Corviknight and setup attempts from Pokemon like Lugia and Arceus formes. U-turn allows Cyclizar to pivot out in the face of Taunt users while not sacrificing HP. Tera Fairy allows Cyclizar to resist Fighting, which is valuable against Zamazenta-C and Great Tusk; it also provides Cyclizar an immunity to Dragon, helping greatly versus Dialga and Palkia-O and allowing it to use Shed Tail in front of them. Cyclizar is excellent at enabling setup Pokemon, so Pokemon like Dragonite, Lugia, Zacian, and Arceus-Poison all appreciate its support. It also pairs well with wallbreakers like Kyurem-W and Chi-Yu, as it can remove hazards and provide a free switch-in to them with Shed Tail. Cyclizar struggles with faster Pokemon and Gholdengo due to being so frail and reliant on support moves, so Pokemon like Choice Scarf Chi-Yu and Landorus-T are excellent partners for it. Palafin and Landorus can form pivoting cores with Cyclizar</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 626445, "username": "Imperial"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 610920, "username": "vesp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Dondozo": {
    "sets": {
      "Unaware Wall": {
        "description": "<p>Dondozo is a good physical wall in Ubers UU thanks to its incredible physical bulk and Unaware, allowing it to take on threats like Zacian, Palafin, Chien-Pao, and Sneasler. Curse makes Dondozo less passive and allows it to operate as a wincon if needed. Rest is Dondozo's only form of reliable recovery; it increases its longevity and also alleviates its crippling weakness to status like Toxic poison. Sleep Talk allows Dondozo to deal damage or continue setting up with Curse while it is asleep, although Body Press is an option instead, allowing Dondozo to hit Pokemon like Zamazenta-C, Chien-Pao, and Kingambit for super effective damage and hit Water-resistant foes like Palafin and and Palkia-O. Tera Dragon gives Dondozo a useful defensive typing, letting it flip the matchup against Pokemon like Wild Charge Zacian and Ogerpon-H, although Tera Grass is an option too, as it still removes all of Dondozo's weaknesses while giving it a resistance to Ground-type attacks from Pokemon like Great Tusk and Ursaluna. Tera Fighting gives Dondozo a valuable Dark-type resistance, helping it take on Kingambit and Chien-Pao, while also boosting Body Press. Dondozo exclusively fits on stall teams, helping teammates like Mandibuzz and Blissey take on threats like Zacian and Chien-Pao. Dondozo crumbles against special attackers like Mewtwo, Palkia-O, and Landorus, so specially defensive walls like Blissey and Giratina can be helpful to have, with the combination of Blissey and Dondozo in particular blanket checking nearly every attacker in the tier.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 642468, "username": "Finchely"}, {"user_id": 626445, "username": "Imperial"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Annihilape": {
    "sets": {
      "Bulk Up": {
        "description": "<p>Annihilape is a decent setup sweeper thanks to its good Attack and defensive stats, incredible STAB combination, and incredible signature move in Rage Fist. Taunt is important to shut down walls like Quagsire and Solgaleo that would status or phaze Annihilape. Tera Water gives Annihilape a valuable defensive typing, allowing it to set up on Pokemon like Chi-Yu and Palafin. Tera Fire is an option to provide the ability to set up on Pokemon like Kyurem-W and the aforementioned Chi-Yu and a valuable immunity to Will-O-Wisp, although it comes at the cost of a Stealth Rock weakness. Tera Fairy makes Annihilape immune to Dragon-type attacks, notably allowing it to not get phazed by Dragon Tail from Pokemon like Giratina and Garchomp. Annihilape generally fits on teams looking for a bulky wincon or stallbreaker. Annihilape can struggle against Pokemon like Palkia-O, Arceus-Dark, and Giratina that can cripple it with status, so Pokemon that can take these threats on like Solgaleo and Magearna can be nice to have. If Annihilape is used on hyper offense teams, dual screens support from Alolan Ninetales, Regieleki, and Deoxys-S to help it safely set up can be nice to have.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 610920, "username": "vesp"}, {"user_id": 642468, "username": "Finchely"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Kingambit": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Kingambit is one of Ubers UU's most threatening wallbreakers and late-game cleaners thanks to its naturally high Attack, decent defenses, an incredible ability in Supreme Overlord, access to Swords Dance, and great offensive typing allowing it to threaten Pokemon like Solgaleo, Mewtwo, Giratina, and Clefable. While Kowtow Cleave is normally preferred to have a more consistent Dark-type STAB move than Sucker Punch, Low Kick is an option to hit threats like Dialga and opposing Kingambit for super effective damage. Sucker Punch is extremely valuable, allowing Kingambit to operate as a revenge killer against Pokemon like Mewtwo, Deoxys, and Choice Scarf Kyurem-W. Black Glasses boosts Kingambit's Dark-type STAB moves, making it a more powerful threat and achieving valuable damage thresholds like OHKOing offensive Arceus formes after a Swords Dance when five teammates have fallen. Alternatively, Leftovers can give Kingambit a slight amount of consistent recovery, and Lum Berry allows it to avoid crippling status from Pokemon like Dialga and Giratina. Tera Flying gives Kingambit a great defensive typing, flipping the matchup against Pokemon like Great Tusk, Landorus-T, and Zamazenta-C. 12 Speed EVs allow Kingambit to outspeed paralyzed Arceus formes. Kingambit fits best on offense and hyper offense teams looking for a powerful physical wallbreaker and late-game cleaner. Kingambit's inability to deal much damage against bulky Fighting-types like Great Tusk and Zamazenta-C can be problematic, so Pokemon that can take these threats on like Palkia-O, Landorus, Chi-Yu, and Palafin are nice to have. Kingambit can remove Psychic- and Ghost-types like Mewtwo, Giratina, and Gholdengo, which allows partner Pokemon like Zamazenta-C have an easier time attempting a sweep themselves.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 610920, "username": "vesp"}, {"user_id": 626445, "username": "Imperial"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Great Tusk": {
    "sets": {
      "Offensive Utility": {
        "description": "<p>Thanks to its good typing, stats, and ample movepool, Great Tusk can serve as both an effective entry hazard remover and wallbreaker. Knock Off helps Great Tusk punish Pokemon that wall it such as Giratina, Skarmory, and Landorus. Close Combat lets Great Tusk hit threats such as Arceus-Dark and Ursaluna hard, while Stealth Rock lets Great Tusk compress the roles of hazard setter, wallbreaker, and hazard remover. Tera Dark is used to bolster Knock Off and grant Great Tusk an immunity to Psychic-type moves from the likes of Deoxys and Mewtwo, letting it punish them with a super effective Knock Off. Tera Water can instead be used to grant Great Tusk a resistance to Palafin's Water moves and Arceus-Fire's Flare Blitz. Hazard-weak wallbreakers, such as Chi-Yu and Kyurem-W, appreciate Great Tusk removing hazards for them; in exchange, they target the physical walls that Great Tusk loathes. Kyurem-W in particular forms an excellent offensive core with it, being able to offensively pressure its checks such as Giratina and Lugia. Arceus-Dark also makes a good partner for Great Tusk, as it covers Great Tusk's weakness to special attackers while also enjoying hazards being removed. Furthermore, Arceus-Dark pressures the Ghost-types that block Great Tusk's attempts to use Rapid Spin.</p>"
      },
      "Physically Defensive": {},
      "Bulk Up": {}
    },
    "credits": {"writtenBy": [{"user_id": 236507, "username": "Bice"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 610920, "username": "vesp"}, {"user_id": 642468, "username": "Finchely"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Iron Treads": {"sets": {"Utility": {}, "Booster Speed Lead": {}}},
  "Iron Moth": {"sets": {"Booster Energy": {}}},
  "Baxcalibur": {
    "sets": {
      "Loaded Dice": {
        "description": "<p>Baxcalibur is a powerful sweeper, especially with the support of Snow and Aurora Veil. Thermal Exchange makes Baxcalibur immune to being burned, taking what is normally a huge weakness for physical attackers off the table. Earthquake is valuable to cover Steel and Fire types that otherwise pose a fair bit of danger, such as Solgaleo and Kingambit. Alternatively, Ice Shard finishes off low health targets and surprises faster Pokémon, which is very beneficial due to Baxcalibur's relatively low Speed. Tera Ground powers up Earthquake as well as makes Baxcalibur immune to Thunder Wave and blocking Volt Switch, which is very useful. Alolan Ninetales is a fantastic teammate with its ability Snow Warning, as Snow and Aurora Veil increase Baxcalibur's bulk to very high levels. Other good teammates are ones that can cover problems Fighting, Steel, or Fairy types, so Zacian, Mewtwo, Chi-Yu, and Solgaleo are notably appreciated. Some Pokémon like Kingambit and Arceus-Poison that are vulnerable to Ground Type attacks appreciate having Baxcalibur around to snuff them out.</p>"
      },
      "Dragon Dance": {
        "description": "<p>Dragon Dance Baxcalibur is an excellent setup sweeper and beneficiary of snow with its solid STAB combination, its high Attack, its powerful attacking moves, and Dragon Dance. Earthquake allows it to hit bulky Steel-type Pokemon like Magearna, Dialga, and Solgaleo, which would otherwise wall it. Tera Ground boosts Baxcalibur's Earthquake and gives it a Thunder Wave immunity, while Tera Fairy allows it to absorb Dragon-type moves and set up on Pokemon like Palkia-O, Dialga, and Giratina. Alolan Ninetales is one of the best teammates for Baxcalibur, as Aurora Veil and the Defense boost snow gives to Ice-types make it much easier for Baxcalibur to set up. Choice Scarf Chi-Yu and Choice Scarf Landorus are also good teammates for Baxcalibur, as they threaten Zamazenta-C and Magearna, which would otherwise beat it, and Landorus can pivot with U-turn. Magearna and Solgaleo can also be used as defensive teammates, as they have excellent synergy with Baxcalibur and can slowly pivot it in, positioning it to sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 650155, "username": "OceanicGamer"}, {"user_id": 655922, "username": "AlicieLizzie"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 610920, "username": "vesp"}, {"user_id": 642468, "username": "Finchely"}, {"user_id": 567483, "username": "Bella"}, {"user_id": 626445, "username": "Imperial"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Gholdengo": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Gholdengo is a fearsome setup sweeper in Ubers UU, in part due to its terrifyingly strong signature move, potent signature ability, and fantastic defensive typing. Make It Rain allows Gholdengo to output huge damage and hit important targets like Kyurem-W, Baxcalibur, and Zacian, whereas Shadow Ball offers incredible neutral coverage while hitting Mewtwo, Giratina, and Galarian Slowking extremely hard. Recover allows Gholdengo to have incredible longevity alongside its immunity to status moves. Tera Water allows Gholdengo to turn its Fire weakness into a resistance, helping against Chi-Yu and Kyurem-W, while also providing a resistance to Water, which assists against Palkia-O and Palafin. Air Balloon gives Gholdengo a temporary Ground immunity, giving it more entry points through an immunity to Spikes, Earth Power, and Earthquake from Great Tusk and Landorus. Gholdengo pairs excellently with entry hazard setters such as Magearna and Skarmory, as it blocks both Rapid Spin and Defog. It can also break through some walls with its sheer power, like Clefable and Arceus-Grass, giving teammates like Zacian an easier time cleaning up. Gholdengo struggles with faster offensive Pokemon that can halt its sweep and revenge kill it, such as Dragapult and Tera Fire Zacian, so Pokemon like Deoxys, Palafin, and Rillaboom can help Gholdengo by handing them. Pokemon with strong priority moves, like Kingambit and Palafin, can also halt its sweep and revenge kill it, so teammates like Zamazenta-C and Palkia-O, which can take Sucker Punch and Jet Punch, respectively, provide excellent support for it.</p>"
      },
      "Specially Defensive": {
        "description": "<p>Gholdengo is an excellent setup sweeper and support Pokemon in Ubers UU, in large part due to its fantastic defensive typing, its strong ability, and Nasty Plot. Hex allows Gholdengo to do huge damage to statused foes, like sleeping Giratina and statused Arceus formes. Thunder Wave allows Gholdengo to disrupt the enemy team, power up its Hex, and cripple offensive Pokemon like Zacian, Palkia-O, and Chi-Yu. Nasty Plot turns Gholdengo from a wall into a potential sweeper with Shadow Ball, being able to boost on Pokemon that rely on status or phazing, like Arceus-Poison if its Air Balloon is intact and Clefable. Air Balloon gives Gholdengo a temporary Ground-type and Spikes immunity, allowing it to switch in on Great Tusk and Landorus easily, and keep entry hazards on the field against Great Tusk. Tera Water allows Gholdengo to resist Water- and Fire-type moves from the likes of Chi-Yu, Kyurem-W, Palkia-O, and Palafin. Gholdengo can paralyze and beat foes like Zacian and Zamazenta-C, helping teammates such as Arceus-Dark and Kyurem-W that appreciate being faster than opposing threats. However, Gholdengo struggles with Dark-types like Kingambit and Arceus-Dark, so Pokemon like Magearna and Zamazenta-C pair excellently with it. Additionally, Gholdengo has natural synergy with entry hazard setters like Magearna, Galarian Slowking, Galvantula, and Skarmory, as it blocks both Rapid Spin and Defog, making it the best Pokemon for keeping hazards on the opponent's field.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Gholdengo is a decent option as a Choice Scarf user and revenge killer thanks to its great offensive and defensive typing. Focus Blast allows it to hit Kingambit, Dialga, and Choice Specs Chi-Yu, whereas Thunderbolt can be used instead for Palafin and Toxapex. Trick cripples opposing Pokemon like Magearna and Dialga, which could otherwise wall Gholdengo. As Choice Scarf Gholdengo is unable to run a damage-boosting item, it sometimes lacks in damage. Tera Steel makes up for this by allowing it to OHKO Mewtwo after Stealth Rock and OHKO Great Tusk; Tera Steel also removes its weaknesses to the Dark- and Ghost-type attacks that would otherwise force it out like Sucker Punch from Kingambit, Shadow Ball from Mewtwo, and Judgment from Arceus-Dark. Tera Fighting is used exclusively on Focus Blast sets to turn Gholdengo's Sucker Punch weakness into a resistance while also allowing it to OHKO Zamazenta-C and offensive Dialga. Gholdengo is one of the most reliable forms of entry hazard control in the tier, as its immunity to both Rapid Spin and Defog allows it to keep hazards up with ease. Therefore, hazard setters like Magearna, Skarmory, and Deoxys-S make for excellent partners. Primarily used as a revenge killer, Gholdengo is excellent at enabling other premier offensive cleaners like Zacian, Ogerpon-H, and Kingambit by punching through their potential checks like Clefable and Dondozo, while also crippling Giratina with Trick. Gholdengo struggles against teams that contain strong priority users like Palafin and Kingambit, so Pokemon that can take hits from them, like Arceus-Grass, Archaludon, Toxapex, and Palkia-O are desirable partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 620359, "username": "Paris 2024"}, {"user_id": 626445, "username": "Imperial"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 475771, "username": "Dorron"}, {"user_id": 587908, "username": "Leo Justice"}, {"user_id": 626445, "username": "Imperial"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Chien-Pao": {
    "sets": {
      "Choice Band": {},
      "Swords Dance": {
        "description": "<p>Swords Dance Chien-Pao is one of the strongest cleaners in the tier, easily finding opportunities to set up with how many switches it forces. Sucker Punch can be used to beat out the few Pokemon that can revenge kill Chien-Pao such as Deoxys and Palafin. Sacred Sword and Tera Blast Fire or Ground are niche coverage options that can be used to deal with Zamazenta-C and Magearna. Tera Dark boosts Chien-Pao's Crunch and Sucker Punch to astronomical levels of power, while Tera Fire and Tera Ground can award Chien-Pao with further setup opportunities by providing immunities to Will-O-Wisp and Thunder Wave, respectively. Swords Dance Chien-Pao appreciates wallbreakers such as Mewtwo, Palafin, and Palkia-O that can tear holes in the opponent's team, paving the way for a late-game sweep. Chien-Pao particularly dislikes Fairy-types such as Magearna and Zacian; some strong options that can deal with them are Landorus-T, Chi-Yu, and Arceus-Poison. Chien-Pao also greatly appreciates entry hazard setters and bulky pivots that can help chip down the opponent's team and safely bring it in. For this reason, Magearna and Landorus-T pair very well with it.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 642468, "username": "Finchely"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 587908, "username": "Leo Justice"}, {"user_id": 610920, "username": "vesp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Chi-Yu": {"sets": {"Choice Item": {}, "Nasty Plot": {}}},
  "Roaring Moon": {"sets": {"All Out Dragon Dance": {}, "Disruptive Dragon Dance": {}, "Choice Item": {}, "Boots Pivot": {}}},
  "Walking Wake": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Thanks to Walking Wake's great STAB combination that threatens out Pokemon like Great Tusk, Giratina, and Palkia-O; great Special Attack and Speed; powerful ability in Protosynthesis; and spammable signature move in Hydro Steam, it is one of Ubers UU's best sun attackers. Flamethrower targets Steel- and Grass-types like Magearna, Zamazenta-C, Arceus-Grass, and Corviknight. Flip Turn allows Walking Wake to take advantage of the switches it forces against Pokemon like Chi-Yu and Landorus and gain momentum for its team. 244 EVs in Special Attack allow Walking Wake to gain a Speed boost under sun, making it a strong cleaner and revenge killer. Tera Water boosts Hydro Steam and Flip Turn, allowing Walking Wake to reach damage thresholds such as OHKOing Mewtwo and Magearna under sun. Walking Wake fits exclusively on sun teams and is mandatory on them. Torkoal is the most automatic partner for Walking Wake, as it sets the sun needed for Walking Wake to be at its fullest potential while also spinning away entry hazards and setting up Stealth Rock to wear down would-be switchins to Walking Wake like Magearna. Great Tusk is also a notable partner, as it removes entry hazards as well and can deal with the Steel-types Waking Wake can struggle against. Other sun wallbreakers like Chi-Yu and Ogerpon-H can break through Walking Wake's checks like Magearna and Blissey and give it an easier time punching holes in the opposing team. Pivots like Landorus-T can create a good pivoting core with Walking Wake.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 610920, "username": "vesp"}, {"user_id": 626445, "username": "Imperial"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Ogerpon-Hearthflame": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Ogerpon-H is an incredibly potent stallbreaker and sweeper in Ubers UU due to Mold Breaker and Swords Dance. Trailblaze allows Ogerpon-H to boost its Speed past that of usually faster Pokemon, such as Deoxys, Dragapult, Zacian, Choice Scarf Chi-Yu, and Choice Scarf Landorus. Power Whip and Horn Leech can be run as stronger Grass-type moves to hit Palafin and Great Tusk for super effective damage. Ivy Cudgel gives Ogerpon-H a strong, non-contact Fire-type STAB move to hit Magearna and Skarmory with while avoiding Rocky Helmet chip damage. Play Rough is for Dragon-types like Giratina and Reshiram that resist its STAB moves, whereas Knock Off is for general utility and hits Mewtwo and Lugia. Terastallizing Ogerpon-H gives it an Attack boost, letting it grab OHKOs on bulky neutral Pokemon like Zacian and Dialga without a Swords Dance boost. Ogerpon-H is best dealt with using offensive counterplay that takes advantage of its poor bulk, as Pokemon like Deoxys, Zacian, Choice Scarf Landorus, Chi-Yu, and Palafin can outrun and KO it. Defensively, almost nothing can take Ogerpon-H on, as Mold Breaker ignores Unaware, so only the likes of Moltres can safely handle it. Entry hazards are also a huge problem for Ogerpon-H, as it cannot hold Heavy-Duty Boots, meaning it will take significant chip damage when hitting the battlefield. Ogerpon-H especially appreciates support from Corviknight, which can help Ogerpon-H safely hit the field and remove hazards. Ogerpon-H also forms strong offensive cores with priority users like Rillaboom, Palafin, and Arceus formes due to them being able to eliminate the few faster threats in the metagame. Ogerpon-H also pairs uniquely well with Sticky Web Galvantula, as the foes' Speed drops let it move before everything in the unboosted metagame besides priority users, making it much more threatening.</p>"
      },
      "All-out Attacker": {
        "description": "<p>Ogerpon-H is a fearsome wallbreaker and late-game cleaner in Ubers UU. Power Whip is a strong STAB option, hitting important damage thresholds on Great Tusk, Toxapex, and Arceus formes, but Horn Leech's healing effect can offset chip damage from entry hazards, making it a solid alternative. Play Rough hits Dragon-types like Giratina and Palkia-O hard. Trailblaze boosting Ogerpon-H's Speed allows it to outpace most of the metagame, notably Zacian, Mewtwo, Deoxys, and Arceus formes. Tera Fire boosts Ogerpon-H's damage meteorically, allowing it to OHKO Pokemon like Zacian, Landorus, and Palkia-O. Ogerpon-H can have issues breaking through Pokemon like bulky Arceus formes and Giratina without Terastalizing, as they can shrug off its coverage moves, so Pokemon that can break through these threats like Palkia-O, Zacian, and Ice Beam Mewtwo are excellent partners. Ogerpon-H's wallbreaking prowess makes it an excellent partner to late-game cleaners like Zacian, Chi-Yu, and Kyurem-W, which appreciate it beating Pokemon like Dondozo, Solgaleo, and Magearna that could otherwise stop their sweep. Ogerpon-H's also cannot hold Heavy-Duty Boots, as it is locked into using Hearthflame Mask, so hazard control from Great Tusk and Giratina is appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 610920, "username": "vesp"}, {"user_id": 626445, "username": "Imperial"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 489963, "username": "Hungry Hungry Hippos"}, {"user_id": 642468, "username": "Finchely"}, {"user_id": 567483, "username": "Bella"}, {"user_id": 587908, "username": "Leo Justice"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Archaludon": {
    "sets": {
      "Rain Sweeper": {
        "description": "<p>Archaludon is an excellent rain sweeper and wallbreaker thanks to the combination of its movepool, typing, and ability allowing it to threaten a large part of the metagame with super effective damage while withstanding a lot of damage thanks to Stamina and Assault Vest. Electro Shot allows Archaludon to increase its Special Attack while in rain and provides valuable coverage against Skarmory and Dondozo, and the combination of Body Press and Stamina allows it to deal damage to specially defensive Pokemon like Blissey and Dialga, which it would otherwise struggle against. Tera Fairy allows Archaludon to resist Fighting-type attacks and gives it a Dragon-type immunity, flipping the matchup against Pokemon like Palkia-O and Zacian. Tera Flying can be used instead, giving it a Ground-type immunity to avoid getting revenge killed by Landorus-I or Great Tusk, although this comes with the significant drawback of making it weak to Stealth Rock. The HP and Defense EVs allow Archaludon to take Close Combat from a +1 Zacian after one layer of Spikes, and 124 Speed EVs allow it to outspeed Palafin. Archaludon requires rain support to be at its fullest potential, which makes Pelipper the ideal partner with its access to Drizzle and U-turn to pivot Archaludon into the game. Strong Water-types like Palafin appreciate Archaludon's ability to defeat walls they struggle with such as Giratina and Toxapex. Archaludon struggles against faster Ground-types like offensive Great Tusk and Landorus, so Flying-types like Corviknight and faster offensive Water-types that can take care of them like Palkia-O and Barraskewda are excellent teammates. Additionally, Fighting-types like Zamzenta-C can give Archaludon trouble, so having Pokemon that can handle these threats like Giratina and Zacian is important. Archaludon is also very weak to hazards, making a hazard remover like Regieleki or Giratina being good teammate.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 587908, "username": "Leo Justice"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 567483, "username": "Bella"}, {"user_id": 610920, "username": "vesp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  }
}