{
  "Charizard": {"sets": [{"name": "Choice Specs"}]},
  "Arcanine": {"sets": [{"name": "Utility"}]},
  "Slowbro": {"sets": [{"name": "Defensive"}]},
  "Cloyster": {"sets": [{"name": "Shell Smash Sweeper"}]},
  "Gengar": {"sets": [{"name": "Choice Specs"}]},
  "Chansey": {"sets": [{"name": "Defensive"}]},
  "Tauros-Paldea-Blaze": {"sets": [{"name": "Physically Defensive"}]},
  "Gyarados": {"sets": [{"name": "Dragon Dance"}]},
  "Ditto": {"sets": [{"name": "Imposter"}]},
  "Dragonite": {
    "sets": [
      {
        "name": "Offensive Dragon Dance",
        "description": "<p>Multiscale combined with solid natural bulk, a high Attack stat, and Dragon Dance enable Dragonite become a deadly set-up sweeper. Extreme Speed is an excellent move for any physical sweeper, due to its high power and initiative over other priority users such as Kingambit. Earthquake provides coverage against bulky foes such as Toxapex, Garganacl, and Clodsire. Fire Punch OHKOes Scizor and 2HKOes physically defensive Corviknight after a Dragon Dance and Stealth Rock. Alternatively, Ice Spinner hits opposing Dragonite, Great Tusk, and Dragapult super effectively, notably OHKOing Dragapult after a Dragon Dance. Heavy-Duty Boots + Roost improves Dragonite's longevity and possibly enables it to retain Multiscale and obtain multiple boosts; preserving Multiscale is particularly useful for surviving Draco Meteor from Timid Choice Specs Dragapult. However, the loss of coverage against targets such as Corviknight and Air Balloon Gholdengo is noticeable. Tera Normal turns Extreme Speed into an incredibly powerful STAB priority move capable of shredding offensive teams after a single boost, and a timely typing change also removes Dragonite's weaknesses to Ice, Fairy, and Dragon, which can buy a free turn to set up. An Adamant nature is preferred since it maximizes the power of Extreme Speed, which often makes makes Speed stats irrelevant, but a Jolly nature can also be used to outspeed the Normal-immune Dragapult after a Dragon Dance, which is especially useful if Dragonite is running Ice Spinner.</p> <p>Offensive Dragon Dance Dragonite regularly serves as a potent win con on offensive teams that can also act as a revenge killer against fast and frail threats. Multiscale Dragonite's considerable bulk, as well as Ghost immunity with Tera Normal provides significant defensive utility for offensive teams. In particular, teams using frail offensive Pokemon such as Iron Valiant appreciate the defensive utility Dragonite brings. In return, these Pokemon can help wallbreak for a late-game Dragonite sweep. Entry hazard support from Great Tusk, Glimmora, and Garchomp is appreciated to weaken Pokemon such as Iron Valiant into range of boosted Extreme Speed. Dual screens support from Grimmsnarl and Shed Tail support from Orthworm are potential options that can supplement Dragonite's already great bulk and virtually guarantee the ability to acquire multiple boosts. Since Dragonite struggles against bulky Unaware users such as Dondozo and Skeledirge, a teammate that can switch into and check these Pokemon, such as Rotom-W, is appreciated. Rotom-W can cripple these physical walls with Trick, gain momentum against them with Volt Switch, and absorb Will-O-Wisp from Skeledirge.</p> "
      },
      {
        "name": "Bulky Dragon Dance",
        "description": "<p>With the combination of its solid natural bulk, valuable typing, reliable recovery in Roost, and Multiscale, Dragonite can accrue multiple Dragon Dance boosts and become a dangerous bulky setup sweeper. It can set up on common Pokemon such as Great Tusk lacking Bulk Up or Ice Spinner, non-Will-O-Wisp Volcarona, and even super effective attacks from Iron Valiant and Choice Specs Dragapult thanks to Multiscale. Extreme Speed alongside Tera Normal lets Dragonite clean up late-game, OHKOing faster threats like Meowscarada and potentially Cinderace at +1. It also outprioritizes Meowscarada's Sucker Punch as well as Grimmsnarl's Prankster-boosted Reflect and Thunder Wave. Earthquake covers Normal-resistant and -immune Pokemon, including foes like Dragapult, non-Air Balloon Gholdengo, Garganacl, and Kingambit. 144 HP EVs allow Dragonite to survive Tera Fairy Iron Valiant's Moonblast at +1 through Multiscale. Aside from strengthening Dragonite's Extreme Speed, Tera Normal sheds off its weaknesses to give it setup opportunities against would-be threats like Dragapult and Hatterene. Heavy-Duty Boots keeps Multiscale intact by ignoring Stealth Rock.</p> <p>Bulky Dragon Dance Dragonite fits well on bulky offense. A defensive backbone consisting of Pokemon like Ting-Lu, Gholdengo, and Corviknight is valuable to check threats like Dragapult and Iron Valiant, which would threaten Dragonite prior to boosting; in return, Dragonite can answer threats like Roaring Moon, Cinderace, and Volcarona for them. Garchomp, Glimmora, and Ting-Lu can reliably set entry hazards, which rack up chip damage onto walls such as Dondozo, Great Tusk, and Garganacl and puts revenge killers like Iron Valiant into guaranteed KO range of +1 Tera Normal Extreme Speed. Wallbreakers such as Breloom and Great Tusk can punch holes early-game and overwhelm Dragonite's checks, such as Corviknight, Dondozo, Skeledirge, and defensive Great Tusk. Moreover, Breloom can incapacitate foes with Spore to give setup opportunities for Dragonite, while Great Tusk can use Knock Off to cripple Corviknight and Dondozo and pop Gholdengo's Air Balloon. Other setup sweepers are great partners; Volcarona can threaten Corviknight, use Tera Steel Rotom-W as setup fodder, and spread burns with Flame Body and Will-O-Wisp against physical attackers such as Iron Valiant, Iron Hands, and Roaring Moon to further support Dragonite.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360720, "username": "ausma"}, {"user_id": 540138, "username": "Milo"}, {"user_id": 197439, "username": "chimp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}, {"user_id": 272785, "username": "nimzowitsch"}]}
  },
  "Azumarill": {"sets": [{"name": "Choice Band"}, {"name": "Assault Vest"}]},
  "Umbreon": {"sets": [{"name": "Specially Defensive"}]},
  "Slowking": {"sets": [{"name": "Specially Defensive"}]},
  "Scizor": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>With a Choice Band, Scizor can efficiently act as a strong offensive pivot and a revenge killer against fast offensive threats. This is achievable with Bullet Punch in tandem with Technician, as it revenge kills Dragonite, Roaring Moon, and Iron Valiant. Bullet Punch can also remove slower threats such as Hatterene and Tera Fairy Kingambit. Close Combat grants Scizor coverage against Pokemon such as Iron Treads, Kingambit, and Garganacl and provides strong neutral coverage against foes like Rotom-W and Corviknight, especially if not running the corresponding coverage move. Thief is a good way for Scizor to deal a good amount of damage against Gholdengo, while Trailblaze can be used to deal with defensive Water-types like Rotom-W lacking Will-O-Wisp and Dondozo. Tera Steel is Scizor's best option for a Tera type, since it not only gives a boost to Scizor's Bullet Punch but also makes Scizor resistant to Stealth Rock. Alternatively, Tera Electric + Tera Blast can be run to hit Flying- and Water-types such as Toxapex, Dondozo, Corviknight, and Tera Flying Kingambit. 20 Speed EVs are run in order for Scizor to outspeed Corviknight.</p> <p>Offensive teams appreciate Scizor's wallbreaking and revenge killing abilities. Scizor gets easily forced out by Great Tusk as well as Fire-types such as Skeledirge, Cinderace, and Volcarona. Therefore, Water-types such as Rotom-W and Azumarill make for good teammates. Rotom-W in particular synergizes well with Scizor, since the two of them can form a potent VoltTurn core. Azumarill also greatly appreciates Scizor pivoting into it. In return, Scizor can check Grass-types they struggle against like Breloom and Meowscarada. Scizor appreciates teammates that allow it to wallbreak much more easily, so entry hazard support from Pokemon like Garchomp are greatly appreciated. Gholdengo is another good teammate, since it can keep hazards on the field for Scizor to exploit in order to sweep late-game. If Scizor isn't running Thief, it can easily be checked by Gholdengo, so Dark-types like Kingambit pair well with Scizor. However, if Scizor is running Thief, it can struggle against Water-types, so Grass-types like Breloom, Meowscarada, and Tera Grass Volcarona make for good teammates. Scizor's lack of longevity means it can struggle with hazards, so hazard removers like Great Tusk, Cinderace, and Corviknight make for good teammates. Most of Scizor's damage output comes from Bullet Punch, so it dislikes Pokemon like Rotom-W, Corviknight, and Gholdengo switching into it. Thus, Pokemon that can counter them such as Meowscarada for the former, as well as Iron Moth for the latter two make for good teammates. Finally, setup sweepers such as Dragapult, Dragonite, and Roaring Moon appreciate Scizor muscling through walls like Garganacl, Tera Fairy Skeledirge, and Ting-Lu. They also appreciate the defensive utility Scizor brings with its ability to check Baxcalibur, Choice-locked Meowscarada, and Calm Mind Iron Valiant.</p> "
      },
      {"name": "Offensive Pivot"},
      {
        "name": "Swords Dance",
        "description": "<p>With Swords Dance, Scizor serves as a deadly wallbreaker and revenge killer for offensive teams. Close Combat is crucial to 2HKO defensive Rotom-W and defensive Great Tusk, as well as blow through Steel-types such as Kingambit, Orthworm, and Iron Treads. Tera Blast paired with Tera Electric has a good chance to 2HKO Dondozo and can OHKO Toxapex, Alomomola, Corviknight, and offensive Gholdengo after a Swords Dance. Tera Electric also removes Scizor's Fire weakness, improving its matchup against Volcarona and Iron Moth, and grants it crucial resistances to Roaring Moon's Acrobatics and Iron Valiant's Thunderbolt. Alternatively, Quick Attack with Tera Normal gives Scizor a tool to pick off offensive Pokemon that resist Bullet Punch, such as Volcarona, Quaquaval, and Greninja. 180 Speed EVs allow Scizor to outspeed defensive Great Tusk and Rotom-W, while 76 HP EVs improve its bulk enough to survive Tera Flying Acrobatics from Roaring Moon.</p> <p>Scizor is best utilized on fast, offensive teams that appreciate its ability to wear down common defensive cores and keep opposing sweepers such as Roaring Moon, Baxcalibur, and Booster Energy Iron Valiant in check. Glimmora and Great Tusk can set entry hazards to help chip Pokemon like Garchomp and defensive Gholdengo into range of Scizor's attacks. Grimmsnarl and Orthworm can ease Scizor's sweep by setting up screens or passing it a Substitute through Shed Tail, respectively, and appreciate falling back on Scizor to handle threats such as Iron Valiant. Special attackers like Iron Moth, Gholdengo, Greninja, and Iron Valiant can deal with the physical walls that check Scizor, such as Dondozo, Skeledirge, and Great Tusk. Scizor's ability to lure Dondozo and take it out with Tera Blast makes it an excellent partner for other physical sweepers that struggle with it, such as Dragonite, Kingambit, and Baxcalibur. Conversely, Breloom is an excellent partner for Quick Attack Scizor that handles Dondozo and appreciates Scizor keeping Volcarona, Iron Moth, and Dragapult in check.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 540138, "username": "Milo"}, {"user_id": 197439, "username": "chimp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 537558, "username": "memesketch"}]}
  },
  "Blissey": {"sets": [{"name": "Defensive"}]},
  "Tyranitar": {"sets": [{"name": "Choice Band"}, {"name": "Defensive"}]},
  "Pelipper": {"sets": [{"name": "Rain Setter"}]},
  "Masquerain": {"sets": [{"name": "Sticky Web"}]},
  "Breloom": {
    "sets": [
      {
        "name": "Focus Sash",
        "description": "<p>A Focus Sash allows Breloom to make full use of Spore's utility and function as a solid lead or early-game wallbreaker. Spore generates free turns that Breloom or a teammate can capitalize on and is especially useful to halt a sweeper that Breloom cannot reliably OHKO, such as Iron Valiant or Volcarona. Bullet Seed hits various defensive Pokemon, such as Clodsire, Dondozo, and Garganacl, for significant damage. Mach Punch lets Breloom revenge kill threats such as Greninja and Roaring Moon and allows it to preserve its Focus Sash by bypassing Kingambit's Sucker Punch. With Tera Fire, Tera Blast lets Breloom lure in and dispatch Gholdengo and Amoonguss, the tier's predominant Spore absorbers. Alternatively, Swords Dance helps Breloom better pressure Pokemon such as Toxapex and Hatterene with Bullet Seed, while Close Combat is another option for faster-paced teams that gives Breloom a greater immediate offensive presence. If Breloom drops Tera Blast, Tera Fighting is ideal to power up Mach Punch and Close Combat, notably allowing +2 Mach Punch to OHKO Cinderace and deal huge damage to Pokemon that resist it such as Iron Valiant and Iron Moth.</p> <p>Reliable forms of entry hazard control, such as Great Tusk and Hatterene, are vital teammates that help preserve Breloom's Focus Sash and give it the flexibility to stop a sweeper or wallbreaker later in the game. Rotom-W, Iron Valiant, and Garganacl all greatly appreciate Tera Fire Breloom's ability to weaken or eliminate Gholdengo and Amoonguss. Dark-types like Ting-Lu, Kingambit, and Hydreigon can check the Ghost-types that are immune to Breloom's Mach Punch, such as Dragapult, and Skeledirge. Powerful sweepers such as Baxcalibur, Nasty Plot Gholdengo, and Roaring Moon can take advantage of Spore granting them free opportunities to set up. Similarly, wallbreakers like Dragapult and Greninja can maximize the free turns generated by Spore to break through defensive threats that trouble Breloom, such as Skeledirge, and Corviknight.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Breloom is a powerful wallbreaker, capable of shredding through physically defensive walls such as Garganacl, Dondozo, and Corviknight. Technician-boosted Bullet Seed hits Water- and Ground-types such as Rotom-W and Great Tusk hard while providing a powerful neutral hit against walls such as Toxapex and Hatterene. Close Combat is Breloom's most consistent wallbreaking tool, OHKOing Garganacl after Stealth Rock and cleanly 2HKOing Corviknight. Mach Punch, in conjunction with Technician, allows Breloom to pick off faster threats such as Greninja, Meowscarada, Roaring Moon, and Baxcalibur. Lastly, Bulldoze OHKOes Gholdengo and 2HKOes Skeledirge, while Spore lets Breloom incapacitate a switch-in and generates opportunities to take down counters later in the battle, and Rock Tomb OHKOes Volcarona while reliably hitting Dragonite and still 2HKOing Skeledirge. Tera Fighting allows Breloom to 2HKO Amoonguss after Stealth Rock with Close Combat and revenge kill threats such as Cinderace from higher health with Mach Punch. Alternatively, Tera Grass turns Bullet Seed into a powerful nuke that can break down common switch-ins like Gholdengo and generally increase its damage output, turning Breloom into a very potent stallbreaker. Tera Fire, on the other hand, gives Breloom the option to use Tera Blast in the final slot, which destroys Gholdengo and Amoonguss and allows Breloom to take a hit from, and OHKO in return, offensive Volcarona.</p> <p>Breloom fits well on bulky offense teams that can give it opportunities to come into play and capitalize on its wallbreaking prowess. Due to Breloom's low defenses and Speed, it appreciates being paired with pivots like Rotom-W and Dragapult that can help it enter battle safely. Ting-Lu and Great Tusk can set entry hazards to help Breloom break through pivots such as Toxapex and Amoonguss. Great Tusk in particular appreciates its tendency to force in Gholdengo and pop its Air Balloon, while teammates such as Garganacl, Toxapex, and Choice Scarf Gholdengo can deal with Breloom's faster offensive checks, such as Dragapult, Volcarona, and Iron Valiant. On more hyper offensive teams, Breloom is best paired with sweepers like Volcarona, Iron Valiant, and Baxcalibur that appreciate its ability to wear down key defensive threats such as Garganacl, Skeledirge, and Gholdengo. On these teams, leads such as Glimmora can set hazards to aid Breloom's wallbreaking capabilities. Kingambit is a fantastic partner that handles Gholdengo and appreciates Breloom putting pressure on Great Tusk.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 540318, "username": "Milo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 537558, "username": "memesketch"}]}
  },
  "Torkoal": {"sets": [{"name": "Defensive"}]},
  "Salamence": {"sets": [{"name": "Dragon Dance"}]},
  "Floatzel": {"sets": [{"name": "Rain Breaker"}]},
  "Gastrodon": {"sets": [{"name": "Specially Defensive"}]},
  "Garchomp": {
    "sets": [
      {
        "name": "TankChomp",
        "description": "<p>Garchomp is a formidable tank that can reliably set multiple layers of entry hazards while still possessing an adequate offensive presence itself. Notably, it matches up well against common spinners like Great Tusk, Iron Treads, and Glimmora, especially as it can punish them from doing so with Rocky Helmet + Rough Skin. This combination is also valuable to spread chip damage onto physical attackers like Kingambit and Dragonite and punish pivots such as Cinderace and Corviknight. Dragon Tail forces out setup sweepers such as Dragonite, Tera Flying Kingambit, Tera Grass Volcarona, and Air Balloon Gholdengo, and it works extremely well to force entry hazard damage onto foes such as Tera Fairy Garganacl, Dondozo, and Iron Valiant. Tera Ghost is used to completely spinblock Great Tusk and Iron Treads. Alternatively, Tera Steel lets it emergency check Dragapult, Meowscarada, and non-Earthquake Baxcalibur and block Glimmora's Mortal Spin, while Tera Water allows it to deal with Gholdengo, Scizor, and Hatterene better.</p> <p>Garchomp fits best on hazard stacking teams that range from bulky offense to offense. Gholdengo is a near-necessary teammate that can prevent most attempts of entry hazard removal, and it can make use of them itself to chip down checks like Tera Water Garganacl, Amoonguss, and Clodsire. Knock Off users like Meowscarada and Great Tusk can remove Heavy-Duty Boots from Pokemon like Amoonguss, Kingambit, and Dragonite to make them susceptible to Garchomp's entry hazards; Great Tusk in particular provides Rapid Spin as well, which removes entry hazards on your side of the field and subsequently maintains your own entry hazards up the opponent's side. Offensive Pokemon like Greninja, Dragapult, Volcarona, and Iron Valiant tend to force multiple switches and enjoy entry hazards chipping down their checks such as Toxapex, Amoonguss, Clodsire, and Garganacl. Substitute Skeledirge is a fantastic teammate that can take advantage of entry hazards itself, use its defensive profile to cover Fairy- and Ice-types like Iron Valiant and Baxcalibur, threaten Defog Corviknight from removing entry hazards, and pressure Hatterene, which would otherwise prevent Garchomp's antics and use it as setup fodder.</p> "
      },
      {
        "name": "ChainChomp (Mixed)",
        "description": "<p>Mixed Garchomp is a fantastic wallbreaker that can threaten common walls such as Great Tusk, Dondozo, Toxapex, and Clodsire. Draco Meteor hits physical walls. Great Tusk and Dondozo in particular are hit hard by Draco Meteor, with Great Tusk pressured while switching in to remove entry hazards and Dondozo's Unaware letting Garchomp freely use Draco Meteor multiple times on it. Fire Blast covers Steel-type Pokemon such as Corviknight and Air Balloon Gholdengo, the former of which would otherwise switch into Garchomp and clear entry hazards. Stealth Rock is generally preferred if a team does not have another Stealth Rock user, but Spikes can be used to capitalize on the switches that Garchomp forces. A Rash nature makes Garchomp much harder to switch into, even letting it OHKO defensive Great Tusk after one layer of Spikes, but Naive can be used to outspeed Hydreigon, offensive Volcarona, and Speed tie opposing Garchomp. Tera Fire is the preferred Tera type, due to it powering up Garchomp's Fire Blast and providing it a resistance to attacks such as Baxcalibur's Ice Shard, Iron Valiant's Moonblast, and Hatterene's Draining Kiss, as well as an immunity to Will-O-Wisp from Volcarona, Dragapult, and Skeledirge. Tera Steel similarly flips Garchomp's type matchup, providing it with a useful Dragon and Fairy resistance while maintaining its Stealth Rock resistance.</p> <p>Garchomp fits on offensive teams thanks to its ability to set entry hazards and wear down common defensive Pokemon, such as Toxapex, Clodsire, and Dondozo, with Life Orb-boosted attacks while keeping entry hazards up against common hazard removers such as Great Tusk and Corviknight. Sweepers such as Volcarona, Kingambit, Dragon Dance Dragapult, Calm Mind Iron Valiant, Iron Moth, Baxcalibur, and Bulk Up Great Tusk appreciate Garchomp breaking holes in the opposing team early-game. Volcarona in particular is a fantastic option, as it soft checks Iron Valiant, spreads status with Will-O-Wisp + Flame Body to prevent being revenge killed by Dragonite and Kingambit, and appreciates Garchomp breaking through Dondozo, Clodsire, and Toxapex for it. Garchomp is forced out by Fairy-types such as Iron Valiant and Tera Fairy Garganacl, as well as Dragon-types such as Choice Band Baxcalibur, Dragapult, and Roaring Moon without using Terastallization, so support from Steel-type partners is appreciated to switch into these Pokemon. Kingambit is another good partner because it takes on Dragapult and appreciates Garchomp wearing down Great Tusk and Dondozo. Hatterene and Tera Fairy Skeledirge can also take on these Dragon-types while spreading further passive damage with Magic Bounce or Will-O-Wisp. Garchomp can also form a hazard stacking core with lead Meowscarada or other Stealth Rock users such as Great Tusk and Ting-Lu, and Garchomp can pressure common Rapid Spin users. Gholdengo is a great partner for Garchomp, since it blocks most forms of hazard removal while appreciating Garchomp soft checking Volcarona and Iron Moth. Garchomp is also prone to being worn down quickly thanks to Life Orb recoil, entry hazards, and being prediction reliant, so teammates that can clear hazards are appreciated. These include Corviknight, Great Tusk, and Iron Treads, which all appreciate Garchomp wearing down their common switch-ins such as opposing Great Tusk and Rotom-W.</p> "
      },
      {
        "name": "Swords Dance",
        "description": "<p>Garchomp makes for a powerful physical wallbreaker with Swords Dance, using its Attack boosts to ensure OHKOs against a number of foes in the metagame. Garchomp’s incredible STAB combination of Dragon / Ground can annihilate most walls and defensive cores at +2, with Earthquake reliably knocking out bulky Pokemon like Toxapex, Kingambit, defensive Gholdengo, and Garganacl, and Dragon Claw hitting a vast majority of foes that resist Earthquake, such as Rotom-W and Breloom. Dragon Claw is preferred to Outrage, as it doesn’t provide free switch-in opportunities to prominent Fairy-types such as Iron Valiant and Hatterene. Substitute is essential for letting Garchomp block incoming status, especially from foes it cannot always OHKO, such as Skeledirge, non-Foul Play Amoonguss, and Rotom-W. Substitute can be set up on a forced switch to ensure Garchomp gets a chance to use Swords Dance, and can be set up for free against U-turns from slow pivots like Corviknight. Leftovers allows Garchomp to heal off Substitute damage, giving it more chances to use it. With Rough Skin, Garchomp punishes Great Tusk using Rapid Spin and U-turn from pivots like Cinderace. Tera Ground allows Garchomp to hit much harder with Earthquake, giving it the extra power to OHKO Hatterene, Garganacl after Stealth Rock chip, and potentially Amoonguss and offensive Great Tusk sets at +2. Alternatively, Tera Steel is a more defensive option used to resist Iron Valiant's Moonblast and Dragapult's Draco Meteor, the latter being very important, as Infiltrator allows it to bypass Garchomp’s Substitute.</p> <p>Garchomp is a solid wallbreaker on balance and bulky offense teams, due to its power complemented by defensive utility from Substitute, Leftovers, and decent bulk that gives it opportunities for consistent use throughout a battle. Garchomp mainly struggles against Corviknight, as well as exceptionally bulky physical walls such as Dondozo and Great Tusk. Special wallbreakers like Greninja, Iron Valiant, and Iron Moth threaten these walls to Garchomp and therefore make excellent partners. Dragapult can also provide much-needed special offense while pressuring Dondozo and Corviknight with Draco Meteor and Flamethrower, forming a dangerous Dragon-type spam core with Garchomp and providing speed control that Garchomp cannot, especially against foes like Iron Valiant and Greninja. Additionally, Dragapult can use U-turn to scout a forced switch and safely bring Garchomp into battle against foes like Clodsire and Kingambit. Entry hazard setters like Great Tusk, Ting-Lu, and Glimmora are great partners, as they allow Garchomp to secure KOs against opponents like Tera Fairy Garganacl and Amoonguss, which it otherwise cannot OHKO at +2. Glimmora and Great Tusk are especially good for this role, as they can both remove hazards that hinder Garchomp’s wallbreaking potential, and the latter can cripple Corviknight by removing its Leftovers with Knock Off. Fast sweepers, such as Roaring Moon, Iron Valiant, and Dragapult, can easily revenge kill Garchomp, especially when its Substitute is down. A defensive backbone made up of Pokemon like Clodsire and Corviknight is essential for Garchomp’s team. Lastly, Garchomp gives great support to late-game and sweepers like Volcarona and Dragapult that appreciate foes like defensive Gholdengo, Toxapex, and Clodsire being removed.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 487308, "username": "BT89"}, {"user_id": 540138, "username": "Milo"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 493260, "username": "royalfuxh"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}, {"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}, {"user_id": 595062, "username": "Takatk"}, {"user_id": 619748, "username": "BreloomBuddy"}]}
  },
  "Hippowdon": {"sets": [{"name": "Specially Defensive"}]},
  "Magnezone": {"sets": [{"name": "Choice Specs"}]},
  "Gallade": {"sets": [{"name": "Swords Dance"}]},
  "Rotom-Heat": {"sets": [{"name": "Specially Defensive Pivot"}]},
  "Rotom-Wash": {
    "sets": [
      {"name": "Defensive Pivot"},
      {
        "name": "Trick",
        "description": "<p>Equipped with a Choice Scarf, Rotom-W provides excellent utility as a fast pivot thanks to its Volt Switch, devastating status moves, and high-Base Power STAB move in Hydro Pump. Volt Switch keeps up momentum during the game, and it can super effectively hit Corviknight, Dondozo, Toxapex, and Greninja, which Rotom-W now outspeeds thanks to its Choice Scarf. Hydro Pump is the strongest move it has, meaningfully hurting a wide range of Pokemon, and it punishes Ground-types such as Greak Tusk, Clodsire, and Garchomp that attempt to block Volt Switch. Rotom-W can outspeed the entire unboosted metagame with its Choice Scarf, allowing it to reliably hit Cinderace, Iron Moth, and Garganacl. Trick is essential to cripple walls that can recover from Rotom-W's attacks, like Toxapex and Tera Fairy Garganacl. Thunder Wave can be used to cripple threats such as Dragapult, Iron Moth, Volcarona, and Baxcalibur, especially since Choice Scarf Rotom-W outspeeds them. Will-O-Wisp is just as useful as Thunder Wave, disarming physical threats like Roaring Moon, Dragonite, Breloom, and Meowscarada. Tera Steel gives Rotom-W an immunity to Toxic from Clodsire and Toxapex, as well as a resistance to Meowscarada's Flower Trick, Breloom's Bullet Seed, Iron Valiant's Moonblast, and Dragonite's Extreme Speed. On top of this, Levitate makes Steel's Ground weakness into an immunity; notably, EdgeQuake can't hit Tera Steel Rotom-W neutrally. Alternatively, Tera Water takes a more offensive approach, boosting the power of Hydro Pump to 2HKO Gholdengo, and it can potentially OHKO physically defensive Garganacl and Clodsire.</p> <p>Rotom-W sits comfortably on balance and bulky offense teams. It pairs well with defensive Pokemon such as Corviknight, Toxapex, and Amoonguss, which use their Grass resistances and/or recovery to sponge hits like Breloom's Bullet Seed, Meowscarada's Flower Trick, and Ting-Lu's Ruination. Rotom-W pressures entry hazard removers like Great Tusk, Iron Treads, Corviknight, and Cinderace, which helps hazard setters. Great Tusk is a great example, since it also removes hazards to ease Rotom-W's pivoting. More offensive partners like Iron Valiant, Cinderace, and Dragapult love Rotom-W crippling bothersome walls like Ting-Lu and Amoonguss with Trick. In turn, they can effectively check Breloom, Meowscarada, Choice Specs Iron Valiant, Gholdengo, and Choice Specs Dragapult, which can all cause trouble for Rotom-W. When Rotom-W pivots against Corviknight, Dondozo, Toxapex, and Greninja as they switch out, frail attackers such as Meowscarada, Cinderace, and Iron Valiant can safely come in to pressure the incoming Amoonguss, opposing Rotom-W, and Gholdengo.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 493260, "username": "royalfluxh"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 540318, "username": "Milo"}]}
  },
  "Amoonguss": {
    "sets": [
      {
        "name": "Spore",
        "description": "<p>Amoonguss is the tier's sole defensive user of Spore, as it can stick around and put foes to sleep throughout a match. Giga Drain affords Amoonguss extra longevity, which is particularly helpful because Regenerator often cannot keep up with the damage that Amoonguss takes. However, Grass Knot hits foes like Dondozo, Garganacl, and Ting-Lu harder. Clear Smog removes the boosts of setup sweepers like Dragonite, Dragon Dance Dragapult, and Bulk Up Great Tusk. Foul Play, on the other hand, gives Amoonguss a way to pressure Dragapult immediately while still punishing physical setup sweepers. Rocky Helmet lets Amoonguss punish U-turn users like Meowscarada and Scizor, but Covert Cloak is a valid option to check Garganacl more easily. Tera Water Amoonguss checks Cinderace and Baxcalibur, while Tera Fire Amoonguss can use Clear Smog safely on Tera Grass Volcarona and Tera Fire Breloom at the cost of becoming weak to Ground-types like Great Tusk. Maximum HP investment with 84 Special Defense EVs prevents a 2HKO from Choice Specs Dragapult's Shadow Ball; the rest of the investment is poured in Defense to better check Great Tusk.</p> <p>Amoonguss is best utilized on balance teams that appreciate it taking a foe out of commission with Spore. Gholdengo and Dragapult greatly appreciate this as well as Amoonguss's ability to check Ting-Lu. Cinderace and Kingambit are other good offensive teammates that appreciate Amoonguss threatening Dondozo. Because Amoonguss relies mostly on Regenerator for its recovery, entry hazard removal in the form of Great Tusk or Iron Treads is key; Great Tusk also checks Cinderace, while Iron Treads can help deal with Gholdengo. Even though Amoonguss has the ability to check some setup sweepers with Clear Smog, it is best to pair it with an Unaware teammate like Skeledirge or Dondozo, which can handle Pokemon like Tera Flying Roaring Moon and Baxcalibur much more effectively. Pokemon like Dragonite and Choice Band Roaring Moon also make for good partners, as Amoonguss is one of the best Iron Valiant checks.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 540318, "username": "Milo"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 548068, "username": "SetsuSetsuna"}]}, {"name": "Grammar checked by", "members": [{"user_id": 331519, "username": "CryoGyro"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Alomomola": {"sets": [{"name": "Defensive"}]},
  "Haxorus": {"sets": [{"name": "Swords Dance"}]},
  "Hydreigon": {"sets": [{"name": "Nasty Plot"}]},
  "Volcarona": {
    "sets": [
      {"name": "Bulky Quiver Dance"},
      {
        "name": "Offensive Quiver Dance",
        "description": "<p>Offensive Volcarona is an extremely threatening late-game sweeper due to its access to Quiver Dance alongside its powerful STAB moves, great offensive coverage, and excellent utilization of Terastallization both defensively and offensively to dramatically limit its counterplay. Flamethrower is a strong, consistent STAB move with more PP than Fiery Dance that can always OHKO offensive Great Tusk after a Quiver Dance, but Fiery Dance can allow Volcarona to quickly snowball should it accrue additional boosts with it. Bug Buzz is a similarly consistent attack that hits Ting-Lu and Roaring Moon super effectively and offers strong neutral coverage against threats like Garchomp and Dondozo. Bug Buzz also bypasses opposing Substitutes, which improves its matchup against teams that rely on Orthworm's Shed Tail. Giga Drain grants Volcarona some additional longevity and allows it to hit Water-types like Dondozo, Azumarill, and Quaquaval very hard. Tera Blast offers powerful, diverse coverage depending on Volcarona's choice of Tera type. Substitute is worth considering to block status effects from the likes of Toxapex and Nuzzle Hatterene, prevent revenge killing attempts, and ease setup opportunities, especially against teams featuring Sucker Punch users like Kingambit and Meowscarada. Moreover, Substitute alongside Giga Drain and Tera Grass allows Volcarona to reliably beat Clodsire one-on-one, as Clodsire cannot break Volcarona's Substitute with a single Earthquake and Giga Drain outheals damage taken from Substitute. Heavy-Duty Boots is almost mandatory to run on Volcarona, as the item removes its otherwise-crippling weakness to all forms of entry hazards, especially Stealth Rock. Flame Body improves Volcarona's defensive utility by deterring contact moves from Meowscarada, Great Tusk, and Kingambit. Tera Ground grants Volcarona an Electric immunity and turns its crippling Rock weakness into a resistance while giving Volcarona's Tera Blast Ground-type coverage to deal with Toxapex, Clodsire, and opposing Fire-types like Iron Moth, Skeledirge, and Tera Fire Kingambit. Alternatively, Tera Fairy provides a Dragon immunity and an overall strong defensive typing and allows Volcarona's Tera Blast to threaten Dragon-types like Baxcalibur, Dragapult, Dragonite, and Garchomp as well as Fighting-types like Quaquaval and Iron Hands. If it opts to drop Tera Blast or Substitute and Giga Drain, Volcarona can utilize many other Tera types: Tera Fire or Bug to strengthen its existing STAB moves, Tera Psychic alongside Psychic to enable maximum damage against Toxapex and Fighting-types and offer a significant chance to 2HKO Clodsire, Tera Steel for an immunity to Poison and a generally strong defensive profile, and even Tera Rock alongside Tera Blast to lure in and eliminate opposing Volcarona while still hitting Iron Moth, Skeledirge, and Dragonite super effectively.</p> <p>Volcarona is a very powerful win condition for offensive teams and greatly appreciates any sort of support that helps facilitate its sweep. Offensive Great Tusk, Garchomp, and Glimmora are fantastic teammates for Volcarona. Great Tusk and Garchomp provide entry hazard support and can wear down checks like Garganacl and Clodsire, while Glimmora trades immediate power for the ability to stack multiple entry hazards. Lead Meowscarada also makes for an effective teammate due to its ability to reliably set up Spikes while disrupting passive threats like Toxapex and Clodsire, drastically limiting Grimmsnarl leads, and preventing setup from offensive staples like Dragonite, Kingambit, and opposing Volcarona with its fast Taunt. In return, Volcarona can threaten Corviknight, preventing its Defog from removing entry hazards. Volcarona greatly appreciates dual screens support from Grimmsnarl and Shed Tail support from Orthworm to open up more setup opportunities. Orthworm in particular completely walls Clodsire, turning it into free opportunities to use Shed Tail. Iron Valiant, Choice Band Breloom, and Choice Band Dragapult can help wear down or remove walls like Clodsire, specially defensive Skeledirge, and Garganacl, allowing Volcarona to more easily finish the job against them or to sweep outright. Volcarona is very limited by its moveslots and therefore appreciates teammates that provide the coverage Volcarona itself cannot always run; Tera Fairy Volcarona appreciates strong Ground-type attacks from Great Tusk and Garchomp to remove Clodsire, Skeledirge, and Toxapex, while Tera Grass and Tera Ground Volcarona appreciate Choice Band Dragapult's ability to pressure Dragon-types like Dragonite and Garchomp, as well as opposing Volcarona, with Dragon Darts. Other sweepers like Kingambit and Tera Normal Dragonite are effective teammates for offensive Volcarona, as they can use their great bulk and powerful priority to beat strong physical attackers like Dragapult, Baxcalibur, and Cinderace that Volcarona itself may not be able to set up against or eliminate. In cases where Volcarona itself cannot sweep, it can still use its power and coverage to enable another teammate's sweep. For example, Iron Valiant appreciates Tera Ground and Tera Psychic Volcarona's ability to wear down or eliminate Toxapex and Clodsire, allowing it to more freely spam its powerful Moonblast late-game, while Dragonite appreciates Volcarona's ability to deal with Corviknight.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 540138, "username": "Milo"}, {"user_id": 493260, "username": "royalfluxh"}, {"user_id": 384270, "username": "autumn"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 408271, "username": "Dreadfury"}]}
  },
  "Talonflame": {"sets": [{"name": "Defensive Utility"}]},
  "Sylveon": {"sets": [{"name": "Specially Defensive Calm Mind"}]},
  "Hawlucha": {"sets": [{"name": "Unburden Sweeper"}]},
  "Klefki": {"sets": [{"name": "Trick Room Setter"}]},
  "Avalugg": {"sets": [{"name": "Defensive"}]},
  "Toxapex": {
    "sets": [
      {
        "name": "The Pex",
        "description": "<p>With a valuable defensive profile and remarkable longevity, Toxapex cements itself as a very sturdy mixed wall and defensive pivot. It can switch into and counter Pokemon like Volcarona, Cinderace, and Greninja, scout for Choice item users like Dragapult, Breloom, and Iron Valiant, and absorb Toxic Spikes from Glimmora and opposing Toxapex. Surf forces damage onto Toxic-immune foes such as Gholdengo, Garganacl, Iron Moth, and Kingambit. Toxic shuts down Pokemon such as Dragonite, Volcarona, Baxcalibur, Skeledirge, and Rotom-W, and if Toxapex should run Toxic Spikes, it matches up well against offensive teams that contain setup sweepers such as Roaring Moon, Iron Valiant, and Great Tusk. Any attempts of boosting past Toxapex gets shut down easily by Haze, which combined with poison damage prevents Toxapex from being used as setup fodder by Pokemon such as Substitute Baxcalibur and Calm Mind Hatterene. Covert Cloak is an option to ignore Garganacl's Salt Cure, Dragapult and Gholdengo's Shadow Ball drops, and Greninja's Dark Pulse flinches, but Leftovers's longevity reduces Toxapex's reliance on Recover, and it is used over Black Sludge in case Toxapex decides to Terastallize. Tera Steel improves Toxapex's matchup against non-Earthquake Roaring Moon and Meowscarada while still maintaining an immunity to poison. Alternatively, Tera Fairy fares better against Dragapult, Great Tusk, Garganacl, and Choice Band Roaring Moon. The given EVs allow Toxapex to survive two Choice Band Meowscarada's Flower Trick from full health.</p> <p>Toxapex fits nicely on balance and bulky offense teams that appreciate a sturdy defensive backbone. Teammates like Corviknight, Ting-Lu, and Garganacl are terrific defensive partners that covers Pokemon such as Great Tusk, Choice Specs Dragapult, and Tera Electric Iron Valiant, respectively. Corviknight and Great Tusk in particular provide a backup check to multiple combinations of physical attackers like Roaring Moon, Dragonite, and Kingambit that attempt to overwhelm Toxapex. They also remove entry hazards, which would mitigate Toxapex's Regenerator and force it to use Recover more often; in return, Toxapex covers Pokemon such as Cinderace for the former and Greninja for the latter. Bulky setup sweepers like Garganacl, Skeledirge, and Gholdengo can take advantage of Toxic Spikes slowly chipping down checks such as Dondozo, Ting-Lu, and Great Tusk. Particularly, Skeledirge and Gholdengo can make use of Hex easily to take advantage of Toxapex spreading poison, as well as threaten Hatterene, which can block Toxapex's Toxic Spikes and use non-Haze variants as setup fodder. Offensive partners like Dragapult, Iron Valiant, and Kingambit compensate for Toxapex's overall passivity; in return, they appreciate Toxapex switching into their revenge killers such as Choice Scarf Gholdengo, Scizor, and Iron Valiant, respectively.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 540138, "username": "Milo"}, {"user_id": 197439, "username": "chimp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}]}
  },
  "Mimikyu": {"sets": [{"name": "Swords Dance"}]},
  "Cinderace": {
    "sets": [
      {
        "name": "Offensive Pivot",
        "description": "<p>Cinderace is a good offensive pivot thanks to its high Speed, decent Attack, and wide coverage that gains a STAB boost thanks to Libero each time it enters the field. Pyro Ball is its most reliable move, as it can hit hard while preserving Libero. Sucker Punch gives Cinderace a means to hit faster Pokemon such as Choice Scarf Gholdengo and Dragapult super effectively. Alternatively, Gunk Shot can be run to OHKO Iron Valiant and Hatterene while preserving the team's ability to Terastallize. Court Change is an extremely useful move, as it can provide hazard control that is unaffected by Gholdengo's Good as Gold while also stealing Light Screen and Reflect from hyper offensive teams; however, Cinderace can choose to run High Jump Kick instead to hit Dark-types such as Roaring Moon and Ting-Lu harder as well as inflicting more damage against Pokemon that resist Pyro Ball like Garchomp and Garganacl. Tera Fire is the Tera type that Cinderace wants to utilize in order to maximize Pyro Ball's damage, giving it the ability to OHKO Volcarona, and, with an Adamant nature, Corviknight after Stealth Rock. It also helps Cinderace hit bulkier targets like Hatterene and offensive Great Tusk, especially if it isn't running Gunk Shot or High Jump Kick. A Jolly nature is preferred to augment Cinderace's role as a fast pivot, allowing it to outspeed Iron Valiant, Iron Moth, and Iron Treads. However, an Adamant nature can be run instead to increase its damage output.</p> <p>Cinderace works best on balance and bulky offense teams, providing utility and entry hazard control while simultaneously exerting offensive pressure. Defensive Water-type Pokemon like Toxapex, Rotom-W, and Dondozo can all sponge Water-type attacks while taking neutral damage from Rock- and Ground-type moves, with the exception of Toxapex. In turn, Cinderace can match up well against wallbreakers such as Dragapult, Iron Valiant and Meowscarada, which can all cause difficulties for the aforementioned Water-types. Ground-types that provide entry hazard support such as Garchomp, Great Tusk, and Ting-Lu make it easier for Cinderace to check threats with Stealth Rock and Spikes, especially if it is running an Adamant nature. Dragapult, Gholdengo, and Iron Valiant pair well with Cinderace, as they can eradicate foes that wall it such as Great Tusk, Dondozo, and Rotom-W. Similarly, Dragonite and Kingambit can check Pokemon such as Hatterene and Skeledirge, which can both cause issues for Cinderace. In return, Cinderace can provide hazard control for all of these partners and help them come in the field more safely without having to worry about chip damage from entry hazards.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 487308, "username": "BT89"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "lumari"}]}], "writtenBy": [{"user_id": 540318, "username": "Milo"}]}
  },
  "Corviknight": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Physically defensive Corviknight is a fantastic check to dangerous attackers like Garchomp, Roaring Moon, and Dragonite an effective slow pivot; and one of the few viable entry hazard removers. The choice between Brave Bird and Body Press comes down to team need; Brave Bird nails Great Tusk and has no immunities, while Body Press is Corviknight's best option against Kingambit and Chien-Pao. Leftovers is the preferred item to provide extra longevity, but Rocky Helmet can further punish physical attackers, especially on weak hits like Scizor's and Meowscarada's U-turn. Tera Water serves as an emergency check to dangerous Fire-types like Cinderace, while Tera Ground surprises Iron Hands.</p> <p>Corviknight is a fantastic slow pivot, making it a great partner for frail-but-powerful teammates like Chien-Pao and Iron Valiant. It is also one of the few viable Defoggers, allowing it to partner up with teammates like Dragonite, Chien-Pao, and Volcarona that loathe Stealth Rock. Be warned, Corviknight is utterly unable to Defog against Gholdengo, so secondary entry hazard removal like Great Tusk and a reliable switch-in like Ting-Lu are recommended. Corviknight is unable to handle powerful physical Fire-types like Cinderace and Ceruledge and Electric-types like Iron Hands. Teammates that can cover these weaknesses like Dondozo and Great Tusk are wonderful partners. Its middling special bulk makes teammates like Slowking and Ting-Lu valuable. Slowking has the added benefit of being another slow pivot as well, while Ting-Lu forms a strong entry hazard core with Corviknight and threatens Gholdengo.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 349443, "username": "Tysonslayer"}, {"user_id": 487308, "username": "BT89"}]}, {"name": "Grammar checked by", "members": [{"user_id": 168392, "username": "P Squared"}]}], "writtenBy": [{"user_id": 523866, "username": "UT"}]}
  },
  "Barraskewda": {"sets": [{"name": "Rain Sweeper"}]},
  "Polteageist": {"sets": [{"name": "Shell Smash"}]},
  "Hatterene": {
    "sets": [
      {
        "name": "Calm Mind",
        "description": "<p>Calm Mind Hatterene is an excellent option on balance teams to deny entry hazards from being set up. With Magic Bounce, it can switch into and reflect entry hazards from Pokemon such as Great Tusk, Ting-Lu, and Blissey. From there, it can begin setting up Calm Mind to pose a greater threat itself and overwhelm the opponent's defensive answers to it. Draining Kiss acts as pseudo-recovery and can help Hatterene heal off damage it's taken from Pokemon such as Ting-Lu and Great Tusk. Psyshock allows Hatterene to deal high damage to special walls such as Blissey and Clodsire and win potential setup wars against other Hatterene and Volcarona. Stored Power fulfills a similar role to Psyshock in enabling Hatterene to break through special walls and other Calm Mind users and can also help Hatterene defeat various Unaware Pokemon such as Skeledirge and Dondozo, but it requires Hatterene to set up multiple Calm Minds before it becomes truly potent. Mystical Fire deals high damage to many of Hatterene's common switch-ins such as Gholdengo, Corviknight, and Kingambit and has the nice bonus of lowering the target's Special Attack, which is particularly useful against Gholdengo that aren't running Covert Cloak. Nuzzle is another option to cripple switch-ins with paralysis, which can act as useful speed control for Hatterene's teammates. Tera Water nullifies all of Hatterene's weaknesses, which can grant it more opportunities to use Calm Mind against its checks such as Gholdengo, while Tera Fire can similarly neutralize all of Hatterene's weaknesses and comes with additional benefits such as boosting the damage of its Mystical Fire and letting it check Iron Valiant and Volcarona better. However, Tera Fire also comes with notable downsides, namely giving Hatterene a weakness to Ground-type moves and Stealth Rock, which can hinder its matchups against common entry hazard setters. The EV spread allows Hatterene to move reliably switch into physical attacks from common entry hazard setters while also outspeeding Toxapex and Garganacl.</p> <p>Hatterene's ability to discourage the use of entry hazards will be appreciated by almost any team. Pokemon vulnerable to entry hazards and those that frequently pivot in and out of battle such as Meowscarada, Gholdengo, Garganacl, and Dragapult enjoy Hatterene's support. Entry hazard removers such as Great Tusk and Corviknight are also good partners, as Hatterene's presence can ease the burden placed on them to remove entry hazards and grants the team greater flexibility in dealing with entry hazard setters. Furthermore, while Hatterene can switch into entry hazard setters such as Ting-Lu and Great Tusk, it can be worn down quickly from their repeated Ground-type attacks. Great Tusk and Corviknight can reduce Hatterene's need to switch in as often by acting as alternative switch-ins. Due to relying on Leftovers and Draining Kiss for recovery, Hatterene can struggle to stay healthy, particularly if it loses its Leftovers to Knock Off or is hit by Salt Cure, so it is recommended to have teammates that can switch into these moves. Corviknight can switch into Knock Off from hazard setters such as Meowscarada and Great Tusk, while Covert Cloak Gholdengo can neutralize Salt Cure. Pokemon holding Rocky Helmet such as Corviknight can be troublesome for Hatterene, as they will wear Hatterene down when it uses Nuzzle or Draining Kiss. Covert Cloak users, especially Gholdengo, are similarly irritating for Hatterene due to nullifying the secondary effect of its Nuzzle or Mystical Fire. Knock Off support from Meowscarada, Great Tusk, and Iron Valiant is thus appreciated to remove these items from the opponent's Pokemon. Hatterene's weakness to Steel- and Ghost-type attacks can be exploited by strong attackers such as Gholdengo, Dragapult, and Kingambit. Kingambit and Tera Water Garganacl can reliably switch into Gholdengo and Dragapult, while Great Tusk and Dondozo can counter Kingambit.</p> "
      },
      {"name": "Healing Wish"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 260369, "username": "TPP"}, {"user_id": 197439, "username": "chimp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 177111, "username": "Magcargo"}]}
  },
  "Grimmsnarl": {"sets": [{"name": "Dual Screens"}]},
  "Pincurchin": {"sets": [{"name": "Terrain Setter"}]},
  "Indeedee": {"sets": [{"name": "Choice Scarf"}, {"name": "Terrain Setter"}]},
  "Dragapult": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Possessing OU's highest unboosted Speed tier makes Choice Specs Dragapult a very remarkable special wallbreaker, revenge killer, and offensive pivot. It outspeeds and threatens common offensive threats like Cinderace, Iron Moth, and even boosted foes like Adamant Dragonite after a Dragon Dance. Moreover, it's immune or resistant to common priority attacks like the aforementioned Dragonite's Extreme Speed, Breloom's Mach Punch, and Slither Wing's First Impression, which makes it much harder to revenge kill. It is also able to switch into and check Rotom-W. A coverage move in either Flamethrower or Thunder lets Dragapult nail Corviknight, with the former also hitting other Steel-types like Kingambit and Iron Treads, while the latter pressures Toxapex and Tera Water Garganacl. Infiltrator allows Dragapult to bypass Grimmsnarl's dual screens, Orthworm's Shed Tail, and Substitute users like Gholdengo, which gives it an edge against hyper offense teams. Tera Ghost maintains an immunity to Dragonite's Extreme Speed and strengthens Shadow Ball—its most spammable attack—notably guaranteeing the 2HKO on Corviknight and Assault Vest Iron Treads after Terastallizing. Tera Fairy prevents Dragapult from being picked off by opposing Dragapult and Sucker Punch from Kingambit and Meowscarada. Finally, Tera Dragon turns Draco Meteor into an even more powerful nuke. This takes advantage of the lack of prominent bulky Steel- and Fairy-types in the metagame, notably chunking answers to Ghost-types like Purifying Salt Garganacl and Ting-Lu and 2HKOing Unaware Clodsire.</p> <p>Choice Specs Dragapult fits perfectly on bulky offense and VoltTurn teams. Physical wallbreakers like Great Tusk appreciate Dragapult's U-turn bringing them in safely, and they are able to pressure its switch-ins like Clodsire, Ting-Lu, Blissey, and Garganacl. Entry hazard removers like Corviknight and Great Tusk allow Dragapult to pivot throughout the game unperturbed; the former can also pivot it in safely via U-turn, letting it threaten Gholdengo, which tends to switch into Corviknight to block its Defog. Furthermore, Corviknight and Great Tusk provide the necessary defensive backbone to switch into boosted threats such as Roaring Moon, as well as revenge kill attempts from Sucker Punch users like Kingambit. Gholdengo forms a Ghost spam core with Dragapult, as it can overwhelm a shared check in Ting-Lu, use non-Calm Mind Blissey as setup fodder, and either cripple Tera Water Garganacl with Trick or straight up dent Tera Fairy variants. Entry hazards from Ting-Lu, Garchomp, and Garganacl can quickly put foes into Dragapult's KO range, especially as it tends to force a lot of switches; in return, Dragapult spinblocks foes like Great Tusk and Iron Treads in a pinch. Setup sweepers like Volcarona and Iron Valiant appreciate Dragapult wallbreaking early-game for them to clean up late-game easily.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Dragapult utilizes its near-unresisted STAB moves, its blistering Speed stat, and its excellent Attack stat to function as a strong physical wallbreaker. The choice for the second move depends on what Tera type Dragapult chooses. Tera Dragon Dragapult uses Phantom Force for a Ghost-type STAB move, but Tera Ghost uses Tera Blast, since, unlike Phantom Force, it is not a two-turn move. Sucker Punch allows Dragapult to revenge kill weakened sweepers such as opposing Dragapult, as well as Iron Moth and Tera Flying Roaring Moon after some chip damage. However, be careful when using Sucker Punch, since opponents can predict it and set up. An Adamant nature gives Dragapult extra wallbreaking power. Alternatively, a Jolly nature allows Dragapult to outspeed the entirety of the unboosted metagame. With Tera Dragon, Dragapult's Dragon Darts becomes harder to switch into; it 2HKOes walls Dragapult normally struggles with such as Ting-Lu. Tera Dragon Dragapult is also less susceptible to Sucker Punch, albeit at the cost of losing its immunity to Dragonite's Extreme Speed.</p> <p>Iron Valiant is a fantastic partner, since it's able to check Dark-types such as Kingambit and Ting-Lu. Hazard removal from Pokemon like Great Tusk, Cinderace, and Corviknight make for good partners, since Dragapult's lack of longevity makes it difficult to switch in when hazards are up. Great Tusk and Corviknight are able to beat both Scizor and opposing Great Tusk, while Cinderace can threaten bulky Steel-types such as Corviknight. Dragapult benefits from entry hazards from the likes of Great Tusk, Ting-Lu, and Garganacl, since it can more effectively wallbreak with entry hazards up. Other pivots such as Scizor and Rotom-W appreciate that Dragapult's U-turn can bring them in. In return, Scizor can revenge kill Ice-types such as Naxcalibur, while Rotom-W can check both Corviknight and defensive Great Tusk. Paralysis support from Rotom-W can shutdown offensive Pokemon like opposing Dragapult and Roaring Moon. Lastly, Gholdengo makes for a good teammate, since it can spinblock and deny Defog and can help Dragapult overwhelm shared checks like Kingambit and Ting-Lu.</p> "
      },
      {
        "name": "Utility",
        "description": "<p>Unlike its more offensively oriented Choice item sets, this Dragapult set goes for a more multifunctional approach. Dragapult's unmatched Speed tier, in conjunction with STAB Dragon Darts, allows it to snipe key offensive threats such as Roaring Moon, Iron Moth, and Cinderace with some prior chip damage. This often means that Dragapult will force a lot of switches which can be capitalized on with Will-O-Wisp to spread status and power up Hex. Will-O-Wisp also allows Dragapult to avoid Sucker Punch, which can come in handy against Cinderace, Kingambit, and Meowscarada. With a burn and Stealth Rock up, Hex 2HKOs Defensive Corviknight, Amoonguss, and Dondozo, allowing Dragapult to pick apart balanced cores. U-turn rounds out the set, letting Dragapult keep momentum up even against hard counters like Ting-Lu and Garganacl. Alternatively, Substitute can be run to improve Dragapult's matchup against Sucker Punch users and enable it to avoid Salt Cure damage. 252 Speed EVs with a Hasty nature ensure that Dragapult outspeeds the entire unboosted tier. 76 Attack EVs ensure an OHKO on Roaring Moon with Dragon Darts, while the rest of the EVs are put into Special Attack. Although Dragapult does not typically find itself needing to Terastallize very often, Ghost is most commonly used to power up Hex even further. For example, Tera Ghost Hex does a minimum of 84% to a burned defensive Great Tusk. In a pinch however, Terastallization can be used defensively to avoid super effective hits.</p> <p>Because of the amount of utility it provides, Dragapult appreciates plentiful chip damage from its teammates, as it lacks immediate power. All forms of entry hazards are greatly appreciated due to Dragapult's ability to force out the opponent, so entry hazard setters like Garganacl, Great Tusk, Glimmora and Ting-Lu form good teammates. Stealth Rock is particularly important since it secures important 2HKOs with Hex. Among the entry hazard setters, Garganacl has fantastic synergy with Dragapult, as it is able to set up Stealth Rock while also chipping down foes with Salt Cure. Partners that can spread status such as Rotom-W and Skeledirge are also excellent teammates. Since Ting-Lu and Garganacl stonewall this set, teammates that scare them out such as Offensive Great Tusk and Banded Meowscarada are great partners. Tera Flying Covert Cloak Gholdengo forms a particularly potent Ghost spam core with Dragapult, as it can turn common counters to Dragapult such as Ting-Lu, Clodsire, and Garganacl into setup fodder. Physical sweepers like Kingambit appreciate having their counters like Corviknight and Great Tusk crippled with burns and have solid type synergy with Dragapult. Due to this set being most potent in the mid- to late-game, it's more at home in teams with solid defensive backbones that can sponge hits. Defensive pokemon such as Ting-Lu, Hatterene, Great Tusk, Clodsire, and Amoonguss can all soak damage for Dragapult from common checks like Garganacl, Ting-Lu, and Kingambit while setting up entry hazards, spreading status, or dealing chip damage, allowing Dragapult to clean up later in the game.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 349443, "username": "Tysonslayer"}, {"user_id": 540138, "username": "Milo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 518399, "username": "Itchy"}, {"user_id": 336073, "username": "Rabia"}, {"user_id": 277988, "username": "dex"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}, {"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 40598, "username": "hamiltonion"}]}
  },
  "Meowscarada": {
    "sets": [
      {
        "name": "Lead",
        "description": "<p>Meowscarada is the fastest Spiker in the metagame that also provides further utility, making it a very potent dedicated lead. Moreover, its immunity to Prankster Taunt from Grimmsnarl, another common lead, lets Meowscarada get the leg up against opposing offensive teams. Taunt in conjunction with its insane Speed tier allows Meowscarada to shut down opposing entry hazard setters and removers like Garchomp, Glimmora, Iron Moth, and Corviknight, annoy defensive Pokemon like Clodsire and Toxapex, and prevent foes such as Volcarona, Kingambit, and Dragonite from using it as setup fodder. Aside from threatening Grass-resistant Pokemon like Dragapult, Skeledirge, and Gholdengo, Knock Off's utility allows Meowscarada to soften up and cripple defensive Pokemon like Corviknight and Toxapex, and it works well with Spikes by removing Heavy-Duty Boots from foes such as Amoonguss, Clodsire, and Scizor. Even with Meowscarada's middling Special Attack, Leaf Storm boosted by Overgrow can cleanly OHKO defensive Great Tusk, one of the metagame's most common entry hazard removers. Focus Sash guarantees that Meowscarada can set at least one layer of Spikes and safely puts Meowscarada into Overgrow range. Tera Ghost can be used in a pinch to spinblock Great Tusk, Iron Treads, and Torkoal.</p> <p>Meowscarada excels at setting up the tempo for hyper offense teams. Offensive Stealth Rock setters like Garchomp and Great Tusk can stack entry hazards to put even more pressure on the opposing team, with mixed Garchomp threatening Corviknight from using Defog; in return, Meowscarada's Knock Off removes Heavy-Duty Boots from the likes of Dragonite and Volcarona to make them susceptible to Stealth Rock. By stacking entry hazards, Gholdengo becomes a near-mandatory teammate to prevent every attempt of hazard removal; Gholdengo also takes advantage of entry hazards itself to pressure checks like Toxapex and Clodsire, which makes Nasty Plot variants particularly difficult to deal with. Setup sweepers commonly found on hyper offense teams such as Dragonite, Kingambit, Baxcalibur, Iron Valiant, and Iron Moth appreciate Spikes chipping down Pokemon like Dondozo, Great Tusk, Garganacl, and Clodsire. Furthermore, they enjoy Meowscarada crippling defensive Pokemon such as Corviknight and Amoonguss with Knock Off, with Dragonite and Kingambit in particular also appreciating Meowscarada luring in and dealing with Great Tusk.</p> "
      },
      {"name": "Pivot"},
      {"name": "Choice Band"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 277988, "username": "dex"}, {"user_id": 540318, "username": "Milo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}]}
  },
  "Skeledirge": {
    "sets": [
      {
        "name": "Bulky Attacker",
        "description": "<p>Skeledirge is a fantastic defensive Pokemon thanks to its great bulk and Unaware letting it check dangerous Pokemon like Iron Valiant, Volcarona, and Hatterene. Unlike other walls, however, Skeledirge can also be a foreboding wincon with Torch Song and its great offensive typing, which gives it nearly unresisted coverage. Will-O-Wisp gives it value against switch-ins such as Ting-Lu, Rotom-W, and Clodsire and cripples physical attackers like Great Tusk and Garchomp. Hex benefits from Skeledirge spreading burns, 2HKOing Pokemon such as Dragonite, Iron Hands, and physically defensive Dondozo unboosted, and Toxapex after a single boost from Torch Song. Tera Fairy bolsters Skeledirge against Dragon-types that would otherwise overwhelm it like Dragapult, Dragonite, Garchomp, and Baxcalibur. It also lets Skeledirge beat Quaquaval and lose its Ground weakness, letting it more easily spread burns against Ground-types like Great Tusk and Garchomp. In a pinch, it can bait Dark-type moves from Pokemon like Kingambit, Roaring Moon, and Meowscarada, Terastallize the same turn, and punish them with Will-O-Wisp. Tera Fairy also maintains Skeledirge's ability to beat Iron Valiant, Volcarona, and Hatterene.</p> <p>Skeledirge fits on many bulky offense, balance, and stall teams as a much-appreciated answer to common wallbreakers such as Iron Valiant and Hatterene. Skeledirge often ends up entry hazard fodder for Ground-types such as Ting-Lu and Clodsire. Thus, secure hazard removers like Great Tusk and Corviknight are excellent partners. Additionally, Great Tusk can 2HKO the aforementioned Pokemon, helping set Skeledirge up for a potential sweep, while Corviknight walls the aforementioned Ground-types, can bring Skeledirge in later with U-turn, and can absorb Knock Off from the likes of Great Tusk, Meowscarada, and Iron Treads. Pokemon such as Meowscarada and Iron Valiant can overwhelm Skeledirge answers like Gholdengo, Great Tusk, and Ting-Lu. In addition to this, they appreciate Skeledirge's ability to beat Hatterene and, after Terastallizing, Dragapult. Covert Cloak Gholdengo can beat any Garganacl using Skeledirge as setup fodder. Bulky Water-types like Rotom-W and Toxapex help deal with offensive Water-types like Greninja and Quaquaval. Additionally, they can both spread status, facilitating Skeledirge's Hex. Rotom-W in particular can offensively check Ground-types like Great Tusk, Garchomp, and Ting-Lu too, although it cannot directly switch into them. Offensive Pokemon like Great Tusk, Iron Valiant, Kingambit, and Dragonite appreciate Skeledirge halting scary Pokemon, like Volcarona and Iron Valiant, and they help it overwhelm checks like Garganacl, Ting-Lu, and Clodsire.</p> "
      },
      {
        "name": "Substitute",
        "description": "<p>With Substitute, Skeledirge can use its typing and bulk to consistently check Garganacl and more easily snowball with Torch Song. Substitute also allows Skeledirge to scout Choice item Pokemon like Roaring Moon and Dragonite, as well as protecting it from revenge killers like Kingambit and Roaring Moon more reliably. Substitute also lets Skeledirge set up against the likes of Garganacl and Cinderace, and it blocks from status from the likes of Toxapex, Clodsire, and Thunder Wave Rotom-W. Maximum HP investment means that Garganacl cannot break Substitute with Salt Cure. 40 Defense EVs let Skeledirge survive two Bulldozes from Focus Sash Breloom, meaning it can consistently outheal Bulldoze, barring a critical hit. 188 Special Defense EVs ensures it survives a Shadow Ball from non-Tera Ghost Choice Specs Dragapult, while 28 Speed EVs let it outspeed Kingambit. Tera Fairy helps stop the likes of Dragapult and Great Tusk from overwhelming Skeledirge, especially the former, which bypasses Substitute with Infiltrator but cannot 2HKO Skeledirge after it Terastallizes. Tera Fairy also prevents Garganacl's Earthquake from breaking Substitute.</p> <p>Substitute Skeledirge fits best on bulky offense and balance teams as a good check to Garganacl. Pokemon Garganacl can overwhelm such as Dragonite, Hex Dragapult, Dragon Dance Roaring Moon, Calm Mind Hatterene, Corviknight, Toxapex, and Dondozo can lure it in for Skeledirge to set up Substitute on and snowball. Additionally, the former can break through Pokemon that wall Skeledirge, namely Toxapex and Clodsire, and Dragapult and Corviknight also boast U-turn, letting them pivot into Skeledirge on a Garganacl switch-in. The setup sweepers enjoy Skeledirge's potent wallbreaking, too. Toxapex and Dondozo also check Pokemon that overwhelm Skeledirge, such as Dragapult and Greninja. Pokemon that do not mind Knock Off like Great Tusk and Corviknight greatly help this set, as Skeledirge is both weak to Knock Off and reliant on Heavy-Duty Boots due to its Stealth Rock weakness. These Pokemon also double as entry hazard removers, with the former preventing Gholdengo from entering safely and the latter checking Ground-types like Great Tusk and Ting-Lu. Entry hazard setters such as Garchomp and Meowscarada can chip down Pokemon that wall Skeledirge like Ting-Lu and Clodsire. In return, Skeledirge can threaten common entry hazard answers like Hatterene and Corviknight, as well as spinblocking in a pinch.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 461329, "username": "Estarossa"}, {"user_id": 493260, "username": "royalfluxh"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 487308, "username": "BT89"}]}
  },
  "Quaquaval": {"sets": [{"name": "Bulk Up"}, {"name": "Swords Dance"}]},
  "Lokix": {"sets": [{"name": "Swords Dance"}, {"name": "Choice Band"}]},
  "Pawmot": {"sets": [{"name": "Utility"}, {"name": "Offensive"}]},
  "Maushold": {"sets": [{"name": "Skill"}]},
  "Garganacl": {
    "sets": [
      {
        "name": "IronPress",
        "description": "<p>The combination of Iron Defense + Body Press lets Garganacl serve as a bulky and dangerous setup sweeper, allowing it to beat Pokemon it otherwise loses to, such as Dragonite, Roaring Moon, and Kingambit. Salt Cure wears down common switch-ins such as Great Tusk, Gholdengo, Rotom-W, and Hatterene, as well as passive Pokemon like Toxapex and Corviknight, and forces them to burn recovery PP more often. Recover keeps Garganacl healthy throughout a game to check Pokemon like Ceruledge and Iron Moth and makes it more sustainable as a wincon. Purifying Salt prevents it from being crippled by Pokemon like Toxapex, Rotom-W, and Clodsire. It also provides a handy Ghost resistance, letting Garganacl potentially switch in on predicted Ghost-type moves from Pokemon like Dragapult and Skeledirge. Leftovers provides valuable passive recovery, reducing Garganacl's reliance on Recover. Maximum Special Defense EVs and a Careful nature maximize Garganacl's bulk, making it easier for Garganacl to switch in on Pokemon such as Iron Moth, Volcarona, and Dragapult and use them as setup fodder. Tera Water provides incredibly valuable resistances, letting Garganacl potentially check Gholdengo and Scizor while retaining its ability to pivot in on Fire-types like Cinderace. Tera Fairy allows Garganacl to turn the tables on Great Tusk while also preventing Breloom from revenge killing it. However, this does remove its resistance to Fire, making it more susceptible to Pokemon like Skeledirge and Ceruledge. Tera Ghost prevents Fighting-types like Iron Hands and Great Tusk from reliably revenge killing Garganacl, letting it use them as setup fodder. It does negate the Ghost resistance provided by Purifying Salt, however, so another switch-in to Dragapult's Shadow Ball should be used.</p> <p>Checks to strong wallbreakers like Iron Valiant and Breloom are good teammates; examples include the likes of Toxapex, Amoonguss, and Corviknight. While Garganacl is given a Ghost resistance from Purifying Salt, it cannot fully check Dragapult and Gholdengo prior to Terastallization, with the latter completely countering it if it uses Covert Cloak. As such, Pokemon like Ting-Lu and Clodsire make for great teammates. Pokemon like Corviknight and Scizor appreciate Garganacl checking Fire-types like Ceruledge and Skeledirge. Corviknight is notable in that it also forms a strong defensive core with Garganacl, checking Meowscarada for it. Entry hazard removers like Great Tusk and the aforementioned Corviknight are appreciated, as Garganacl is heavily pressured by entry hazards and cannot set up reliably if it is worn down. Frail, offensive Pokemon like Cinderace appreciate chip damage being forced onto their checks and having a strong defensive Pokemon to fall back on. Pokemon like Ting-Lu, Kingambit, and Iron Valiant can pave the way for Garganacl to clean late-game, wearing down or significantly pressuring its checks in Gholdengo, Meowscarada, and Fighting-types like Iron Hands and Great Tusk.</p> "
      },
      {
        "name": "Stealth Rock",
        "description": "<p>Garganacl is a great Stealth Rock setter thanks to its fantastic bulk, longevity with Recover, and ability to easily force switches against Great Tusk and outlast Defog Corviknight one-on-one. Protect alongside Salt Cure wears down entry hazard removal options such as Great Tusk and especially Corviknight due to its limited Roost PP and typing's vulnerability to Salt Cure. Protect also scouts out the intentions of Choice locked Pokemon such as Gholdengo and gives extra Leftovers recovery. Terastallization, lets Garganacl turn the tables on Great Tusk and Iron Treads lacking Iron Head, and makes it an incredibly consistent Stealth Rock setter. Specifically, Tera Fairy lets it completely wall Dragapult, while Tera Water lets it check Gholdengo, though this makes its matchup against opposing Garganacl much tougher. 116 Special Defense EVs let Garganacl take a Draco Meteor from Choice Specs Tera Dragon Dragapult at full health.</p> <p>Garganacl fits on a wide variety of teams from bulky offense to stall thanks to it setting up Stealth Rock easily and having fantastic longevity. Ting-Lu is a fantastic partner since it can lay Spikes, and check Gholdengo and unboosted Kingambit, and wear down Corviknight much faster with Ruination thanks to Garganacl running Stealth Rock. Meowscarada and Great Tusk provide Knock Off support by removing Heavy-Duty Boots and Covert Cloak from Gholdengo and Toxapex to let Garganacl accrue Salt Cure damage more freely. Great Tusk also removes entry hazards with Rapid Spin. Gholdengo appreciates Great Tusk being worn down, since it shuts down other forms of entry hazard control well and fits alongside Garganacl and other entry hazard setters such as Garchomp. Cinderace lures in and uses U-turn on bulky Water-types such as Dondozo and Toxapex, giving Garganacl free entry to pressure them with Salt Cure</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 349443, "username": "Tysonslayer"}, {"user_id": 540138, "username": "Milo"}, {"user_id": 360720, "username": "ausma"}, {"user_id": 540138, "username": "Milo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "Aurora"}, {"user_id": 297659, "username": "deetah"}, {"user_id": 467437, "username": "Dawn Of Ares"}, {"user_id": 523866, "username": "UT"}]}], "writtenBy": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 524894, "username": "romanji"}]}
  },
  "Ceruledge": {"sets": [{"name": "Bulk Up"}, {"name": "Swords Dance"}]},
  "Kilowattrel": {"sets": [{"name": "Rain Sweeper"}]},
  "Scovillain": {"sets": [{"name": "Sun Sweeper"}]},
  "Rabsca": {"sets": [{"name": "Trick Room Setter"}]},
  "Orthworm": {"sets": [{"name": "Shed Tail Support"}]},
  "Glimmora": {
    "sets": [
      {
        "name": "Focus Sash Glimmora",
        "description": "<p>With Stealth Rock and its ability Toxic Debris, Focus Sash Glimmora functions as a lead able to set up hazards when hit by a physical attack. Mortal Spin lets Glimmora provide entry hazard removal for its team and potentionally poison an opposing Pokemon. Earth Power hits Steel-types like Gholdengo, Kingambit, and Iron Treads, which all block Mortal Spin. Energy Ball is mainly used to hit Great Tusk while also dealing super effective damage against Garganacl, Rotom-W, and Greninja. Alternatively, Sludge Wave allows Glimmora to threaten Hatterene, which would otherwise be troublesome thanks to its Magic Bounce ability and STAB Psychic-type moves like Psyshock. Spikes is another option that gives Glimmora the potential to set up as many entry hazards as possible, rather than the singular Stealth Rock. Tera Grass turns Glimmora's weakness to Ground-type attacks into a resistance and increases the damage output of Energy Ball, both of which are particularly useful against Great Tusk. Alternatively, Tera Ghost blocks Rapid Spin attempts from Great Tusk and Iron Treads, ensuring all of Glimmora's hazards stay up.</p> <p>Hyper offense teams appreciate Focus Sash Glimmora's entry hazards to provide chip damage support for setup sweepers like Roaring Moon, Dragonite, and Kingambit. Gholdengo is a great partner for Glimmora, as its ability Good As Gold lets it block Defog attempts from Corviknight, while its Ghost typing prevents Rapid Spin attempts from Great Tusk and Iron Treads, which in turn allows the hazards Glimmora set up to stay up throughout the game. Pokemon like Iron Valiant and Choice Specs Dragapult can use Great Tusk as an opportunity to fire off powerful attacks, which can hit Glimmora for super effective damage with Earthquake and remove its entry hazards with Rapid Spin.</p> "
      },
      {"name": "Choice Scarf"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 540138, "username": "Milo"}, {"user_id": 197439, "username": "chimp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 548068, "username": "SetsuSetsuna"}]}
  },
  "Cetitan": {"sets": [{"name": "Slush Rush Sweeper"}]},
  "Dondozo": {
    "sets": [
      {
        "name": "Wall",
        "description": "<p>Dondozo is one of OU's premier walls, capable of shutting down dangerous setup sweepers like Roaring Moon. Liquidation is Dondozo's STAB move of choice due to its lack of recoil, but Wave Crash's power has some merit against foes like Ting-Lu, Skeledirge, and Clodsire. While weaker, Waterfall is another option that has more PP than Liquidation, allowing Dondozo to perform better against stall; however, its use case is rare. Body Press makes use of Dondozo's massive Defense stat and punishes Pokemon like Tera Normal Dragonite and Kingambit. Rest + Sleep Talk provides Dondozo with good sustainability without making it too passive, while Yawn is an option that forces out sweepers Dondozo cannot consistently deal with, like mixed Iron Valiant. On Yawn sets, Leftovers over Heavy-Duty Boots can be beneficial, as Dondozo is vulnerable when it is asleep without Sleep Talk. Grass is the preferred Tera type for eliminating Dondozo's original weaknesses; this is particularly helpful against Meowscarada and Iron Hands. Dragon, however, is an option that keeps Dondozo's resistance to Fire intact, albeit making it weak to Fairy-types like Azumarill and Iron Valiant.</p> <p>Entry hazard setters like Clodsire and Ting-Lu pair perfectly with Dondozo, playing into its desire to outlast foes long-term with chip damage in the form of entry hazards, status, or Ruination. Both also check special attackers like Iron Valiant and Gholdengo, which Dondozo tends to struggle with. Garganacl deserves a special mention as a teammate due to its ability to wear down foes with Salt Cure; it, in turn, appreciates Dondozo taking on Great Tusk and Kingambit. Hatterene provides Dondozo teams with an excellent sweeper and appreciates Dondozo taking care of physical wallbreakers like Dragapult, and Kingambit. It also can help by blocking opposing entry hazards with Magic Bounce, letting Dondozo more comfortably tank a Knock Off from Great Tusk or Iron Treads. Similarly, entry hazard removal from Corviknight or Great Tusk is also helpful; Corviknight also deals with Meowscarada, which can force Dondozo to Terastallize early. Choice Scarf Gholdengo can help pressure opposing Dondozo while dealing with Dragapult and Iron Valiant.</p> "
      },
      {
        "name": "Curse",
        "description": "<p>Curse Dondozo is a deceptively strong sweeper that provides good defensive utility before it attempts a sweep. Liquidation is preferred over Wave Crash due to its lack of recoil; however, Wave Crash is an option if a stronger STAB move is desired. Waterfall has higher PP than Liquidation, but it is usually a weaker option. Body Press makes use of Dondozo's naturally high Defense stat and Curse's boosts, while Protect lets Dondozo accumulate Leftovers recovery. However, these two moves can be dropped for the combination of Rest and Sleep Talk, which affords Dondozo greater longevity at the cost of relying on Sleep Talk to call the right move. Leftovers is preferred over Heavy-Duty Boots, as Dondozo will be on the field for many turns in a row to adequately set up with Curse; however, if a team requires it to play more defensively, Heavy-Duty Boots is fine choice. Grass is Dondozo's Tera type of choice, removing its original weaknesses while giving it an important resistance to Ground. Maximum investment in special bulk allows Dondozo to become nigh-unbreakable once it sets up.</p> <p>Entry hazard removal is key for Dondozo if it does not run Heavy-Duty Boots; good options include Great Tusk, Iron Treads, and Corviknight. Though Dondozo can have quite the offensive presence once it sets up, it is best to run it alongside consistent wallbreakers like Dragapult, Gholdengo, and Iron Valiant, which can help break open holes for it to sweep late-game. Similarly, entry hazards from teammates like Garchomp and Glimmora can facilitate Dondozo's sweep. Trick users like Meowscarada and Gholdengo can cripple Dondozo checks like Clodsire and Skeledirge, causing them to lose to Dondozo over the course of the game. While Dondozo is a great sweeper, it is far from consistent at generating setup opportunities; accordingly, it is best to pair it with another bulky sweeper like Iron Defense Garganacl or Hatterene, which can weaken or bait out answers to bulky sweepers like Trick users and Unaware Clodsire.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 540138, "username": "Milo"}, {"user_id": 197439, "username": "chimp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 277988, "username": "dex"}]}
  },
  "Clodsire": {"sets": [{"name": "Defensive"}]},
  "Kingambit": {
    "sets": [
      {
        "name": "Swords Dance",
        "description": "<p>Supreme Overlord Kingambit is a terrifying revenge killer and sweeper. Dark / Steel is a great offensive typing that can hit Pokemon such as Skeledirge, Gholdengo, Dragapult, Garganacl, and Iron Valiant super effectively as well as Great Tusk, Ting-Lu, and Corviknight neutrally. Tera Flying completely reverses Kingambit's weaknesses and resistances and can catch Pokemon looking to KO Kingambit with Fighting- and Ground-type moves like Iron Valiant and Great Tusk, off guard. Alternatively, Kingambit can opt for Tera Ghost to better counter Tera Normal Dragonite, as Earthquake becomes neutral against Kingambit and Extreme Speed is ineffective. Similarly, Tera Fairy can be chosen because Kingambit then resists Roaring Moon's Crunch, which cannot OHKO Kingambit without Tera Steel. Kingambit chooses to run 144 Speed EVs to reliably outspeed Corviknight and Swords Dance Iron Hands; the rest of its investment is in HP to maximize bulk.</p> <p>Kingambit fits very well on hyper and bulky offense teams, as it works very well coming in after its teammates have fallen, such as Iron Valiant, Gholdengo, Breloom, and Dragonite. On hyper offense particularly, Grimmsnarl and Glimmora both work as great leads that set up screens and entry hazards, respectively. Kingambit checks opposing offensive Pokemon such as Dragapult, Gholdengo, and Meowscarada thanks to its defensive typing but loses out against revenge killers such as Breloom and other threats like Calm Mind Iron Valiant, Iron Hands, Dodonzo, and Great Tusk; as such, Kingambit appreciates defensive support from Great Tusk, Skeledirge, and Rotom-W and offensive support from Iron Valiant, Gholdengo, and Dragapult.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 5542641, "username": "Coolcodename"}, {"user_id": 197439, "username": "chimp"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}], "writtenBy": [{"user_id": 540138, "username": "Milo"}]}
  },
  "Great Tusk": {
    "sets": [
      {
        "name": "Offensive",
        "description": "<p>Great Tusk is the best offensive Rapid Spin user and a fantastic wallbreaker thanks to its typing, bulk, and high-Base Power STAB attacks. Great Tusk takes on a plethora of physical attackers in the tier, including Kingambit, Garchomp, and Scizor while also threatening entry hazard setters such as Glimmora, Ting-Lu, Clodsire, and Garganacl. Knock Off prevents Air Balloon Gholdengo from completely spinblocking Great Tusk, and it also removes items such as Rocky Helmet, Leftovers, and Heavy-Duty Boots from defensive Pokemon that commonly switch into Great Tusk such as Dondozo, Corviknight, and Hatterene. Ice Spinner lets Great Tusk take on Dragonite, Roaring Moon, and Garchomp more easily, though the lack of Close Combat leaves Great Tusk walled by Corviknight and Rotom-W. Maximum Speed investment paired with a Jolly nature ensures that Great Tusk is able to outspeed Rotom-W, non-Choice Scarf Gholdengo, and Jolly Dragonite. Tera Fighting makes Great Tusk much better at taking on Water-types such as Quaquaval while making Close Combat significantly harder to switch into; alternatively, Tera Steel lets Great Tusk flip its type weaknesses and take on Pokemon like Iron Valiant, and Tera Flying Roaring Moon. Heavy-Duty Boots prevents Great Tusk from being worn down by Toxic Spikes and Spikes, letting it remove entry hazards consistently throughout a match; however, Leftovers provides Great Tusk with a form of recovery. Booster Energy is a niche option that provides Great Tusk with a one-time boost to its Attack, making it an immediately threatening wallbreaker without the use of Terastallization.</p> <p>Great Tusk takes on Dark-type Pokemon such as Kingambit, and Ting-Lu, so Pokemon weak to Dark such as Dragapult, Gholdengo, Slowking, and Skeledirge appreciate Great Tusk; Slowking and Dragapult in particular are able to pivot in Great Tusk with Chilly Reception and U-turn, respectively. Great Tusk is also able to take on entry hazard setters such as Ting-Lu and Garchomp and remove entry hazards from the field, so Pokemon that can be overwhelmed by hazards such as Dondozo, Ting-Lu, and Garganacl appreciate Great Tusk's presence. Great Tusk struggles to take on faster special attackers such as Iron Valiant, Dragapult, and Volcarona, so special walls such as Clodsire, Ting-Lu, and Toxapex are great partners. Great Tusk also has difficulty with physical walls such as Dondozo, Tera Water and Tera Fairy Garganacl, and Tera Fairy Skeledirge. Spikes support from Ting-Lu, Glimmora, and Garchomp wears down these checks into range of Great Tusk's attacks, especially when paired with Knock Off. Wallbreakers such as Choice Specs Iron Valiant, Gholdengo, Iron Hands, and Breloom make for good partners by being able to overwhelm shared checks; Gholdengo is a noteworthy wallbreaker for also blocking opposing hazard removal. Torkoal is also an excellent partner for Great Tusk, setting up the sun to activate Protosynthesis and weaken Water-type attacks, while supporting other wallbreakers that can pressure the aforementioned physical walls, such as Choice Band Roaring Moon, Scovillain, and Slither Wing.</p> "
      },
      {
        "name": "Physically Defensive",
        "description": "<p>Great Tusk has a solid niche as a defensive Pokemon by virtue of its utility, movepool, bulk, and typing. It can adequately check Pokemon like Kingambit, Cinderace, and Iron Hands, threatening them with a strong Earthquake in return. Stealth Rock lets Great Tusk compress even more roles, chipping away at the opposition. If another Stealth Rock user is already on the team, however, Body Press can take advantage of its high Defense stat and better threaten the likes of Ting-Lu and Roaring Moon. Body Press also lets Great Tusk catch Rotom-W with greater chip damage than Knock Off does on the switch. Knock Off provides valuable item removal, getting rid of Leftovers from Pokemon like Dondozo, Corviknight, and Hatterene, as well as Heavy-Duty Boots from Volcarona and Dragonite. Additionally, Knock Off is Great Tusk's only initial way to hit Air Balloon Gholdengo, which can't OHKO this defensive set. Rapid Spin, besides clearing entry hazards, also allows Great Tusk to outspeed faster foes like Focus Sash Glimmora and Gholdengo. Tera Fighting gets rid of Great Tusk's Ground typing, giving it a better matchup against Pokemon like Quaquaval and Floatzel while also strengthening Body Press if it is used. Alternatively, Tera Steel can give Great Tusk valuable resistances to Fairy, and Grass, turning the tables on Hatterene and Meowscarada. Leftovers greatly increases Great Tusk's longevity; however, Rocky Helmet can be used to wear down Pokemon like Scizor and Cinderace over time.</p> <p>After Great Tusk sets Stealth Rock, Corviknight effortlessly switches in and uses Defog to remove entry hazards, so Pokemon like Cinderace, Gholdengo, and Rotom-W that handle it are great partners. With no good way to hit Flying-types and Pokemon that use Tera Flying, Great Tusk can be set up on very quickly, most notably against the likes of Dragonite and Roaring Moon;even though the former dislikes Knock Off. Therefore, checks to these such as Dondozo and Corviknight are appreciated. A different Stealth Rock setter like Garganacl or Ting-Lu lets Great Tusk comfortably run Body Press without losing out on anything major. Ting-Lu also forms a potent entry hazard-stacking core with Great Tusk via Spikes. Further, it takes on the special attackers that Great Tusk struggles with, like Gholdengo, Choice Specs Dragapult, and Volcarona. Great Tusk is forced out by wallbreakers like Iron Valiant and Quaquaval, so teammates that can check them like Amoonguss and Toxapex are welcome. Pokemon like Ceruledge, and Iron Moth appreciate the entry hazard removal that Great Tusk provides. Great Tusk's defensive qualities greatly help frail wallbreakers like Dragapult, and Iron Valiant, as these Pokemon need strong defensive Pokemon to fall back on very often.</p> "
      },
      {
        "name": "Choice Band",
        "description": "<p>The combination of high Attack, powerful STAB moves, a decent movepool, and well-rounded physical bulk allows Great Tusk to function as a strong physical wallbreaker. It can support teams offensively with Knock Off and Rapid Spin as well as defensively through its ability to check Kingambit, Cinderace, and Choice Band Roaring Moon. Its dual STAB moves are able to OHKO or severely damage several key offensive Pokemon in the metagame such as Kingambit, and Tera Normal Dragonite. Knock Off allows Great Tusk to remove Leftovers from walls such as Corviknight and Dondozo. It can also remove important items from more offensive Pokemon, such as Heavy-Duty Boots from Dragonite, Volcarona, and bulky pivot Roaring Moon, and it can provide coverage against Air Balloon Gholdengo, which otherwise checks this set. Ice Spinner hits Dragon-types that Headlong Rush isn't as strong against like bulky Garchomp and Dragonite. Alternatively, Rapid Spin can be run if the team is still in need of entry hazard removal. With Tera Fighting, Close Combat becomes much stronger, guaranteeing OHKOs against offensive Scizor sets. Tera Fighting also improves Great Tusk's matchups against Dondozo, Rotom-W, and opposing Great Tusk. With Tera Steel, Great Tusk can better handle Grass- and Fairy-types such as Meowscarada and Hatterene, and it can also shrug off attacks it normally can't, such as Meowscarada's Flower Trick and Dragapult's Draco Meteor. When running Great Tusk on sun teams, an alternate EV spread making Speed its highest stat can be considered due to Protosynthesis boosting Speed; this allows Great Tusk to outspeed otherwise faster Pokemon like Dragapult, and Choice Scarf Gholdengo.</p> <p>Rotom-W, Skeledirge, and Torkoal make for good teammates, since their status spreading can help weaken foes and help Great Tusk wallbreak more efficiently. Rotom-W is able to paralyze faster Pokemon such as Iron Valiant and boosted Quaquaval, allowing Great Tusk to outspeed them. Skeledirge is able to spread burn, capitalize on foes afflicted with status with a boosted Hex, and check Iron Valiant sets lacking Shadow Ball. Lastly, Torkoal is able to force switches thanks to Yawn, spread status with Lava Plume, and set up sun to make Great Tusk an even scarier wallbreaker. Great Tusk appreciates entry hazard support from the likes of Garganacl and Ting-Lu, since it can wallbreak more easily thanks to the chip damage they provide. Great Tusk is able to keep their hazards up in exchange while simultaneously removing hazards set by foes. Sweepers that are vulnerable to hazards like Iron Moth and Tera Flying Roaring Moon appreciate Great Tusk being able to remove hazards and beat walls such as Ting-Lu, allowing them to sweep more easily late-game. Lastly, other offensive Pokemon such as Kingambit and Dragonite make for good partners, since Great Tusk is able to weaken or cripple their common checks in Iron Valiant.</p> "
      },
      {
        "name": "Bulk Up",
        "description": "<p>Bulk Up Great Tusk can act as both a defensive backbone and a potential late-game sweeper, able to set up in front of Pokemon such as Dragonite, Iron Treads, Cinderace, Dragon Dance Dragapult, and opposing Great Tusk. Knock Off provides item removal against defensive walls like Dondozo and Corviknight, as well as coverage against Air Balloon Gholdengo that would otherwise wall Great Tusk. Rapid Spin lets Great Tusk provide entry hazard removal for the team in games where it would not be able to win with Bulk Up, while allowing it to boost its Speed in games where it can sweep with Bulk Up. Body Press is another option that gives Great Tusk a way to more immediately hit Dark-types such as Meowscarada, Roaring Moon, and Ting-Lu. Tera Water turns Great Tusk's Water and Ice weaknesses into resistances, allowing it to better take hits from Azumarill, Quaquaval, and Floatzel. On the other hand, Tera Steel lets Great Tusk take on Grass-type attacks such as Breloom's Bullet Seed and Meowscarada's Flower Trick, Flying-type attacks like Roaring Moon's Acrobatics, and if need be, Fairy-type attacks such as Iron Valiant's Moonblast.</p> <p>Bulk Up Great Tusk appreciates specially defensive teammates like Toxapex and Garganacl that can help play around fast special attackers such as Choice Specs Iron Valiant and Choice Specs Dragapult. In return, Garganacl and Toxapex appreciate the presence of a Terastallized Great Tusk as they can get overwhelmed by Kingambit and Belly Drum Azumarill. Teammates such as Gholdengo, Iron Valiant, and Dragapult can help break through physically defensive Pokemon like Rotom-W, Dondozo, and Skeledirge that Bulk Up Great Tusk can struggle against. Gholdengo in particular is a great partner, as it can struggle against Cinderace and Dragonite, both of which Great Tusk covers.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 349443, "username": "Tysonslayer"}, {"user_id": 540138, "username": "Milo"}, {"user_id": 277988, "username": "dex"}, {"user_id": 487308, "username": "BT89"}, {"user_id": 554264, "username": "Coolcodename"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}, {"user_id": 109385, "username": "Aurora"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 297659, "username": "deetah"}]}], "writtenBy": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 548068, "username": "SetsuSetsuna"}, {"user_id": 602431, "username": "CaptainDaimyo"}, {"user_id": 595062, "username": "Takatk"}]}
  },
  "Scream Tail": {"sets": [{"name": "Defensive"}]},
  "Brute Bonnet": {"sets": [{"name": "Offensive"}]},
  "Slither Wing": {"sets": [{"name": "Defensive"}, {"name": "Choice Band"}]},
  "Sandy Shocks": {"sets": [{"name": "Choice Specs"}]},
  "Iron Treads": {"sets": [{"name": "Offensive"}, {"name": "Utility"}]},
  "Iron Hands": {"sets": [{"name": "Choice Band"}, {"name": "Swords Dance"}]},
  "Iron Jugulis": {"sets": [{"name": "Choice Specs"}]},
  "Iron Moth": {
    "sets": [
      {"name": "Offensive"},
      {
        "name": "Booster Energy",
        "description": "<p>High Special Attack, great Speed, and a variety of coverage moves make Iron Moth a powerful offensive presence and late-game sweeper. With Booster Energy and the listed EV spread, Iron Moth receives a one-time Speed boost to outspeed and threaten normally-faster foes such as Dragapult, Choice Scarf Gholdengo, and Roaring Moon. Furthermore, Fiery Dance can further boost its offense with Special Attack boosts. Energy Ball allows it to take on Water- and Ground-types such as Rotom-W, Dondozo, and Great Tusk. Dazzling Gleam gives Iron Moth an answer to Dragon-types such as Dragapult, Roaring Moon, and Baxcalibur. Finally, Psychic threatens Poison-types such as opposing Iron Moth and Toxapex, as well as Fighting-types such as Iron Valiant. With Tera Fairy, Iron Moth receives a boost to Dazzling Gleam, and it also loses its crippling weaknesses to Ground, Psychic, and Stealth Rock. Tera Fairy also gives Iron Moth a valuable resistance to Sucker Punch, meaning it no longer fears Kingambit revenge killing it mid-sweep. An alternative EV spread of maximum Special Attack and Speed with a Timid nature is a viable alternative, since Iron Moth will receive a boost to its Special Attack from Booster Energy.</p> <p>Iron Moth serves best on various hyper offense teams, where it can sweep efficiently. When pairing Iron Moth with other offensive Pokemon like Iron Valiant, Baxcalibur, and Dragapult, some can punch holes early- and mid-game for others to sweep more easily late-game. Meowscarada, Great Tusk, and mixed offensive Garchomp provide hyper offense teams with entry hazards, which wear foes down into Iron Moth's KO range. Kingambit, Dragonite, and Choice Band Scizor can revenge kill boosted sweepers that Iron Moth can struggle with. Kingambit revenge kills Dragapult and Tera Flying Roaring Moon, Dragonite covers Volcarona and offensive Iron Moth, and Choice Band Scizor covers Iron Valiant and Dragonite. Iron Moth is very vulnerable to hazards, so it appreciates hazard removal from the likes of offensive Great Tusk and Booster Energy Iron Treads.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 540138, "username": "Milo"}, {"user_id": 197439, "username": "chimp"}, {"user_id": 384270, "username": "autumn"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}], "writtenBy": [{"user_id": 602431, "username": "CaptainDaimyo"}]}
  },
  "Iron Thorns": {"sets": [{"name": "Offensive"}]},
  "Baxcalibur": {"sets": [{"name": "Offensive"}]},
  "Gholdengo": {
    "sets": [
      {
        "name": "Choice Scarf",
        "description": "<p>Choice Scarf Gholdengo utilizes its high Special Attack and its great offensive typing to become a fast revenge killer. Gholdengo can effectively hit offensive threats such as Dragapult and Iron Valiant with its STAB moves. Trick allows Gholdengo to cripple defensive Pokemon such as Dodonzo, Corviknight, and Clodsire. Its typing also allows it to switch into foes such as Iron Valiant and Iron Hands in a pinch, as it either resists or is immune to most of their attacks. Focus Blast is ideal for Gholdengo to hit Kingambit and other foes such as a weakened Ting-Lu, but Nasty Plot can be run instead to take advantage of stopping defensive Pokemon with Trick and having a free turn to set up and do a great amount of damage. Recover can also be run, taking a more defensive approach to give Gholdengo a free turn to heal. Gholdengo prefers Fighting as a Tera type, as it removes its prior weaknesses, meaning it is not threatened by Kingambit's Sucker Punch or Skeledirge's Torch Song. It also boosts the power of Focus Blast, reliably removing the former. To counter different foes, Gholdengo can instead opt for Tera Flying to have better ground against Great Tusk and Iron Treads.</p> <p>Teammates such as Kingambit and Iron Valiant appreciate Gholdengo's offensive pressure, as it can help against shared checks such as Great Tusk and Amoonguss. With this role, Gholdengo prefers to have a clean switch after a teammate has fainted in order to pressure the opponent. Similarly, entry hazard setters such as Garchomp, Garganacl, and Ting-Lu appreciate Gholdengo for its Good as Gold ability and its Ghost typing, preventing all forms of hazard removal excluding Court Change. Gholdengo is mainly vulnerable to priority moves such as Kingambit's Sucker Punch. Dragonite also presents an issue for it with Multiscale in conjunction with Earthquake, not to mention it can set up twice in front of Gholdengo. This can be avoided with a carefully timed Trick or help from defensive Great Tusk and Skeledirge. Similarly, depending on its Choice lock, Roaring Moon and Cinderace can take advantage of Gholdengo with Crunch and Sucker Punch, respectively. As a result of this, Garchomp and Garganacl pair well with Gholdengo, acting as a defensive backbone with type advantage and great bulk. Iron Valiant can be a great revenge killer against these threats with great Speed and coverage.</p> "
      },
      {
        "name": "Air Balloon",
        "description": "<p>Thanks to its great typing and Good as Gold, Gholdengo is a setup sweeper that's notably difficult to deal with. Having an additional Ground immunity with Air Balloon further improves Gholdengo's already great typing, letting it switch in on Pokemon that otherwise threaten it, such as Garchomp and Iron Treads. This is especially useful against the latter, as Air Balloon strengthens Gholdengo's ability to block entry hazard removal. Maximum Speed investment is for outspeeding Dragonite and uninvested Great Tusk. 252 Special Attack EVs and Nasty Plot makes Gholdengo's STAB moves very threatening against neutral foes. Fighting and Dark Tera types give Gholdengo the option to Terastallize defensively; notably, Tera Fighting lessens the impact of moves like Crunch from Roaring Moon. Tera Dark is useful in a pinch to resist attacks such as Shadow Ball from Dragapult and opposing Gholdengo.</p> <p>Entry hazard setters like Great Tusk and Glimmora are the most profitable teammates for Gholdengo, as its ability and typing ensure that their entry hazards stay around as long as Gholdengo does. Hyper offense staples such as Iron Valiant benefit greatly from the constant presence of entry hazards to break down bulkier cores; in return, Gholdengo gets teammates that synergize with its role as a wallbreaker, applying heavy pressure throughout a game to Pokemon like Ting-Lu and Rotom-W. Offensive Pokemon that outspeed and OHKO Gholdengo, such as Cinderace, Roaring Moon, and Knock Off variants of Great Tusk, threaten to completely shut down Gholdengo; defensive teammates like Garganacl, Dondozo and Skeledirge can help mitigate some of these weaknesses.</p> "
      },
      {
        "name": "Defensive",
        "description": "<p>Gholdengo can utilize its natural bulk, great typing, and immunity to status moves for a more defensive role on balance and stall teams. It can switch into several key offensive threats such as Iron Valiant, Scizor and Breloom and completely shut down multiple defensive Pokemon such as Amoonguss and Corviknight. With Good as Gold, Gholdengo can act as a reliable means of spinblocking and denying Defog. Recover provides Gholdengo with a means of improving its longevity, letting it switch into the aforementioned threats multiple times throughout a match. Thunder Wave allows Gholdengo to cripple threats it can lure in, like Iron Moth and Roaring Moon. Gholdengo can capitalize on the status it spreads with Hex, letting it deal high damage once its targets have been paralyzed. Gholdengo can take advantage of switches it forces by setting up Nasty Plot, letting it exert a high offensive threat level, and enabling it to win potential stalemates against bulkier Pokemon such as Corviknight and Dondozo. Alternatively, Make It Rain can be used to immediately KO Garganacl and Iron Valiant. Tera Flying improves Gholdengo's matchups against Ground-types like Great Tusk and Iron Treads. This completely flips the matchup in Gholdengo's favor, as it can use them as a point of entry to set up Nasty Plot. Tera Fairy, on the other hand, grants Gholdengo a resistance to Dark-type attacks, allowing it to survive Crunch from Roaring Moon and paralyze it with Thunder Wave. Gholdengo's item choice is quite flexible and largely depends on its team structure. Leftovers offers passive recovery, which is quite valuable to preserve Recover PP. Covert Cloak grants Gholdengo an immunity to the secondary effects of various moves, allowing it to counter Garganacl by nullifying the chip damage from Salt Cure. It is also useful to allow Gholdengo to switch into a wider pool of moves, like Hatterene's Nuzzle, with far less risk. Heavy-Duty Boots nullifies entry hazard damage, allowing Gholdengo to switch in and out with little issue. A physically defensive EV spread allows Gholdengo to more reliably check Pokemon such as Garganacl, Corviknight, and Scizor.</p> <p>Defensive Gholdengo fits on a variety of teams, but it particularly shines on balance and stall teams. Its ability to nullify most forms of hazard control is most useful to entry hazard setters such as Garchomp, Ting-Lu, and Great Tusk. These Pokemon also appreciate Gholdengo's ability to check Hatterene, which can bounce back hazards with Magic Bounce. If Gholdengo is utilizing Covert Cloak, it will be a great teammate to Pokemon like Dodonzo, Toxapex, and Corviknight, which struggle against Garganacl due to Salt Cure. Gholdengo can pivot into many key status moves such as Will-O-Wisp and is therefore a great ally to Pokemon that are common targets of them, such as Dragonite, Great Tusk, and Meowscarada. When not running Tera Flying, Ground-types like Great Tusk, Ting-Lu, and Clodsire can use Gholdengo as an entry point to either deal high damage to it with Earthquake or set up entry hazards. Corviknight is thus a great partner, as it can switch into them with ease and clear entry hazards they may set up with Defog. Hatterene is another good teammate, since it can completely shut down attempts to set up entry hazards with Magic Bounce. Gholdengo is also quite vulnerable to a few other offensive threats, such as Volcarona, Cinderace, and Kingambit, so bulky Water-types like Dondozo and Toxpaex can switch into these Pokemon and prevent setup via Unaware and Haze, respectively, which Gholdengo will greatly appreciate. Garchomp and Great Tusk can switch into Cinderace and Kingambit and threaten them out with Earthquake, and they can also benefit from Gholdengo's Thunder Wave support, allowing them to more reliably check Cinderace and Iron Moth.</p> "
      },
      {"name": "Choice Specs"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 487308, "username": "BT89"}, {"user_id": 554264, "username": "Coolcodename"}, {"user_id": 197439, "username": "chimp"}, {"user_id": 540138, "username": "Milo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}, {"user_id": 430518, "username": "Lunaflare"}, {"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 359575, "username": "Nichalho"}, {"user_id": 540138, "username": "Milo"}, {"user_id": 177111, "username": "Magcargo"}]}
  },
  "Ting-Lu": {
    "sets": [
      {
        "name": "Defensive Hazards",
        "description": "<p>Ting-Lu is an incredible entry hazard setter for bulky offense and balance teams alike thanks to its combination of gargantuan defensive stats, good utility movepool, and an amazing defensive ability in Vessel of Ruin. It also has a great typing that lets it answer threats such as Gholdengo, Choice Specs Dragapult, Iron Moth, and Ceruledge. Whirlwind is incredibly useful for thwarting setup Pokemon like Roaring Moon and Volcarona. Ruination lets Ting-Lu deal consistent damage to bulky Pokemon like Corviknight, Rotom-W, and Hatterene. Tera Poison lets Ting-Lu act as an answer to Iron Valiant while giving it an immunity to poison damage from Clodsire’s Toxic and letting it absorb Toxic Spikes from the likes of Glimmora and Iron Moth. Meanwhile, Tera Fairy is a generally solid defensive typing, letting it more reliably check Pokemon such as Dragapult and Great Tusk. Maximum Special Defense, in tandem with Ting-Lu's ability, makes it a more consistent check to special attackers such as Choice Specs Dragapult and Volcarona.</p> <p>Ting-Lu’s premier defensive profile makes it most proficient on bulky offense and balance teams that can supply enough offensive momentum to make up for Ting-Lu’s relative passivity. Pokemon that can supplement offensive prowess to make up for Ting-Lu's passivity such as Iron Valiant and Kingambit make for excellent partners, as they can assist against threats like opposing Iron Valiant, Dondozo, and Great Tusk. Without Ruination, Ting-Lu is utterly helpless against Corviknight, so Pokemon that can threaten it such as Gholdengo and Cinderace make for excellent partners. Bulky Water-types like Dondozo and Toxapex appreciate Ting-Lu's immunity to Electric while being quite helpful against Pokemon like Kingambit and Quaquaval in return. Other defensive Pokemon like Garganacl and Corviknight also make for excellent partners, being helpful against Pokemon like Scizor while appreciating Ting-Lu’s ability to check Gholdengo and Choice Specs Dragapult. Additional entry hazard setters such as Garganacl and Great Tusk allow Ting-Lu to fit Ruination into its moveset more capably, so it is less passive in the face of Ground-immune threats like Corviknight and Air Balloon Gholdengo.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 197439, "username": "chimp"}, {"user_id": 349443, "username": "Tysonslayer"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}], "writtenBy": [{"user_id": 487306, "username": "BT89"}]}
  },
  "Roaring Moon": {
    "sets": [
      {
        "name": "Booster Energy",
        "description": "<p>Dragon Dance Roaring Moon is one of the tier's most threatening late-game setup sweepers due to its high offensive stats, strong coverage moves, and decent bulk. Earthquake is a strong, consistent coverage option that hits Kingambit, Garganacl, Iron Hands, and Clodsire super effectively. Roost, on the other hand, gives Roaring Moon access to reliable recovery, which gives it more setup opportunities throughout the game even if its Booster Energy is already used up. Acrobatics has fantastic coverage, as it hits Great Tusk, Iron Valiant, and Breloom super effectively and should always be run alongside Tera Flying to maximize its power. Iron Head is a viable alternative to Acrobatics and should always be run alongside Tera Steel, as it deals with Fairy-types like Iron Valiant and Hatterene simultaneously. Tera Flying removes all of Roaring Moon's baseline weaknesses bar Ice, gives it a resistance to Fighting- and Bug-type attacks, a Ground immunity, and a STAB boost to Acrobatics. Tera Steel, though more niche, allows Roaring Moon to resist Hatterene's Dazzling Gleam, Scizor's Bullet Punch, and Tera Normal Dragonite's Extreme Speed. A Jolly nature is typically run to outspeed Booster Energy Iron Valiant after a Dragon Dance, but Adamant is a decent alternative, particularly on teams that allow Roaring Moon to obtain more than one Dragon Dance boost. After a Dragon Dance, Adamant Roaring Moon can more easily OHKO defensive variants of Gholdengo and Great Tusk.</p> <p>Dragon Dance Roaring Moon best functions on offensive teams, pairing well with setup sweepers that can wear down each other's checks. Iron Valiant can opt out of running Psyshock, since Roaring Moon breaks past Clodsire for it, and Breloom can more effectively utilize its STAB moves and Spore once Roaring Moon eliminates Gholdengo. Dondozo and Tera Fairy Skeledirge are major threats to Roaring Moon due to their ability to ignore its boosts with Unaware, while strong priority users like Dragonite and Breloom can revenge kill Roaring Moon thanks to its low Defense. Ting-Lu can force Roaring Moon out with Whirlwind, and Choice Band Iron Hands survives a boosted Earthquake from full health and can OHKO Roaring Moon with Close Combat. Iron Valiant offers immediate damage against Dondozo, Iron Hands, and Ting-Lu due to its excellent mixed coverage. Offensive Great Tusk and Technician Breloom can help wear down Ting-Lu with their super effective STAB moves, and Breloom's Technician-boosted Bullet Seed can also break past Dondozo. Grimmsnarl's ability to set up dual screens allows Roaring Moon to set up multiple Dragon Dances and survive attacks from Dragonite. Orthworm is a niche option that sets entry hazards and provides a slow Shed Tail to get Roaring Moon in safely behind a Substitute, allowing for much easier setup opportunities against opposing status users like Rotom-W and protecting it from priority moves from Dragonite and Breloom.</p> "
      },
      {"name": "Choice Band"}
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 360720, "username": "ausma"}, {"user_id": 540138, "username": "Milo"}]}, {"name": "Grammar checked by", "members": [{"user_id": 430518, "username": "lunaflare"}]}], "writtenBy": [{"user_id": 408271, "username": "Dreadfury"}]}
  },
  "Iron Valiant": {
    "sets": [
      {
        "name": "Choice Specs",
        "description": "<p>Choice Specs Iron Valiant functions as a special wallbreaker thanks to its speed, power, and coverage moves. Psyshock hits Poison-types like Clodsire, Toxapex, and Amoonguss. Shadow Ball targets Gholdengo and Skeledirge, while Thunderbolt is used to hit Corviknight, as well as doing super effective damage to Toxapex, Tera Flying Gholdengo, and Tera Flying Kingambit. Trick is another option to cripple common switch-ins such as Clodsire, Skeledirge, Toxapex, and Volcarona. Focus Blast threatens an OHKO on Garganacl while greatly damaging Corviknight. However, Aura Sphere is another option that is more consistent thanks to its accuracy, though it misses out on the damage output of Focus Blast. Tera Fairy powers up Moonblast and removes Iron Valiant's weakness to Fairy-, Psychic-, and Flying-type attacks. Alternatively, Tera Ghost makes Iron Valiant immune to Dragonite's Extreme Speed, allows it to OHKO Gholdengo, and increases its damage output against Skeledirge. Tera Electric is a final option to OHKO Toxapex and physically defensive Corviknight and turn its Steel-type weakness into a resistance.</p> <p>Physically offensive Pokemon such as Dragonite, Kingambit, and Cinderace benefit from Iron Valiant, as they struggle against Dondozo, Great Tusk, and Rotom-W, all of which Iron Valiant can pressure effectively. Entry hazard support from partners like Ting-Lu, Garganacl, and Garchomp provides chip damage against Pokemon that try to play around Iron Valiant such as Toxapex, Amoonguss, and Clodsire. Pivots such as Rotom-W, Dragapult, Cinderace, and Corviknight give Iron Valiant opportunities to get on the field, reducing the risk of it taking damage. Volcarona can counter Iron Valiant, as it is only 3HKOed by all of its attacks and can set up in front of it. Therefore, Toxapex is a great partner, as is specially defensive Garganacl, which can handle Will-O-Wisp Volcarona, and Dragonite, which can handle Giga Drain variants. Iron Valiant enjoys the presence of partners that it can rely on to take hits, such as Toxapex, Great Tusk, Ting-Lu, and Garganacl, due to its frailty. Keeping the field free from hazards grants Iron Valiant more chances to get on the field and make progress, so teammates with access to Rapid Spin or Defog such as Great Tusk, Iron Treads, and Corviknight are appreciated.</p> "
      },
      {
        "name": "Mixed",
        "description": "<p>High attacking stats and a wide array of coverage moves make Iron Valiant a devastating mixed attacker that can 2HKO common defensive walls physically and specially; Moonblast and Thunderbolt threaten physically defensive Pokemon like Great Tusk, Corviknight, and Dondozo, while Close Combat and Psyshock deal with specially defensive foes like Ting-Lu and Clodsire. Its Quark Drive-boosted Speed from Booster Energy turns it into a potent late-game cleaner, letting it outspeed would-be revenge killers like Dragapult, and Choice Scarf Gholdengo, which is further enforced by its unique typing that resists Sucker Punch from Kingambit. However, it can also be used to revenge kill boosted threats like Baxcalibur and Dragonite in a pinch, especially since Iron Valiant can take on the latter's +1 Tera Normal Extreme Speed from full health. Tera Fairy boosts Iron Valiant's Moonblast while still retaining its defensive profile to take on Sucker Punch. Alternatively, Tera Electric amplifies Thunderbolt's damage, notably allowing it to 2HKO would-be checks like Toxapex, specially defensive Dondozo and Tera Water Garganacl, and offensive Gholdengo after Stealth Rock, as well as preventing Iron Valiant from being revenge killed by Scizor's Bullet Punch.</p> <p>Mixed Iron Valiant is commonly seen on offense and bulky offense teams. Due to the lack of a damage boosting item or setup move, it can still fall short of threatening bulky Pokemon like Amoonguss, and without Shadow Ball or Knock Off, Skeledirge and defensive Gholdengo as well; thus, Pokemon that can deal with them such as Great Tusk, and Kingambit make good teammates. Particularly, the aforementioned Pokemon can overwhelm a shared check in Corviknight and are generally effective as early-game wallbreakers that can open up Iron Valiant to clean up late-game easily. Entry hazards from teammates like Garchomp, Ting-Lu, and Glimmora can chip down foes like Garganacl, Amoonguss, and Tera Grass Dondozo. A sturdy defensive backbone with the likes of Corviknight and Ting-Lu can help check offensive threats that threaten Iron Valiant out, such as a boosted Roaring Moon, opposing Iron Valiant, and Gholdengo. Pivots like Dragapult, Scizor, and Rotom-W can compensate for Iron Valiant's lack of bulk by bringing it in safely on foes like Ting-Lu, Great Tusk, and Blissey, respectively; the latter can also cripple Amoonguss with either Trick or Will-O-Wisp. Gholdengo is a great partner, as it reliably prevents the much-needed entry hazards from being removed by Rapid Spin and Defog, threatens Skeledirge and Tera Fairy Garganacl, and appreciates Iron Valiant dealing with foes like Corviknight and Dark-types like Ting-Lu, Kingambit, and Roaring Moon in return.</p> "
      },
      {
        "name": "Calm Mind",
        "description": "<p>Iron Valiant utilizes a deadly combination of offensive power, coverage, and Speed to function as one of the best sweepers in OU. After a Quark Drive boost, Iron Valiant outspeeds and OHKOes a plethora of premier offensive threats in the tier, such as Dragapult, Meowscarada, and Roaring Moon. Thunderbolt allows Iron Valiant to damage Corviknight and bulky Water-types like Dondozo, Azumarill, Toxapex, and Tera Water Garganacl, while Psyshock scores a 2HKO on any Clodsire looking to stop Iron Valiant's sweep. With Calm Mind, Iron Valiant can switch roles from an endgame sweeper to a powerful wallbreaker. After one Calm Mind, Moonblast 2HKOes defensive Garganacl, and +1 Tera Electric Thunderbolt 2HKOes specially defensive Slowking and OHKOes Corviknight. Tera Fairy powers up Moonblast, which can now 2HKO Garganacl and Hatterene. Tera Electric boosts the power of Thunderbolt, which secures important 2HKOs on specially defensive Dodonzo, Corviknight, and Toxapex, lets Iron Valiant survive Scizor's Bullet Punch, and grants Iron Valiant an immunity to paralysis from Hatterene's Nuzzle.</p> <p>Iron Valiant relies heavily on its super-effective coverage moves for damage output. As a result, it struggles to make progress against Pokemon like Volcarona, Skeledirge, and Gholdengo. Thus, teammates like Clodsire and Ting-Lu are good defensive partners for Iron Valiant, with the added benefit of being able to set up entry hazards. Iron Moth has strong offensive synergy with Iron Valiant, being able to threaten Amoonguss, Iron Treads, and Tera Fairy Garganacl, while also being able to chip down special walls like Clodsire. On offense teams, Iron Valiant complements powerful wallbreakers like Nasty Plot Gholdengo, and Kingambit, since they can overwhelm defensive cores and open up the path for Iron Valiant to sweep. Finally, Iron Valiant is highly reliant on Booster Energy to sweep, as it cannot normally outspeed common revenge-killers like Dragapult, Cinderace, and Meowscarada. Therefore, it is important to time when to switch in to Iron Valiant to ensure defensive counters like Skeledirge and Volcarona are either removed or heavily damaged so it can sweep or break through the opposing team effectively. Along these lines, it is important to conserve Iron Valiant's health, since it can survive key priority moves such as Extreme Speed from Tera Normal Dragonite after a Dragon Dance. Therefore, Pokemon that can remove entry hazards, such as Great Tusk and Iron Treads, are great teammates for Iron Valiant.</p> "
      }
    ],
    "credits": {"teams": [{"name": "Quality checked by", "members": [{"user_id": 540138, "username": "Milo"}, {"user_id": 197439, "username": "chimp"}, {"user_id": 277988, "username": "dex"}, {"user_id": 349443, "username": "Tysonslayer"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 430518, "username": "Lunaflare"}, {"user_id": 384270, "username": "autumn"}, {"user_id": 232216, "username": "Lumari"}]}], "writtenBy": [{"user_id": 493260, "username": "royalfluxh"}, {"user_id": 40598, "username": "hamiltonion"}, {"user_id": 548068, "username": "SetsuSetsuna"}]}
  }
}