{
  "Beedrill-Mega": {"sets": {"Choice Band": {}}},
  "Pikachu": {
    "sets": {
      "Imposter": {
        "description": "<p>Thanks to Light Ball, Pikachu is a niche Imposter user that can break past less-sturdy Imposter-proofers, although it forgoes defensive utility in exchange. When Pikachu transforms, only the ability, item, and HP EVs listed here matter. The listed moves, non-HP EVs, and nature will very rarely see use: since Pikachu outspeeds all other Imposter users like Chansey, it is extremely rare that Pikachu is not transformed. Nevertheless, Volt Switch provides a reasonably strong pivoting option against opposing transformed Imposter users, which cause Pikachu's Imposter to fail, while Glare can paralyze threats to aid Pikachu later on. Healing Wish and Spikes both provide some utility if Pikachu is no longer needed. Since Pikachu is extremely frail, it can easily fall to any strong move from opposing threats it wants to transform into. Therefore, significant team support is needed to realize its potential. Paralysis spam through Nuzzle and Glare ensures Pikachu always outspeeds opposing threats like Mega Mewtwo X, and it can also generate free turns. Knock Off invalidates Pikachu, so Knock Off absorbers, such as Arceus with a held Plate are recommended. Bulky special walls like Ice Scales Arceus-Ground and Ho-Oh check Mega Diancie and Arceus-Ghost, which Pikachu cannot safely transform into: the former can OHKO with Extreme Speed, and the latter Imposter-proofs itself.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 338877, "username": "TTTech"}]}, {"name": "Grammar checked by", "members": [{"user_id": 517429, "username": "Adeleine"}]}]}
  },
  "Alakazam-Mega": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Mega Alakazam is a powerful special wallbreaker and revenge killer by virtue of its nearly unparalleled Speed tier and sky-high Special Attack. Moongeist Beam provides coverage against opposing Psychic-types and Imposter users, and it also bypasses Ice Scales. Fleur Cannon OHKOes Yveltal and Dragon-types such as Mega Garchomp and Miraidon. Blue Flare is the strongest coverage option against Steel-types like Mega Steelix and Registeel. Beads of Ruin provides a general power boost to all moves, but Psychic Surge allows Mega Alakazam to use Expanding Force, which is more spammable than Psycho Boost, and Psystrike, which crushes Blissey and RegenVest users like Primal Kyogre. Mega Alakazam appreciates support from Imposter users and Knock Off users to remove Assault Vests from RegenVest Pokemon that could otherwise what move it locks into and Leftovers from Blissey to make it easier to wear down. Entry hazard support from RegenVest users with Stone Axe and Spikes users such as Eternatus can help Mega Alakazam achieve 2HKOes on targets like Ice Scales Arceus formes. RegenVests users like Primal Kyogre can additionally provide slow pivoting to bring Mega Alakazam in safely, as it is frail and susceptible to status conditions; these can also Imposter-proof Mega Alakazam if it isn't using Psystrike. Other Imposter-proofing options include Imposter Chansey and Ice Scales walls neutral to its attacks like Ho-Oh.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Slowbro-Mega": {
    "sets": {
      "Physical Wall": {
        "description": "<p>Mega Slowbro's insanely high Defense and good typing make it an incredibly hard to break Fur Coat wall on balance teams, checking and forcing out common metagame threats like Mega Garchomp and Kyurem-B. Scald threatens to burn setup threats like Ice Scales Arceus-Ground, which could otherwise set up in Mega Slowbro's face, and it also deals solid damage. Future Sight has incredible synergy with Teleport, as it allows Mega Slowbro to support its offensive teammates by preventing opposing walls from safely switching in. Alternatively, Mortal Spin allows Mega Slowbro to serve as an entry hazard remover and cripple foes unaffected by burn, such as Ho-Oh. Covert Cloak prevents Mega Slowbro from being chipped by foes reliant on Salt Cure and Mortal Spin to make progress, while Rocky Helmet consistently chips wallbreakers in exchange for a worse matchup against passive walls like Mega Audino; Rocky Helmet also notably punishes Choice Band foes, such as Kyurem-B, for trying to easily up chip damage with U-turn. The pivoting and Future Sight support Mega Slowbro provides is heavily appreciated by wallbreakers that often fall just shy of 2HKOs, such as Mega Garchomp and Ash-Greninja; teammates with a bad matchup against various physical attackers are also appreciative of its walling capabilities, including the likes of Ice Scales Ho-Oh and Blissey. The aforementioned Blissey and other special walls like Ice Scales Arceus-Ground and Ho-Oh can also cover for dangerous foes like Miraidon and Flutter Mane, forming a solid defensive core. Since Ash-Greninja is one of the only wallbreakers that can dissuade Mega Slowbro from switching in, a check to it like Miraidon or Fur Coat Arceus-Fairy is appreciated. Mega Slowbro should be Imposter-proofed by a Take Heart user, ideally with Thunder Cage, as even if Mega Slowbro is able to burn or poison the Imposter user, it still acts as a free source of healing and Teleport momentum.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 528036, "username": "Sulo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Chansey": {
    "sets": {
      "Imposter": {
        "description": "<p>With Imposter, Chansey transforms into a version of the opposing Pokemon with bulk that is far greater and can be further bolstered by Eviolite. This provides a myriad of benefits, including blanket checking most Pokemon, scouting sets, and PP stalling less threatening foes. These traits make Imposter Chansey a valuable addition to almost every team. The given moves offer the most utility in the rare situations Chansey is not transformed, allowing it to Imposter-proof certain special attackers and act as a cleric. While Eviolite is usually the best item, Covert Cloak is useful against Spirit Shackle and Salt Cure users, and Spooky Plate allows Chansey to threaten Arceus-Ghost and Lunala that would otherwise defeat it with Judgment. Offensive threats such as Ultra Necrozma appreciate the information Imposter Chansey provides through scouting; physical attackers in particular highly appreciate moves like Burning Bulwark being discovered. Special attackers enjoy Imposter Chansey taking advantage of RegenVest users and potentially Imposter-proofing them. Imposter Chansey appreciates slow pivoting from Pokemon like Celesteela and Mega Steelix so it can safely scout. Specially defensive Pokemon like Ice Scales Arceus formes and Magic Guard Blissey can serve as checks to opposing Take Heart Arceus formes, which can beat Imposter Chansey one-on-one, while also checking Dragon-type attackers like Eternatus and Miraidon that can hit it hard.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Blissey": {
    "sets": {
      "Magic Guard": {
        "description": "<p>With naturally high Special Defense and HP along with a decent neutral typing against most attacks, Blissey is an effective special wall capable of checking various special threats like Eternatus and Miraidon. Magic Guard also gives Blissey an immunity to residual damage from sources such as Salt Cure and Thunder Cage, with the protection from the latter and its low Attack limiting healing from Strength Sap letting it check most Take Heart Arceus formes. Ruination is a way to make near-guaranteed progress barring a miss, and its consistent damage mitigates Blissey's otherwise-crippling passivity. Topsy-Turvy deters setup attempts from Take Heart and Nasty Plot users by inverting their boosts and likely forcing a switch, in which case Blissey can then pivot out with Teleport or Parting Shot. Blissey's ability to deny Strength Sap healing makes it a great pick on balance teams carrying physical attackers such as Mega Lucario, as Fur Coat walls with Strength Sap usually can't get past Blissey, and physical attackers can force Imposter users out if they switch in while Blissey is pivoting. Blissey's immense frailty means that reliable physical walls, such as Mega Slowbro, are mandatory to cover for it; Arceus-Ghost can also bypass Blissey with either Secret Sword or Triple Arrows, so Yveltal makes for a good teammate. Imposter-proof Blissey with any Regenerator user.</p>"
      },
      "Regenerator": {
        "description": "<p>Blissey uses its enormous special bulk and minimal Attack to simultaneously wall special threats and disrupt their Strength Sap recovery while maintaining momentum from Regenerator. Knock Off is a staple move on RegenVest users, while Wish in conjunction with Blissey's HP helps keep teammates healthy. Ruination reduces Blissey's passivity, though Salt Cure is an alternative that can be more effective into Pokemon like Celesteela and Flare Boost Flutter Mane. Clear Smog, Topsy-Turvy, and Glare prevent Blissey from being setup fodder, with the latter being particularly useful against Magic Guard Eternatus and Imposter users, while Stone Axe provides utility if setup control is not necessary. Assault Vest further amplifies Blissey's Special Defense against powerful wallbreakers like Mega Alakazam that could otherwise outdamage Regenerator healing, while Heavy-Duty Boots prevents entry hazard damage and allows Blissey to access the aforementioned status moves. Blissey pairs incredibly well with very fast offensive Pokemon like Mega Alakazam and Mega Sceptile, as it provides slow pivoting, Wish support to offset residual damage for Mega Alakazam and allow Mega Sceptile to forgo Strength Sap, and healing denial against special walls like Ice Scales Arceus formes, while they revenge-kill numerous threats that Blissey can pivot into, especially those that Blissey cannot beat by itself such as Eternatus and Flare Boost Flutter Mane. Strong physical attackers also work well, as they can offensively Imposter-proof Blissey without conceding momentum; particularly, Ash-Greninja can pick off chipped Ice Scales Arceus formes. Blissey cannot handle certain special attackers like Psystrike Mega Alakazam, Shell Side Arm Eternatus, and various Secret Sword users, mandating a secondary special wall like Ice Scales users. Depending on the moveset, Blissey can be Imposter-proofed by other RegenVest users or Magic Guard users.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 589755, "username": "rightclicker"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Ho-Oh": {
    "sets": {
      "Ice Scales": {
        "description": "<p>Ho-Oh is an effective special wall capable of checking dangerous special attackers like Simple Lunala and Mega Gardevoir. Teleport is a fantastic move for slowly pivoting in offensive teammates. Knock Off can crucially remove items from Ho-Ohs's checks like Miraidon, Imposter Chansey, and Mega Slowbro. Mortal Spin in combination with STAB-boosted V-create allows Ho-Oh to function as a strong entry hazard remover thanks to its solid matchup against most Steel types, and Mortal Spin can heavily punish Imposter users on the switch. Topsy-Turvy crucially removes stat boosts against foes like Simple Arceus-Ghost and Lunala. Ho-Oh requires suitable Knock Off absorbers like Dialga-O and Arceus formes because of its glaring Stealth Rock weakness. Ho-Oh also struggles against Miraidon, Primal Kyogre, and most Take Heart Arceus formes, so teammates that can deal with them like Blissey and RegenVest Mega Swampert can help. Imposter-proof Ho-Oh with the aforementioned Knock Off absorbers, although they should ideally have a method to punish the Imposter user back. Steel-types not weak to Fire such as Primordial Sea Celesteela and Registeel can be used to block the Imposter user's Mortal Spin, although they must carry a move to prevent the Imposter user from freely healing with Recover.</p>"
      },
      "Magic Guard": {
        "description": "<p>Good stats and the fabled STAB-boosted V-create make Ho-Oh a solid setup attacker. Magic Guard negates annoying chip damage from Mortal Spin and Salt Cure and allows for free use of Life Orb. Volt Tackle's very high PP and good damage output are excellent, as they allow Ho-Oh to both fish for paralysis on threats like Imposter users and also deal hefty damage, notably ensuring that Mega Slowbro can't wall it long-term. Swords Dance bolsters these moves even further, notably allowing V-create to OHKO neutral Arceus formes and Volt Tackle to 2HKO Mega Slowbro, in addition to preventing Imposter users and faster Pokemon like Eternatus and from permanently walling Ho-Oh with Strength Sap; alternatively, Headlong Rush allows Ho-Oh to hit foes like Eternatus and Fire-immune Steel-types like Registeel super effectively. Magic Guard Ho-Oh best fits on balance teams looking for a bulky setup attacker that wears down common walls and can potentially sweep late-game. Dragon-types are a notable thorn in Ho-Oh's side, particularly ones that use Strength Sap like Eternatus, so an ally that blocks Strength Sap like Magic Guard Blissey is a valuable teammate. Ho-Oh's damage potential also tanks without its Life Orb, so a Knock Off absorber like an Arceus forme is useful. Imposter-proof Swords Dance Ho-Oh with a Dragon-type teammate like Eternatus or Miraidon; Headlong Rush sets can be Imposter-proofed by any Fur Coat user, ideally one immune to or not bothered by potential paralysis.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 658705, "username": "Notgamingreally"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Sceptile-Mega": {
    "sets": {
      "Magic Guard": {
        "description": "<p>Mega Sceptile is a decent fast attacker. Its main draw is its high Speed, giving it the jump on other common fast attackers like Ash-Greninja, Eternatus, and after chip damage, Flutter Mane. Life Orb-boosted Dragon Energy and Chloroblast pack a good punch, letting Mega Sceptile threaten neutral targets like Mega Audino, and Chloroblast uniquely matches up well against Mega Swampert and Arceus-Ground. Torch Song targets Steel-types like Celesteela and Magearna, and it can also enable late-game sweeps against softened teams. Mega Sceptile best fits on balance teams looking for a tool to out-offense traditional fast attackers like Eternatus without having to deal with a Choice lock like Mega Alakazam does. Mega Sceptile's damage isn't particularly high, even after Torch Song, and Strength Sap with only special moves means Strength Sap blockers like Magic Guard Blissey are a big problem; for this reason, Mega Sceptile should be used as a supporting piece for other special wallbreakers like Flutter Mane and Secret Sword Arceus-Ghost. Primordial Sea Steel-types like Registeel are also essentially immune to damage from Mega Sceptile, so Magic Guard users that can switch in and cut their utility are recommended. Mega Sceptile is frail and also needs to keep its Life Orb to deal any acceptable damage, so slow pivots like Mega Audino are essentially mandatory for it. Imposter-proof Mega Sceptile with a special wall like Magic Guard Blissey or Imposter Chansey.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}]}]}
  },
  "Swampert-Mega": {
    "sets": {
      "Ice Scales": {
        "description": "<p>Mega Swampert leverages its strong typing, usable bulk, and good Attack to be an effective Tidy Up user with an advantage against Miraidon and Ultra Necrozma. Tidy Up allows it to remove entry hazards while also allowing it to outspeed threats such as Mega Lucario and sweep late-game given roadblocks like Ho-Oh and Celesteela have been removed. Precipice Blades has higher power, notably OHKOing Registeel at +1, while Earthquake doesn’t miss. Spirit Shackle allows Mega Swampert to trap Imposter users while setting up, ensuring it exits the interaction at +6 with the Imposter user gone. Strength Sap has more PP then Recover and allows Mega Swampert to successfully beat Imposter users by itself. Covert Cloak helps Mega Swampert against moves like Salt Cure and Mortal Spin. Mega Swampert fits well on teams that appreciate its hazard removal capabilities and typing, notably providing a buffer against the aforementioned Miraidon and Ultra Necrozma. Mega Swampert's lack of a stat boost-removing move means bulky Topsy-Turvy users like Mega Audino and Yveltal are appreciated to take on bulky setup sweepers like Simple Arceus-Ghost, Mega Audino as well as Blissey can also beat Take Heart Arceus Formes which Mega Swampert can struggle against. Mega Swampert can be Imposter-proofed by itself, but in an emergency, most Topsy-Turvy users and bulky Flying-types like Celesteela, Ho-Oh, and Yveltal will do the same.</p>"
      },
      "RegenVest": {
        "description": "<p>RegenVest Mega Swampert is a reliable pivot with a strong advantage against Pokemon like Miraidon and Eternatus. Precipice Blade's high Base Power is generally preferred; however, Earthquake doesn’t miss. Mortal Spin can remove entry hazards particularly well thanks to Mega Swampert's Ground-type STAB move scaring off Steel-types like Registeel, and its ability to poison pairs well with Knock Off, which removes Covert Cloak from foes like Mega Audino. Stone Axe allows Mega Swampert to make progress against switch-ins like Arceus-Ghost. Frail offensive Pokemon like Mega Lucario, Blacephalon, and Mega Alakazam appreciate Mega Swampert's utility and its ability to stifle fast Dragon-types like Miraidon and Eternatus that would otherwise scare them out, with Mega Alakazam crucially outspeeding and KOing Miraidon and Eternatus, preventing them from spamming Strength Sap against Mega Swampert. Because of Mega Swampert's lack of incredible bulk, it cannot be relied on to wall most of the metagame; as a result, partners like Ho-Oh and Mega Audino are useful help against stronger special attackers like Mega Alakazam and Palkia-O. Salt Cure and Celesteela also greatly annoy Mega Swampert, so partners like Miraidon and other Magic Guard users help. Mega Swampert can be Imposter-proofed with Take Heart Arceus formes with a held Plate.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 658705, "username": "Notgamingreally"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 652656, "username": "Gambit_Gamin"}]}]}
  },
  "Gardevoir-Mega": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Sky-high Special Attack alongside STAB- and Pixilate-boosted Boomburst makes Mega Gardevoir a powerful special wallbreaker. It also has STAB-boosted Psystrike, allowing it hit common special walls like Magic Guard Blissey and RegenVest users like Primal Kyogre for respectable damage. Blue Flare destroys Steel-types like RegenVest Celesteela, while Steam Eruption 2HKOes Primordial Sea Steel-types, otherwise solid checks. Volt Switch eases prediction and chips targets like Ho-Oh into 2HKO range of Psystrike. Mega Gardevoir synergizes very well with other specially offensive Pokemon like Eternatus and Palkia-O because it's capable of pressuring common specially defensive walls like Ice Scales Mega Audino, Magic Guard Blissey, and RegenVest Primal Kyogre. In return, these threats help dent faster special walls like Arceus formes. RegenVest Pokemon like Celesteela can help compensate for Mega Gardevoir's low physical bulk and middling Speed by providing slow pivoting and potential paralysis support. Mega Gardevoir can be Imposter-proofed by teammates such as Well-Baked Body Steel-types and Ice Scales Pokemon like Arceus formes and Lunala.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Registeel": {
    "sets": {
      "Fire Immunity": {
        "description": "<p>Registeel takes advantage of Primordial Sea to rid itself of a Fire weakness, improving its matchups against Ultra Necrozma, Mega Sceptile, and Eternatus; Primordial Sea also isn't ignored by Mold Breaker, making it preferred over Well-Baked Body. Salt Cure and Knock Off help to cripple would-be switch-ins like Mega Garchomp and Mega Swampert as well as being overall annoying to Imposter users, while Stone Axe lets Registeel set entry hazards for its teammates. Glare and Nuzzle both help to cripple Pokemon that Registeel checks such as Eternatus and Mega Sceptile; with Glare, it can slow down Ground-types like Arceus-Ground and Mega Garchomp, while Nuzzle can paralyze Magic Bounce Pokemon like Yveltal. Alternatively, Mortal Spin lets Registeel remove entry hazards and prevent Imposter users from stealing its utility. Teleport is useful for slow pivoting into teammates without fail, while Parting Shot can weaken foes for the incoming teammate at the cost of being useless against Magic Bouce. Primordial Sea and Well-Baked Body both give a Fire immunity, with Primordial Sea not being affected by Mold Breaker and removing Desolate Land, while Well-Baked Body lets Registeel spinblock Primal Kyogre without taking boosted Scalds. Registeel struggles with Fighting- and Ground-types like Mega Lucario, Mega Blaziken, and Mega Garchomp, so having Fur Coat teammates like Miraidon, Arceus-Fariy, and Arceus-Ghost can help. Registeel can Imposter-proof itself for the most part, but when using Knock Off, having any Arceus forme will do, and with Glare and Parting Shot, having a Magic Bouncer like Mega Audino will work. Registeel helps to Imposter-proof Pokemon with Fire-type coverage like Mega Sceptile and Eternatus.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 603640, "username": "Hiusi guy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Kyogre-Primal": {
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Primal Kyogre is a useful special wall, pivot, and utility Pokemon, notably checking foes like Flutter Mane, Palkia-O, and Eternatus. Flip Turn allows Primal Kyogre to safely scout moves from opposing threats like Choice Specs Flutter Mane and then swap into the appropriate answer, be it an Imposter Pokemon or an Ice Scales user. Scald is typically preferred over Steam Eruption thanks to its higher PP, but some teams may appreciate the extra power of Steam Eruption. Knock Off cripples item-reliant Pokemon like Chansey, RegenVest Dialga, and RegenVest Celesteela along with removing Covert Cloak to let it status Pokemon it otherwise couldn't, such as Mega Audino. Mortal Spin's entry hazard removal and poison-inflicting capabilities make it a good all-around utility choice, especially since Primal Kyogre has an excellent matchup against many of the metagame's Steel-types, like Mega Steelix and Celesteela. Nuzzle can slow down wallbreakers like Eternatus and Choice Specs Flutter Mane, and Stone Axe can help wear down foes for allies. Primal Kyogre's fear of physical wallbreakers like Mega Garchomp, Ash-Greninja, and Ultra Necrozma makes reliable checks to them, like Fur Coat Mega Audino and Ice Scales Arceus-Ground, useful teammates. Special wallbreakers like Flutter Mane, Eternatus, and Miraidon appreciate Knock Off removing items from opposing RegenVest users and Ability Shields from Pokemon like Ice Scales Arceus-Ground. Imposter-proof Primal Kyogre with a Take Heart Arceus forme holding a Plate.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 610920, "username": "vesp"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Deoxys": {"sets": {"Sheer Force": {}}},
  "Garchomp-Mega": {
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Mega Garchomp is a strong wallbreaker thanks to its high Attack and good STAB moves. Dragon + Ground offers good coverage that only Celesteela resists, and even then, it needs to be using Fur Coat to survive two uses of Glaive Rush; Mega Garchomp also isn't weak to Stealth Rock, giving it an advantage over a close competitor in Kyurem-B. Headlong Rush is generally better than Precipice Blades, as it doesn't miss and Imposter users aren't immune to Tough Claws's damage boost, but Precipice Blades has more PP and doesn't make contact. Sunsteel Strike is necessary for smashing through Fur Coat Mega Audino and Arceus-Fairy, which are otherwise unbreakable walls. Bolt Strike can 2HKO Fur Coat Mega Slowbro and Celesteela; alternatively, U-turn can provide momentum and still help weaken Mega Slowbro. While Mega Garchomp is powerful, it isn't fast, meaning Fur Coat Arceus formes can always outspeed it and attempt to heal with Strength Sap; as a result, allies that can limit Strength Sap's recovery, such as Blissey and Magic Bounce users, are good support. Most other offensive Pokemon in the tier outspeed Mega Garchomp and chase it out, so solid defensive options like Mega Audino, Celesteela, and Arceus formes are recommended. Mega Garchomp also requires correct prediction to make any substantial progress, so reliable pivots like RegenVest users are useful. Mega Garchomp's use of four contact moves means Burning Bulwark is a massive problem, so an Imposter user can help with scouting in order to avoid a disaster. Imposter-proof Mega Garchomp with a bulky Fur Coat user like Mega Slowbro, Celesteela, or an Arceus forme; if Mega Garchomp is using Bolt Strike, Celesteela shouldn't be used, but Mega Slowbro still works.</p>"
      },
      "Setup Sweeper": {
        "description": "<p>Mega Garchomp is a strong late-game sweeper, bursting through foes with its strong boosted Glaive Rush and Headlong Rush. Shift Gear allows Mega Garchomp to outspeed every Pokemon in the tier, including most +1 foes, while Tidy Up clears entry hazards. Jungle Healing allows Mega Garchomp to set up in the face of Mortal Spin users like Mega Steelix, helps deal with burns from Burning Bulwark, and limits the recovery any Imposter users can steal. 164 Defense EVs ensure Eviolite Imposter Chansey is OHKOed by +1 Glaive Rush. Mega Garchomp can never break through Fur Coat Pokemon like Arceus-Fairy, Mega Audino, Mega Slowbro, and Celesteela by itself, so teammates like Mega Lucario and Ultra Necrozma can help by dealing with these checks. Mega Garchomp enjoys teammates that can block or reduce Strength Sap's healing like Blissey or Mega Slowbro. Finally, Mega Garchomp appreciates being slowly pivoted onto the field by Pokemon such as Mega Swampert, Mega Audino, and Mega Steelix to provide it with as many opportunities to set up as possible. To Imposter-proof Mega Garchomp, you can use Fur Coat Arceus-Fairy, Arceus-Ghost, or Mega Slowbro.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 603640, "username": "Hiusi guy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Lucario-Mega": {
    "sets": {
      "Mixed Attacker": {
        "description": "<p>Mixed Mega Lucario fills a valuable niche as the easiest way to bypass Fur Coat Mega Audino, Mega Slowbro, and Celesteela in a single teamslot. Sunsteel Strike deals solid damage even without Choice Band; every non-resistant foe bar Giratina takes over 50%, meaning allies that can block Strength Sap can deny foes like most Arceus formes healing of any value, and it OHKOes Mega Audino after any chip damage. Electro Drift OHKOes the two most common Sunsteel Strike answers, being Celesteela and Mega Slowbro. Strength Sap provides reliable healing to offset Life Orb recoil, especially given that no Strength Sap blocker wants to come near Mega Lucario, while Tidy Up provides some entry hazard removal and gives Mega Lucario a late-game sweeping option. Mega Lucario's best fit is on more offensive teams looking for a tool to pave the way for dangerous allies like Tidy Up Mega Garchomp and Sniper Ash-Greninja. The exclusive use of contact moves means an unexpected Burning Bulwark can instantly kill any hopes of Mega Lucario doing acceptable damage, so Imposter users can prove useful to scout for it. Mega Lucario also struggles to beat faster Strength Sap users, such as Arceus formes, Miraidon, and Eternatus, one-on-one; as a result, a Strength Sap-blocking teammate like Magic Guard Blissey is highly recommended. Imposter-proof Mega Lucario with a faster Fur Coat user that ideally resists Steel, such as Arceus-Fire or Miraidon.</p>"
      },
      "Choice Band": {
        "description": "<p>Mega Lucario's potent STAB combination and serviceable Speed tier make it an effective wallbreaker on balance teams. Sunsteel Strike ignoring Fur Coat further differentiates Mega Lucario from other wallbreakers of its caliber, denting walls like Arceus-Ghost and Yveltal more easily; Steel STAB also notably makes it much more effective against Fur Coat Mega Audino. Bolt Strike decimates Ho-Oh, 2HKOes Fur Coat Celesteela, and can potentially eliminate Mega Slowbro after chip damage and entry hazards. U-turn allows Mega Lucario to escape unfavorable matchups like Fur Coat Arceus-Ghost to bring in a teammate that can handle them, and it can also help accumulate chip damage on Mega Slowbro. Mega Lucario's good matchup against Fur Coat walls like Mega Audino and Arceus-Fairy makes it synergize well with teammates like Ash-Greninja and Mega Garchomp; it also appreciates entry hazards from teammates like RegenVest pivots utilizing Stone Axe. Said RegenVest pivots can also bring in Mega Lucario via slow pivoting, which is helpful, since its poor bulk and complete reliance on its held item prevent it from doing so on its own. Other slow pivots like Teleport Mega Audino and Dialga-O are also appreciated, with Dialga-O in particular setting up uncomfortable situations for the opponent with Doom Desire, enhancing Mega Lucario's wallbreaking ability. Mega Lucario should be Imposter-proofed with Fur Coat Mega Slowbro or a neutral Fur Coat wall like Arceus-Ghost.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 528036, "username": "Sulo"}, {"user_id": 577920, "username": "Tea Guzzler"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Dialga-Origin": {
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Dialga-O acts as a reliable pivot and a check to some special attackers like Miraidon and Eternatus. Revelation Dance hits Flutter Mane and Mega Audino for major damage, preventing the former from using Dialga-O as a free Nasty Plot window and the latter from using it as a free Teleport window. Doom Desire can enable attackers that struggle to break through Fairy-type walls like Mega Garchomp and Ash-Greninja due to their one-sided wallbreaking nature shoehorning your opponent into specific response patterns; alternatively, Draco Meteor threatens Miraidon and Eternatus. Additionally, Revelation Dance + Draco Meteor hits both Flutter Mane and Dragon-type attackers, but Dialga-O can't provide Doom Desire support if this combination is run. Replacing either move with Doom Desire forces you to pick what Dialga-O can and can't beat, but it's still able to pivot into a teammate that takes care of foes that it struggles with. Knock Off removes key items such as Assault Vest from RegenVest Mega Steelix, Salt Cure heavily deters Steel-types that would otherwise endlessly wall Dialga-O, Rapid Spin acts as decent entry hazard removal, and Stone Axe can be used as a reliable way to set entry hazards. A Quiet nature is recommended for Revelation Dance to potentially KO Flutter Mane after three turns of burn damage and Draco Meteor to OHKO Miraidon, but a Sassy nature provides greater safety against threats like Mega Alakazam. Teammates that struggle to break through Fairy-types appreciate Dialga-O hitting them with Doom Desire, as mentioned previously, along with the slow pivoting it provides. Teammates vulnerable to Thunder Cage and Mortal Spin like Mega Slowbro also appreciate Dialga-O checking users of these moves. Dialga-O cannot break through Steel-types without Salt Cure, so a Pokemon that can pivot in and break them like Magic Guard Ho-Oh makes for a good partner. Dialga-O is heavily reliant on Assault Vest to actually check threats, so a partner that can absorb Knock Off like Arceus-Ghost also synergizes well with it. Imposter-proof Dialga-O with a neutral Ice Scales user, a Steel-type if it's not running Salt Cure, or Imposter Chansey if it's not running Knock Off.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589755, "username": "rightclicker"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Palkia-Origin": {
    "sets": {
      "Nasty Plot": {
        "description": "<p>Palkia-O is a strong setup sweeper that has an unremovable item and a strong matchup against the likes of Arceus-Ground and Ho-Oh. Speed Boost denies offensive counterplay from Pokemon like Ash-Greninja and Flutter Mane, and it prevents slow pivots like Teleport Blissey from forcing Palkia-O out via switching to Imposter users. Magic Guard can exploit defensive Pokemon that rely on status moves to deal damage, lets Palkia-O sit on common Knock Off users, and helps keep Dragon Energy's power high. Strength Sap is generally preferred for its greater amount of healing, but Recover can help against Strength Sap blockers like Mega Audino and Blissey. Pokemon like Ultra Necrozma and Mega Gardevoir appreciate Palkia-O beating Ho-Oh and Arceus-Ground, and they can help it beat checks like Mega Audino and Blissey in return. Speed Boost Palkia-O essentially ceases to function if statused, so a status absorber like a Take Heart Arceus forme can help. Teammates such as Blissey that can take on faster attackers like Eternatus and Flutter Mane are also greatly appreciated by Magic Guard variants. Imposter-proof Palkia-O with Ice Scales Mega Audino, Arceus-Fairy, or Imposter Chansey.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 658705, "username": "Notgamingreally"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Giratina": {
    "outdated": true,
    "sets": {
      "Prankster": {
        "description": "<p>Prankster + Haze Giratina's huge bulk and recovery and disruption options allow it to function as a reliable answer to setup users. Giratina has a wide array of options it can use to disrupt foes attempting to set up: Glare paralyzes fast attackers such as Palkia-O, Encore keeps them locked into moves such as Nasty Plot, Parting Shot lets Giratina pivot and Destiny Bond trades a KO, and Entrainment helps force out ability-dependent attackers. Heavy-Duty Boots helps Giratina switch in more easily without fear of entry hazard chip, while Covert Cloak helps prevent status from moves like Mortal Spin and Nuzzle. Tera Fairy improves Giratina's matchup into opposing Dragon-types such as Koraidon while maintaining a Fighting-type resistance, whereas Tera Dark grants immunity to status moves from opposing Prankster users and a Ghost- and Dark-type resistance for Flutter Mane and Arceus-Dark. Great partners for Prankster Giratina include RegenVest Ting-Lu, Fur Coat Dondozo, and Imposter users thanks to their strong defensive synergy, which allows Giratina to get in more comfortably against Arceus-Ghost and Koraidon.</p>"
      },
      "Magic Bounce": {
        "description": "<p>Giratina is a great defensive Pokemon that provides utility and disruption with its immunity to Fighting and resistance to powerful attacks like V-create and Rising Voltage. Court Change makes Giratina effective at removing entry hazards against Mold Breaker entry hazard setters and Stone Axe Pokemon. Strength Sap helps with keeping strong physical attackers such as Groudon in check. Whirlwind bypasses Substitute to force out foes, whereas Encore can be used as another form of disruption. Scald is useful for spreading burns, especially against physical attackers such as Groudon and Zamazenta-C. Tera Fairy is great for the immunity to Dragon-type attacks from Koraidon, Eternatus, and Palkia-O, while Tera Dark is great for being resistant to Ghost- and Dark-type attacks from Arceus-Ghost and Hoopa-Unbound. Covert Cloak helps Giratina beat Imposter users and blocks troublesome status from Scald and Mortal Spin. Dondozo and RegenVest Ting-Lu are great partners for Giratina thanks to their physical bulk and complementary typings, which help Giratina against threats such as Eternatus and Arceus-Ghost.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 338877, "username": "TTTech"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 375662, "username": "Isaiah"}]}]}
  },
  "Arceus-Electric": {
    "sets": {
      "Defensive": {
        "description": "<p>Arceus-Electric's main draw is its Electric typing, which grants it both STAB on Thunder Cage and a resistance to it, giving Arceus-Electric a niche over other mostly neutral options like Arceus. Ice Beam provides generally good coverage, hitting Dragon- and Ground-types like Eternatus and Mega Garchomp that can otherwise switch into Thunder Cage safely. Secret Sword is an option that lets Arceus-Electric bypass Blissey, an otherwise hard stop to it that also denies Strength Sap healing. Leftovers provides crucial recovery for Ice Beam and Scald variants against Blissey, but Rocky Helmet is an option to harshly punish Ash-Greninja. Fur Coat variants can handle most physical threats but are notably weak to Mega Garchomp, making a teammate like Celesteela or a secondary Fur Coat user necessary. Ice Scales variants can struggle to answer powerful threats like Mega Alakazam and Flutter Mane long-term, making a secondary specially defensive teammate, such as a RegenVest user or Blissey, helpful. Arceus-Electric usually can Imposter-proof itself, but Pokemon like Imposter Chansey can act as a secondary Imposter-proofer if it is weakened or inflicted with Salt Cure.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arceus-Fairy": {
    "sets": {
      "Take Heart": {
        "description": "<p>Arceus-Fairy's excellent typing allows it to check dangerous wallbreakers depending on its ability, with Fur Coat variants checking threats like Ash-Greninja and Mega Garchomp, while Ice Scales variants can handle threats like Palkia-O and Nasty Plot Arceus-Ghost. Fairy's good neutral coverage also allows Arceus-Fairy to double as a potent bulky setup threat. Take Heart allows Arceus-Fairy to boost its offenses and set up alongside threats like Arceus-Ghost; it also shakes off debilitating status from Mortal Spin. Thunder Cage provides good general coverage, hitting Celesteela and Ho-Oh, and it inflicts chip damage to special walls like Ice Scales Arceus formes. Strength Sap allows Arceus-Fairy to win one-on-one against Imposter users thanks to Thunder Cage and helps neutralize physical wallbreakers like Mega Garchomp. Pixie Plate lets Arceus-Fairy act as a good Knock Off absorber, while Covert Cloak prevents it from being chipped by Mortal Spin and Salt Cure. Revelation Dance is a niche option for Covert Cloak sets to still hit rare Normalize users. Fur Coat Arceus-Fairy has a poor matchup against Mega Lucario, so Lucario checks like Mega Slowbro and Victini are good teammates, with the former acting as a secondary check to Sunsteel Strike Mega Garchomp and the latter checking Ultra Necrozma. Ice Scales Arceus-Fairy can struggle against threats like Flutter Mane and Poison move Eternatus; as a result, teammates like Primal Kyogre and Blissey are appreciated. Arceus-Fairy generally can Imposter-proof itself, but a Pokemon that can Imposter-proof it as a backup like Imposter Chansey is helpful for when it is at low health.</p>"
      },
      "Tidy Up": {
        "description": "<p>Arceus-Fairy is an effective entry hazard remover and check to various wallbreakers like Ash-Greninja, Mega Alakazam, and Mega Garchomp, depending on its ability. Fur Coat makes Arceus-Fairy a blanket check to physical attackers, while Ice Scales improves its matchup against special wallbreakers like the aforementioned Mega Alakazam and Miraidon. Beyond removing hazards, Tidy Up reduces Arceus-Fairy's overall passivity and gives it late-game sweeping potential when checks like Celesteela are gone. Spirit Shackle takes advantage of passive foes like Celesteela and Yveltal that don't have a move to remove Attack boosts and lets Arceus-Fairy potentially rack up boosts or switch to a teammate that can better exploit them; it also lets Arceus-Fairy trap Imposter users, which should always ensure the Imposter user faints and Arceus-Fairy gets +6 Attack. Strength Sap provides reliable recovery that lets Arceus-Fairy beat wallbreakers consisatently while also preventing it from being overwhelmed by physical setup sweepers and maintaining its ability to Imposter-proof itself. Covert Cloak allows Arceus-Fairy to completely wall passive foes reliant on moves like Mortal Spin and Salt Cure to make progress, forcing them out as a result, and it guarantees that Imposter users can't get past it via confusion. Arceus-Fairy's good utility makes it a solid fit on balance teams in need of hazard removal and a general check to physical attackers; its ability to remove said hazards makes teammates consistently annoyed by them, such as RegenVest users and wallbreakers like Ultra Necrozma, solid to use alongside it. Arceus-Fairy doesn't have a joyous time against Sunsteel Strike users like Mega Lucario and most Mega Garchomp, so Regenerator Celesteela is highly recommended to scout their moves beforehand. Arceus-Fairy also commonly invites in the likes of Celesteela and Dondozo, so teammates that take advantage of them like Mega Swampert and Magic Guard Miraidon are appreciated. Arceus-Fairy can Imposter-proof itself, as it wins the one-on-one against Imposter users through PP stalling, but a reasonably bulky Strength Sap user like Ho-Oh can help out if Arceus-Fairy is at very low HP and thus can't beat Imposter users without risking a Speed tie.</p>"
      },
      "Pixilate": {}
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 528036, "username": "Sulo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arceus-Fighting": {
    "sets": {
      "Fur Coat": {
        "description": "<p>Arceus-Fighting distinguishes itself as a Take Heart Arceus forme through its Fighting-type STAB moves, letting it pressure Blissey, an otherwise difficult wall to surpass, much harder. Its Fighting typing also provides it with a useful resistance to Ash-Greninja's Wicked Blow, a resistance to Stealth Rock, and no weaknesses to common physical moves. Secret Sword heavily chunks Blissey and hits RegenVest Pokemon such as Primal Kyogre harder, though Revelation Dance has more PP, allows Arceus-Fighting to Imposter-proof itself, and isn't weakened by Fur Coat, making it generally better against Mega Audino. Thunder Cage provides general coverage and chip damage against Pokemon like Ho-Oh and Arceus-Fairy, as well as deterring Imposter users. Ice Beam is an alternative to punish Eternatus, particularly Magic Guard variants that otherwise wall Arceus-Fighting, and also hit Ultra Necrozma, although this means a teammate is required for Imposter-proofing. Leftovers helps provide additional healing to supplement Strength Sap, while Rocky Helmet mainly punishes Ash-Greninja's Surging Strikes. Arceus-Fighting can generally handle most physical threats well but is prone to letting in powerful special wallbreakers such as Mega Alakazam, Flutter Mane, and Eternatus. Thus, reliable special walls like Ice Scales Meloetta and RegenVest Dialga-O are useful teammates. Secret Sword means Arceus-Fighting can't Imposter-proof itself 100% of the time, so a teammate like Magic Guard Eternatus is recommended; Ice Beam sets can be covered by Ice Scales Mega Audino or Ho-Oh, with the former ideally holding Covert Cloak to prevent being frozen.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Arceus-Ghost": {
    "sets": {
      "Fur Coat": {
        "description": "<p>Fur Coat Arceus-Ghost serves as both a sturdy physical wall and a potent setup wincon, having the unique ability to blank Knock Off and self-Imposter-proof with Spooky Plate + Judgment. Strength Sap is the preferred recovery option due to its higher healing against physical attackers like Mega Garchomp and ability to neutralize Attack boosts, but Shore Up can't be limited by Pokemon like Magic Guard Blissey. Take Heart and Nasty Plot bolster Arceus-Ghost's average Special Attack; Take Heart allows it to rid itself of sweep-ending poison from Mortal Spin, while Nasty Plot provides bigger boosts and means Shore Up sets can't be stalled by Imposter users. The last slot is dedicated to utility or coverage. Secret Sword nukes Blissey; Knock Off can ease Arceus-Ghost's sweep by removing Assault Vests, Yveltal's Heavy-Duty Boots, and the occasional Spooky Plate from Imposter users; Sludge Wave smashes Mega Audino and helps prevent Ice Scales Arceus-Fairy from PP stalling Arceus-Ghost; and Thunder Cage threatens Yveltal and Ho-Oh in addition to chipping special walls. Mega Garchomp appreciates Arceus-Ghost removing items from Yveltal and Mega Audino or, with certain coverage, straight up removing them; in return, Arceus-Ghost Imposter-proofs Mega Garchomp. Arceus-Ghost can struggle against Ash-Greninja, so a check to it like Fur Coat Mega Audino is a good partner. Arceus-Ghost generally Imposter-proofs itself, but in the event of your opponent having a rare Spooky Plate Imposter user, a teammate that can cover it like Magic Guard Blissey is recommended.</p>"
      },
      "Simple": {
        "description": "<p>Simple Arceus-Ghost is a potent setup sweeper thanks to its good bulk, offensive profile, and natural advantage against Imposter users thanks to Spooky Plate + Judgment. No Retreat provides a great deal of stat boosts and notably makes Arceus-Ghost an effective mixed attacker, allowing it to bypass Ice Scales users much more readily than other sweepers like Take Heart Arceus formes and Ultra Necrozma. Triple Arrows OHKOes Blissey and occasionally allows Arceus-Ghost to get past checks like non-Fur Coat Yveltal and RegenVest users via flinches. Alternatively, a Poison-type move can shred Fairy-type checks like Mega Audino and Ice Scales Arceus-Fairy, with Gunk Shot being able to OHKO both after slight chip damage and Noxious Torque not missing; both can also poison would-be answers like Yveltal. Jungle Healing both provides recovery and prevents Mortal Spin's poison from stifling a sweep. While Arceus-Ghost is strong, special walls and Yveltal can almost completely nullify it with Topsy-Turvy if they don't lose to its physical move, so supporting allies like Mold Breaker Eternatus and Strength Sap blockers like Magic Guard Blissey are useful. Fur Coat Mega Audino is a particularly noteworthy problem, as multiple setup attempts are necessary to run it out of Recover PP, so Mega Lucario can help by taking advantage of its Steel weakness. Arceus-Ghost can Imposter-proof itself thanks to Spooky Plate + Judgment, but Knock Off support is recommended, as Eviolite Imposter users can use No Retreat and attempt to PP stall Judgment in a pinch; an ally like Yveltal is also useful as an emergency precaution against Spooky Plate Imposter users.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 589755, "username": "rightclicker"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 338877, "username": "TTTech"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arceus-Ground": {
    "sets": {
      "Ice Scales": {
        "description": "<p>Ice Scales Arceus-Ground fills a valuable niche as a special wall, self-Imposter-proof setup sweeper, and entry hazard remover; its Ground typing also offers a useful immunity to Thunder Cage and Volt Switch. Tidy Up supplements a strong Earthquake and allows Arceus-Ground to sweep late-game when its checks like Celesteela and Yveltal have been removed. Spirit Shackle is solely for Imposter users; after trapping one, Arceus-Ground can always boost to +6 and beat it one-on-one, putting the opponent in a heavily disadvantaged position. Strength Sap is necessary for Arceus-Ground to Imposter-proof itself, and it usually heals for more than Recover; Arceus-Ground being a physical attacker also prevents the bane of most Ice Scales Arceus formes, Magic Guard Blissey, from denying it healing. Earth Plate provides a damage boost to Earthquake and can't be removed with Knock Off or Trick, while Covert Cloak shuts down passive damage from Salt Cure and Mortal Spin, making boosting easier. Arceus-Ground's main drawback is that against teams with Strength Sap, Haze, or Topsy-Turvy Celesteela or Yveltal it's never sweeping; as a result, threats like Bolt Strike Mega Garchomp and Mega Lucario are useful teammates. Arceus-Ground can also struggle against Palkia-O and No Retreat Arceus-Ghost, so backup checks to them like Salt Cure users and Mega Audino help out. Arceus-Ground can almost always Imposter-proof itself thanks to Spirit Shackle, but if it's badly poisoned or if the Imposter user has a Covert Cloak, then some physical tank like Mega Slowbro or Yveltal can fulfil this role.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 338877, "username": "TTTech"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Arceus-Water": {
    "sets": {
      "Defensive": {
        "description": "<p>Arceus-Water differentiates itself from other bulky Water-types such as Mega Slowbro and Dondozo through its good Speed tier and balanced bulk, which makes it more resilient to slower wallbreakers like Mega Garchomp. Its Special Defense also means it doesn't instantly fold to Electro Drift coverage, while the aforementioned Water-types are both OHKOed by any Tough Claws user with it. Fur Coat allows Arceus-Water to wall threats like Mega Garchomp and Ash-Greninja, albeit needing a Bold nature to dodge a potential 2HKO from Ash-Greninja's Flower Trick, while Ice Scales takes advantage of Water's lack of weaknesses to common special moves to serve as a decent answer to the likes of Mega Alakazam and Eternatus. Scald threatens burns on Pokemon like Mega Lucario and defensive switch-ins like RegenVest users. Due to Arceus-Water's weakness to Thunder Cage, Spirit Shackle is the safest option for Fur Coat variants to Imposter-proof themselves. Spirit Shackle variants can utilize Shore Up to not have recovery denied by Magic Guard Blissey. Covert Cloak is necessary to prevent Salt Cure's passive damage. Fur Coat variants still takes a lot of damage from coverage options like Electro Drift and Ash-Greninja's Flower Trick, so backup checks to these like Dragon-types and Fur Coat Fairy-types help. Ice Scales variants similarly can be pressured by strong moves such as Mega Alakazam's Psycho Boost, so having RegenVest teammates to scout for moves can be useful. Arceus-Water can generally Imposter-proof itself but can always be Imposter-proofed by Imposter Chansey as a backup.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Audino-Mega": {
    "sets": {
      "Defensive": {
        "description": "<p>Mega Audino utilizes its very rare typing, good bulk, low Attack capable of stifling Strength Sap healing, and low Speed to be a versatile wall and an effective pivot. The ability chosen is up to team preference; Fur Coat can let it check Dragon- and Dark-type physical attackers like Mega Garchomp and Choice Band Ash-Greninja, Ice Scales can let it check various special threats like Flutter Mane and Take Heart Arceus formes, and Magic Bounce can reflect key status moves like Spikes, Glare, Strength Sap, and Toxic. Topsy-Turvy heavily deters setup from threats like Flare Boost Flutter Mane, Take Heart Arceus formes, and Mega Garchomp. Knock Off removes key items such as Assault Vest from Mega Steelix; if consistent progress making throughout the game is desired, Mortal Spin can instead be used to remove entry hazards and spread poison. Teleport is a consistent pivoting option with the switches Mega Audino often forces by denying Strength Sap healing or threatening to remove items. Moonblast hits Magic Guard Miraidon for good damage and dissuades other Magic Guard users from freely switching in. Mega Audino fits on balance or bulky teams looking for a flexible check to most of the metagame, a Pokemon with a Ghost-type immunity, or more importantly a Strength Sap blocker; thus, strong physical attackers like Ash-Greninja and Kyurem-B are good partners that appreciate its ability to limit Strength Sap healing and slow pivoting. In return, Mega Audino can Imposter-proof these attackers. Mega Audino is weak to Sunsteel Strike users like Mega Lucario, so solid checks to them like Mega Slowbro and Celesteela makes for good partners. Imposter-proof Mega Audino with Steel-type teammates, Regenerator users, or Take Heart Arceus formes carrying a Plate.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589755, "username": "rightclicker"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Kyurem-Black": {
    "sets": {
      "Choice Band": {
        "description": "<p>Kyurem-B's main niche compared to competitors like Mega Garchomp and Ash-Greninja lies in its immensely spammable Glacial Lance, which hits most physical walls for at least neutral damage while also being non-contact to avoid Rocky Helmet and Burning Bulwark. Bolt Strike 2HKOes Fur Coat Water-types like Mega Slowbro and Dondozo in addition to Primordial Sea Registeel. U-turn eases prediction and chips walls like Mega Slowbro. Headlong Rush and V-create both target Steel-types like Zacian-C, with the former OHKOing Primordial Sea Registeel and the latter OHKOing Mega Steelix. Kyurem-B's main weakness is its vulnerability to Stealth Rock, making strong entry hazard removal mandatory. Due to Glacial Lance's excellent neutral coverage and Kyurem-B's raw power, it forces most physical walls to remain healthy to avoid being KOed the next time it attacks, making Strength Sap blockers like Magic Guard Blissey and Magic Bounce users fantastic teammates. Kyurem-B is also very slow for a wallbreaker, making fast Pokemon such as Ash-Greninja and Koraidon desirable. Imposter-proof Kyurem-B with Fur Coat Pokemon such as Arceus-Ghost and Mega Audino.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Kyurem-White": {"sets": {"Choice Specs": {}}},
  "Meloetta": {
    "sets": {
      "Ice Scales": {
        "description": "<p>Meloetta differentiates itself from other special walls like Arceus-Ground and Mega Audino through its typing, which provides an immunity to Moongeist Beam and a resistance to Psychic-type moves, making it an effective special wall against powerful metagame threats including Flutter Mane, Mega Alakazam, and No Retreat Lunala. Psystrike has high damage output against Flutter Mane and Blissey, more than negating the drawback of its damage being cut by both Fur Coat and Ice Scales. Block traps opposing Imposter users, deters Mega Alakazam from spamming Blue Flare to burn recovery PP, and threatens to trap and eliminate Take Heart Arceus formes. Topsy-Turvy shuts down setup attackers such as Take Heart Arceus formes, Torch Song Dragon-types, and No Retreat Lunala. Covert Cloak blocks a myriad of secondary effects like Eternatus's poison, while Leftovers helps offset chip damage from entry hazards and Thunder Cage. Meloetta is incredibly passive and cannot touch any Pokemon with recovery and without very poor Defense, requiring teammates such as Take Heart Arceus formes and Magic Guard users to minimize momentum loss. Due to not resisting Dragon, it can be pressured by strong Dragon Energy users such as Eternatus and Miraidon, making Steel- and Fairy-type Pokemon like Magearna and Arceus-Fairy helpful teammates. Meloetta's vulnerability to all forms of entry hazards as well as its tendency to get worn down by neutral special attacks can quickly drain recovery PP, so it highly appreciates teammates that provide reliable hazard removal, such as Mortal Spin RegenVest Pokemon and Tidy Up users.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Greninja-Ash": {
    "sets": {
      "Sniper": {
        "description": "<p>Using its high Speed, synergistic offensive typing, and high offensive stats, Ash-Greninja becomes a strong wallbreaker. With Flower Trick, Ash-Greninja can dent Fur Coat Slowbro without activating Rocky Helmet, OHKO Mega Swampert, and 2HKO Imposter users. Frost Breath lets Ash-Greninja OHKO Mega Garchomp and severely weaken Fur Coat Miraidon and Yveltal. Physically strong Pokemon like Mega Garchomp, Mega Lucario, and Kyurem-B appreciate Ash-Greninja's presence, as it's able to help overwhelm their checks such as Fur Coat Arceus-Ghost, Ho-Oh, and Mega Slowbro; Mega Lucario is particularly useful thanks to its strong matchup against Fur Coat Fairy-types like Mega Audino, which otherwise completely wall Ash-Greninja thanks to Rocky Helmet. Ash-Greninja can struggle against faster Pokemon such as Flutter Mane and Miraidon, as these are are all able to revenge kill it, so having teammates like Mega Steelix, Ho-Oh, and Arceus-Ground helps. Ash-Greninja also benefits immensely from having teammates that can block Strength Sap such as Mega Audino, Blissey, and Mega Slowbro, as many of its defensive checks like Miraidon and Arceus-Fairy rely on this move for healing. Having slow pivots, such as Teleport users like Mega Audino or RegenVest users like Mega Swampert, is also helpful to account for its frailty. To Imposter-proof Ash-Greninja, a Fur Coat + Rocky Helmet user like Mega Audino is ideal.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 603640, "username": "Hiusi guy"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Yveltal": {
    "sets": {
      "Defensive": {
        "description": "<p>Defensive Yveltal's main use case is as a sixth-teamslot option to cover Simple + No Retreat users like Arceus-Ghost and Lunala. Fur Coat makes Yveltal a decent check to Mega Garchomp sets lacking an Electric-type move, completely nullifies Tidy Up Arceus-Ground, and means Triple Arrows Arceus-Ghost needs many more flinches to get past it; alternatively, Magic Bounce can throw back Glare and Spikes, and it also provides a way of blocking Strength Sap without having to commit to running something like Blissey. Revelation Dance hits Fur Coat Arceus-Ghost hard, which can otherwise wall and spinblock Yveltal. Topsy-Turvy halts boosting threats and minimizes Simple Arceus-Ghost's ability to badger Yveltal with secondary effects. Teleport provides a pivoting option, helping offset Yveltal's tendency to lure in Arceus formes that can sponge Knock Off, while Rapid Spin clears entry hazards for its team and partners well with Revelation Dance. Yveltal's main use is on balance teams looking for an easy option to counter Simple Ghost-types that the rest of the team aren't equipped for. Rapid Spin Yveltal alone isn't typically reliable hazard removal in longer games, so a second removal option like a RegenVest user with Mortal Spin is recommended. Yveltal also tends to be Imposter bait; its only deterrent is Knock Off removing the Imposter user's Eviolite, which in slower games can be forgone in favor of making Yveltal a free Recover window, so allies that can directly harm the Imposter user like Ruination or Mortal Spin users are useful.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Solgaleo": {
    "sets": {
      "Choice Scarf": {},
      "Primordial Sea": {
        "description": "<p>Primordial Sea Solgaleo is most notable for its ability to wall Eternatus, and it also serves as a solid defensive answer to threats like Ultra Necrozma, Desolate Land Mega Blaziken, and non-Headlong Rush Kyurem-B. Psychic Noise deals respectable damage against Eternatus and prevents it, along with potential switch-ins like Arceus formes, from using Strength Sap. Flip Turn is boosted by Primordial Sea and can deal minor chip damage, while Teleport provides slow pivoting despite Solgaleo's high Speed. Gigaton Hammer pressures Fairy-types like Mega Audino and dissuades Blissey from attempting to block Strength Sap. Spikes can help reduce Solgaleo's passivity against many defensive Pokemon. An Impish nature guarantees Solgaleo isn't 2HKOed by Sheer Force Ultra Necrozma's Bolt Strike, while Jolly allows Solgaleo to outrun Mega Blaziken and Mega Gardevoir. Solgaleo is useful when paired with threats like Ultra Necrozma, which usually require specific allies to Imposter-proof. Defensively, Solgaleo struggles against threats like Moongeist Beam users, Ash-Greninja, and Mega Garchomp, making walls like RegenVest Primal Kyogre and Fur Coat Fairy-types good teammates. Solgaleo can be Imposter-proofed by numerous options, but RegenVest users in particular do not care about Psychic Noise and can maintain momentum.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Lunala": {
    "sets": {
      "Simple": {
        "description": "<p>Simple + No Retreat Lunala distinguishes itself from Arceus-Ghost by having STAB-boosted Stored Power and high HP, allowing it to effectively dispatch of Arceus-Ghost's checks. After No Retreat, Stored Power reaches 220 Base Power, heavily threatening special walls like Mega Audino and Arceus formes. Final Gambit dispatches of hard walls like Yveltal, Meloetta, and Ice Scales Mega Audino, paving the way for teammates to sweep. Due to this, Lunala pairs extremely well with other Ghost-types, most notably Arceus-Ghost but also Flutter Mane and the niche Necrozma-DW. While a boosted Lunala can 2HKO most special walls, it never OHKOes them without heavy chip damage and gets forced out by Topsy-Turvy if it misses any KO, making entry hazard support and teammates such as Thunder Cage users very helpful. A healthy Ash-Greninja can force Lunala to use Final Gambit on it rather than the special walls, so walls like Fur Coat Audino with Rocky Helmet act as good teammates. Lunala usually Imposter-proofs itself due to Spooky Plate, but it is recommended to have a backup Imposter-proofer like Yveltal or Meloetta in case Lunala is in KO range of Stored Power or the opposing Imposter is holding a Spooky Plate.</p>"
      },
      "Ice Scales": {
        "description": "<p>Ice Scales Lunala is notable for its capability to check Eternatus as well as pivot into neutral threats like Mega Sceptile. The Psychic-type differentiates Lunala from other Eternatus answers by threatening direct damage, and Psystrike is the preferred choice to hit Blissey hard. Hex combined with Nuzzle or Glare provides a solid secondary STAB move capable of threatening Fur Coat Pokemon and Steel-types, and paralysis shuts down fast wallbreakers like Mega Sceptile. Judgment + Spooky Plate is an alternate option that lets Lunala Imposter-proof itself. Covert Cloak is necessary to prevent secondary effects like poison from Eternatus and Salt Cure. A Calm nature is typically preferred for more special bulk, but a Timid nature can be used to outspeed threats like Mega Gardevoir. Lunala can't check Moongeist Beam users like Flutter Mane and Mega Alakazam, so RegenVest users like Dialga-O that pose a particular threat to them are recommended. Blissey can also check them to an extent and provides an answer against Take Heart Arceus formes. Lunala is highly susceptible to Knock Off, so teammates like Take Heart Arceus formes and Magic Guard Pokemon can help switch into common Knock Off users. Lunala can paralyze Imposter users, but Hex variants require an Imposter-proof teammate like Imposter Chansey.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Pheromosa": {
    "sets": {
      "Choice Band": {
        "description": "<p>Pheromosa has one job on most teams: be the fastest thing on the field and fire off very strong U-turn. This allows it to both force out dangerous offensive threats and grab momentum at the same time. Sword of Ruin kicks up Pheromosa's power and makes it a decent supporting wallbreaker for an ally like Mega Garchomp. Glacial Lance chunks Dragon-types like Eternatus and Giratina for solid damage. Knock Off cuts into the longevity of most physical walls by removing their Leftovers and Heavy-Duty Boots, making it easier for an ally to pick them off; in addition, removing Covert Cloak opens these up to be poisoned by Mortal Spin. Pheromosa's best fit is on offense teams that are looking for a reliable way of scaring out fast threats that Imposter isn't very reliable into, like Ultra Necrozma and Ash-Greninja. Pheromosa lacks the power to beat Fur Coat users by itself, so another physical wallbreaker like Mega Garchomp is mandatory for it to be useful. Imposter-proof Pheromosa with bulky physical walls that don't mind Knock Off, like Fur Coat Arceus-Ghost.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 577920, "username": "Tea Guzzler"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 523866, "username": "UT"}]}]}
  },
  "Celesteela": {
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Celesteela utilizes its excellent defensive typing to act as a reliable pivot capable of soft checking numerous threats, including Mega Garchomp, Flutter Mane, Tidy Up Arceus-Ground, and Take Heart Arceus formes. Knock Off provides excellent utility, nullifying offensive threats by removing items like Life Orb and Choice Specs while relieving defensive Pokemon of items like Covert Cloak and Leftovers. Stone Axe helps reduce Celesteela's passivity by providing entry hazard support for teammates. Salt Cure deters Pokemon like Take Heart Arceus formes from using Celesteela as setup bait, and it deals good chip damage to Imposter users. Doom Desire is an option to support offensive teammates against walls like Mega Audino. Beak Blast punishes moves such as U-turn and deters moves like Bolt Strike and Electro Drift. Even with Assault Vest, Celesteela's natural bulk is only decent, so it requires sturdy teammates like Ice Scales Mega Audino and Ho-Oh to pivot into to help against powerful wallbreakers like Choice Specs Flutter Mane and Mega Alakazam. Celesteela's typing also leaves it vulnerable to threats like Miraidon and Fire-type coverage from Pokemon such as Eternatus, making walls like Magic Guard Blissey desirable teammates. Imposter users also pair well with Celesteela to defeat Take Heart Arceus formes after they have been hit by Salt Cure. Imposter-proofing Celesteela can be annoying, with Take Heart Arceus formes and Magic Guard Pokemon that do not mind losing their item being decent options to do so.</p>"
      },
      "Fur Coat": {
        "description": "<p>Fur Coat Celesteela acts as a decent physical wall for teams looking for a Ground immunity while soft checking Ash-Greninja and non-Mold Breaker Koraidon. Teleport brings in dangerous wallbreakers safely. Beak Blast, if it successfully burns, instantly kills any physical wallbreaker's hopes of dealing damage except mixed attackers with Electro Drift; it also outdamages Jungle Healing from Mega Garchomp. Knock Off annoys defensive switch-ins like Mega Audino by removing items like Covert Cloak, while Salt Cure can help rack up large amounts of passive damage and more directly threatens Imposter users. Stone Axe capitalizes on the switches Celesteela often forces by virtue of its typing by setting entry hazards, but it's notably worse against Imposter users. Recover provides reliable healing in the face of wallbreaker + Strength Sap blocker structures, while Strength Sap has higher burst healing against some teams, is easier to Imposter-proof, neutralizes Mega Garchomp, and helps versus Ash-Greninja. Rocky Helmet helps wear away at physical attackers without needing entry hazard support and throttles Ash-Greninja into spamming Wicked Blow, while Covert Cloak shuts off Salt Cure's crushing passive damage. Physical wallbreakers like Mega Garchomp appreciate Celesteela Imposter-proofing them and blocking Mortal Spin to keep hazards on the field to increase the odds of KOs. Celesteela can be vulnerable to Bolt Strike or Electro Drift users like Mega Lucario and mixed attackers like Ultra Necrozma, so sturdy walls to them like Miraidon and Ice Scales Arceus-Ground makes for good partners. Imposter-proof Celesteela with a Magic Bounce user, a Magic Guard user not deterred by burns or Knock Off like Arceus-Ghost, or a RegenVest user like Primal Kyogre.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 589755, "username": "rightclicker"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Blacephalon": {
    "sets": {"Adaptability": {"description": "<p>Blacephalon is an incredibly threatening mixed wallbreaker. Choice Scarf makes Blacephalon effective speed control and grants a jump on Imposter users, while Life Orb boosts Blacephalon's damage to absurd levels, allowing V-create to potentially OHKO Arceus. Volt Switch lets Blacephalon act as an offensive pivot and chip checks like Ho-Oh and Mega Audino. Blue Flare cleanly 2HKOs Fur Coat Mega Audino. Trick can cripple defensive walls on teams where Choice Scarf isn't necessary. Strength Sap provides crucial longevity on Life Orb sets. Blacephalon being severely frail means slow pivots like Ho-Oh and Mega Swampert are required; weakness to Stealth Rock is also a critical flaw that makes reliable entry hazard removal options like Mortal Spin Ho-Oh and Primal Kyogre crucial. Imposter-proof Blacephalon with Fur Coat or Ice Scales users resistant to the other attacking side's move, such as Mega Audino, and Mega Swampert.</p>"}},
    "credits": {"writtenBy": [{"user_id": 658705, "username": "Notgamingreally"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}]}]}
  },
  "Melmetal": {"sets": {"RegenVest": {}}},
  "Zacian": {
    "sets": {
      "Defensive": {
        "description": "<p>Zacian's niche lies in its excellent Speed, allowing it to outspeed threats like Ash-Greninja, Flutter Mane, and Ultra Necrozma and thus check them better than its competition like Arceus-Fairy. Fur Coat lets Zacian check threats like Ash-Greninja and Mega Garchomp, while Ice Scales lets it soft check Flutter Mane and Ultra Necrozma. Strength Sap is generally preferred for its higher healing output and useful Attack drops, but Shore Up can be used on Ice Scales sets to more reliably heal against low Attack Pokemon such as Mega Alakazam and Flutter Mane. Magical Torque's higher damage output is useful against Pokemon like Mega Garchomp and Mega Alakazam, but Spirit Break is more effective to stave off boosting special attackers like Nasty Plot Flutter Mane and non-Poison-type move Eternatus. Glare and Topsy-Turvy both serve as tools against setup, with the former more effective and disruptive but also more difficult to Imposter-proof and useless against Flare Boost Flutter Mane. Spikes and Stone Axe help reduce Zacian's passivity by providing entry hazard support. Leftovers is useful to reduce the frequency that Zacian needs to recover, while Rocky Helmet harshly punishes Ash-Greninja. Ability Shield is a niche choice that improves its matchup against Moongeist Beam and non-STAB-boosted Sunsteel Strike users. Fur Coat Zacian can struggle against certain physical attackers like Zacian-C and Mega Lucario, so teammates that can cover them such as Fur Coat Arceus-Electric and Mega Swampert are appreciated. Ice Scales Zacian has trouble with Eternatus and repeated attacks from Mega Alakazam and Flutter Mane, making secondary special walls like RegenVest Primal Kyogre good teammates. Zacian can be Imposter-proofed by Pokemon like Fur Coat Take Heart Arceus formes, Imposter Chansey, and Magic Bounce Ho-Oh.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Zacian-Crowned": {
    "sets": {
      "Utility": {
        "description": "<p>With blistering Speed outpacing nearly the entire tier, decent bulk, good Attack, and great typing, Zacian-C serves as a good utility Pokemon. Magical Torque and Gigaton Hammer can force switches against opposing offensive foes like Ash-Greninja and Flutter Mane, giving Zacian-C opportunities to set Spikes. The last moveslot can also be switched with either Spirit Shackle, removing Imposter entirely; Knock Off, removing important items from physical walls like Covert Cloak from Mega Slowbro and Celesteela; or Taunt, denying recovery and Spikes from these walls. Most wallbreakers, especially Magic Guard Eternatus, Ash-Greninja, and Koraidon, appreciate Zacian-C setting hazards and blocking Mortal Spin, or the other utility Zacian-C offers such as removing Imposter or items, along with the occasional Imposter-proofing Zacian-C can provide with its typing. Zacian-C's typing means that Eternatus that run Fire-type moves is a problem for it, so a check like RegenVest Primal Kyogre is recommended. Zacian-C's inability to hold Covert Cloak means a Covert Cloak Steel-type like Celesteela can provide additional fortitude against Mortal Spin. Zacian-C can be Imposter-proofed by neutral Fur Coat users or Steel-types with hazard removal like Mega Slowbro or RegenVest Mega Steelix if it's running Spikes or Taunt, Fur Coat Arceus formes holding a Plate if it's running Knock Off, or itself if it's running Spirit Shackle.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589755, "username": "rightclicker"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Eternatus": {
    "sets": {
      "Magic Guard": {
        "description": "<p>Magic Guard Eternatus is a dangerous setup attacker with high damage output. Magic Guard helps offset Dragon Energy's high HP requirement, allowing Eternatus to use its bulk and maintain good damage output, and it also allows for a drawback-free Life Orb. While Malignant Chain is usually more consistent, Shell Side Arm can be used with maximum Attack EVs and IVs in order to more reliably dent Blissey. Torch Song 2HKOes non-Assault Vest Celesteela, is generally easier to Imposter-proof, and doesn't leave Eternatus completely shut off by Magearna and Zacian-C, while Nasty Plot allows for staggering damage, letting full-powered Dragon Energy 2HKO Ice Scales Arceus even if it uses Take Heart after the first hit. Strength Sap's high instant healing, easy Imposter-proofing, and ability to ward off slower physical attackers like Mega Lucario make it a solid choice; alternatively, Recover doesn't get shut off by Blissey and Magic Bounce users, making it much more reliable. Magic Guard Eternatus's best fit is on offense teams that want high instant damage that throttles annoying Fairy-types like Mega Audino without a Choice lock. Eternatus's biggest enemy is Blissey, as it stuffs Strength Sap, stalls Dragon Energy with Topsy-Turvy and its immense bulk, and isn't 2HKOed by Shell Side Arm; as a result, a teammate like Secret Sword Arceus-Ghost is near mandatory to get past it in a reasonable amount of time. Eternatus's Speed tier also leaves it outsped by other offensive foes like Mega Alakazam and Flutter Mane, so RegenVest users like Dialga-O help by preventing it from folding to these. Imposter-proof Torch Song Eternatus with Ice Scales users, Magic Guard Blissey, or Imposter Chansey; Nasty Plot is harder to Imposter-proof, so Magearna and specially defensive Steel-types are recommended. Paralysis support is also highly recommended on Recover sets, as a paralyzed Imposter user negates one of Recover's big drawbacks in Imposter users exploiting it for healing.</p>"
      },
      "Boosting Attacker": {
        "description": "<p>Eternatus serves as a strong setup attacker that can support teammates by pressuring opposing special walls and provide some defensive utility. Torch Song hits Steel-types like Celesteela while doubling as a boosting option, allowing Eternatus to pressure walls like Magic Guard Blissey. Sludge Bomb hits Fairy-types like Arceus-Fairy and Mega Audino, and it can also poison walls like RegenVest Primal Kyogre. Eternatus makes good use of Glare, as Eternatus deters Miraidon from switching in while also having a favorable matchup against common Take Heart users. Spikes allows Eternatus to make progress against walls considering its good matchup against common entry hazard removers, while Knock Off removes important items like Assault Vest to soften defensive answers to it. Strength Sap provides higher instant healing against most foes, keeping Dragon Energy strong, but Shore Up may be preferred to improve Eternatus's matchup into Blissey and is also better on Unaware sets. Mold Breaker allows Eternatus to bypass Ice Scales and Magic Bounce, and Unaware provides useful defensive utility by letting it check Take Heart Arceus formes as well as Nasty Plot and No Retreat Arceus-Ghost. Eternatus is effective at pressuring special walls, so it pairs well with special wallbreakers such as Mega Alakazam and Flutter Mane that can take advantage of this. Imposter-proof Eternatus lacking Knock Off with Imposter Chansey, and Imposter-proof Knock Off sets with specially defensive walls like Ice Scales Arceus-Fairy.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 338877, "username": "TTTech"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Dondozo": {
    "sets": {
      "Fur Coat": {
        "description": "<p>Fur Coat Dondozo uses its massive physical bulk and solid typing to check powerful physical wallbreakers including Mega Garchomp, non-mixed Mega Lucario, and Ash-Greninja. Strength Sap is the preferred recovery option to also slow down setup sweepers like Mega Garchomp, but Shore Up cannot be blocked by Magic Bounce or be limited by Pokemon like Blissey. Dondozo's extremely low Speed also makes it a great pivot capable of underspeeding common defensive staples like Parting Shot Mega Audino. Glare cripples all physical attackers excluding Jungle Healing users as well as deterring most special wallbreakers, while Knock Off provides support by removing crucial items like Assault Vest. Stone Axe and Spikes help reduce Dondozo's passivity against Teleport users and Take Heart Arceus formes. Covert Cloak prevents annoying secondary effects from moves like Salt Cure and Mortal Spin, which is valuable because Dondozo can be 2HKOed by coverage moves after slight chip damage; alternatively, Rocky Helmet punishes otherwise safe U-turns and prevents foes like Mega Garchomp from simply PP stalling Dondozo's healing. Dondozo cannot answer mixed threats such as Electro Drift Mega Garchomp, and thus checks to these Pokemon such as Fur Coat Arceus-Ghost are good teammates. Powerful special wallbreakers like Mega Alakazam and Mega Sceptile appreciate the slow pivoting and entry hazards Dondozo provides and in return can offensively Imposter-proof Dondozo. Dondozo can also be Imposter-proofed by Take Heart users and Electric-types.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Flutter Mane": {
    "sets": {
      "Flare Boost": {
        "description": "<p>Flutter Mane leverages its extremely rare offensive typing, good Speed, and decent Special Attack to be a very threatening wallbreaker and cleaner. Flame Orb + Flare Boost gives it a boost that can't be copied by Imposter users alongside a pseudo-immunity to status and Knock Off's item removal. With a Nasty Plot boost, Moongeist Beam does terrifying amounts of damage to Ice Scales users, having odds of OHKOing Ice Scales Arceus formes after Stealth Rock; Flutter Mane's Speed and power also let it offensively pressure other fast offensive threats, such as Ultra Necrozma and Ash-Greninja. Flutter Mane uses Pain Split, which Imposter users can't utilize effectively, as a burst healing option thanks to its low HP stat, offsetting burn damage and allowing it to beat Magic Guard Blissey one-on-one. Flutter Mane fits on balance and offense teams looking for a powerful special wallbreaker and late-game cleaner. Moongeist Beam ignores Ice Scales but not Assault Vest, making Knock Off users like RegenVest Primal Kyogre great partners. Imposter-proofing Flutter Mane can be done by any specially defensive Normal-type with Haze or Topsy-Turvy, usually Imposter Chansey, which can also trade Knock Off with RegenVest users.</p>"
      },
      "Choice Specs": {
        "description": "<p>Choice Specs Flutter Mane acts as a dangerous wallbreaker that utilizes its strong STAB combination and stats. Moongeist Beam cuts through Ice Scales, allowing Flutter Mane to bypass traditional special walls like Ice Scales Arceus formes, while Astral Barrage deals more damage to other checks like RegenVest users. Volt Switch grants Flutter Mane the option to pivot out on switch-ins like Primal Kyogre, Ice Scales Mega Audino, and Ho-Oh, while Knock Off allows it to cripple special walls by removing items like RegenVest users' Assault Vests, Ho-Oh's Heavy-Duty Boots, and Blissey's Leftovers. Beads of Ruin is an option over Adaptability to increase Volt Switch's chipping capabilities, but running it means Astral Barrage will no longer 2HKO Imposter users. Flutter Mane appreciates entry hazard support from the likes of RegenVest Mega Steelix, Primal Kyogre, and Mega Swampert, as this allows it to have an easier time threatening 2HKOs on the aforementioned Ice Scales walls like Arceus formes and Primal Kyogre. Flutter Mane necessitates a teammate that can threaten specially defensive Normal-types like Blissey, Ice Scales Mega Audino, and Ice Scales Arceus; this makes mixed attackers like Ultra Necrozma valuable. Imposter-proof Flutter Mane with a specially defensive Normal-type like Imposter Chansey.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 580765, "username": "cat"}, {"user_id": 589755, "username": "rightclicker"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Iron Hands": {
    "sets": {
      "Fur Coat": {
        "description": "<p>Iron Hands's immense physical bulk and typing make it one of the best answers to Ash-Greninja and Mega Lucario. Strength Sap is usually better thanks to its greater recovery and ability to reduce boosts from Tidy Up; however, Recover has a better matchup against Magic Bounce users. Knock Off removes items from common switch-ins like Mega Audino. Mortal Spin works well in combination with Thunderous Kick, poisons Imposter users, and allows Iron Hands to remove entry hazards for teammates like Ash-Greninja. Teleport lets Iron Hands in offensive threats such as Kyurem-B, Mega Lucario, and Ash-Greninja. Rocky Helmet allows Iron Hands to punish Ash-Greninja's Surging Strikes and generally chip wallbreakers like Mega Lucario. Iron Hands can wall most physical threats; however, its Ground weakness necessitates a teammate that can handle Mega Garchomp and Arceus-Ground such as Celesteela or a secondary Fur Coat user such as Arceus-Ghost. Iron Hands is virtually helpless against most Arceus-Ghost sets, so a solid check to it like Mega Audino or Meloetta is useful. Imposter-proof Iron Hands with a Pokemon that can take its utility moves, such as Arceus-Ghost or Mega Audino. Offensive Imposter-proofing with Pokemon such as Ultra Necrozma is also effective.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 658705, "username": "Notgamingreally"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Ting-Lu": {
    "sets": {
      "Defensive": {
        "description": "<p>Ting-Lu leverages its typing, massive defensive stats, and ability to counter Final Gambit Lunala to find use as a reasonable utility Pokemon. Fur Coat allows Ting-Lu to counter threats like Mega Garchomp, Ho-Oh, and Arceus-Ghost. Knock Off forces progress, removing items from foes such as Mega Audino. Salt Cure's residual damage limits Take Heart Arceus formes' ability to set up in front of Ting-Lu and reduces its passivity, while Parting Shot can still deal with Pokemon such as Arceus-Ghost when in combination with a revenge killer like Mega Alakazam. Topsy-Turvy neutralizes setup threats like Arceus-Ghost and Mega Garchomp. Covert Cloak protects Ting-Lu from Mortal Spin and Salt Cure. Ting-Lu best fits on teams looking for a good blanket physical wall and Simple Ghost-type answer. Ting-Lu struggles against Mega Lucario and Ash-Greninja, so backup checks like Fur Coat Celesteela are mandatory. Imposter-proof Ting-Lu with Knock Off absorbers like Arceus formes; Magic Bounce can also be useful against Parting Shot variants.</p>"
      },
      "RegenVest": {
        "description": "<p>RegenVest Ting-Lu leverages its massive mixed bulk, unique typing, and low Speed tier to act as a pivot into several of the tier's special attackers as well as defensive Pokemon to fire off its utility moves. U-turn and Knock Off are staple moves for RegenVest users. Nuzzle is primarily for Eternatus, which is otherwise difficult to punish, but if Ting-Lu can pivot into a revenge killer such as Mega Alakazam or Mega Sceptile, then Salt Cure can be opted for to annoy Take Heart Arceus formes. Stone Axe provides entry hazard support, while Mortal Spin poisons Imposter users and can act as a decent option for hazard removal, especially if paired with Salt Cure. Ting-Lu requires its Assault Vest to switch into any reasonably strong special attack it doesn't resist, so it needs secondary Knock Off absorbers like Take Heart Arceus formes and Imposter users. It is also vulnerable to threats like Flutter Mane, Palkia-O, and Ultra Necrozma with Magical Torque or Mountain Gale, so it appreciates a specially defensive teammate like Ice Scales Arceus-Fairy, and in return Ting-Lu scouts powerful attacks like Psycho Boost and Moongeist Beam. Depending on its moves, Ting-Lu can be Imposter-proofed by Take Heart Arceus formes or Electric-types like Arceus-Electric and Iron Hands.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 658705, "username": "Notgamingreally"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 652656, "username": "Gambit_Gamin"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Iron Valiant": {
    "sets": {
      "Pixilate": {
        "description": "<p>With Pixilate, a good offensive typing that lets it hit Imposter users super effectively, and decent stats, Iron Valiant is a decently strong mixed wallbreaker best suited to offensive teams. Boomburst has very high power and Extreme Speed gives Iron Valiant the ability to scare out faster offensive threats. V-create hits Steel-types like Celesteela and Registeel. For the last moveslot: Population Bomb can dent foes like Ice Scales Arceus formes without having Iron Valiant sacrifice itself, Explosion can enable its teammates by removing a key defensive piece, and Pain Split works well with its low HP stat and offsets Life Orb damage. Wallbreakers like Eternatus and Arceus-Ghost appreciate Iron Valiant breaking through slower walls with its mixed capabilities. Iron Valiant struggles against faster walls like Fur Coat Arceus-Fairy, so a teammate that can help deny their recovery like Magic Guard Blissey makes for a good partner. Imposter-proof Iron Valiant with a Fairy resistant Pokemon like Primordial Sea Solgaleo or Arceus-Fire.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589755, "username": "rightclicker"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Koraidon": {
    "sets": {
      "Choice Band": {
        "description": "<p>Koraidon distinguishes itself from similar Choice Band wallbreakers like Kyurem-B and Mega Garchomp with its high Speed that allows it to revenge kill offensive threats like Ash-Greninja, Stealth Rock resistance, STAB that removes the need for Bolt Strike, and ease of Imposter-proofing. Glaive Rush and Close Combat 2HKO most Fur Coat users after Stealth Rock with Teravolt. Gigaton Hammer smacks Fairy-types that would otherwise stonewall Koraidon's STAB moves like Mega Audino, and U-turn racks up small amounts chip damage, most notably making Mega Slowbro feasible to KO without extensive team support. Wallbreakers like Mega Garchomp and Ash-Greninja that struggle with Celesteela or Fairy-type physical walls appreciate Koraidon threatening these obstacles, and their raw power helps Koraidon in return. Koraidon struggles to actually get OHKOs due to its lower Attack compared to the competition, so chip damage support, Strength Sap blockers, and slow pivoting like Spikes users, Magic Guard Blissey, and RegenVest users such as Mega Swampert make for good partners. Imposter-proof Koraidon with an Arceus forme that isn't weak to any of its moves like Arceus-Ghost or naturally physically bulky Pokemon like Mega Slowbro.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589755, "username": "rightclicker"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 355040, "username": "Chessking345"}, {"user_id": 577920, "username": "Tea Guzzler"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  },
  "Miraidon": {
    "sets": {
      "Fur Coat": {
        "description": "<p>Fur Coat Miraidon is a resilient wall with strong offensive pressure that can also check Pokemon like Mega Lucario and Ash-Greninja. Torch Song provides coverage against Mega Steelix and boosts Miraidon's Special Attack, potentially facilitating a late-game sweep. Spikes can support Miraidon's offensive teammates and force progress against hard walls like Mega Swampert. Thunder Cage + Torch Song lets Miraidon damage most Steel-types well, making it an effective user of Mortal Spin. Will-O-Wisp threatens to burn offensive threats and some switch-ins like Mega Swampert. Take Heart is another way to boost Special Attack, and also means Miraidon can’t be put on a permanent timer once it loses Covert Cloak. Miraidon struggles against Mega Garchomp and mixed attackers like Ultra Necrozma, so Pokemon like Celesteela and Arceus-Ground can pair well with it. Miraidon can be Imposter-proofed by itself in most cases due to Thunder Cage; however, Pokemon like Blissey and the aforementioned Arceus-Ground can Imposter-proof it in emergency situations.</p>"
      },
      "Magic Guard": {
        "description": "<p>With Magic Guard, Miraidon is a powerful wallbreaker that can exploit passive foes relying on Mortal Spin and Salt Cure to deal damage; its typing and Speed also allow it to soft check slower foes like Mega Lucario and Ash-Greninja. Torch Song hits Steel-types like Registeel and Mega Steelix while boosting Miraidon's Special Attack. Thunder Cage traps foes, deals good chip damage to special walls, and is an overall decent high-PP STAB move; alternatively, Volt Switch makes Miraidon a very effective pivot. Dragon Energy, when boosted by Life Orb, becomes a very powerful attack against foes taking chip from Thunder Cage. Strength Sap is a burst healing option that's easy to Imposter-proof and keeps Dragon Energy's Base Power high. Miraidon's ability to heavily chip down special walls makes other special attackers like Choice Specs Flutter Mane good partners; other teammates relying on passive damage such as Salt Cure users also appreciate Miraidon as an offensive Imposter-proofer. Miraidon will never beat Arceus-Ground and struggles against Magic Guard Blissey and specially defensive Mega Swampert, so allies like Ultra Necrozma and Simple Arceus-Ghost are useful. Imposter-proof Miraidon with Ice Scales Arceus-Ground or Magic Guard Blissey; Imposter Chansey can also work, but it's less reliable due to taking chip damage from Thunder Cage.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 589755, "username": "rightclicker"}, {"user_id": 658705, "username": "Notgamingreally"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}, {"user_id": 355040, "username": "Chessking345"}, {"user_id": 548612, "username": "RoFnA"}]}, {"name": "Grammar checked by", "members": [{"user_id": 511181, "username": "Rose"}]}]}
  }
}