{
  "Gengar": {"sets": [{"name": "Choice Specs"}, {"name": "Choice Scarf"}, {"name": "Substitute + 3 Attacks"}, {"name": "Nasty Plot"}, {"name": "Hex", "description": "<p>For the Hex and Substitute + 3 Attacks sets, Leftovers is preferred over Black Sludge as Gengar may Terastallize into a Ghost- or Fairy-type, causing it to lose its Poison-type and take damage from Black Sludge.</p> "}]},
  "Quagsire": {"sets": [{"name": "Unaware Wall"}]},
  "Gastrodon": {"sets": [{"name": "Specially Defensive Wall", "description": "<p>Tera Poison allows Gastrodon to resist Fighting-type attacks from Slither Wing and Hawlucha as well as Power Whip from Tsareena. It also gains a Toxic immunity from foes like Grafaiai and resists other miscellaneous attacks such as Play Rough from Mimikyu and First Impression from Lokix.</p> <p>Tera Ghost allows Gastrodon to stop Rapid Spin users such as Tsareena and Donphan from removing its entry hazards, although it should be wary of the latter's high Attack. It also resists STABs from Slither Wing and shuts down Swords Dance Lucario.</p> <p>Tera Steel lets Gastrodon resist Normal-type attacks from Toxtricity, Maushold, Noivern, and Staraptor, although the latter two carry coverage options to hit it super effectively.</p> "}]},
  "Lucario": {"sets": [{"name": "Swords Dance"}]},
  "Haxorus": {"sets": [{"name": "Dragon Dance"}]},
  "Talonflame": {"sets": [{"name": "Fast Utility", "description": "<p>Tera Ghost allows Talonflame to check Maushold and Swords Dance Lucario, spinblock, improve its matchup versus Slither Wing, and if running Taunt, Gastrodon and Quagsire, remove its Stealth Rock weakness if it loses its item to Knock Off, and provide an emergency immunity to Boomburst from Noivern and Toxtricity.</p> <p>Tera Steel instead lets Talonflame gain a Stealth Rock resistence while still posessing an Extreme Speed resist, while gaining a Toxic and Poison immunity to help it versus Grafaiai. It can also let it serve as a serviceable Staraptor switch-in, although it must beware of Close Combat, and must be careful to not Tera if needed to handle Slither Wing still.</p> "}]},
  "Noivern": {"sets": [{"name": "Choice Specs"}]}
}