{
  "Sandslash": {"sets": {"Sand Wallbreaker": {}, "Physical Wall": {}}},
  "Sandslash-Alola": {"sets": {"Specially Defensive Spinner": {"description": "<p>The Speed EVs help Alolan Sandslash to get the jump on Umbreon and Vaporeon.</p>"}}},
  "Vileplume": {
    "overview": "<p>Vileplume is one of the premier physical walls in the NU tier. Its Grass / Poison typing allows it to resist common Fighting- and Water-type attacks from Mienshao, Breloom, and Basculegion. Vileplume excels in punishing foes for making contact, dealing damage with Rocky Helmet and spreading status with Effect Spore. Despite being a wall, Vileplume isn't completely passive; with Giga Drain and Sludge Bomb, it can threaten serious damage on Vaporeon, Sylveon, and Avalugg, and Vileplume can potentially poison foes with the latter. Leech Seed and Strength Sap further Vileplume's longevity and weaken checks like Registeel and Alolan Muk. Special wallbreakers like Dragalge, Chandelure, and Porygon-Z can easily overwhelm Vileplume. Defensive Steel-types such as Copperajah and Klefki that resist both of Vileplume's STAB moves wall it well but risk being worn down by Leech Seed.</p>",
    "comments": "<h3>Other Options</h3> <p>Growth can be used over Leech Seed, allowing Vileplume to take advantage of bulkier Pokemon that can't threaten it like Alolan Muk and Brute Bonnet, but losing out on Leech Seed means Vileplume can't take on or chip away at Steel-type checks like Registeel and Klefki. Heavy-Duty Boots can be used to ignore entry hazards and to decrease passivity by not needing to heal as often, but the sheer punishment of Rocky Helmet or healing of Leftovers is usually preferred. This value is often not seen long-term, as Vileplume is often tasked with taking Knock Off repeatedly.</p> <h3>Checks and Counters</h3> <p><strong>Special Wallbreakers</strong>: Special wallbreakers like Chandelure, Munkidori, and Porygon-Z can all easily beat Vileplume down with their powerful super effective and even neutral attacks.</p> <p><strong>Tentacruel</strong>: Tentacruel's Liquid Ooze poses a unique threat to Vileplume, which cannot meaningfully damage it with Giga Drain or Sludge Bomb. Liquid Ooze prevents Leech Seed from healing Vileplume and threatens to OHKO Vileplume if it attempts to use Strength Sap.</p>",
    "sets": {
      "Physically Defensive": {
        "description": "<h4>Set Details</h4> <p>Giga Drain hits offensive Ground-types like Swampert and Flygon that resist Sludge Bomb. However, Stun Spore can be run instead for extra utility, allowing Vileplume to spread paralysis for teammates. Leech Seed allows Vileplume to make progress against special walls like Registeel, Cresselia, and Dragalge. Effect Spore and Rocky Helmet can punish U-turn pivots like Mienshao and Flygon and other contact attackers like Paldean Tauros-W and Basculegion. Leftovers can be used to keep it from being too passive and having to heal up as often. Tera Water is used to resist Fire- and Ice-type attacks in a pinch from Chandelure, Mienshao, and Inteleon; on the other hand, Tera Fairy removes its weaknesses, notably to Fire and Psychic, while improving its matchup versus Fighting-types like Mienshao, Gallade, and Infernape.</p> <p>Defensive Steel-types like Copperajah and Registeel wall Vileplume's STAB moves, so Fighting-types like Mienshao and Gallade and Fire-types like Chandelure and Infernape pair well with it. Vileplume also needs support from more specially defensive teammates to take on special wallbreakers like Dragalge, Chandelure, and Inteleon. Options like Registeel, Incineroar, and Milotic can resist these wallbreakers' strong special attacks. Psychic-types like Assault Vest Gallade and Cresselia and Dark-types like Brute Bonnet and Alolan Muk also support Vileplume, helping it against Psychic-type threats like Munkidori, Indeedee-F, and Gallade. Powerful Fire-types like Infernape, Incineroar, Chandelure, and Hisuian Typhlosion also pose a threat to Vileplume, so teammates like Vaporeon, Swampert, and Diancie help it handle these threats.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641404, "username": "hammer798"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Arcanine": {"sets": {"Offensive": {}, "Curse Sweeper": {}}},
  "Tentacruel": {"sets": {"Utility": {}}},
  "Slowbro-Galar": {
    "overview": "<p>Galarian Slowbro establishes itself as a solid physical wall in NU thanks to Regenerator, letting it come in and check threats repeatedly without having to waste a turn healing. Its typing allows Galarian Slowbro to be immune to poison, allowing it to avoid Toxic from Overqwil, while letting it consistently check Fighting-types like Mienshao, Toxicroak, and Breloom. Galarian Slowbro's deep utility movepool lets it support its team by whittling away at walls like Incineroar and Diancie with Toxic or slowing down threats like Munkidori and Inteleon with Thunder Wave. It also has access to Calm Mind, which allows Galarian Slowbro to take advantage of common defensive walls like Registeel and Vileplume by making it harder to KO and switch into as well. On the other hand, it can choose to be more immediately threatening with Assault Vest, as it allows Galarian Slowbro to make use of its vast coverage, and it helps act as a blanket check to special wallbreakers such as Munkidori, Dragalge, and Porygon-Z. However, Galarian Slowbro's typing makes it weak to common Ground- and Dark-types like Flygon, Incineroar, and Alolan Muk. Galarian Slowbro is also susceptible to being KOed by repeated special hits from wallbreakers like Inteleon, Toxtricity, and Porygon-Z due to its below average Special Defense. While Galarian Slowbro checks Fighting-types like Toxicroak and Breloom quite well, other physical wallbreakers with neutral STAB moves like Heracross, Paldean Tauros-W, and Basculegion can easily overpower it or force it to Terastallize.</p>",
    "comments": "<h3>Other Options</h3> <p>Iron Defense + Body Press can be used to turn the tables against Dark-types like Incineroar, Scrafty, and Alolan Muk, but Galarian Slowbro is still easily forced out by special wallbreakers. Nasty Plot can be used over Calm Mind, turning it into a terrifying sweeper, but unlike Calm Mind, it forces Galarian Slowbro to switch out when it's up against special wallbreakers like Dragalge and Munkidori. Trick Room can be used on Galarian Slowbro to take advantage of it's low Speed and decent Special Attack, but without a boost, it struggles to pick up KOs. Colbur Berry lets Galarian Slowbro tank any Dark-type attacks such as Incineroar's and Alolan Muk's Knock Off and Toxicroak's Dark Pulse so that it can respond with an attack afterwards, but the utility of its other items usually outweighs the benefit to using it. Eject Button allows Galarian Slowbro to become a one-time pivot, letting it safely bring in setup sweepers like Swords Dance Incineroar, Dragon Dance Flygon, and Nasty Plot Toxicroak for free. Galarian Slowbro could also opt to go itemless, as it can then wall Brambleghast and reduce Knock Off damage from Incineroar and Mienshao.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: Incineroar and Bombirdier can put a lot of pressure on Galarian Slowbro with their STAB attacks, but they have to be worried about getting poisoned by Sludge Bomb when switching in. Alolan Muk is especially noteworthy for being able to switch into its STAB attacks easily without worry of being poisoned, and it can respond with Knock Off.</p> <p><strong>Ground-types</strong>: Flygon, Swampert, and Gligar can tank its Poison-type attacks and threaten Galarian Slowbro with their STAB Earthquake. However, the former two have to fear getting poisoned, and they all have to be cautious about switching into Ice Beam, Grass Knot, or Surf.</p> <p><strong>Ghost-types</strong>: Chandelure, Hisuian Typhlosion, Decidueye, and Brambleghast can easily destroy Galarian Slowbro with their STAB attacks. However, the former two have to fear about switching into Surf, while the latter two have to worry about Sludge Bomb damage and switching into a Flamethrower.</p> <p><strong>Special Wallbreakers</strong>: Special wallbreakers like Choice Specs Meloetta and Inteleon can easily break through Galarian Slowbro and force it to switch out. Calm Mind users like Uxie and Chandelure can put a lot of pressure on Galarian Slowbro too, but they have to be mindful of getting poisoned and switching into Psyshock and Surf, respectively.</p>",
    "sets": {
      "Physical Wall": {
        "description": "<h4>Set Details</h4> <p>Sludge Bomb is Galarian Slowbro's preferred STAB move, as it hits Fairy-types like Sylveon and Florges while also threatening foes like Incineroar, Flygon, and Swampert with poison. However, Psyshock can be used over Sludge Bomb, allowing Galarian Slowbro to deal with Poison-types and special walls like Toxicroak, Tentacruel, and Diancie more easily, and it also helps overwhelm opposing special setup Pokemon like Sylveon and Oricorio-G. Flamethrower allows Galarian Slowbro to hit Steel-types switching in on Sludge Bomb like Copperajah, Registeel, Bronzong, and Tera Steel Sylveon. Alternatively, Surf allows it to target Incineroar trying to blank an incoming Psyshock. Rocky Helmet punishes physical wallbreakers like Mienshao, Cinccino, and Breloom; it also pairs well with Regenerator, as it allows Galarian Slowbro to consistently switch in to rack up chip damage. Heavy-Duty Boots lets Galarian Slowbro avoid damage from entry hazards, meaning its Regenerator can't be negated, while Leftovers gives it passive recovery, minimizing the need to heal off damage with Slack Off. The EV spread lets Galarian Slowbro outpace Bronzong. Tera Water lets it handle Water-, Ground-, and Fire-types like Basculegion, Flygon, and Incineroar; however, Galarian Slowbro loses its matchup against Grass-types like Tsareena and Breloom. Tera Fairy retains the Fighting-type resistance and allows it to resist Dark-type attacks from Incineroar and Bombirdier but makes it weak to foes like Copperajah and Toxicroak.</p> <p>Galarian Slowbro pairs best with bulky Water-types like Vaporeon, Swampert, and Milotic to handle Ground-types such as Flygon and Swampert; in return, Galarian Slowbro checks Grass-types like Tsareena, Breloom, and Vileplume. Dark-types like Incineroar, Bombirdier, and Scrafty synergize well with Galarian Slowbro by beating Ghost-types like Chandelure and Decidueye; in return, Galarian Slowbro handles Fighting-types like Mienshao, Toxicroak, and Breloom. Galarian Slowbro appreciates Fighting-type teammates like Toxicroak, Breloom, and Paldean Tauros-W, as they can check Dark-types like Incineroar, Bombirdier, and Alolan Muk, which threaten it. Physical wallbreakers like Flygon, Mienshao, and Infernape appreciate Galarian Slowbro's positive matchup against physically defensive walls like Milotic, Vileplume, and Avalugg. Galarian Slowbro can form a defensive backbone with special walls like Copperajah, Bronzong, and Diancie, as they can check special wallbreakers like Choice Specs Meloetta and Toxtricity, while Galarian Slowbro handles the physical wallbreakers like Breloom and Toxicroak.</p>"
      },
      "Assault Vest": {
        "description": "<h4>Set Details</h4> <p>Shell Side Arm is preferred over Sludge Bomb, as it will do more damage to special walls. However, Sludge Bomb can be used for its higher poison chance. Similarly, Psyshock hits special walls harder, but Psychic can be used for its raw power. Flamethrower allows it to hit Steel-types like Copperajah, Bronzong, and Klefki, while Earthquake targets Alolan Muk and Tentacruel with a trade-off of not hitting Bronzong and Orthworm. Ice Beam lets Galarian Slowbro hit Ground-types like Flygon and Gligar, while Surf targets Fire- and Rock-types like Chandelure, Talonflame, and Diancie. Grass Knot can be used as well to hit Water- and Ground-types like Swampert, Milotic, and Gastrodon more effectively. The given Speed EVs outpace Bronzong, though a spread of 180 HP / 252 SpA / 76 Spe could be run to outspeed Gastrodon if it runs Grass Knot. An alternative bulkier EV spread of 252 HP / 128 Def / 4 SpA / 96 SpD / 28 Spe can be run with a Bold nature to live a +2 Wave Crash from Paldean Tauros-W and ensure that Shell Side Arm is a special attack, but Galarian Slowbro can fail to put its coverage to great use at times if it doesn't invest heavily in its offenses. Tera Water lets Galarian Slowbro handle Fire- and Water-types like Choice Specs Chandelure and Inteleon. However, Tera Fairy retains the Fighting-type resistance while letting it handle Dark-types like Incineroar and Bombirdier.</p> <p>Bulky Water- and Grass-types like Vaporeon, Milotic, and Tsareena are great partners for Galarian Slowbro, as they can check Ground-types like Flygon and Swampert. Dark-types like Incineroar, Scrafty, and Wo-Chien appreciate Galarian Slowbro for checking Fighting-types like Mienshao, Toxicroak, and Breloom. In return, they can handle the Ghost-types like Chandelure, Basculegion, and Hisuian Typhlosion. Galarian Slowbro's typing leaves it weak to common Knock Off users like Incineroar and Alolan Muk. Thus, it pairs well with Pokemon like Bellibolt, Swampert, and Toxicroak, as they can check the aforementioned Knock Off users. Defensive walls like Bellibolt, Sylveon, Vaporeon, and Orthworm are great partners for Galarian Slowbro, as they can check physical wallbreakers like Basculegion and Flygon. Physical wallbreakers like Life Orb Mienshao and Choice Band users such as Paldean Tauros-W and Flygon are great partners to form a wallbreaking core with Galarian Slowbro. Special walls like Bronzong, Milotic, and Incineroar can check special wallbreakers like Meloetta, Inteleon, and Chandelure, since Galarian Slowbro can't always beat them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 609709, "username": "Pika134"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Muk-Alola": {
    "overview": "<p>Alolan Muk's useful defensive typing and high Special Defense allow it to be one of the top threats in the metagame. Common special attackers like Chandelure, Munkidori, and Indeedee are stopped in their tracks and forced out by it. On top of this, Alolan Muk isn't useless against bulkier Pokemon either; thanks to its access to Knock Off in combination with Poison Touch, it can slowly beat Sylveon, Talonflame, and Gastrodon. Poison Touch along with Poison Jab allow it to spread poison nearly uninhibited, letting it chip away at opposing teams quite easily. However, Alolan Muk is quite frail physically, often being forced out by pivots like Mienshao and Flygon and losing momentum. It is also weak to fairly common Ground-types like Flygon and Swampert, which then get free turns to set entry hazards or boost their offensive stats. Also, its reliance on unreliable and passive forms of recovery can let it be overwhelmed and taken advantage of.</p>",
    "comments": "<h3>Other Options</h3> <p>A more offensive Alolan Muk with an Assault Vest and a moveset of Knock Off / Poison Jab / Drain Punch / and one of Ice Punch, Rock Slide, Giga Drain, or Shadow Sneak can be used to take special hits while also pressuring foes, but, in doing so, it sacrifices a lot of longevity. Alolan Muk could also run Clear Smog to counteract setup sweepers trying to take advantage of its passivity.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Ground-type Pokemon like Swampert, Flygon, and Mudsdale easily deal great damage to Alolan Muk with a super effective Earthquake, and they can capitalize on a forced switch by setting Stealth Rock or boosting.</p> <p><strong>Fighting-types</strong>: Fighting-types like Mienshao, Paldean Tauros-W, and Heracross, while not having a way to hit Alolan Muk super effectively, overwhelm it, taking advantage of its low Defense with their powerful Fighting-type attacks.</p> <p><strong>Poison-types</strong>: Poison-types like Vileplume and Toxicroak can wall Alolan Muk due to their immunity to poison. On top of that, Vileplume is able to set up Leech Seed or use Growth, while Toxicroak freely sets up with Swords Dance and can do this repeatedly with Leftovers and Drain Punch.</p> <p><strong>Physical Wallbreakers</strong>: Physical wallbreakers like Iron Thorns and Heracross easily overwhelm Alolan Muk with their Quark Drive- and Guts-boosted attacks due to its low Defense.</p> <p><strong>Setup Pokemon</strong>: With how passive Alolan Muk can be, especially with Rest, it can be setup fodder for Pokemon like Drednaw, Incineroar, and Flygon.</p>",
    "sets": {
      "Special Wall": {
        "description": "<h4>Set Details</h4> <p>Poison Jab is preferred for damage, but Poison Fang can be used to spread poison more easily. Rest + Sleep Talk offers recovery but is sometimes unreliable; alternatively, Drain Punch + Protect allows Alolan Muk to regain health while threatening Steel-types like Copperajah and Registeel. Tera Water can be used to better take Fire-type attacks from Hisuian Typhlosion and Chandelure, and it gifts Alolan Muk a strong defensive Tera type that can take on tons of Pokemon well. However, Tera Dragon helps Alolan Muk check a wide array of special attackers like Inteleon, Oricorio-E, and Rotom-H better than Tera Water does. Both Tera Water and Dragon help Alolan Muk when facing Ground-types, but they tend to leave it more susceptible to other physical wallbreakers like Tsareena and Brambleghast.</p> <p>Alolan Muk fails against physical attackers, especially Ground- and Fighting-types such as Flygon, Breloom, and Mienshao. So, Pokemon like Vileplume, Talonflame, and Swampert help to form a strong defensive core for the team. After using Knock Off, Alolan Muk is almost helpless against Steel-types like Registeel and Klefki as they set entry hazards or boost; its Drain Punch is just too weak. To counter this, teammates that can handle these foes such as Infernape, Chandelure, and Flygon pair well with Alolan Muk. Since it can deal with Psychic- and Ghost-types easily, Pokemon such as Mienshao, Brambleghast, and Munkidori greatly appreciate Alolan Muk's presence. Because of how easily Alolan Muk can remove items, hazard setters like Klefki, Swampert, and Quagsire have great synergy with it. On the flip side, with how many times Alolan Muk is forced to switch into an attack, hazards become an issue for it, jeopardizing its ability to take on Chandelure and Munkidori. To clear these hazards, Pokemon like Talonflame, Avalugg, and Tsareena pair perfectly.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Electrode-Hisui": {"sets": {"Offensive Pivot": {"description": "<p>20 Defense EVs allow Electrode-Hisui to avoid a 2HKO from Choice Scarf Bruxish Wave Crash. Fairy Tera Blast hits Dragon-types like Goodra and Tatsugiri. The given Speed outruns Jolteon.</p>"}}},
  "Hitmonlee": {"sets": {"Terrain Sweeper": {}}},
  "Weezing": {"sets": {"Physical Wall": {}}},
  "Scyther": {"sets": {"Swords Dance": {}, "Pivot": {}}},
  "Tauros-Paldea-Blaze": {"sets": {"Bulk Up": {}, "Choice Item": {}}},
  "Tauros-Paldea-Aqua": {
    "overview": "<p>Paldean Tauros-W splashes its way to the top of the tier as one of the best wallbreakers thanks to its strong STAB attacks boosted with Choice Band or Bulk Up, good Speed tier, and great matchup against top threats like Flygon and Incineroar. With a Choice Band, it threatens common physical walls like Swampert, Galarian Slowbro, and Bellibolt. Alternatively, it can choose to set up with Bulk Up, which prevents physical revenge killers from trying to stop it. Not only does it have a good Speed tier, outspeeding wallbreakers like Porygon-Z, Hisuian Typhlosion, and Toxicroak, but it has a strong priority option in Aqua Jet to beat weakened, faster foes like Kilowattrel and Cinccino. However, it can be easy to take advantage of. If it is Choice Band, then Pokemon immune to Water like Vaporeon or Toxicroak as well as Ghost-types like Chandelure can switch in and punish it. Other foes that resist its STAB moves like Galarian Slowbro and Vileplume use Rocky Helmet to punish its use of contact moves; the latter can punish it further due to Effect Spore. Vileplume is able to hard wall Bulk Up variants, stopping any attempt to set up or forcing the use of Tera. Its Speed tier is good, but not good enough, as some wallbreakers like Kilowattrel, Tornadus, and Munkidori outspeed and revenge it with ease.</p>",
    "comments": "<h3>Other Options</h3> <p>Iron Head can be used as an option to hit Tera Fairy Vaporeon, but that's its only target because Wave Crash hits the other Fairy-types for more damage. Stone Edge is an option to target Talonflame without risking a Flame Body burn. Trailblaze can be paired with Bulk Up to outspeed would-be faster Pokemon like Kilowattrel and Choice Scarf Porygon-Z.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Vileplume is a hard counter, resisting both of its STAB attacks and only ever getting 2HKOed by Choice Band Zen Headbutt. Defensive Brambleghast can be problematic due to its immunity to Fighting-type moves and Water resistance; that in combination with Strength Sap can wall Paldean Tauros-W. Choice Scarf users like Rotom-C and Tsareena can revenge kill it while resisting its Water-type moves. Decidueye resists Wave Crash and is immune to Close Combat, letting it switch in and set up at no cost.</p> <p><strong>Psychic-types</strong>: Bulky Psychic-types like Cresselia and Galarian Slowbro can tank any of Paldean Tauros-W's hits and threaten it in return. Others like Munkidori and Espeon outspeed it and threaten to KO or force the use of Tera Steel.</p> <p><strong>Water-immune and -resistant Pokemon</strong>: Vaporeon and Gastrodon are both immune to Wave Crash and Raging Bull and can use Tera Fairy to resist Close Combat. Vaporeon and Milotic can use Scald to burn it. Toxicroak is immune to its Water-type moves and resists Close Combat, often giving it a free turn to set up. Tera Water Galarian Slowbro is hardly threatened by Paldean Tauros-W, and it can hit it back with a super effective Psychic.</p> <p><strong>Chip Damage</strong>: Some of Paldean Tauros-W's most common checks, like Vileplume, Galarian Slowbro, and Houndstone, tend to use Rocky Helmet, punishing it for simply attacking. On top of that, one of its main STAB attacks inflicts recoil damage, which adds up over any given match. This also leads into it having a poor matchup against Talonflame, Vileplume, and Bellibolt, which all have abilities that can status it on contact.</p>",
    "sets": {
      "Choice Item": {
        "description": "<h4>Set Details</h4> <p>Choice Band turns Paldean Tauros-W into a powerful wallbreaker with its high-Base Power STAB attacks, letting it 2HKO slower Water- or Fighting-resistant Pokemon like Brambleghast and Choice Specs Sylveon. Choice Band also takes advantage of Aqua Jet's priority to revenge kill faster threats like Kilowattrel, Munkidori, and Choice Scarf Chandelure. Choice Scarf allows it to use Raging Bull instead of Aqua Jet, giving it another Water-type STAB move that doesn't have recoil damage. Zen Headbutt allows it to 2HKO Vileplume, while Earthquake is more accurate and has higher damage against other Poison-types like Galarian Slowbro and Dragalge. Choice Scarf enables Paldean Tauros-W to turn into a revenge killer, outspeeding and KOing threats like Inteleon, Munkidori, and Kilowattrel. Tera Water pushes Wave Crash's damage through the roof, opening room for new 2HKOs on Pokemon like Cresselia, defensive Brambleghast, and Bellibolt. Tera Fighting buffs Close Combat, enabling it to OHKO Klefki and, after some prior chip damage, Diancie and Vaporeon.</p> <p>Psychic- and Fairy-types like Cresselia, Munkidori, and Sylveon all heavily threaten Paldean Tauros-W with their super effective STAB attacks while being able to tank its Close Combat. This opens room for Steel-types and certain special walls like Bronzong, Registeel, and Incineroar; in return, Paldean Tauros-W helps deal with Fire- and Ground-types, like Chandelure, Flygon, and Swampert, that hinder those Pokemon. Ground-types like Flygon, Swampert, and Gastrodon take advantage of Electric-types like Kilowattrel, Bellibolt, and Rotom-C, which can all KO Paldean Tauros-W with ease. Due to its struggles with taking on common physical walls like Vileplume, Galarian Slowbro, and Tera Poison Avalugg, special wallbreakers like Munkidori, Porygon-Z, and Hisuian Typhlosion make for great partners. Due to recoil damage, Rocky Helmet, and entry hazards, it appreciates Wish support from Pokemon like Sylveon and Florges as well as Lunar Dance from Choice Scarf Cresselia. Vaporeon and Toxicroak are both checks to it due to their Water immunity; this opens up room for certain Pokemon like Rotom-C and Kilowattrel. Galarian Articuno in particular forms a core with it thanks to Future Sight and U-turn to pressure Vileplume and other Pokemon that switch into Paldean Tauros-W; in return, Paldean Tauros-W helps defeat any Steel- and Dark-types that Galarian Articuno loses to.</p>"
      },
      "Bulk Up": {
        "description": "<h4>Set Details</h4> <p>Raging Bull can be used over Wave Crash as a strong option if Paldean Tauros-W is not using Leftovers to help mitigate recoil damage. Aqua Jet gives it a form of strong priority, making revenge killing it with Kilowattrel and Munkidori much harder. Zen Headbutt helps to hit Poison-types like Vileplume, Toxicroak, and Dragalge. Substitute can be used instead for longevity, pairing well with Tera Steel to become immune to status and Vileplume's Leech Seed. Leftovers gives it some form of longevity while setting up and lets it regain some HP lost due to Wave Crash's recoil. Lum Berry grants it a one-time immunity to any status it may obtain from the likes of Talonflame's Flame Body and Vileplume's Effect Spore. Tera Steel grants useful resistances to Fairy-, Psychic-, Flying-, and Grass-type attacks that Paldean Tauros-W is otherwise weak to, while Tera Water boosts the damage of Wave Crash and Raging Bull, though it doesn't offer much defensive utility.</p> <p>This set excels when partnered with other setup sweepers on a hyper offense team, such as Flygon, Chandelure, and Incineroar; they all appreciate having Galvantula as a lead to lay Sticky Web on the opposing side, slowing down any faster Pokemon. Froslass, Brambleghast, and Iron Thorns are other good leads for these teams, using Spikes to wear down already unstable checks. Despite that, Paldean Tauros-W isn't a one-trick pony, being a staple on some balance builds, especially when paired with Flygon. It helps beat some of Flygon's checks such as Bronzong, Orthworm, and Choice Scarf Cresselia; simultaneously, Flygon pressures Paldean Tauros-W's checks like Galarian Slowbro, Toxicroak, and Vileplume. It appreciates Steel-types like Bronzong, Registeel, and Klefki to tank any Psychic- and Fairy-type attacks coming its way. Flygon, Swampert, and Volt Absorb Kilowattrel do a great job at punishing any Electric-types trying to revenge it like opposing Kilowattrel and Choice Scarf Rotom-C. It appreciates help from Pokemon like Munkidori and Meloetta to threaten Vileplume, Galarian Slowbro, and Houndstone; Paldean Tauros-W, in return, alleviates pressure from Dark-types like Incineroar, Alolan Muk, and Umbreon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 189361, "username": "Lucario"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 641404, "username": "hammer798"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Ditto": {"sets": {"Among Us": {}}},
  "Vaporeon": {
    "overview": "<p>Vaporeon's typing and good defenses let it check common physical attackers like Paldean Tauros-W, Incineroar, and Flygon, and Water Absorb makes it one of the best answers to opposing Water-types like Inteleon and Basculegion-M. Compared to other physically bulky Water-types like Swampert and Quagsire, Vaporeon excels due to its access to reliable recovery in Wish and its ability to pivot and potentially pass Wish to its teammates with Flip Turn. Vaporeon can also run Haze, which allows it to check bulky setup sweepers like Calm Mind Cresselia and Iron Defense Registeel. However, more powerful or more aggressively boosting foes, such as Swords Dance Mienshao and Nasty Plot Munkidori, can overwhelm Vaporeon. Additionally, while Vaporeon can be a great blanket check to certain physical and special attackers, it can be easily overwhelmed at times by either how many it has to check in a battle or their sheer power. Grass- and Electric-type attackers, such as Poison Heal Breloom, Brambleghast, and Kilowattrel, are quite common as well and easily force Vaporeon out.</p>",
    "comments": "<h3>Other Options</h3> <p>As an alternative to Haze, Vaporeon can utilize Roar to phaze opposing setup sweepers. Calm Mind can be used on Vaporeon to let it take advantage of forced switches and passive Pokemon, usually alongside Ice Beam to make progress against Toxicroak and Grass-types like Vileplume. However, this set is still walled by opposing Water-types. Tera Fairy can be used to resist Fighting- and Dragon-type attacks, and Tera Ghost can be used to completely wall Paldean Tauros-W.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Vaporeon is weak to common Grass-type attackers such as Brambleghast, Technician Breloom, and Tsareena. However, all of these hate switching into a Scald burn. Grass-type coverage, like Chandelure's Energy Ball and Tera Grass Paldean Tauros-F's Trailblaze, can also be threatening.</p> <p><strong>Electric-types</strong>: Electric-type attackers like Kilowattrel and Iron Thorns force Vaporeon out, and they can take advantage of this by gaining momentum or setting up.</p> <p><strong>Special Attackers</strong>: Strong special attackers, such as Porygon-Z, Chandelure, and Dragalge, scare out Vaporeon, and the first two have Trick to cripple it.</p> <p><strong>Water-immune Pokemon</strong>: As Vaporeon only runs Water-type attacks, it cannot actually damage opposing Water-immune Pokemon. Most prominently, Toxicroak can set up on Vaporeon or throw out powerful attacks, Gastrodon can set entry hazards, and opposing Vaporeon are untouchable.</p>",
    "sets": {
      "Wish Passer": {
        "description": "<h4>Set Details</h4> <p>Flip Turn allows Vaporeon to pivot in teammates for free and more easily pass Wish. Alternatively, Haze gives Vaporeon an option to prevent opposing setup sweepers like Calm Mind Cresselia and Iron Defense Registeel from boosting out of control. Leftovers gives Vaporeon additional healing, particularly in combination with Protect to gain free turns to heal. However, Heavy-Duty Boots allows Vaporeon to pivot more frequently without concern for entry hazard chip damage. Tera Poison gives Vaporeon a resistance to Fighting- and Grass-type attacks from common physical attackers such as Mienshao, Breloom, and Brambleghast, as well as an immunity to being poisoned by Umbreon's Toxic. Tera Dark, on the other hand, allows Vaporeon to temporarily check Stored Power sweepers like Bronzong and Cresselia if it doesn't have Haze, as well as Choice Band Tera Blast Ghost Basculegion, which would 2HKO it otherwise.</p> <p>Vaporeon benefits from teammates that can take powerful special attacks from foes like Chandelure, Porygon-Z, and Munkidori, so special walls like Incineroar, Bronzong, and Assault Vest Alolan Muk support it well. These teammates also benefit from Wish being passed to them, as they lack reliable recovery. A backup physical wall such as Sylveon or Vileplume is useful to ensure Vaporeon isn't overwhelmed by Ground- and Fighting-types like Flygon and Mienshao. On non-Heavy-Duty Boots sets, entry hazard removal from Pokemon such as Talonflame, Tsareena, and Brambleghast is vital to ensure Vaporeon doesn't become excessively passive by being forced to heal each time it comes out. Powerful wallbreakers such as Mienshao, Flygon, and Chandelure benefit from Wish and Flip Turn support from Vaporeon, allowing them to repeatedly switch in and break opposing walls.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641404, "username": "hammer798"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Articuno-Galar": {"sets": {"Calm Mind": {"description": "<p>Psychic Noise can be used as the last move to better beat bulkier teams, while Psyshock lets Galarian Articuno have an easier time versus Calm Mind Sylveon.</p>"}, "Future Sight Pivot": {}}},
  "Typhlosion-Hisui": {"sets": {"All-out Attacker": {}, "Choice Item": {}}},
  "Espeon": {"sets": {"Choice Specs": {}, "Rain Support": {}}},
  "Gligar": {"sets": {"Physical Wall": {"description": "<p>56 Speed EVs allows Gligar to outspeed Adamant Incineroar, while 140 Speed EVs lets it outpace Jolly Incineroar and Adamant Decidueye.</p>"}}},
  "Qwilfish-Hisui": {"sets": {"Rain Sweeper": {}}},
  "Heracross": {"sets": {"Wallbreaker": {}, "Choice Scarf": {}, "Spikes Setter": {}}},
  "Sneasel": {"sets": {"Swords Dance": {}}},
  "Kingdra": {"sets": {"Rain Sweeper": {}}},
  "Smeargle": {"sets": {"Lead": {}}},
  "Raikou": {"sets": {"Calm Mind": {}}},
  "Sceptile": {"sets": {"Terrain Sweeper": {}}},
  "Swampert": {
    "overview": "<p>Swampert is an excellent wall. Its great defensive typing gives it resistances and immunities to Fire-, Poison-, and Electric-type attacks from the likes of Infernape, Alolan Muk, and Iron Thorns, and it threatens them with Earthquake. While there is some competition for the Water-type slot on teams, Swampert is unique in its ability to simultaneously threaten Electric-types and pivot out with Flip Turn, often slowly enough to bring its teammate in completely safely. On top of this, Swampert also has access to Knock Off, which is valuable utility to cripple item-reliant Pokemon like Talonflame, Avalugg, and Registeel, and Roar, which allows Swampert to challenge setup sweepers like Cresselia and Oricorio-E. However, its limited recovery options make Swampert vulnerable to being worn down over the course of a battle, meaning it won't be able to check these aforementioned setup sweepers long-term. Swampert's 4x weakness to Grass-type attacks also hampers it, as it struggles against common Grass-types like Tsareena, Breloom, and Brambleghast. On top of this, many Pokemon like Chandelure, Gallade, and Iron Thorns carry some way to surprise Swampert with Grass-type coverage, whether that be Energy Ball, Leaf Blade, or Tera Blast Grass.</p>",
    "comments": "<h3>Other Options</h3> <p>More offensive sets like Choice Band or bulkier ones that utilize Assault Vest can work, but it's difficult to fit another entry hazard setter that doesn't add on to Swampert's Grass-type weakness. Swampert can run special attacks like Hydro Pump, Earth Power, and Ice Beam; however, if Swampert goes this route, it struggles to fit these moves and its great utility options on the same set, as it wants all of Knock Off, pivoting, hazards, STAB moves, and powerful coverage.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types and Grass-type coverage</strong>: Foes like Vileplume and Breloom can be immensely threatening. Grass-types with Rapid Spin like Brambleghast and Tsareena are particularly dangerous foes because they can chase Swampert out while removing Stealth Rock simultaneously. Pokemon with Grass-type coverage like Grass Knot Infernape, Energy Ball Chandelure, and Tera Blast Grass Iron Thorns can typically KO Swampert without warning from high health.</p> <p><strong>Chip Damage</strong>: Swampert lacks reliable recovery, so it is vulnerable to repeated damage from entry hazards, status ailments from Vileplume's Effect Spore and Talonflame's Flame Body, and repeated attacks from foes it is meant to check like Mienshao, Munkidori, and Hisuian Typhlosion. Knock Off users like Incineroar and Alolan Muk only exacerbate this issue with their ability to remove Swampert's Leftovers.</p>",
    "sets": {
      "Utility Tank": {
        "description": "<h4>Set Details</h4> <p>Flip Turn allows Swampert to pivot out and bring in teammates to make progress. Knock Off supplies utility against foes that Swampert cannot hit well with its STAB moves, and it cripples item-reliant foes like Munkidori, Talonflame, and Avalugg. However, Roar prevents Swampert's passivity from getting taken advantage of by stopping setup sweepers like Oricorio-E and Paldean Tauros-W. The physically defensive EV spread is better into attackers like Flygon and Mienshao, but a specially defensive one assists against Electric-types like Rotom-H and Raikou. Tera Poison turns Swampert's 4x weakness to Grass-type attacks into a resistance and helps it more easily take on the myriad of Fighting-types like Mienshao, Infernape, and Breloom. Tera Fairy makes Swampert immune to Dragon-type attacks from threats like Dragalge and resistant to Dark- and Fighting-type attacks from foes such as Brute Bonnet and Mienshao while allowing it to continue checking Ground-types like Flygon. Tera Dragon gives Swampert resistances to Water-, Fire-, and Grass-type attacks, making it strong against common attackers like Basculegion-M, Incineroar, and Breloom. Tera Steel gives Swampert a wide array of resistances to more easily handle special attackers like Dragalge and Sylveon.</p> <p>Swampert benefits from the support of Grass-resistant teammates like Dragalge, Talonflame, and Incineroar, covering its biggest weakness. Swampert's Stealth Rock can be supplemented by Grass-resistant Spikes users like Klefki and Brambleghast to stack entry hazards, both of which also benefit from Swampert's Fire resistance. Ghost-type teammates like Brambleghast and Chandelure can also support Swampert's Stealth Rock by preventing Rapid Spin from opposing Tsareena and Avalugg. Knock Off users like Alolan Muk, Incineroar, and Mienshao can further support Swampert's entry hazards by removing items. While Swampert can take multiple hits, it lacks any reliable recovery, so pairing it with Wish passers like Sylveon and Florges or backup walls like Dragalge, Vileplume, Registeel, and Incineroar can be helpful. As Swampert lures in Grass-types like Tsareena and Vileplume, wallbreakers that can take advantage of Swampert's pivoting like Infernape, Dragalge, and Chandelure can threaten these foes and force others to switch in and take damage from Swampert's Stealth Rock.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641404, "username": "hammer798"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Ludicolo": {"sets": {"Rain Dance Sweeper": {}}},
  "Breloom": {
    "overview": "<p>Breloom's monstrous Attack, especially when coupled with Technician, makes it difficult to switch into at times. On top of this, it has the rare trait of being a Fighting-type that easily beats Water-types like Vaporeon, Swampert, and Milotic; however, it competes with Toxicroak for this role, which has an immunity to Water-type attacks and a higher Speed tier to boot. Breloom can circumvent its middling Speed with a Technician-boosted Mach Punch, though, and while Breloom has solid checks like Vileplume, Galarian Slowbro, and Tornadus, it can carry coverage moves to make quick work of them. Breloom is even immune to Vileplume's Effect Spore, letting it attack it without worry, though it needs to be wary of Rocky Helmet. However, Breloom can't beat all of these checks in one set, forcing it to choose which foes it prefers to beat. Additionally, even though it can be worked around, its Speed can be taken advantage of by multiple other wallbreakers like Chandelure, Staraptor, and Toxtricity. While Breloom has good resistances like Water and Ground, these are often rendered moot by its low defenses, and Water-types, which it can normally check, might burn it with Scald, worsening its damage output and ability to beat them.</p>",
    "comments": "<h3>Other Options</h3> <p>Breloom can equip a Choice Scarf to become a surprise revenge killer, but its mediocre Speed tier and access to a Technician-boosted Mach Punch makes this set unappealing overall. Gunk Shot lets Breloom hit Grass- and Fairy-types that try to switch into its STAB attacks super effectively like Brambleghast, Whimsicott, and Scream Tail while dealing good damage to Flying-types like Tornadus and Kilowattrel that try to do the same.</p> <h3>Checks and Counters</h3> <p><strong>Poison-types</strong>: Galarian Slowbro, Dragalge, and Vileplume all easily wall Breloom, and both Toxicroak and Tera Poison Uxie can easily use it as setup fodder. However, if Breloom carries Bulldoze, the majority of these aren't an issue, and Aerial Ace can make quick work of Vileplume.</p> <p><strong>Flying-types</strong>: Kilowattrel and Galarian Articuno wall Breloom's STAB moves and can use it for momentum, while Tornadus and Scyther can do the same and also capitalize on Breloom by setting up or throwing off their high-Base Power attacks. However, they're quite frail, meaning Mach Punch could pick them off if they've been sufficiently weakened, and Breloom can carry Rock Tomb and Tera Rock to handle them, though Scyther often carries Close Combat and doesn't worry about Substitute sets thanks to Dual Wingbeat's multi-hit nature.</p> <p><strong>Fire-types</strong>: Chandelure and Hisuian Typhlosion can take both of Breloom's STAB moves and retaliate with powerful Fire-type attacks. Paldean Tauros-F and Incineroar are also annoying for Breloom with their access to Intimidate. Breloom can take them out on the switch in with Rock Tomb or Bulldoze and can use Tera Rock to take one Fire-type attack if needed, though.</p> <p><strong>Psychic-types</strong>: Munkidori, Meloetta, and Uxie can all threaten out Breloom, but the first two are susceptible to being picked off due to their frailty, and none of them take multiple Bullet Seed hits comfortably.</p>",
    "sets": {
      "Choice Band": {
        "description": "<h4>Set Details</h4> <p>Aerial Ace allows Breloom to handle one of its best checks, Vileplume. However, Breloom could opt for Bulldoze instead, since Poison-types like Dragalge and Galarian Slowbro can be a pain for it to get past, but in doing so, Breloom gives up any chance of even touching Tornadus, Kilowattrel, and Galarian Articuno. Rock Tomb, on the other hand, allows Breloom to hit these aforementioned troublesome Flying-types as they switch in, and similarly to Bulldoze, it can hit Fire-types like Chandelure, Incineroar, and Hisuian Typhlosion. Seed Bomb can be used over Bullet Seed for its reliable damage output, as it's stronger if Bullet Seed only hits twice; however, the majority of the time, it's weaker, and Breloom is worse off running it. Since Breloom's Speed tier isn't too congested, Adamant is preferred for more power. Jolly does let it outpace Adamant Basculegion, Jolly Incineroar, and Modest Toxtricity, though. Tera Fighting lets Breloom boost its Close Combat and Mach Punch to absurd levels, allowing it to OHKO Alolan Muk and Bronzong and 2HKO Sylveon with the former as well as OHKO Inteleon and Mienshao with the latter. On the other hand, Tera Fire allows Breloom to avoid burns from Incineroar's Will-O-Wisp while letting it withstand a Fire-type attack from Hisuian Typhlosion, Chandelure, and the aforementioned Incineroar at least once. Tera Rock similarly gifts Breloom a Fire resistance and allows it to take Flying-type attacks from Galarian Articuno, Kilowattrel, and Tornadus so that it can retaliate with a STAB-boosted Rock Tomb.</p> <p>One of Breloom's main struggles when trying to wallbreak is getting past Poison-types like Vileplume, Dragalge, and Galarian Slowbro, so Psychic- and Ground-types like Munkidori, Uxie, and Flygon are greatly appreciated. The former two as well as Kilowattrel and Dragalge excel at pivoting Breloom in on Dark- and Steel-types like Klefki, Registeel, and Alolan Muk with their U-turn and Flip Turn. Galarian Articuno is an exceptionally good partner, as on top of also providing U-turn support, it can use Future Sight to limit Breloom's switch-ins even further and take advantage of Vileplume's Strength Sap with its Competitive. In a similar vein, pivots such as Mienshao, Incineroar, Inteleon, and the aforementioned Flygon are appreciated, as they commonly draw in Water-types, like Vaporeon, Milotic, Gastrodon, and Swampert, for Breloom to take advantage of. Flying-types like Kilowattrel and Tornadus can be similarly annoying, so switch-ins to these threats like Kilowattrel, Bellibolt, and Diancie have good synergy. Incineroar, Alolan Muk, and Bronzong, also make for decent partners, handling the Psychic- and Fairy-types, like Uxie, Munkidori, Whimsicott, and Sylveon, that force Breloom out.</p>"
      },
      "Swords Dance": {},
      "GlisLoom (Poison Heal)": {
        "description": "<p>After Poison Heal Breloom activates its Toxic Orb, its immunity to status means it doesn't have to fear attempts to status it from Thunder Wave Galarian Slowbro and Scald users such as Vaporeon and Milotic. However, this could be completely negated if Breloom takes a Knock Off or Trick too early from Mienshao or Choice Scarf Florges. Seed Bomb gives Breloom a STAB move to let it reliably threaten bulky Water- and Ground-types like Vaporeon, Swampert, and Palossand, whereas Toxic allows Breloom to pressure troublesome Ghost-types that it would struggle with otherwise such as Chandelure, Hisuian Typhlosion, and Brambleghast as well as physical walls like Sylveon and Bellibolt. Protect allows Breloom to activate its Toxic Orb, gives it a free turn of Poison Heal recovery, and lets it scout out Choice item users like Flygon and Munkidori. Breloom could also choose to opt for other moves too, though. For example, Leech Seed allows Breloom to make progress against bulkier foes like Orthworm and Bronzong, Substitute lets it take advantage of passive Pokemon that give it more turns to heal such as Vaporeon and Gligar, Drain Punch lets Breloom target Dark- and Steel-types like Incineroar and Copperajah, Focus Punch pairs exceptionally well with Substitute and lets Breloom do major damage against the aforementioned foes and others like Diancie and Tsareena, and Swords Dance, which should be used in combination with Bulldoze as its last move, allows Breloom to become more threatening more quickly. The EV spread allows Breloom to maximize Poison Heal recovery, outspeed Dragalge, and OHKO Vileplume with a +2 Tera Normal Facade.</p> <p>Breloom appreciates pivot support from Flygon, Mienshao, Incineroar, and Inteleon, as they can force in Water-types like Milotic and Vaporeon for Breloom to take advantage of, and they grant it free entry because if it switches into a Scald without its Toxic Orb activated already, it risks getting burned. Physical walls like Galarian Slowbro, Milotic, and Dragalge are great partners for Breloom, since they can handle faster, more powerful foes like Mienshao, Chandelure, and Paldean Tauros-W. Bulky Poison-types like Galarian Slowbro, Vileplume, and Dragalge can tank Breloom's attacks when it's unboosted, so it best partners with Psychic- and Ground-types like Munkidori, Meloetta, and Flygon to check them. Flying-types like Kilowattrel and Tornadus can easily revenge kill Breloom. Thus, it appreciates Pokemon like Bellibolt, Diancie, and Rotom-H to take advantage of them. Breloom works well as a partner to Steel- and Dark-types like Copperajah, Bronzong, and Incineroar, as they can handle Fairy- and Psychic-types like Sylveon, Florges, and Meloetta. Breloom synergizes really well with Incineroar, Chandelure, and Hisuian Typhlosion, as it resists Ground-type attacks and can beat both Water- and Dark-types like Milotic and Scrafty for them. Pokemon that hate Scald like Flygon, Paldean Tauros-F, and Mienshao appreciate Breloom for dealing with Scald users like Vaporeon and Milotic for them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 609709, "username": "Pika134"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Hariyama": {"sets": {"Belly Drum": {}, "Assault Vest": {}, "Guts Wallbreaker": {}, "Bulk Up": {}}},
  "Flygon": {
    "overview": "<p>Flygon's great set versatility makes it an elite Pokemon and one of the best Ground-types in NU. Choice Scarf Flygon fits on many teams, outspeeding and limiting many wallbreakers such as non-Choice Scarf Mienshao and Munkidori. Choice Band gives Flygon an incredibly spammable Earthquake and makes it a lot harder to switch into. Flygon can also pivot out with U-turn, allowing it to maintain offensive pressure and momentum. Dragon Dance Flygon can use Loaded Dice, which makes it a great late-game sweeper, and it also threatens lead entry hazard setters like Galvantula and Smeargle. However, as a Choice Scarf user, it faces competition from Mienshao and Infernape, both of which are faster than it and can revenge kill it with Close Combat. Additionally, Flygon's average Attack stat leaves it struggling when facing physical walls like Vaporeon, Vileplume, and Avalugg, as they can still take its attacks even after a Dragon Dance boost. Choice Scarf Flygon can be very easy to play around due to both of its STAB options having common immunities and resistances.</p>",
    "comments": "<h3>Other Options</h3> <p>Flygon can run a mixed set with Draco Meteor and Fire Blast, allowing it to hit physically defensive Pokemon like Avalugg, Orthworm, and Vileplume. It can also run a Choice Specs set with Tera Normal, which gives it a powerful Boomburst. However, both of these sets are not common due to Flygon's low Special Attack. Flygon can also run a utility set with Stealth Rock / Earthquake / Dragon Tail / U-turn with a bulkier EV spread. This set allows it to set entry hazards for its teammates and check foes like Copperajah, Iron Thorns, and Infernape. Sadly, Flygon lacks any recovery, making it very easy for it to get worn down by chip damage.</p> <h3>Checks and Counters</h3> <p><strong>Fairy-types</strong>: Sylveon and Florges are able to tank hits from Choice Scarf Flygon and KO it back with their STAB Fairy-type attacks; however, neither of them can handle Choice Band sets, and they are complete setup fodder against Tera Steel Dragon Dance Flygon.</p> <p><strong>Physically Defensive Pokemon</strong>: Physically defensive Pokemon such as Avalugg and Vileplume have enough bulk to win against any of Flygon's sets, but Vileplume has to be careful directly switching into +1 Flygon if entry hazards are present. Bulky Water-types like Vaporeon, Swampert, and Quagsire are bulky enough to tank a boosted attack and threaten Flygon back with status and Knock Off.</p> <p><strong>Priority Users and Faster Attackers</strong>: Infernape, Breloom, Brute Bonnet, and Basculegion can revenge kill Flygon after it has been weakened a bit. Choice Scarf users like Mienshao and Infernape can outspeed even Choice Scarf Flygon and destroy it with Close Combat.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<h4>Set Details</h4> <p>Outrage is one of Flygon's strongest STAB attacks for late-game cleaning, and it can 2HKO foes like Tsareena and Kilowattrel on a switch. Dragon Claw is a safer option to avoid getting locked into Outrage, but it's significantly weaker and is harder to revenge kill foes with. U-turn allows Flygon to maintain momentum and provide free switches to teammates. Flygon's last move is commonly Stone Edge, which allows it to hit Flying-types like Talonflame, Kilowattrel, and Oricorio-E. Alternatively, Stealth Rock allows it to set entry hazards for its teammates. Flygon can run Dragon Claw alongside Outrage so that it can still revenge kill foes like Kilowattrel and Tsareena without getting immediately destroyed by Fairy-types. First Impression can be used over Stone Edge, allowing Flygon to revenge kill weakened boosted and faster threats like Drednaw and Choice Scarf Munkidori. Tera Steel gives Flygon a resistance to Fairy- and Dragon-type attacks from Pokemon like Sylveon, Florges, and opposing Flygon. This also allows it to check some special wallbreakers like Meloetta, Dragalge, and Porygon-Z.</p> <p>Wallbreakers like Chandelure, Mienshao, and Breloom appreciate Choice Scarf Flygon for giving them free entry with U-turn. Flygon can form a VoltTurn core with special attackers like Kilowattrel, Rotom-C, and Toxtricity. They can threaten physical walls like Vaporeon, Avalugg, and Vileplume; in return, Flygon can pressure special walls like Alolan Muk and Copperajah. Choice Scarf Flygon struggles to break past bulky Water-types like Vaporeon, Swampert, and Quagsire, which tank its attacks and punish it with Scald, Knock Off, a slow Flip Turn, and Toxic. Grass-types like Brambleghast, Brute Bonnet, and Vileplume similarly appreciate Flygon's U-turn giving them free entry to handle the aforementioned bulky Water-types. Steel-types like Copperajah, Registeel, and Bronzong appreciate Flygon for checking Fire-types like Chandelure, Infernape, and Incineroar; in return, they can check Fairy-types like Sylveon, Florges, and Diancie. Choice Scarf Flygon appreciates entry hazard support from Copperajah, Diancie, and Swampert, as it can wear down foes to help with Choice Scarf Flygon's low damage output.</p>"
      },
      "Choice Band": {
        "description": "<h4>Set Details</h4> <p>Choice Band gives Flygon more immediate power, allowing it to always 2HKO Vileplume and Quagsire after Spikes damage with Earthquake. Outrage is still an option to allow Flygon to 2HKO Vaporeon and Quagsire, but Scale Shot is preferred so Flygon isn't easily revenge killed by Fairy-types, and it makes Flygon harder to revenge kill overall. First Impression revenge kills weakened foes like Porygon-Z, Munkidori, and Torterra. Alternatively, Throat Chop provides coverage for Bronzong and shuts down Hyper Voice Sylveon, whereas Stone Edge pops Talonflame on the switch. Tera Bug gives First Impression a power boost, allowing Flygon to KO Mew and do major damage to defensive Reuniclus. Tera Steel can sometimes be preferred over Tera Bug, since it's better defensively and allows Flygon to pivot without getting chipped heavily by Stealth Rock.</p> <p>Choice Band Flygon likes having entry hazard support from teammates like Klefki, Copperajah, and Diancie to wear down foes that can repeatedly switch into it. Many Pokemon that tend to struggle against bulky Water-types like Vaporeon and Milotic, such as Registeel, Infernape, and Basculegion, appreciate Choice Band Flygon's ability to 2HKO them on the switch. However, while it can 2HKO most bulky Water-types, it can't always beat them one-on-one, so it pairs well with Grass-types like Tsareena, Brambleghast, and Vileplume. Physically defensive Pokemon like Avalugg, Weezing, and Orthworm can take Flygon's attacks with ease, so it pairs best with Pokemon like Kilowattrel, Munkidori, and Chandelure that can handle these physical walls. Future Sight Galarian Articuno can be a great partner for Choice Band Flygon, allowing it to weaken physical walls like Milotic, Avalugg, and Vileplume.</p>"
      },
      "Dragon Dance": {
        "description": "<h4>Set Details</h4> <p>Dragon Dance with a Scale Shot boost allows Flygon to outspeed the entire tier, including common Choice Scarf users like Mienshao and Infernape. Dropping Scale Shot for Outrage is acceptable to run a different item, but this makes Flygon significantly more reliant on obtaining multiple Dragon Dance boosts to avoid being revenge killed. Substitute allows Flygon to take advantage of switches and passive Pokemon, giving it more turns to set up. With Tera Steel, Flygon can also exploit Pokemon like Vileplume and Brave Bird Talonflame for easier setup. Fire Punch allows Flygon to hit Grass-types like Tsareena, Vileplume, and Brute Bonnet, as well as Steel-types like Bronzong, Orthworm, and Tera Steel Flygon. Alternatively, Throat Chop lets Flygon target Bronzong, and it blocks Sylveon from using Hyper Voice. Tera Steel allows it to be immune to Umbreon and Quagsire's Toxic. Tera Fire gives Fire Punch a much-needed power boost and retains the resistance to Fairy-type attacks that Tera Steel gives. If running Substitute, an alternate EV spread of 32 HP / 224 Atk / 252 Spe can be run to avoid Tera Steel Flygon's Substitute from being broken by Talonflame's Brave Bird.</p> <p>Dragon Dance Flygon appreciates entry hazard support from Klefki and Swampert to guarantee a 2HKO on Pokemon like Vileplume and Vaporeon. Toxic Spikes in particular is helpful, since it makes it a lot easier to break through physical walls like Quagsire and Swampert that would usually tank many hits from a Dragon Dance boost. Flygon is a perfect pick for hyper offense teams due to its Sticky Web immunity and because it can sweep opposing hyper offense teams. It can also punish lead hazard setters like Galvantula and Smeargle by setting up a Dragon Dance and breaking their Focus Sashes with Scale Shot. Other sweepers like Breloom, Drednaw, and Mienshao appreciate Dragon Dance Flygon's ability to weaken teams so they can win late-game. Choice Scarf users like Mienshao, Munkidori, and Infernape can force Flygon to switch out even if it's at +1 because they can still outspeed it. Thus, slow pivots like Toxtricity, Swampert, and Flip Turn Vaporeon can help by bringing Flygon in safely.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 609709, "username": "Pika134"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 189361, "username": "Lucario"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}, {"user_id": 511181, "username": "Rose"}, {"user_id": 470115, "username": "SolarBeam"}]}]}
  },
  "Altaria": {"sets": {"Utility": {}, "Trapper": {}}},
  "Milotic": {"sets": {"Defensive": {"description": "<p>The alternative EV spread allows Milotic to survive a Knock Off from a Swords Dance-boosted Adamant Incineroar while still letting it check special attackers like Hisuian Typhlosion, Chandelure, and Inteleon reliably.</p>"}}},
  "Registeel": {
    "overview": "<p>Thanks to its impressive mixed bulk and utility movepool, Registeel finds a home in the tier as one of the premier walls. Its typing has key resistances to Dragon, Fairy, and Rock, letting it stand in the way of threats like Dragalge, Sylveon, and Diancie. It also isn't completely passive; it can threaten common Fairy-types with its powerful Heavy Slam or even set up on and take out the defensive Pokemon that it walls, like Umbreon, with the devilish IronPress combination. Additionally, Registeel is a great entry hazard setter that has no issue finding opportunities to set Stealth Rock during a game. However, Registeel's typing can often be a burden, as its weaknesses are taken advantage of by common wallbreakers like Chandelure, Breloom, and Flygon. Additionally, Registeel is vulnerable to getting weakened over the course of a battle, as it relies on Leftovers as its only method of recovery. Lastly, Registeel's easy to exploit with slow and paralysis-immune Pokemon like Galarian Slowbro and Swampert that don't mind Thunder Wave, as well as Ghost-types like Hisuian Typhlosion and Chandelure.</p>",
    "comments": "<h3>Other Options</h3> <p>Registeel can run a set of Iron Defense / Amnesia / Body Press / Rest with a Chesto Berry to become a dangerous sweeper that's difficult to break through, but it is quite passive while boosting, is walled by Ghost-types, and can be crippled by Trick, Encore, and Taunt.</p> <h3>Checks and Counters</h3> <p><strong>Fire-types</strong>: Fire-types like Infernape, Chandelure, and Incineroar can easily threaten out Registeel with their super effective STAB moves; however, they don't love switching into Earthquake or Thunder Wave. Talonflame's annoying because it easily removes Registeel's Stealth Rock with Defog and can inhibit any IronPress sweeping attempts with Will-O-Wisp.</p> <p><strong>Ground-types</strong>: Ground-types like Swampert and Flygon can shrug off Registeel's attacks and threaten it out with Earthquake, additionally being immune to Thunder Wave.</p> <p><strong>Fighting-types and Fighting-type Coverage</strong>: The likes of Mienshao and Paldean Tauros-W terrify Registeel with their strong Close Combat, and other attackers like Munkidori can use Focus Blast to handle Registeel. However, none of these Pokemon want to switch into Thunder Wave.</p> <p><strong>Passive Damage</strong>: Registeel is vulnerable to being chipped down by entry hazards, and this is particularly noticeable when its Leftovers has been removed by Knock Off or cancelled out by burn.</p>",
    "sets": {
      "Defensive Stealth Rock": {
        "description": "<h4>Set Details</h4> <p>Earthquake prevents Chandelure and Hisuian Typhlosion from walling Registeel, and it also chunks Poison-types like Alolan Muk and Dragalge. Thunder Wave is an immediate punishment to fast attackers like Infernape and Mienshao attempting to switch in on non-attacking moves. Alternatively, the IronPress combination can be used to take advantage of defensive Pokemon like Copperajah, Sylveon, and Umbreon. Tera Dragon gives Registeel useful resistances to many special attackers' strongest attacks, letting it sponge hits like Choice Specs-boosted Hydro Pump from Inteleon and Fire Blast from Chandelure in a pinch. Tera Ghost can be used to blank Fighting-type attacks from the likes of Mienshao and Toxicroak while notably blocking Rapid Spin. Tera Fairy can also be used to help against Fighting-types, additionally helping IronPress variants to check Dark-types like Brute Bonnet and Incineroar, but it's less effective against Toxicroak. Tera Water can be used to give Registeel a resistance to Water and Fire, which is useful against the likes of Basculegion, Inteleon, and Chandelure, while maintaining its resistance to Ice.</p> <p>Registeel fits best on balance teams alongside other defensive Pokemon as part of a core. Vaporeon and Florges are good examples, being able to pass Wish to Registeel to keep it healthy while also having useful resistances to Fire and Fighting, respectively. Spikes setters like Quagsire and Diancie complement Registeel's Stealth Rock, wearing down opposing Pokemon more consistently. Wallbreaking beneficiaries of hazard-stacking cores that Registeel is a part of include Sylveon, which can check Fighting-types and invite in and chip down Fire-types, and Inteleon, a wallbreaker that is incredibly threatening to Ground-types and can chunk defensive Water-types. Fighting- and Fire-type checks like Talonflame, Vileplume, Vaporeon, and Diancie make for good partners, being able to handle the likes of Mienshao and Chandelure. Additionally, Tsareena and Talonflame can tank Ground-, Fighting-, and Fire-type attacks and remove entry hazards for Registeel. Fighting-types like Mienshao and Breloom appreciate the entry hazards that Registeel sets and also benefit from its ability to check common answers to them like Munkidori and Sylveon. Vileplume partners with Registeel to create a solid defensive partnership, being able to spread paralysis alongside Registeel to help out partners like Chandelure and Paldean Tauros-F.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 569291, "username": "zinnias"}, {"user_id": 336073, "username": "Rabia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Torterra": {
    "overview": "<p>Torterra excels as a setup sweeper on hyper offense teams, using Shell Smash to boost its stats and power through foes. Torterra has all the coverage it needs with Rock Blast, as it hits Flying-types like Talonflame and Kilowattrel that might otherwise threaten to wall and KO Torterra. It can also work around some of its checks with Tera Blast, improving its matchup into Grass-types like Vileplume and Tsareena. Torterra's high base Defense and solid defensive typing provide it ample opportunities to set up against foes like Basculegion and Swampert. While Torterra can somewhat choose its checks with Rock Blast and Tera Blast Fire, it cannot run both, and as a result can be checked by Grass-types like Vileplume and Tsareena or by Flying-types like Talonflame. Furthermore, Torterra's low base Speed makes it vulnerable to being outsped and revenge killed by Choice Scarf users like Munkidori, Flygon, and Mienshao, even after a Shell Smash boost, meaning it often requires Sticky Web support. Priority, such as Flygon's First Impression and Toxicroak's Sucker Punch, can also end a potential sweep, as Torterra often lowers its Defense with Shell Smash and Headlong Rush.</p>",
    "comments": "<h3>Other Options</h3> <p>On non-Loaded Dice sets, Torterra can choose Stone Edge as an alternative to Tera Blast for coverage that does not require Tera, but accuracy can become a problem. Torterra can also run moves like Zen Headbutt and Crunch to hit specific targets like Vileplume and Bronzong without Terastallizing; however, they are fairly niche or outclassed by other options.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types</strong>: Torterra's STAB moves cannot hit Grass-types, such as Tsareena, Vileplume, and Brambleghast, so it is forced to rely on Tera Blast Fire to hit them, which some sets may not carry.</p> <p><strong>Flying-types</strong>: Flying-types like Talonflame, Kilowattrel, and Tornadus don't fear Torterra's STAB moves, and even when Torterra carries coverage like Rock Blast, it can be inaccurate. These foes also outspeed unboosted Torterra, and Talonflame in particular may burn it if it predicts that Torterra will not Terastallize Fire.</p> <p><strong>Revenge Killers</strong>: Torterra's low Speed makes it vulnerable to being revenge killed by Choice Scarf users like Mienshao and Munkidori, as well as priority like Toxicroak's Sucker Punch and Flygon's First Impression. Flygon in particular is dangerous, as its Choice Scarf set cannot be slowed by Sticky Web due to Levitate, and it frequently uses Tera Steel.</p>",
    "sets": {
      "Shell Smash": {
        "description": "<h4>Set Details</h4> <p>Bullet Seed is a powerful STAB move but requires Loaded Dice to be effective, while Wood Hammer provides immediate power without requiring an item slot but forces Torterra to take recoil. Earthquake is a strong move without a drawback, but Headlong Rush provides even more power, with the downside of defensive stat drops. Rock Blast, like Bullet Seed, requires Loaded Dice to be effective, but it provides necessary coverage against Flying-types like Talonflame and Kilowattrel. Tera Ghost can be used defensively, removing Torterra's existing weaknesses and adding an immunity to Fighting-type attacks, which can be useful against revenge killers like Mach Punch Breloom and Choice Scarf Mienshao. Tera Blast Fire can OHKO defensive Grass-types like Tsareena and Vileplume. Tera Fire also prevents Torterra from being burned. Since Flying-types like Talonflame, Tornadus, and Kilowattrel naturally outspeed Torterra and deal great damage with their STAB moves, Torterra may want to opt for Tera Electric, giving it a resistance to their Flying-type STAB moves and maintaining its immunity to Thunder Wave. If not using Loaded Dice along with Bullet Seed and Rock Blast, Torterra can utilize White Herb to restore its defenses after Shell Smash, making it a more reliable setup sweeper. While a Jolly nature lets Torterra outspeed foes such as Choice Scarf Chandelure and Heracross, Adamant can be run on Sticky Web teams for more power.</p> <p>Torterra's low Speed makes it vulnerable to being revenge killed by Choice Scarf users like Mienshao, Munkidori, and Inteleon, so Sticky Web users like Araquanid and Galvantula support it well. Choice Scarf Flygon has Levitate to be immune to Sticky Web, so faster Choice Scarf users like Munkidori and Mienshao can help Torterra handle it. Additional physical breakers can weaken Torterra's checks and finish them off after Torterra is stopped, so teammates like Swords Dance Toxicroak and Dragon Dance Flygon and Iron Thorns pair well with it; the first handles Grass-types, the second and third can weaken them for Torterra, and the last can also handle Flying-types like Talonflame and Kilowattrel. Teammates such as Chandelure and Tornadus that can target Grass-types like Vileplume and Tsareena are also appreciated, weakening or outright removing these checks to Torterra. Fire-types like Chandelure, Hisuian Typhlosion, and Incineroar appreciate Torterra's support against Water- and Ground-types like Swampert and Flygon.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641404, "username": "hammer798"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Infernape": {"sets": {"Choice Scarf": {}, "Choice Band": {}, "Nasty Plot": {}, "Dedicated Lead": {}}},
  "Staraptor": {"sets": {"Choice Band": {}, "Choice Scarf": {}}},
  "Floatzel": {"sets": {"Rain Wallbreaker": {}}},
  "Gastrodon": {"sets": {"Defensive": {}}},
  "Ambipom": {"sets": {"Pivot": {}}},
  "Mismagius": {"sets": {"Choice Scarf": {}, "Substitute + Draining Kiss": {}}},
  "Bronzong": {
    "overview": "<p>Bronzong is an elite Steel-type in NU thanks to both its great mixed bulk and an excellent ability in Levitate, which, unlike other Steel-types, allows it to check many Ground-types like Flygon and Gligar, along with other Pokmon that rely on Ground-type coverage to hit Steel-types like Diancie. Bronzong is remarkably resistant to entry hazards, as it simultaneously resists Stealth Rock and has an immunity to Spikes, making it a centerpiece on teams with little to no hazard removal. Furthermore, Bronzong excels at being a great hazard setter thanks to its ability to check threats like Munkidori, Sylveon, and Porygon-Z. It can take advantage of these positive matchups and its already tremendous bulk by instead being a bulky setup sweeper, becoming very difficult to take out. However, Bronzong's only form of recovery is Leftovers, meaning that it has to be even more wary about switching into the already threatening Knock Off from Pokemon that it would check otherwise like Copperajah, Tsareena, and Toxicroak. Additionally, foes that Bronzong is typically expected to check like Munkidori, Florges, and Rotom-C often run Trick to cripple it severely and especially hurts its setup sets.</p>",
    "comments": "<h3>Other Options</h3> <p>Bronzong can opt to run a fully physically defensive EV spread, letting it handle physical wallbreakers like Flygon, Staraptor, and Breloom a bit better, but this makes it worse against Pokemon like Kilowattrel, Inteleon, and Munkidori. Heatproof allows Bronzong to handle Pokemon that carry Fire-type coverage like Fire Punch Flygon and Flamethrower Galarian Slowbro, but the Ground immunity from Levitate is almost always superior. Future Sight lets it limit switch-ins for wallbreakers like Flygon, Breloom, and Paldean Tauros-W. Gyro Ball lets Bronzong hit faster opponents like Mienshao, Tornadus, and Flygon much harder. Protect can be used on utility sets, providing Bronzong a bit more Leftovers recovery and letting it scout out Choice item users like Flygon and Munkidori; however, it struggles to fit it because it prefers to run other utility moves. Trick alongside Toxic Orb allows Bronzong to cripple defensive tanks like Incineroar, Cresselia, and Vaporeon. Colbur Berry lets Bronzong tank Dark-type attacks like Dark Pulse Inteleon and Knock Off Tsareena, but it prefers Leftovers for gaining extra recovery.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types and Dark-type Coverage</strong>: Incineroar, Alolan Muk, Overqwil, and Scrafty can tank Bronzongs attacks very well and threaten it back with their STAB attacks. However, none of them want to switch into a +2 Body Press. Pokemon that have Dark-type coverage like Throat Chop Flygon, Dark Pulse Inteleon, and Knock Off from Tornadus or Cinccino can put a lot of pressure on Bronzong as well.</p> <p><strong>Ghost-types</strong>: Chandelure, Hisuian Typhlosion, Decidueye, and Brambleghast easily destroy Bronzong with their STAB attacks, and the former can cripple it with Trick. However, the first two have to be mindful about switching into Bronzong variants that run Earthquake.</p> <p><strong>Item Removal</strong>: Knock Off users like Copperajah, Tsareena, Gligar, and Mienshao can threaten Bronzong by getting rid of its Leftovers, cutting into its longevity over the course of the battle. Choice Scarf users like Munkidori, Florges, and Rotom-C can both bother utility sets and ruin Bronzong's sweeping attempts by crippling it with Trick.</p> <p><strong>Fire-types</strong>: Paldean Tauros-F, Rotom-H, and Salazzle threaten Bronzong with their high-Base Power attacks or take advantage of it by getting free turns to set up. Salazzle is especially annoying with its access to Encore and, thanks to Corrosion, can threaten Bronzong with Toxic.</p>",
    "sets": {
      "Utility": {
        "description": "<h4>Set Details</h4> <p>Body Press pairs well with Bronzong's good Defense, letting it threaten Dark- and Steel-types like Incineroar, Scrafty, and Copperajah. Earthquake lets Bronzong target Fire- and Poison-types like Chandelure and Galarian Slowbro, and even after Intimidate, it hits Overqwil harder than Body Press can. Heavy Slam allows Bronzong to hit Fairy-types like Sylveon, Florges, and Diancie. Night Shade can be used over Heavy Slam, allowing Bronzong to make solid progress against Ghost- and Dark-types like Chandelure, Hisuian Typhlosion, and Alolan Muk. Optionally, Bronzong can invest 164 Defense EVs in order to 2HKO offensive Incineroar with Body Press while better taking hits from physical attackers like Flygon. Tera Fairy gives Bronzong a useful resistance to Dark- and Fighting-type attacks from Incineroar and Mienshao. Tera Water, on the other hand, provides it a resistance to Water- and Fire-type attacks, helping it against Pokemon like Inteleon and Chandelure.</p> <p>Bronzong pairs well with Fighting-types like Mienshao, Scrafty, Toxicroak, and Paldean Tauros-W, as they can handle Dark-types like Incineroar and Alolan Muk, and the last three are great switch-ins to Knock Off; in return, Bronzong checks Fairy- and Psychic-types such as Sylveon, Florges, and Munkidori. Ghost-types like Chandelure, Decidueye, and Brambleghast can take Bronzong's attacks fairly easily and threaten it back with their own STAB attacks. Thus, it best partners with Dark-types like Incineroar, Alolan Muk, Overqwil, and Bombirdier to check the aforementioned Ghost-types. Bulky Water-types like Vaporeon, Milotic, and Tentacruel can beat Fire-types like Chandelure and Hisuian Typhlosion for Bronzong. Spikes users like Overqwil, Brambleghast, and Heracross are excellent partners for Bronzong, as they can spread entry hazards to help each other wear down their checks. Wish passers like Vaporeon and Sylveon let Bronzong repeatedly switch in against special wallbreakers like Kilowattrel and Dragalge by offsetting its lack of recovery. Bronzong synergizes well with physical walls like Gligar, Vileplume, and Vaporeon for their positive matchups against physical attackers like Toxicroak, Paldean Tauros-W, and Incineroar. In return, Bronzong handles special wallbreakers like Munkidori, Toxtricity, and Sylveon.</p>"
      },
      "Bulky Setup Sweeper": {
        "description": "<h4>Set Details</h4> <p>Body Press lets Bronzong pressure Steel- and Dark-types like Copperajah, Klefki, and Incineroar. Stored Power lets it more easily break through Fighting-resistant and -immune Pokemon that try to switch in like Sylveon, Vileplume, and Decidueye, while the scaling power from both Bronzong's boosted offenses and defenses helps it break past opposing Calm Mind setup from the likes of Sylveon, Florges, and Galarian Slowbro. The EV spread allows Bronzong to outspeed Gastrodon so that when Bronzong Terastallizes, it can attack before being hit by a Clear Smog while giving it enough special bulk to tank many hits. Tera Fairy gives it a resistance to Fighting-, Dark-, and Dragon-type attacks from Heracross, Scrafty, and Flygon. However, Tera Water lets it better handle foes like Inteleon, Chandelure, and Hisuian Typhlosion. Tera Poison could also be used, as it allows Bronzong to check Fighting- and Poison-types like Mienshao, Toxicroak, and Alolan Muk, and it maintains Bronzong's immunity to both Toxic and the latter's Poison Touch.</p> <p>Wish passers like Vaporeon and Sylveon appreciate Bronzong for checking threats like Munkidori, Kilowattrel, and Porygon-Z. In return, they provide it recovery by passing it Wish. Bronzong greatly appreciates partners like Florges, Mienshao, Scrafty, and Alolan Muk, as they often bring in foes like Munkidori, Sylveon, and Flygon for Bronzong to take advantage of. Fighting- and Fairy-types like Mienshao, Paldean Tauros-F, Florges, and Diancie are great partners for Bronzong, as they can handle Dark-types like Incineroar and Scrafty, and the last three are good Knock Off absorbers; in return, Bronzong checks and can capitalize on bulky Poison-types like Galarian Slowbro, Vileplume, and Dragalge. Bronzong partners well with Dark-types like Incineroar, Alolan Muk, and Overqwil, as they can check Ghost-types such as Chandelure, Decidueye, and Brambleghast and bulky Psychic-types like Uxie and opposing Bronzong that it can struggle with. Fire-types like Hisuian Typhlosion, Rotom-H, and Incineroar can force Bronzong to switch out, so it best pairs with bulky Water- and Dragon-types like Vaporeon, Milotic, and Goodra to check them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 609709, "username": "Pika134"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 312113, "username": "Shengineer"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Toxicroak": {
    "overview": "<p>Toxicroak stands out for having the rare combination of Dry Skin and a great typing both offensively and defensively, which makes it the premier switch-in to Water-types like Vaporeon, Milotic, Paldean Tauros-W, Basculegion, and Inteleon. Toxicroak is also less susceptible to being revenge killed after it has set up; its access to priority moves makes it a lot harder to revenge kill despite its middling Speed. However, Toxicroak's biggest problem is its frailty; if it switches into any non-Water-type attack from these threats, it gets easily 2HKOed, but Toxicroak's good defensive typing gives it more opportunities to set up against foes like Vileplume, Choice Scarf Mienshao, and Tsareena. Toxicroak also struggles against physically defensive Ground- and Poison-types like Palossand, Galarian Slowbro, and Dragalge, as they can take both of its STAB attacks and proceed to threaten Toxicroak back with their own STAB moves. Additionally, Toxicroak also faces Fighting-type competition with Mienshao and Breloom, which are both stronger, making them more consistent at times.</p>",
    "comments": "<h3>Other Options</h3> <p>Choice Scarf Toxicroak can outspeed common threats like Chandelure, Infernape, and Flygon. However, its moves are quite exploitable if it's locked into them, as Pokemon that resist or are immune to its attacks are common. Air Balloon gives Toxicroak a useful immunity to Ground-type attacks, giving it more opportunities to set up. Alternatively, Shuca Berry lets Toxicroak better lure in and damage Flygon and Swampert, as it's discreet; however, the majority of the time, Toxicroak prefers to run other items. Ice Punch allows Toxicroak to hit Ground- and Dragon-types like Gligar, Flygon, and Dragalge, but Toxicroak struggles to fit it. Encore allows Toxicroak to take advantage of bulky setup sweepers and entry hazard leads like Cresselia, Swampert, and Sylveon by giving it a free opportunity to set up either Swords Dance or Nasty Plot.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Flygon, Swampert, and Gastrodon threaten Toxicroak with their STAB Ground-type attacks, but none of them want to switch into a boosted Close Combat or Focus Blast. Quagsire can shut down Toxicroak's sweeping attempts with Unaware and destroy it with a STAB Earthquake. However, Quagsire fares a bit worse against Nasty Plot Toxicroak. Gligar resists both of Toxicroak's STAB attacks and uses it to set up entry hazards or hits it back with Earthquake. Palossand is especially noteworthy, though, as it blanks Fighting-type attacks, resists Poison-type moves, and doesn't take too much from Sucker Punch.</p> <p><strong>Poison-types</strong>: Galarian Slowbro and Dragalge resist both of Toxicroak's STAB attacks, and they can either set up or hit it back with their own STAB attacks.</p> <p><strong>Psychic-types</strong>: Munkidori and Meloetta destroy Toxicroak with their powerful STAB attacks. However, none of them want to switch into a boosted Dark Pulse, and they can also be picked off by Sucker Punch. Indeedee-M will always win in a one-on-one against Toxicroak due to Psychic Terrain, but it can't switch in.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<h4>Set Details</h4> <p>Close Combat is the preferred STAB option, allowing Toxicroak to 2HKO defensive walls like Alolan Muk and Klefki with Stealth Rock. Alternatively, Drain Punch helps provide more longevity against foes like Alolan Muk and Swampert, and it can counteract Life Orb chip if needed. Sucker Punch helps Toxicroak pick off revenge killers and weakened threats alike such as Munkidori and Flygon; Tera Dark allows Toxicroak to OHKO foes like Inteleon and Kilowattrel after a Swords Dance boost. Both Knock Off and Earthquake can be run in the last moveslot to hit checks like Palossand, Galarian Slowbro, and Dragalge harder, but Toxicroak's low Speed makes it prefer a priority move in most situations. A Jolly nature lets Toxicroak outspeed foes like Heracross and Chandelure, but an Adamant nature provides more wallbreaking power, allowing Toxicroak to OHKO Vileplume with a +2 Gunk Shot when it's boosted by Life Orb. Leftovers is the preferred item for Toxicroak, providing it needed recovery and letting it continually come in and check bulky Water-types. However, Life Orb provides Toxicroak a bit more extra wallbreaking power.</p> <p>Toxicroak best pairs with Pokemon that lure in bulkier Water-types such as Vaporeon and Milotic, so good partners would be Water-types like Inteleon and Basculegion and Fire-types like Incineroar and Talonflame, as all of them are able to pivot and give it a free switch into the aforementioned bulky Water-types. Inteleon is a noteworthy partner, as it checks the common Ground- and Fire-types like Flygon, Gligar, and Chandelure, and it can actually pivot on Water-immune Pokemon thanks to its access to U-turn, helping Inteleon keep up momentum. In return, Toxicroak can take advantage of bulky Water- and Grass-types such as Vaporeon, Tentacruel, and Tsareena. Toxicroak gets threatened by Psychic-types such as Indeedee-M, Meloetta, and Munkidori, so it pairs well with Dark- and Steel-types like Umbreon, Incineroar, and Bronzong that check the aforementioned Psychic-types. Poison-types like Dragalge and Galarian Slowbro can cause many problems for Toxicroak, making Psychic- and Ground-types like Meloetta, Flygon, and Swampert great partners. Ground-immune Pokemon like Talonflame, Rotom-C, and Bronzong are great partners for Toxicroak, as they are able to check Ground-types such as Flygon and Swampert. Toxicroak also appreciates Water- and Rock-types like Vaporeon, Swampert, and Diancie to consistently switch into Fire-types like Chandelure, Infernape, and Hisuian Typhlosion.</p>"
      },
      "Nasty Plot": {
        "description": "<h4>Set Details</h4> <p>Dark Pulse hits Psychic- and Ghost-types like Galarian Slowbro, Chandelure, and Basculegion that would resist or be immune to its STAB attacks. Vacuum Wave can be used over Dark Pulse, allowing Toxicroak to KO revenge killers like Porygon-Z, Flygon, and Inteleon. A Timid nature allows Toxicroak to outspeed foes like non-Choice Scarf Chandelure and Basculegion, but a Modest nature allows it to OHKO foes like Swampert with a +2 Focus Blast. Life Orb is preferred for its immediate power, allowing Toxicroak to always 2HKO foes like Swampert and Sylveon, but Leftovers can provide Toxicroak needed recovery over the course of the battle. Tera Dark boosts the power of Dark Pulse while giving Toxicroak an immunity to Psychic-type attacks from Meloetta and Munkidori. Tera Fighting gives both Toxicroak's Focus Blast and Vacuum Wave an extra power boost, allowing it to 2HKO foes like Alolan Muk, Registeel, and Diancie and pick foes off from higher health.</p> <p>Toxicroak pairs well with pivots like Inteleon, Flygon, and Incineroar, as they can bring in foes like Vaporeon, Vileplume, and Alolan Muk and give Toxicroak a free opportunity to set up. Faster Pokemon like Talonflame, Flygon, and Munkidori outspeed and destroy Toxicroak. Thus, it pairs with defensive walls like Vaporeon, Tsareena, and Assault Vest Galarian Slowbro to handle the aforementioned Pokemon. Toxicroak synergies best with Steel- and Dark-types like Bronzong, Umbreon, and Incineroar, as they can check Psychic-types such as Munkidori, Indeedee-M, and Meloetta. In return, Toxicroak can pressure and take advantage of the Fighting- and Fairy-types like Sylveon, Florges, and Mienshao that give these Pokemon trouble. Ground-types like Flygon, Swampert, and Palossand can tank Toxicroak's unboosted attacks and OHKO it with their Ground-type STAB moves. Therefore, Toxicroak partners well with bulky Water- and Grass-types like Vaporeon, Tsareena, and Vileplume, as they can check the aforementioned Ground-types.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 609709, "username": "Pika134"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Abomasnow": {"sets": {"Aurora Veil Setter": {}, "Special Attacker": {}}},
  "Porygon-Z": {"sets": {"Choice Item": {"description": "<p>Tera Blast Ground can be used on Choice Specs sets to hit Steel-type Pokemon.</p>"}, "Agility": {}}},
  "Froslass": {
    "sets": {
      "Spikes Utility": {
        "description": "<p>With excellent Speed, a diverse utility movepool, and Spikes, Froslass is an elite Spikes setter and spinblocker. Taunt shuts down opposing entry hazard setters like Qwilfish, Blissey, and Sandaconda while also preventing Defog from the likes of Braviary and Lurantis. Ice Beam puts additional pressure on the aforementioned Defoggers and targets other walls like Sandaconda and Appletun. Shadow Ball provides higher damage on targets like Mesprit and Ghost-types like Rotom and opposing Froslass. Will-O-Wisp cripples physical attackers like Coil Dudunsparce, Hisuian Sneasel, and Scyther. While Tera Dark is situational, it can become a Knock Off sponge and wall Sableye while inverting its Dark and Ghost weaknesses.</p> <p>Stealth Rock setters like Bombirdier and Sandaconda contribute to the hazard stacking Froslass provides, with the former removing opposing Heavy-Duty Boots with Knock Off. Wallbreakers like Bruxish and Pyroar can put foes into KO range faster thanks to the extra chip damage. VoltTurn users such as Scyther, Jolteon, and Magneton can not only help bring Froslass in safely, but also wear down other walls like Muk, Appletun, and Umbreon. Defensive walls like Blissey and Sandaconda can circumvent Froslass's low bulk with their reliable recovery and can sponge status moves.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 543866, "username": "5Dots"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Rotom-Heat": {"sets": {"Defensive Pivot": {}}},
  "Rotom-Mow": {"sets": {"Choice Scarf": {}, "Utility": {}, "Nasty Plot": {}}},
  "Uxie": {"sets": {"Nasty Plot": {}, "Utility": {}}},
  "Emboar": {"sets": {"Wallbreaker": {}}},
  "Leavanny": {"sets": {"Sticky Web Support": {}}},
  "Whimsicott": {"sets": {"Pivot Support": {"description": "<p>Whimsicott can be used to check some of the tier's most powerful physical attackers in Flygon, Tauros-Paldea-Aqua, and Breloom. Moonblast is its most reliable attacking option, U-turn allows Whimsicott to pivot out of bad matchups, Prankster Encore serves as a blanket check to setup sweepers, and Memento paves the way for Whimsicott's teammates to set up for a sweep of their own. 76 Special Attack EVs ensures Whimsicott OHKOes Mienshao, and 168 Speed EVs allows it to outspeed it too, while maximum Speed lets it outpace Cinccino, Tornadus, and Munkidori.</p>"}}},
  "Lilligant": {
    "sets": {
      "Quiver Dance Sweeper": {
        "description": "<p>Lilligant is a fearsome setup sweeper in NU thanks to the infamously potent combination of Quiver Dance + Terastallization. Tera patches up two of Lilligant's main weaknesses, being poor coverage and a poor defensive typing. Pollen Puff allows Lilligant to hit Grass-types like Appletun and Lurantis without having to rely on Tera Blast. It also doubles as nice coverage for Pokemon such as Umbreon and Mesprit, which pack the bulk and utility options to hinder a Lilligant sweep. Because Lilligant has Pollen Puff for Grass-types, it uses a Tera Blast type capable of threatening Flying-types, commonly Rock or Electric. Tera Rock has the added benefit of resisting Poison, letting Lilligant more easily deal with Muk or take a Poison-type attack from Hisuian Sneasel or Toxicroak in a pinch. Lilligant can opt to run Encore last in tandem with Tera Electric to take advantage of careless Thunder Wave users like Blissey and Umbreon, locking them into the move and granting Lilligant free setup opportunities. Sleep Powder can be used to grant even more setup opportunities, but without the added coverage, these setup opportunities are often moot. Life Orb is great for Lilligant, as Giga Drain can offset the recoil, and the added damage to special walls like Appletun and Bombirdier is greatly beneficial.</p> <p>Lilligant is often found on more offensive teams, both creating and using openings and momentum for and by its teammates. Dedicated leads like Bombirdier and Froslass are the forefront of generating early momentum for offensive Pokemon; the entry hazards and utility options like a respective Memento or Destiny Bond create ample opportunities for Lilligant and other offensive teammates like Hisuian Sneasel, Veluza, and Vivillon. Choice Scarf Mesprit and Rotom can invite in special walls like Blissey, Cryogonal, and Umbreon and Trick them, completely impairing their ability to check Lilligant effectively.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400664, "username": "Stories"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 577920, "username": "Tea Guzzler"}]}]}
  },
  "Scrafty": {"sets": {"Bulk Up": {}, "Dragon Dance": {}}},
  "Cinccino": {
    "overview": "<p>Cinccino's blistering Speed and access to Technician, which it can fully take advantage of with Loaded Dice, make it a dangerous setup sweeper that can end games as easily as it can wallbreak for its partners. Passive Pokemon that might try to take advantage of Cinccino like Orthworm and Bronzong aren't safe from it either, as Cinccino can lock them into setting up entry hazards or using Iron Defense with its Encore, giving it free turns to boost with Tidy Up. On top of that, after a turn of setup, its myriad of coverage moves lets it beat anything from Unaware Quagsire to Flame Body Talonflame unharmed. However, Cinccino has terrible four-moveslot syndrome, and its STAB move can be easily punished by common Rocky Helmet users like Vileplume and Galarian Slowbro. Pokemon like Inteleon and Choice Scarf Mienshao can outpace it and threaten it with a KO, but they fail to check it after it boosts. Cinccino's Tidy Up is also a double-edged sword, as it needs the power to achieve many of its KOs, but in using the move, it removes the hazards that were helping limit its switch-ins in the first place, making it somewhat difficult to fit on many teams. Cinccino also struggles to find setup opportunities due its frailty typically only letting it survive one hit.</p>",
    "comments": "<h3>Other Options</h3> <p>Protective Pads could be run to not be vulnerable to contact punishment, but with how Cinccino is then forced to use Skill Link, it becomes weaker. On teams that would like an offensive form of entry hazard control, Heavy-Duty Boots + Skill Link can be run on Cinccino alongside U-turn, letting it reliably remove hazards and bring in a wallbreaker for incoming Steel-types. However, the weaker power, along with the fact that there are better hazard removal options generally, causes it to be unused. Tera Blast Fire can be utilized on Cinccino to hit Rocky Helmet Vileplume and Steel-types like Orthworm and Copperajah, which it can have trouble dealing with otherwise, but Tera Blast being a wasted moveslot before Terastallization means that it's generally worse overall.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Orthworm, Registeel, and Copperajah can take all of Cinccino's attacks comfortably and retaliate with a Body Press or powerful Iron Head; on top of that, the latter two can even paralyze and phaze it, respectively. Bronzong can also wall Cinccino and retaliate with Body Press, but it must beware of Knock Off. If any of them set up entry hazards or used Iron Defense as Cinccino came in, they are easily beat one-on-one due to its Encore.</p> <p><strong>Contact Punishment</strong>: Pokemon like Flame Body Talonflame, Effect Spore Vileplume, and Static Bellibolt can all cripple Cinccino with a burn, poison, or paralysis, and Rocky Helmet users like the latter two and Galarian Slowbro can chip away heavily at Cinccino if it uses Tail Slap, opening it up to being revenge killed even more easily. However, Cinccino can run Rock Blast to take out Talonflame, Tera Fire to ignore burn attempts, and Knock Off to remove these crippling items.</p> <p><strong>Revenge Killers</strong>: Fast Pokemon, such as Inteleon and Kilowattrel, and Choice Scarf users, like Mienshao and Munkidori, outspeed Cinccino and can threaten it with a KO if Cinccino hasn't boosted yet. On top of that, Pokemon with priority like Mach Punch Breloom and First Impression Flygon can revenge kill Cinccino as well. However, for some of these revenge killers, Cinccino can Terastallize into a Ghost-type and use Encore, which then provides it with setup opportunities.</p>",
    "sets": {
      "Tidy Up": {
        "description": "<h4>Set Details</h4> <p>Knock Off hits Ghost-types that blank Cinccino's STAB attack as well as Bronzong, and Bullet Seed hits certain physically defensive checks like Swampert, Vaporeon, and Quagsire. Encore allows Cinccino to take advantage of passive Pokemon like Swampert and Palossand that use Stealth Rock or heal up, which gifts it more setup opportunities. It also helps Cinccino handle slower setup sweepers like Calm Mind Cresselia and Sylveon and Iron Defense Registeel and Orthworm. Alternatively, Rock Blast can be run to hit Talonflame to avoid Flame Body burns, and Triple Axel can be used as a strong coverage move to nail Brambleghast, Gligar, Flygon, and Dragalge. A Cinccino that aims to sweep teams should run Loaded Dice + Technician for maximum damage output. In contrast, if it chooses to be a dedicated lead, Focus Sash + Skill Link allows it to take advantage of both Tidy Up's entry hazard-clearing potential and its multi-hit moves. Tera Ghost allows Cinccino to become immune to Choice Scarf Mienshao and Infernape's Close Combat, and it lets Cinccino blank Breloom's Mach Punch and take advantage of it with Encore, giving Cinccino free turns to set up. However, Tera Fire can be useful to avoid burns from both Will-O-Wisp and Talonflame's Flame Body.</p> <p>Cinccino struggles with breaking through Steel-types like Copperajah, Orthworm, and Registeel, so partners such as Cresselia, Oricorio-E, Diancie, and Munkidori pair well, as they can help overwhelm these shared checks. Teammates that can benefit from Cinccino's Tidy Up removing hazards like Air Balloon Chandelure, Weakness Policy Incineroar, Choice Scarf Staraptor, and Kilowattrel enjoy its presence; on top of that, the former two can handle Steel-types easily with their STAB moves, whereas the latter two can help wear them down. Terrain teams can also take advantage of Cinccino's hazard clearing, as common Terrain sweepers like Oricorio-E, Galarian Articuno, and Grafaiai enjoy not being chipped by hazards. Due to them not being as concerned about Cinccino's Tidy Up removing their hazards, Stealth Rock leads like Eject Pack Flygon and Booster Energy Scream Tail pair best with it. Spikes leads like Froslass and Brambleghast can help wear down checks like Orthworm and Copperajah, and a Sticky Web lead like Galvantula can help Cinccino outspeed Choice Scarf users like Mienshao, Hisuian Typhlosion, and Munkidori; however, these teams must be wise about when to send out Cinccino to ensure their hazards aren't completely wasted. Physical walls that carry a way to punish contact moves through their ability like Talonflame and Vileplume or item users like Rocky Helmet Bellibolt and Galarian Slowbro are issues for Cinccino, so teammates with access to Knock Off such as Mienshao and Heracross can help deal with these walls. Cinccino's frailty often hinders its ability to set up, so partners that can create opportunities like Memento Chandelure or slow pivots like Dragalge and Incineroar are greatly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641404, "username": "hammer798"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Galvantula": {
    "overview": "<p>By setting up Sticky Web, Galvantula can enable wallbreakers like Torterra, Indeedee-M, and Paldean Tauros-W that are otherwise easily revenge killed by faster Pokemon like Inteleon, Choice Scarf Mienshao, and Choice Scarf Hisuian Typhlosion. Galvantula also spreads paralysis quite easily with both Thunder and Thunder Wave. Galvantula, however, can be outsped and KOed by Pokemon with multi-hit moves like Scale Shot Flygon and Triple Axel Mienshao. Notably, Tsareena, one of the best hazard removers the tier has to offer, can use Rapid Spin to clear Sticky Web and then proceed to outspeed and KO Galvantula with Triple Axel or Knock Off the next turn. Another hurdle for Galvantula to overcome is Magic Bounce Espeon, as it always survives one hit from Galvantula as it switches in and can get severe damage off on it before bringing in a revenge killer to finish it off.</p>",
    "comments": "<h3>Other Options</h3> <p>Lunge or Pounce can be used to simultaneously ease setup for Galvantula's partners and prevent it from being taken advantage of as easily. Volt Switch can also be run to circumvent Galvantula's passivity by letting it pivot, and it can save Sticky Web for later if the hazard is removed. Energy Ball can be run to hit Pokemon like Diancie and specially defensive Swampert, but dropping Thunder Wave makes Galvantula quite passive overall. Swarm can be used over Compound Eyes with Thunderbolt replacing Thunder, as Galvantula can then OHKO Espeon with Bug Buzz after being knocked into Swarm range by Psychic. Infestation can be used to trap slower Pokemon, preventing any needless predictions to cover an opponent's switch to Magic Bounce Espeon.</p> <h3>Checks and Counters</h3> <p><strong>Entry Hazard Control</strong>: Due to Galvantula almost always being a lead, it can be easily countered by entry hazard control. Specifically, Magic Bounce Espeon, Taunt Iron Thorns, Defog Talonflame, and Rapid Spin Tsareena can all thwart hazard setting attempts by Galvantula and KO it without difficulty.</p> <p><strong>Multi-hit Moves</strong>: Some Pokemon carry Focus Sash-breaking multi-hit moves like Tsareena and Mienshao, which can run Triple Axel, and certain setup sweepers like Cinccino, Torterra, and Flygon, which typically run Tail Slap, Rock Blast, and Scale Shot, respectively.</p> <p><strong>Ground-types</strong>: Flygon and Torterra can easily boost in front of Galvantula, as they are not OHKOed and can KO Galvantula the next turn with their multi-hit moves. Since Energy Ball is quite rare on Galvantula, Diancie, Quagsire, and specially defensive Swampert can take advantage of it as well by setting their own hazards.</p>",
    "sets": {
      "SPYDER (Sticky Web Lead)": {
        "description": "<h4>Set Details</h4> <p>Sticky Web lets Galvantula enable potent slower setup sweepers like Flygon, Toxtricity, and Porygon-Z. Thunder + Compound Eyes allows Galvantula to hit as hard as possible with great accuracy. It can also spread paralysis to bulkier Pokemon like Dragalge and Registeel that can freely come in otherwise. Thunder Wave can reliably paralyze Flying-types and Pokemon with Levitate that are unaffected by Sticky Web like Talonflame and Cresselia. Tera Ghost on Galvantula is only used in niche situations where forcing Sticky Web to be up by spinblocking Pokemon like Tsareena, Avalugg, and Brambleghast is necessary or there is no strong need to Terastallize another teammate.</p> <p>Setup sweepers that are relatively slow, like Porygon-Z, Chandelure, and Indeedee-M, greatly appreciate foes suffering the Speed drop from Galvantula's Sticky Web. Other setup sweepers that are still outsped even after they boost their Speed like Torterra and Dragon Dance Flygon work magnificently with Galvantula. Galvantula's Sticky Web also tends to get cleared by Tsareena's Rapid Spin and Talonflame's Defog, so spinblockers and Defog deterrents like Chandelure, Hisuian Typhlosion, Kilowattrel, and Galarian Articuno help to dissuade these entry hazard removers. The former two can also run Choice Scarf so that the team has speed control in case Sticky Web is removed. Opposing Choice Scarf users can be difficult to deal with because Pokemon on Sticky Web teams tend to be relatively slow, meaning naturally fast Pokemon like Inteleon, Infernape, and Flygon can work to counteract this issue. Hazards are also quite annoying for Sticky Web teams, especially opposing Sticky Web. Thus, Tsareena can work well as both an offensive threat and a hazard remover. Another hazard remover that works on Sticky Web teams is Focus Sash Brambleghast, as it can also set up Spikes and dent defensive Pokemon with Curse.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Chandelure": {
    "overview": "<p>With Chandelure's tremendous Special Attack and STAB attacks, it can hit the entire tier for at least neutral damage, barring Incineroar. Chandelure, donning a Choice Specs, easily breaks through would-be checks like Diancie and Alolan Muk. However, with Choice Scarf, it becomes a dangerous revenge killer thats able to check setup sweepers like Munkidori and Mienshao. Chandelure also learns Trick, which allows it to cripple walls and bulky setup sweepers alike such as Umbreon, Incineroar, and Cresselia. However, Chandelure has to deal with being extremely weak to entry hazards, limiting its opportunities to switch in. On top of that, Chandelure itself is quite easily revenge killed due to faster Choice Scarf users that are able to threaten it with their own STAB moves or through coverage moves like Flygon, Mienshao, and Meloetta.</p>",
    "comments": "<h3>Other Options</h3> <p>With a moveset of Will-O Wisp / Pain Split / Energy Ball / Hex, an EV spread of 252 HP / 252 Def / 4 Spe, and a Bold nature, Chandelure, with Heavy-Duty Boots, can become an effective physical wall, spreading burns on the opposing team quite easily; however, most things it would want to check typically carry super effective coverage in Knock Off. Heavy-Duty Boots Chandelure can also run Flame Charge or Trailblaze to pick off weakened threats and sweep with its boosted Speed. Chandelure can run Hex on a status spreading team; however, it must give up a powerful STAB attack, coverage, or Trick to do so. Choice Scarf Chandelure can run Memento on a hyper offense team to try to aid its teammates in setting up once it becomes useless. Chandelure can also run Heavy-Duty Boots or Air Balloon to circumvent its entry hazards weakness and Ground-type weakness, respectively. If it runs these, though, it becomes noticeably weaker and slower.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: Dark-types are a pain for Chandelure mostly because they tend to be able to take one attack and retaliate with a Knock Off. Specifically, Incineroar is quite problematic, since it resists all of Chandelure's attacks and is quite specially defensive, but due its to lack of recovery and entry hazards weakness, Incineroar can be chipped over the course of a game and taken advantage of with Trick, giving Chandelure its Heavy-Duty Boots.</p> <p><strong>Ghost-types</strong>: While Chandelure is able to beat Ghost-types like Basculegion, Brambleghast, and Hisuian Typhlosion offensively, it struggles to switch into and take priority attacks from the former two, and more often that not, it will get outsped and KOed by the latter two.</p> <p><strong>Revenge Killers</strong>: With Chandelure's middling Speed, even with Choice Scarf, it is quite easily revenge killed by faster threats. Most notably, faster Choice Scarf users like Flygon and Mienshao threaten Chandelure through their super effective STAB attacks or coverage, respectively.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<h4>Set Details</h4> <p>Fire Blast is preferred to 2HKO Alolan Muk as to not let it switch in safely, but Flamethrower can be used to be more accurate. Energy Ball hits Fire-type checks such as Swampert and Diancie. Trick cripples walls like Umbreon and Incineroar, but Overheat allows Chandelure to overwhelm Incineroar and Assault Vest users like Alolan Muk and Meloetta over the course of a battle. Tera Grass allows Chandelure to take a Ground- or Water-type attack in a pinch while boosting its Energy Ball, but Tera Fire can be used to give it insane breaking power.</p> <p>Chandelure has issues with switching in, so Pokemon that can pivot like Mienshao, Flygon, and Dragalge pair well, drawing in defensive Psychic-, Grass-, and Steel-types such as Galarian Slowbro, Vileplume, and Copperajah for Chandelure to prey on. With Trick crippling specially defensive foes like Alolan Muk and Umbreon, a partner that can take advantage of this like Munkidori or Cresselia helps with overwhelming these shared checks. Pairing Chandelure with Fighting-types like Mienshao, Gallade, and Scrafty helps it take on Dark-types like Incineroar and Alolan Muk, which it tends to struggle against. With how vulnerable Chandelure is to entry hazards, it pairs greatly with hazards removal from Talonflame, Tsareena, and Tentacruel. Vileplume, Wo-Chien, and Tsareena are great teammates for Chandelure, as they check the Ground- and Water-types that scare it out like Flygon, Basculegion, and Inteleon; on top of that, the former two teammates can spread paralysis with Stun Spore.</p>"
      },
      "Choice Scarf": {
        "description": "<h4>Set Details</h4> <p>Fire Blast gives Chandelure a powerful STAB Fire-type attack, but Flamethrower can be run for a more accurate move. Energy Ball hits Fire-resistant Pokemon like Diancie, Vaporeon, and Swampert. Trick cripples walls and bulky setup sweepers like Alolan Muk and Scrafty. When backed into a corner, Tera Grass lets Chandelure take a Water- or Ground-type attack and boosts its Energy Ball, but Tera Fire can help it clean more easily.</p> <p>With how Chandelure fails to do much of anything versus Dark-types like Incineroar and Alolan Muk, partners that can overwhelm, chip away at, or cripple these Pokemon are vital. So, pair Chandelure with teammates like Munkidori, Klefki, and Meloetta. Chandelure's middling Speed means more common opposing Choice Scarf users like Mienshao, Flygon, and Hisuian Typhlosion will easily outspeed and OHKO it. Placing Chandelure on a hyper offense team with Sticky Web support from Galvantula and setup sweepers like Breloom, Drednaw, and Gallade helps it circumvent its disappointing Speed tier and provides it tons of wallbreakers to help it clean weakened teams in the end-game. Chandelure's weakness to being worn down by entry hazards stops it from revenge killing as often as it would want to, so teammates like Tsareena, Talonflame, and Tentacruel are crucial.</p>"
      },
      "Calm Mind": {
        "description": "<p>Fire Blast is preferred to 2HKO Alolan Muk after a Calm Mind boost and deal greater damage to other special walls like Umbreon and Florges, but Flamethrower can be used for its accuracy. Energy Ball targets common Water-, Rock-, and Ground-type switch-ins like Vaporeon, Diancie, and Gastrodon. Flash Fire gives Chandelure the ability to take advantage of Choice-locked Fire-types like Hisuian Typhlosion, Infernape, and opposing Chandelure. On the other hand, Flame Body lets Chandelure punish contact moves like Flygon's U-turn and Tsareena's Power Whip, but these targets and most others usually carry another move to hit Chandelure super effectively, negating its utility. Heavy-Duty Boots allows Chandelure to ignore entry hazards, letting it switch in repeatedly without worry. However, Air Balloon can be used instead to give Chandelure a temporary immunity to Ground-type attacks, giving Chandelure opportunities to set up against Earthquake Paldean Tauros-F and Choice-locked Flygon. Tera Grass boosts Energy Ball while giving Chandelure a resistance to Ground- and Water-type attacks from Pokemon like Flygon, Swampert, and Vaporeon. Tera Fairy can be used on Air Balloon sets to completely wall Flygon's STAB moves, and in general, it helps with taking Dark-type attacks from the likes of Bombirdier and Incineroar.</p> <p>Ground-types like Flygon and Gligar can destroy Chandelure with their STAB Earthquake, and they can also force it to Terastallize. Therefore, it best partners with defensive Water-types like Vaporeon, Milotic, and Swampert, as they can check the aforementioned Ground-types; in return, Chandelure handles Grass-types like Tsareena, Breloom, and Vileplume. Fairy- and Fighting-types like Sylveon, Toxicroak, and Paldean Tauros-W are great teammates for Chandelure, as they can handle the Dark-types like Umbreon, Incineroar, and Alolan Muk. Chandelure appreciates slow pivots like Swampert, Dragalge, and Bellibolt giving it a safe entry without the risk of taking damage. Galvantula and Araquanid are great partners for Chandelure, as they can set up Sticky Web to remedy Chandelure's underwhelming Speed, letting it outspeed and KO faster foes like Mienshao, Inteleon, and Paldean Tauros-W. On these teams, fellow setup sweepers like Swords Dance Toxicroak, Nasty Plot Munkidori, and Shell Smash Torterra can take advantage of Water-types, overwhelm Dark-types, and help beat Ground-types for Chandelure, respectively. Air Balloon Chandelure is vulnerable to Stealth Rock; thus, it pairs well with hazard removers like Brambleghast, Cinccino, and Tsareena.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 609709, "username": "Pika134"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}, {"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 641404, "username": "hammer798"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Mienshao": {
    "overview": "<p>Mienshao is the best offensive pivot in NU thanks to its high Attack stat, great Speed tier, and good coverage. Mienshao is able to threaten most of the tier with its STAB Close Combat, which enables it as a late-game sweeper. Its great Speed paired with Choice Scarf lets it outspeed unboosted Pokemon like Inteleon and Talonflame as well as boosted sweepers like Shell Smash Torterra and Dragon Dance Flygon. Knock Off punishes Mienshao's switch-ins like Galarian Slowbro, Dragalge, and Talonflame as well as Ghost-types that are immune to Close Combat like Chandelure and Brambleghast, while other coverage options like Stone Edge, Ice Spinner, and Poison Jab hit Flying- and Fairy-type switch-ins with super effective damage. On top of that, Regenerator pushes Mienshao above the competition, effectively letting it ignore entry hazards on the switch. Mienshao often plays into high-risk, high-reward scenarios; the threat of using Close Combat is high, as Fighting-resistant Pokemon like Talonflame, Galarian Slowbro, and Vileplume can all switch in and punish it with Flame Body, Rocky Helmet, and Effect Spore, respectively. Even with the risk of Rocky Helmet, Mienshao can still pivot with U-turn on predicted switches, giving it the upper hand. Mienshao's poor bulk is heavily expressed when facing priority users like Breloom and Basculegion as well as faster Choice Scarf users like Infernape and Munkidori.</p>",
    "comments": "<h3>Other Options</h3> <p>Mienshao can use Choice Band to take advantage of its high Attack stat; however, it opens up more opportunities for your opponent to revenge kill Mienshao. Lastly, Triple Axel can be used over Ice Spinner for a stronger Ice-type move, but it is less reliable. Protective Pads lets Mienshao avoid adverse affects for its contact moves like Rocky Helmet, Flame Body, and Effect Spore but provides little else. Assault Vest is another option on the wallbreaker set, giving Mienshao more longevity against special wallbreakers and revenge killers like Diancie and Porygon-Z.</p> <h3>Checks and Counters</h3> <p><strong>Flying-types</strong>: Pokemon like Talonflame and Kilowattrel outspeed non-Choice Scarf Mienshao, can switch into Close Combat, and threaten an OHKO with Brave Bird and Hurricane, respectively. Talonflame is also able to punish Mienshao thanks to Flame Body having a chance to burn. Oricorio-E is freely able to set up against a Choice-locked Mienshao, but it is 2HKOed by Tera Fighting Close Combat unless it runs a very bulky EV spread.</p> <p><strong>Ghost-types</strong>: Chandelure, Basculegion, and Brambleghast can safely switch in against Choice Scarf Mienshao that is locked into Close Combat and threaten it with an OHKO, but they all have to take caution against Knock Off and the possibility of Mienshao not running Choice Scarf, except Choice Scarf Chandelure and Basculegion.</p> <p><strong>Poison-types</strong>: Vileplume and Galarian Slowbro wall Mienshao thanks to adverse damage over time through Rocky Helmet, Toxic, and recovery; the former can also restore all of its HP while simultaneously making Mienshao weaker with Strength Sap. Munkidori resists Close Combat and is naturally faster than Mienshao, often forcing it out by bluffing Choice Scarf.</p> <p><strong>Psychic-types</strong>: Cresselia and Galarian Slowbro resist Mienshao's Close Combat and can force awkward predictions even while they are not on the field. They are both weak to Knock Off, but they can take the hit with the use of Terastallization and then use Mienshao as setup fodder.</p> <p><strong>Physical Walls</strong>: Blanket physical walls such as Slowbro, Avalugg, and Quagsire can make it hard for Mienshao to break through bulkier teams, as they can recover their HP easily and Terastallize if needed. Bulky Fairy-types like Sylveon and Florges resist most of Mienshao's moves, being able to exploit non-Poison Jab variants.</p> <p><strong>Priority Users</strong>: Tera Fighting Breloom as well as Aqua Jet Basculegion both possess strong priority to revenge kill Mienshao, often forcing it to switch out or Terastallize in situations it wouldn't want to.</p> <p><strong>Faster Pokemon</strong>: Choice Scarf Mienshao doesn't have this issue as much as the wallbreaker set, but Choice Scarf users like Munkidori and Infernape as well as Basculegion under rain will always outspeed Mienshao, giving them the opportunity to revenge kill it. Life Orb Mienshao is also outsped by Espeon, Kilowattrel, and Inteleon, all of which threaten it with a KO.</p>",
    "sets": {
      "Choice Scarf": {
        "description": "<h4>Set Details</h4> <p>Choice Scarf boosts Mienshao's Speed to become a premier revenge killer, outspeeding the faster threats in the tier like Inteleon, Cinccino, and Kilowattrel. With passable bulk paired with Regenerator, Choice Scarf Mienshao is a great lead, achieving an OHKO or 2HKO against most entry hazard setters and Choice Scarf leads like Flygon and Staraptor. Knock Off punishes Ghost- and Psychic-types like Basculegion, Chandelure, and Galarian Slowbro that try to switch in on Close Combat, while U-turn gives Mienshao momentum through pivoting. Stone Edge hits Flying-types like Talonflame and Kilowattrel that want to punish Mienshao using Close Combat. Ice Spinner hits the previously mentioned Kilowattrel as well as Grass- and Dragon-types like Brambleghast, Tsareena, and Dragalge, but it's usually best to use U-turn against them to bring in a better check or generally keep up momentum and weaken them at the same time. Poison Jab can be used for Fairy-types like Sylveon and Florges; this is not preferred because it isn't strong and can be exploited by Steel-types like Registeel, Lucario, and Copperajah as well as other Poison-resistant Pokemon like Swampert, Flygon, and Dragalge. Regenerator gives Mienshao a lot of longevity that it normally wouldn't have with its other abilities, letting it switch in on weaker attacks and hazards without worrying about losing HP. Tera Fighting gives Mienshao's Close Combat a lot of extra power, allowing it to 2HKO Quagsire, Kilowattrel, and Diancie, as well as having a roll to 2HKO Swampert. Tera Dark boosts Knock Off's damage and defensively helps Mienshao against Psychic-types like Galarian Slowbro, Cresselia, and Munkidori while gaining an immunity to Klefki's Thunder Wave.</p> <p>Mienshao appreciates being able to pivot into Pokemon that can take strong hits from Ghost-, Psychic-, and Fairy-types like Incineroar, Bombirdier, Dragalge, and Munkidori, all of which can pivot back into Mienshao if needed. Munkidori is most noteworthy because of its Toxic Chain ability, spreading Toxic on its U-turns to cripple Mienshao's Fairy- and Psychic-type checks like Sylveon, Florges, and Cresselia. This interaction can weaken the Close Combat switch-ins enough to enable Mienshao to freely click Close Combat later in the battle. Offensive threats that lure in Fairy-types like Breloom, Incineroar, and Tera Steel Flygon help at eliminating Mienshao's checks without weakening it or wasting Close Combat's PP. Choice Scarf variants of Munkidori and Infernape are often what will be used to revenge kill Mienshao; as such Cresselia is a good partner, resisting Munkidori's Psychic and being able to take on Infernape. Mienshao isn't weak to entry hazards thanks to Regenerator, but it is weak to teams that take advantage of it being Choice-locked. With that in mind, having a grounded Poison-type like Vileplume or Alolan Muk and a Defog user like Talonflame or Altaria really helps Mienshao stick around for longer, not having to rely so heavily on Regenerator. Pokemon that can take hits from Mienshao's hard switch-ins like Galarian Slowbro, Talonflame, and Vileplume are needed for its longevity, so Pokemon like Alolan Muk, Diancie, Swampert, and Copperajah all pair nicely with it. Mienshao can't do much to physical walls like Galarian Slowbro, Vileplume, and Tera Poison Avalugg, so it enjoys partnering with a strong wallbreaker like Basculegion or better yet with a special attacking one like Chandelure or Toxtricity. These wallbreakers appreciate Mienshao KOing faster Pokemon like Inteleon, Kilowattrel, and Flygon. Chandelure can also switch into Choice Scarf Infernape's Close Combat, preserving some momentum.</p>"
      },
      "Wallbreaker": {
        "description": "<h4>Set Details</h4> <p>Life Orb boosts Mienshao's power a lot with little drawback thanks to Regenerator, giving it the opportunity to 2HKO Quagsire as well as OHKO Tsareena after some prior damage. Close Combat and Knock Off make a nearly unresisted combination; the latter enables Mienshao to hit Ghost- and Psychic-types that switch in on Close Combat like Chandelure, Brambleghast, and Galarian Slowbro. Close Combat and Knock Off synergize better with Life Orb than Choice Scarf thanks to Mienshao not being locked into one move, giving it a better fighting chance against Psychic- and Ghost-type switch-ins. U-turn retains Mienshao's strong pivoting capability without forcing it to lock into a single move. Stone Edge lets Mienshao take care of Talonflame and Kilowattrel on switch-in. Poison Jab hits Fairy-types like Sylveon and Florges. Fake Out allows Mienshao to revenge kill faster, weaker threats like Kilowattrel, Munkidori, and Swift Swim Kingdra. Swords Dance boosts Mienshao's already high Attack, giving it more of a chance to break past physical walls like Galarian Slowbro, Swampert, and Vileplume. Regenerator gives Mienshao more opportunities to wallbreak while not caring too much about damage from entry hazards, Rocky Helmet, and Life Orb. Tera Fighting boosts Close Combat to absurd levels, but Tera Poison boosts Poison Jab's damage, allowing it to OHKO Tsareena and Florges after a Swords Dance boost. Tera Ghost gives Mienshao many immunities to moves to revenge killers like Close Combat from Infernape and Mach Punch from Breloom; however, it becomes weak to Toxicroak's and Brute Bonnet's Sucker Punch.</p> <p>Swords Dance Mienshao appreciates entry hazard support from Swampert, Diancie, Klefki, and Dragalge to guarantee some KOs it otherwise would not obtain. Toxic Spikes in particular help to break through physical walls like Swampert and Sylveon, which cannot afford to run Heavy-Duty Boots. Faster Pokemon like Talonflame, Inteleon, and Kilowattrel can revenge kill Mienshao, which opens up room for various different walls like Diancie, Milotic, Registeel, and Alolan Muk to be paired alongside it. Choice Scarf users like Staraptor, Flygon, and Basculegion can all work to KO Pokemon that try to use their higher Speed to force Mienshao to switch. Slow pivots like Dragalge, Swampert, and Eject Button Galarian Slowbro can all safely bring in Mienshao. If running U-turn, Dark-types like Bombirdier, Alolan Muk, and Incineroar can all be brought in safely on a predicted Psychic-type move from Indeedee, Meloetta, or Munkidori. A status absorber, especially one that can absorb burns, is very useful to keep Mienshao healthy enough to wallbreak at any time; thus, it naturally pairs well with Milotic, Rest Alolan Muk, and Talonflame.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 189361, "username": "Lucario"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 126266, "username": "Kiyo"}, {"user_id": 295647, "username": "etern"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}, {"user_id": 336073, "username": "Rabia"}]}]}
  },
  "Golurk": {"sets": {"Choice Band": {}}},
  "Tornadus": {"sets": {"Rain Support": {}, "Offensive Pivot": {}, "Bulk Up": {}, "Nasty Plot": {}}},
  "Meloetta": {"sets": {"Choice Item": {}, "Sub Calm Mind": {}}},
  "Delphox": {"sets": {"Nasty Plot": {}}},
  "Florges": {"sets": {"Choice Specs": {}, "Calm Mind": {"description": "<p>You can run Wish + Protect on the Calm Mind set to support teammates, but Florges's main niche over Sylveon comes from its access to Synthesis allowing for extra coverage to be run. 136 Speed EVs allows Florges to outpace Modest Sylveon.</p>"}, "Choice Scarf": {}}},
  "Dragalge": {
    "overview": "<p>Dragalge is a staple in NU thanks to its great typing, utility movepool, and access to Adaptability, which let it successfully fulfill both offensive and defensive roles. Bulkier sets can come in on walls like Vileplume and take advantage of them by setting Toxic Spikes, causing the rest of their team to suffer. On the other hand, Choice Specs sets provide a ton of nuking power with Adaptability, allowing Dragalge to break through former counters like Umbreon and Registeel. However, Dragalge lacks good Speed, meaning it often can't retaliate before strong attackers overwhelm it. Bulkier sets are also held back due to a lack of access to recovery moves and Dragalges below-average HP. Dragalges typing too, at times, can be somewhat limiting, since Ground- and Steel-types are fairly common in NU.</p>",
    "comments": "<h3>Other Options</h3> <p>Scald can be used on bulkier Dragalge sets to try to burn checks like Copperajah and Klefki, but this causes Dragalge to lose out on pressure in Toxic Spikes or momentum in Flip Turn. A moveset consisting of Substitute / Sludge Bomb / Dragon Pulse / Focus Blast or Tera Blast Ground can be used with Leftovers to significantly capitalize on forced switches and take advantage of more passive Pokemon. But this can hurt Dragalge's longevity quite a bit, and, in general, opportunities arent too common.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Ground-types like Flygon and Torterra are difficult to handle for Dragalge, as theyre always faster and can hit it with their powerful STAB Earthquake.</p> <p><strong>Steel-types</strong>: Steel-types like Registeel and Tera Steel Sylveon wall Dragalge's STAB moves, meaning they can come in and take advantage of it often and only fear Focus Blast. Also, Klefki loves to come in on any of Dragalges attacks and spread status or set Spikes.</p> <p><strong>Psychic-types</strong>: Dragalge struggles against the plethora of Psychic-types like Gallade, Indeedee, and Munkidori. All of these Pokemon easily scare out Dragalge with their Psychic-type STAB moves and also tend to be able to take a hit from it.</p> <p><strong>Special Walls</strong>: Special walls like Alolan Muk, Assault Vest Gallade, Bronzong, and Diancie take on Dragalges attacks easily and can threaten it with Knock Off, super effective damage, or a physical attack. All of these Pokemon dont have a very reliable source of healing, though, so they tend to be whittled down over the course of a battle.</p>",
    "sets": {
      "Bulky Pivot": {
        "description": "<h4>Set Details</h4> <p>Toxic Spikes allows Dragalge to chip away at walls, while Dragon Tail can phaze Dragalges checks as well as setup sweepers. Flip Turn works amazingly on Dragalge, letting it act as a bulky pivot that can bring in powerful wallbreakers. The given EV spread allows Dragalge to outspeed Vileplume while giving it some physical bulk to aid with Fighting-types like Mienshao and Infernape. Tera Steel allows Dragalge to take Psychic-, Fairy-, and Dragon-type attacks from foes like Munkidori, Sylveon, and opposing Dragalge. On the other hand, Tera Water alleviates its weakness to Ground-type attacks while giving it an overall strong defensive typing.</p> <p>Toxic Spikes lowers switch rates when your opponent tries to play around them, so Pokemon that can scare out Poison-types and cause switches like Flygon and Future Sight Galarian Articuno can overwhelm your opponents. Partners that can bring in physically defensive Pokemon such as Mienshao and Infernape gift Dragalge with chances to set Toxic Spikes. In the face of Steel-types like Klefki and Copperajah, Dragalge fails to do much, so partners that can take advantage of its Flip Turn and deal with these pests, like Gallade, Mienshao, and Flare Blitz Talonflame, work well. Opposing Dragon- and Fairy-type Pokemon also cause issues for Dragalge, as theyre usually faster and can severely damage or KO Dragalge before it can react. Teammates that help alleviate this weakness such as Sylveon, Registeel, and Copperajah are appreciated. Dragalges limited HP also hinders it; to ensure its survival for longer, entry hazard removers or Wish users like Talonflame, Brambleghast, and Vaporeon can be used. Pokemon like Vileplume and Tsareena that can handle more offensive Ground-types such as Flygon and Torterra can help out Dragalge.</p>"
      },
      "Choice Specs": {
        "description": "<h4>Set Details</h4> <p>Sludge Wave is preferred for damage output, but Sludge Bomb can more reliably poison specially defensive Pokemon like Gastrodon and Umbreon. Focus Blast can heavily dent many Steel-types on the switch-in like Registeel, Klefki, and Copperajah. Tera Blast Ground can be used instead to hit these targets more accurately and powerfully along with Alolan Muk; however, this comes at the cost of Terastallizing, making it not as favored of an option overall. For the last move, a way to pivot in Flip Turn is preferred to bring a partner in on a wall it would otherwise have trouble with. The given EVs let Dragalge outpace Vaporeon and Umbreon with the rest poured into HP. An alternative and bulkier EV spread of 120 HP / 252 SpA / 136 Spe can be run, as it gives Dragalge enough Speed to outrun uninvested Sylveon. Tera Poison grants Dragalge a resistance to Fairy while also powering Sludge Wave to preposterous levels; however, a more defensive Tera type like Tera Steel could be used to help Dragalge retaliate after surviving Psychic- and Dragon-type attacks.</p> <p>Dragalges low Speed tends to hinder it a lot, but this can be negated with pivot cores. Dragalge draws in Steel-types, but it can use Flip Turn to let Mienshao or Flygon handle them. On the other hand, Mienshao and Flygon themselves can use U-turn after drawing in a physical wall like Vileplume or Quagsire, which Dragalge preys on. Dragalge can also whittle down Steel-types like Copperajah and Registeel over time with a strong Focus Blast, so Pokemon that can take advantage of this such as Munkidori, Reuniclus, and Calm Mind Sylveon enjoy its presence. Special walls like Alolan Muk, Gastrodon, and Registeel love to come in on Dragalge, so strong physical wallbreakers like Gallade and Incineroar work well to deal with these checks.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 197240, "username": "sunny004"}]}]}
  },
  "Sylveon": {
    "overview": "<p>Sylveon's great matchup against top threats like Mienshao and Flygon alongside its set versatility makes it one of the premier Fairy-types in NU. Wallbreaking sets can break through common special walls like Alolan Muk and Umbreon. Sylveon can also run a more defensive set, letting it heal up teammates that it naturally synergizes with like Incineroar, Registeel, and Swampert that lack reliable recovery. Sylveon has great Special Defense, letting it take on special wallbreakers like Inteleon and Diancie with little or no investment. However, both of Sylveon's roles are contested by another Fairy-type, namely Florges, as Florges has access to Trick for Choice Specs sets as a way to decommission Steel-types and special walls, and it has higher Speed, meaning its wallbreaking sets can outpace more threats and Wish passing sets can invest more in its Defense. On top of that, Sylveon must compete with other Wish passers such as Vaporeon and Umbreon, which can provide more utility at times with the former having access to Haze and Flip Turn, whereas the latter can provide Thunder Wave and Toxic. Sylveon is also walled immensely by Steel-types like Copperajah and Klefki, but their lack of recovery leaves them susceptible to being worn down over the course of a game. Wish sets also tend to be passive and easily taken advantage of by the aforementioned Steel-types and setup sweepers like Munkidori and Incineroar. Sylveon's subpar Defense can also let it be broken through, as it's typically forced to take Knock Off for its team all while being whittled away at by entry hazards.</p>",
    "comments": "<h3>Other Options</h3> <p>Due to Choice Specs Sylveon already having all the coverage it needs from its first three slots, it can run many moves for its last. Sylveon can opt for Quick Attack as a means to pick off weakened threats. Hyper Beam can be used as a nuke button that's able to chip away at Steel-types heavily but leaves it open the next turn. Sylveon can even forgo Choice Specs entirely and go for a Pixie Plate set that allows it to bluff Choice Specs, surprising its opponent when it changes up its moves; however, Sylveon's overall power drops. On Wish sets, Moonblast + Cute Charm can be run on bulkier teams, as Moonblast has higher PP than Hyper Voice, and if Sylveon is female, it can fish for immobilization via attraction against Pokemon forced to be male like Hitmonlee and Tornadus.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Registeel, Bronzong, and Copperajah all wall Sylveon and can use it to set entry hazards, as they easily threaten it out with their Steel-type STAB moves. While Klefki can also wall Sylveon, use it to set entry hazards, and paralyze it with Thunder Wave, it's more of a stalemate because Klefki fails to do significant damage to Sylveon unless it carries a rare move like Steel Beam. All of these Steel-types must be wary of Tera Blast Ground and, in Bronzong's case, Shadow Ball.</p> <p><strong>Poison-types</strong>: Alolan Muk, Munkidori, Vileplume, and Tentacruel can take a Hyper Voice and threaten back with super effective Poison-type attacks. Dragalge can also take a hit and threaten it, but it can only do this once per game.</p> <p><strong>Chip Damage</strong>: Sylveon, especially when defensive, tends to have to take Knock Off and U-turn for its team, and losing Heavy-Duty Boots or not running it in the first place means entry hazards also chip away at it. All of this combined with Wish taking two turns and possibly being cancelled out due to Roar from Swampert or Whirlwind from Copperajah means that Sylveon can be whittled away at and beaten by wallbreakers it normally beats, like Mienshao and Flygon.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<h4>Set Details</h4> <p>Psychic allows Sylveon to hit Poison-types like Dragalge, Vileplume, and Toxtricity super effectively. However, Psyshock can be run to hit Tentacruel and both Tera Poison Cresselia and Bronzong harder. Shadow Ball gives Sylveon a strong neutral move for the Steel-types that tend to switch into Sylveon like Klefki, Registeel, and Copperajah, and notably, it hits Bronzong super effectively. As Sylveon's last moveslot is its most flexible one, it prefers to run Draining Kiss as a secondary STAB move so that it doesn't get chipped away at as easily. Tera Blast Ground can instead be used to hit the aforementioned non-Bronzong Steel-types that could sit on Sylveon otherwise; however, due to this requiring Terastallization, it typically isn't run. A Modest nature is preferred for the extra damage output, but Timid can be run to outspeed Adamant Incineroar. Tera Fairy allows Sylveon to reach catastrophic levels of damage with its Hyper Voice, as it's now able to 2HKO Fairy-resistant Pokemon like Rotom-H and Vileplume.</p> <p>Sylveon's main roadblock from tearing apart teams is bulky Steel-types like Registeel, Copperajah, and Klefki; however, due to their lack of recovery, there are a few ways its teammates can whittle them down. Entry hazard setters like Brambleghast, Swampert, and Flygon can help to soften up these Steel-types for Sylveon's attacks. Another way to break through these Pokemon is teammates that carry super effective coverage to surprise these Steel-types like Close Combat Staraptor, Focus Blast or Tera Blast Ground Munkidori, and Focus Blast Dragalge. It can also go through more straightforward means such as having a partner like Mienshao, Incineroar, or Flygon to pressure these Steel-types. Incineroar, Flygon, and Infernape greatly enjoy Sylveon as a partner, as they can pivot it in on physically defensive Water-types like Milotic, Swampert, and Vaporeon that wall them. Choice Scarf users like Munkidori, Meloetta, and Porygon-Z enjoy Sylveon wearing away at Steel-types like Copperajah, Klefki, and Registeel. Sylveon easily dispatches Dark-types like Incineroar, Umbreon, and Alolan Muk. Teammates that benefit from this like Meloetta, Cresselia, and Brambleghast pair well alongside Sylveon, as they can form a wallbreaking core together.</p>"
      },
      "Wish": {
        "description": "<h4>Set Details</h4> <p>Calm Mind allows Sylveon to use defensive walls like Vaporeon and Talonflame in its favor, as it can set up on them to become more threatening. On the other hand, Roar prevents Sylveon from needing to risk certain Calm Mind wars like those versus Cresselia and Bronzong, and it doubles as a way to get extra chip damage on Steel-types trying to switch in, forcing them out to rack up entry hazard damage. The Speed EVs allow Sylveon to get the jump on Umbreon and Vaporeon, letting it threaten the former better and avoid having its stat boosts thrown away by the latter's Haze before it can get a hit off. Tera Steel is preferred, as it allows Sylveon to better handle Poison- and Steel-types like Vileplume and Copperajah, provides an immunity to Umbreon's and Quagsire's Toxic, and lets it soft check many special attackers in a pinch like Munkidori, Porygon-Z, and Toxtricity. Tera Poison, on the other hand, maintains Sylveon's matchup against Fighting-types while keeping Tera Steel's utility against Toxic users and poison from Alolan Muk. Alternatively, Tera Water provides a strong defensive typing that doesn't forfeit Sylveon's matchup against both Ground- and Fighting-types like Flygon, Mienshao, and Infernape. Leftovers prevents Sylveon from having to use Wish as often and lets it heal with Protect, but Heavy-Duty Boots is useful to circumvent entry hazard chip damage.</p> <p>Sylveon's access to Wish means it can support Pokemon without reliable recovery like Swampert, Bronzong, and Incineroar. Pokemon like Basculegion, Munkidori, and Registeel that are scared out by Brute Bonnet, Flygon, and Mienshao enjoy having Sylveon to check these threats. Alongside a specially defensive partner like Alolan Muk, Gastrodon, or Copperajah, Sylveon can help to form a defensive backbone for teams. Sylveon also appreciates wallbreakers like Mienshao, Flygon, and Chandelure, as they can pressure Steel-types that typically wall and take advantage of it like Klefki, Copperajah, and Bronzong. Due to Sylveon's reliance on Protect to safely heal, it's vulnerable to setup sweepers like Drednaw, Munkidori, and Gallade, meaning Choice Scarf revenge killers like Ditto and Mienshao or Pokemon with priority like Flygon pair well with it. Sylveon also tends to be a momentum sink, so pivots like Flygon, Incineroar, and Mienshao that do well versus common switch-ins like Alolan Muk, Registeel, and Copperajah can help regain lost momentum. As Sylveon can be easily chipped down by entry hazards and having to switch into Knock Off and U-turn from Pokemon like Mienshao, a second soft check to physical attackers is welcome, so partners like Talonflame, Vileplume, and Dragalge work well to fulfill this role.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Goodra": {"sets": {"Choice Specs": {"description": "<p>Fire Blast hits Steel-types like Bronzong and Copperajah hard, but Flamethrower can be used for a reliable accuracy. Sludge Wave hit Fairy-types like Sylveon and Florges. However, Sludge Bomb could be ran instead for a higher poisoning chance. Hydro Pump targets Diancie, but Dragon Pulse provides a spammable STAB move.</p>"}, "Substitute + Acid Spray": {}, "Heavy-Duty Boots": {}}},
  "Klefki": {
    "overview": "<p>Klefki is an incredibly crafty support Pokemon, making use of its incredible combination of ability, movepool, and typing to bring mayhem to the battlefield. Klefki's Prankster ability lets it scatter Spikes, spread paralysis with Thunder Wave, summon rain and sun, and even boost its own stats before the foe can act; it's a very malleable Pokemon that can find itself on almost any team due to its supportive capabilities. Klefki's highly coveted Steel / Fairy typing makes it a great sponge for special attacks, taking on the likes of Munkidori, Espeon, and Dragalge while also resisting Knock Off and U-turn. Although Klefki has many tricks up its sleeve, offense is not one of them, since it uses paltry base 80 offensive stats and often relies on Foul Play to not be a complete sitting duck. Any means to circumvent Prankster-affected moves such as Magic Bounce, Dark-types, and Taunt can generally spell doom for Klefki. Dark-types like Incineroar, Alolan Muk, and Tera Dark Drednaw can take advantage of Klefki's inability to status them. Despite Klefki's phenomenal defensive typing, its stats often leave much to be desired, meaning some special wallbreakers like Porygon-Z and Indeedee-M can eventually overwhelm it even in spite of a type disadvantage.</p>",
    "comments": "<h3>Other Options</h3> <p>Klefki can utilize its Prankster ability to run a Double Dance set; boosting its Defense with Iron Defense and special stats with Calm Mind while maintaining its health with Draining Kiss to turn Stored Power into an unwallable attack. Klefki can sport a Damp Rock or Heat Rock along with Rain Dance or Sunny Day, respectively, to facilitate those respective weather teams. Klefki can use Eject Button or Red Card in tandem with Prankster Recycle to repeatedly pivot itself or its foe out of play. Klefki can hold onto a Toxic Orb, which won't affect it, and use Switcheroo to bestow it onto an unsuspecting target like Oricorio-E, which can otherwise set up on Klefki safely.</p> <h3>Checks and Counters</h3> <p><strong>Ground-types</strong>: Ground-types like Swampert, Flygon, Gligar, and Swampert are immune to Klefki's Prankster Thunder Wave and threaten it with Earthquake, although they must be wary of Magnet Rise.</p> <p><strong>Bulky Setup Sweepers</strong>: Bulky setup sweepers that can take advantage of Klefki's passivity can be a huge issue for it. Calm Mind Pokemon like Cresselia, Chandelure, and Florges take minimal damage from Klefki's attacks and can accrue multiple boosts while it flounders helplessly.</p> <p><strong>Prankster-immune Pokemon</strong>: Many Pokemon that can ignore Klefki's Prankster-affected moves in one way or another can take advantage of Klefki's relative passivity. Magic Bounce Espeon, Dark-types, and Thunder Wave-immune Pokemon like Oricorio-E and Flygon find safe entry against Klefki and threaten it.</p>",
    "sets": {
      "Spikes Support": {
        "description": "<h4>Set Details</h4> <p>Foul Play enables Klefki to hit physical attackers for big damage it'd be unable to achieve using its own Attack stat, hitting Pokemon like Brambleghast and Gallade. Magnet Rise lets Klefki turn the tables on Ground-types like Flygon, Swampert, and Gligar with the former being weak to Dazzling Gleam. Maximum Special Defense investment lets Klefki deal with powerful special attackers in the tier like Munkidori and Dragalge. Tera Water lets Klefki take Fire-type attacks from Chandelure and Infernape in a pinch.</p> <p>Klefki's specially bulky nature makes it pair excellently with physical walls on balance teams, it is typically seen with Pokemon like Vaporeon and Swampert, as they can handle Fire-types like Infernape and Incineroar. Ghost-types like Chandelure and Brambleghast can block Rapid Spin to maintain Klefki's entry hazards, as do Defog deterrents like Galarian Articuno and Competitive Kilowattrel. Klefki's Prankster Thunder Wave is great speed control for slow, powerful wallbreakers like Choice Specs Chandelure and Toxtricity and Guts Heracross.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 400664, "username": "Stories"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Avalugg": {"sets": {"Physically Defensive": {}}},
  "Diancie": {
    "overview": "<p>Diancie's great typing lets it switch in easily against common dangerous Fire-, Flying-, and Normal-types such as Chandelure, Talonflame, Oricorio-E, and Porygon-Z. With well-rounded stats, Diancie can easily go both offensive and defensive, with its sets being supported by its large movepool. Specially defensive Diancie is a great check to special wallbreakers like Chandelure, Kilowattrel, and Hisuian Typhlosion, and it can carry Encore to circumvent its passivity when against setup sweepers. Trick Room sets can easily turn the tables versus faster, more offensive teams, as Diancie can outspeed and KO everything after it gets its Special Attack boost from Meteor Beam.</p>",
    "comments": "<h3>Other Options</h3> <p>Diancie can run Rock Polish for a more permanent Speed boost, but with its low-base Speed, it's easily outpaced by Choice Scarf users like Flygon, Inteleon, and Mienshao even after it boosts. A Sticky Web setter is great for this set, as it attempts to solve Diancie's low Speed issue. If there is already a Stealth Rock user on Diancie's team, it can run Spikes instead so that it can continue to provide entry hazard support. Specially defensive sets can run a more specially-oriented moveset, with moves like Moonblast, Earth Power, and Power Gem being run over Diamond Storm and Body Press. Diancie can also run a sweeper set with a moveset of Calm Mind / Iron Defense / Draining Kiss / Stored Power, which can take advantage of passive or weaker Pokemon quite well, but it can be easily overpowered by any wallbreaker or Trick, Encore, and Taunt users. Diancie can also run offensive sets with Stealth Rock and Spikes, usually with Moonblast and Earth Power supporting it; however, it is considered a bit suboptimal, since its bulk is usually appreciated to set hazards up safely.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Bulky Steel-types like Bronzong, Registeel, and Copperajah can easily switch in on Diancie and set up entry hazards, forcing it out or making it use Tera in order to survive an attack and KO them. In particular, Bronzong is quite bothersome for Diancie, as it walls its STAB attacks and is immune to Earth Power thanks to Levitate. However, all of these Steel-types lack a form of reliable recovery making them easily overwhelmed over the course of a battle. Both Bronzong and Registeel take a lot of damage from +2 Body Press and +1 Earth Power, respectively, so after some chip damage, Diancie can beat them.</p> <p><strong>Ground-types</strong>: Flygon, Swampert, and Gastrodon are trouble for Diancie, as they threaten Diancie out with their Ground-type STAB attacks and can take advantage of it by setting up entry hazards. If Diancie is running Moonblast, it can somewhat damage them, but if its not, it is an almost free switch-in for them, as Earth Power and Body Press aren't doing enough to threaten them.</p> <p><strong>Water-types</strong>: Offensive or defensive Water-types such as Inteleon, Basculegion, and Vaporeon can all threaten Diancie with their STAB attacks. They can also use Diancie for momentum and pivot with U-turn or Flip Turn, and they can even force Diancie to Terastallize or switch out. Inteleon and Basculegion both cannot deal with Diancie when under Trick Room, as they get defeated before they can act.</p> <p><strong>Grass-types</strong>: Offensive Grass-types such as Torterra and Tsareena make progress against and threaten Diancie; however they can't comfortably switch in on offensive sets. Torterra and Tsareena force Diancie to switch out or Terastallize, and the latter can even remove its Stealth Rock with Rapid Spin. Both of those Pokmon can't defeat Diancie when in Trick Room, as they get KOed first by +1 Moonblast</p>",
    "sets": {
      "Special Wall": {
        "description": "<h4>Set Details</h4> <p>With a specially defensive EV spread, Diancie is able to repeatedly switch into special attacks, giving it opportunities to set up Stealth Rock and fire off STAB Diamond Storm. Body Press hits Steel-types like Copperajah and Registeel trying to switch in on Diancie, and it can take advantage of Diamond Storm's chance to boost its Defense. Encore prevents Diancie's passivity from getting taken advantage of too easily by opposing hazard setters and setup sweepers, such as Klefki and Iron Thorns alike, but Moonblast can be used to be able to hit Ground-types like Swampert and Flygon harder. Tera types for this set are focused on flipping Diancie's matchups. Tera Water gives Diancie a resistance to Steel- and Water-type attacks, letting it finish off Copperajah and Inteleon while maintaining its Fire resistance. However, Tera Steel trades Diancie's matchup against Fire-types for a strong defensive typing thay can take on hits from Munkidori, Sylveon, and Tsareena without issue. Tera Dragon on the other hand lets Diancie take on Rotom-C and Araquanid, but it completely throws away its matchup against Dragalge and Florges.</p> <p>Fire-types like Incineroar and Talonflame make for strong partners because they threaten Steel- and Grass-types that force Diancie out, such as Bronzong, Registeel, Tsareena, and Brambleghast. The aforementioned Grass-types, along with Rotom-C, also have great synergy with Diancie, as it checks Fire- and Flying-types for them. In return, they handle Ground- and Water-types like Flygon, Swampert, and Inteleon. Diancie can't take on physical wallbreakers like Toxicroak and Mienshao too well, so physically defensive Pokemon like Swampert, Dragalge, and Talonflame pair well with it to help check these threats.</p>"
      },
      "Offensive Trick Room": {
        "description": "<h4>Set Details</h4> <p>With an offensive spread, the Trick Room set is capable of taking down many foes. Earth Power offers coverage for the Steel- and Poison-types that can take Diancie's Moonblast comfortably such as Registeel, Copperajah, and Tentacruel. Power Herb allows Diancie to immediately attack and get its Special Attack boost with Meteor Beam. Tera Grass gives Diancie a resistance to Grass-, Ground-, and Water-type attacks while giving it a neutrality to Steel-type moves, letting it set up Trick Room and attack more easily. Alternatively, Tera Ground is an option to boost Earth Power's damage, which is really appreciated to get KOs it wouldn't otherwise.</p> <p>A lead to set up entry hazards such as Brambleghast or Froslass makes for a great partner, as it can help chip checks like Registeel, Alolan Muk, and Tentacruel into range for a KO. Mienshao and Breloom enjoy how Diancie can come in on and take advantage of Talonflame, and with it being downed, they don't need to worry about being revenge killed as easily or getting burned. Pokemon like Flygon, Drednaw, Oricorio-E, Galarian Articuno, and Iron Thorns that can chip away at and weaken Steel-types like Registeel and Copperajah for Diancie pair well with it too.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 644300, "username": "estra"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Hoopa": {"sets": {"Choice Specs": {}, "Substitute + 3 Attacks": {}, "All-out Attacker": {}, "Nasty Plot": {}}},
  "Decidueye": {"sets": {"Swords Dance": {}, "Wallbreaker": {}, "Defog": {}}},
  "Decidueye-Hisui": {"sets": {"Defog": {}}},
  "Incineroar": {
    "overview": "<p>The combination of Knock Off, good typing, and Intimidate makes Incineroar a great wallbreaker while being a solid defensive Pokemon. Sword Dance sets can make Incineroar into a great wallbreaker, since many defensive staples like Vileplume, Galarian Slowbro, and Registeel just drop to its Swords Dance-boosted STAB attacks. Also, Incineroar easily checks the common Ghost-, Grass-, and Steel-types like Chandelure, Brambleghast, and Klefki, meaning it can take advantage of its utility moves it can go for a more defensively-oriented pivot set if it wishes. It has Will-O-Wisp and Knock Off to cripple incoming physical wallbreakers like Toxicroak, Flygon, and Mienshao and item-reliant Pokemon like Talonflame, Avalugg, and Swampert, respectively. Defensive Incineroar is solid for handling special wallbreakers such as Hisuian Typhlosion, Porygon-Z, and Heavy-Duty Boots Munkidori. However, Incineroar's low Speed stat makes it very easy for wallbreakers with a middling Speed tier like Basculegion, Breloom, and Heracross to outspeed and destroy it with their own STAB attacks. Incineroar's reliance on Heavy-Duty Boots can be felt, since it has to be wary of switching into opposing Knock Off from Tsareena, Alolan Muk, and Wo-Chien. It even has to worry about switching into the Pokemon it checks best, Chandelure, as it carries Trick to cripple Incineroar. Incineroar also lacks any form of recovery, making it easily worn down over the course of a battle.</p>",
    "comments": "<h3>Other Options</h3> <p>Close Combat is an option to hit many foes neutrally like Swampert and Diancie while also hitting foes like Iron Thorns and opposing Incineroar super effectively. Flame Charge gives Incineroar the opportunity to become a late-game cleaner after picking off a weakened threat. Alternatively, Trailblaze can be used alongside Tera Grass to hit Water-types super effectively but it's pretty reliant on Terastallization to do good damage. Iron Head can be used on Swords Dance Incineroar to surprise Sylveon, Diancie, and Florges, but the ability to pivot, boost its Speed, or use a high-Base Power coverage move tends to be better overall. Weakness Policy + Power Trip sets can be used on hyper offense teams, letting Incineroar become a dangerous sweeper. Incineroar has a bunch of usable defensive Tera types, but they are really inconsistent for many teams. Tera Flying helps Incineroar take on Fighting- and Ground-type attacks, but it retains its weakness to Stealth Rock. Tera Grass gives Incineroar a resistance to Water- and Ground-type attacks but gives it a bad matchup against opposing Fire-types like Chandelure, Infernape, and Hisuian Typhlosion.</p> <h3>Checks and Counters</h3> <p><strong>Water-types</strong>: Vaporeon, Milotic, and Swampert can switch into its Flare Blitz and threaten Incineroar back with their own STAB attacks, but they have to be wary about switching into a boosted Knock Off from Swords Dance sets. Offensive Water-types like Inteleon and Basculegion, while they have to be worried about switching into its Knock Off, can easily destroy it. Quagsire is notable for shutting down Incineroar sweeps due to Unaware and punish it back by spreading Toxic or hitting Incineroar with its STAB Earthquake.</p> <p><strong>Ground-types</strong>: Flygon, Swampert, and Quagsire destroy Incineroar with their STAB Earthquake, but they have to be wary about switching into Will-O-Wisp from bulkier sets.</p> <p><strong>Fighting-types</strong>: Mienshao, Toxicroak, and Breloom outspeed Incineroar and destroy it with their STAB Fighting-type attacks. Infernape and Paldean Tauros-W resist both of Incineroar's STAB attacks and use it as setup fodder.</p> <p><strong>Rock-types</strong>: Diancie and Iron Thorns can tank Incineroar's STAB attacks very well and use it to set up Stealth Rock or hit it back with their STAB Rock-type attacks.</p> <p><strong>Item Displacement</strong>: Common Knock Off users like Tsareena, Alolan Muk, and Wo-Chien can threaten Incineroar by removing its Heavy-Duty Boots, making it a lot weaker to entry hazards. On top of this, Pokemon it would love to switch into like Chandelure, Munkidori, and Porygon-Z often carry Trick to cripple it.</p>",
    "sets": {
      "Swords Dance": {
        "description": "<h4>Set Details</h4> <p>U-turn allows Incineroar to pivot on, chip away at, and not get taken advantage of by its checks like Swampert and Diancie. Earthquake, on the other hand, provides a powerful attack that has no drawback that also hits the common Rock-, Poison-, and Fire-types like Iron Thorns, Dragalge, and opposing Incineroar. An Adamant nature can be used to allow Incineroar to 2HKO Pokemon like Alolan Muk and Talonflame, but a Jolly nature is useful for outspeeding foes like Modest Choice Specs Sylveon and unboosted Torterra. A specially defensive spread of 248 HP / 212 SpD / 48 Spe with a Careful nature can alternatively be used on Swords Dance sets, allowing Incineroar to safely handle Cresselia while letting it better pivot into foes like Chandelure, Munkidori, and Meloetta; the Speed EVs let Incineroar outpace foes like Brute Bonnet and Alolan Muk. Tera Poison gives Incineroar an immunity to poison from Alolan Muk and Vileplume while having a resistance to Fighting-type attacks. However, Tera Fairy provides a more well-rounded defensive typing that isn't weak to Ground-type attacks while still resisting Fighting-type attacks, giving opportunities for Incineroar to set up against Fighting-types like Mienshao, Toxicroak, and Breloom. Tera Ghost, on the other hand, allows Incineroar to completely blank Close Combat, and it helps to revenge kill Cinccino. This comes at a trade-off of it having no other useful resistances, though.</p> <p>Incineroar can partner with other pivots like Rotom-C, Flygon, and Swampert, which tend to draw in Grass-types like Brute Bonnet, Vileplume, and Tsareena for Incineroar to prey on and form a VoltTurn core able to chip away at each other's checks. Entry hazard removers like Brambleghast, Tsareena, and Tentacruel can be great partners, since they can remove entry hazards if Incineroar loses its Heavy-Duty Boots. Incineroar can struggle against bulky Water-types like Vaporeon, Quagsire, and Swampert that can tank its STAB attacks, so it pairs with Pokemon like Toxicroak, Rotom-C, and Vileplume, as they can check the aforementioned Water-types. Fairy- and Poison-types like Sylveon, Dragalge, and Vileplume appreciate Incineroar for checking Steel-types like Registeel, Klefki, and Bronzong; in return, they can check Fighting-types like Mienshao, Infernape, and Gallade.</p>"
      },
      "Defensive Pivot": {
        "description": "<h4>Set Details</h4> <p>Will-O-Wisp allows Incineroar to cripple its common switch-ins like Diancie, Swampert, and Gallade. Parting Shot can be used to weaken foes, pivot, and provide safety for setup sweepers. However, U-turn can be used because it allows Incineroar to pivot out from Diancie and Registeel that would usually be immune to Parting Shot due to their Clear Body ability. The given EV spread allows Incineroar to get the jump on Brute Bonnet while having as much special bulk as possible. Tera Fairy provides it the ability to check Dragon- and Fighting-types like Flygon, Mienshao, and Gallade while also letting it resist the omnipresent U-turn. Alternatively, Tera Dragon gives Incineroar the ability to check a myriad of special attackers like Toxtricity, Vileplume, and Inteleon. Tera Water is similar to Tera Dragon but replaces a Grass resistance for an Ice resistance, making Incineroar better against Inteleon.</p> <p>Grass-types like Tsareena, Brambleghast, and Vileplume are great partners for Incineroar, since they can handle bulky Water- and Ground-types such as Vaporeon, Swampert, and Gastrodon. Fighting-types like Mienshao, Toxicroak, and Infernape can force Incineroar to switch, so it best pairs with physically defensive Pokemon like Galarian Slowbro, Bellibolt, and Sylveon that can handle the aforementioned Fighting-types. Additionally, Sylveon can provide Incineroar with recovery by passing it a Wish. Wallbreakers like Inteleon, Munkidori, and Toxtricity appreciate Incineroar's slow Parting Shot, as they can get a free entry on Rock-, Fighting-, and Water-types that tend to switch in on Incineroar. Setup sweepers like Calm Mind Cresselia, Swords Dance Toxicroak, and Dragon Dance Flygon similarly appreciate Incineroar's Parting Shot weakening foes and it giving them more opportunities to set up. Incineroar's longevity is limited and can be cut severely if it loses its Heavy-Duty Boots, so it pairs well with entry hazard removers such as Tsareena, Tentacruel, and Brambleghast.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 609709, "username": "Pika134"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Oricorio": {"sets": {"Quiver Dance": {}}},
  "Oricorio-Sensu": {"sets": {"Quiver Dance": {}}},
  "Mudsdale": {"sets": {"Defensive": {}}},
  "Araquanid": {"sets": {"Sticky Web": {"description": "<p>The Speed EVs help to outpace Vaporeon.</p>"}}},
  "Salazzle": {"sets": {"Nasty Plot": {}, "Utility": {}}},
  "Tsareena": {
    "overview": "<p>Tsareena is NU's best entry hazard remover, and for good reason: it easily beats the plethora of Grass-weak hazard setters like Rhyperior, Swampert, and Diancie, and even Steel-types such as Klefki and Registeel are inconsistent at beating it one-on-one. While offensive Tsareena profiles as a solid wallbreaker that can take over games thanks to Rapid Spin's Speed boost, defensive sets are fantastic at checking the swathes of offensive Ground-types in NU, especially Krookodile and Flygon, and its access to Synthesis is a huge factor in it outclassing Brambleghast, its primary competition. Tsareena faces some very real struggles defensively, though, as almost every Ground-type it aims to check carries super effective coverage, like Gunk Shot from Krookodile and Megahorn from Rhyperior, that threatens to KO it with minimal chip damage required. Offensive sets aren't very fast without a Speed boost and easily pressured by other wallbreakers like Chandelure and Munkidori as well as fast utility options in Noivern and Talonflame. Meanwhile, defensive sets are quite easy to exploit due to their reliance on Knock Off with Pokemon like RestTalk Alolan Muk, Vileplume, and Dragalge.</p>",
    "comments": "<h3>Other Options</h3> <p>Tsareena has other usable Tera types than the ones listed, but they lack consistency across teams. Tera Dark is good for teams that lack a Ghost resistance and amps up Knock Off's damage, but it offers little else. Tera Ghost is a harder answer to Fighting-types than Tera Poison, but it's just as bad into Krookodile and gives Tsareena a horrible Alolan Muk matchup. Tera Fire is similar to Tera Dragon in helping Tsareena against Fire-types, although Tsareena gains a Water weakness. Choice Scarf sets are good at revenge killing priority-reliant setup sweepers like Lycanroc-D and Lucario and don't have to worry about Klefki's Thunder Wave.</p> <h3>Checks and Counters</h3> <p><strong>Flying-types</strong>: All of Talonflame, Noivern, and Acrobatics Thundurus outspeed Tsareena and beat it with relative ease. Talonflame hates losing its item, though, and both Noivern and Thundurus are vulnerable to Triple Axel from offensive sets.</p> <p><strong>Poison-types</strong>: Alolan Muk is a great Tsareena answer, especially if it's RestTalk. Other Poison-types like Dragalge, Vileplume, and Munkidori are good checks but less consistent. The former two cannot survive Knock Off followed by Triple Axel, while the latter is too frail to take Knock Off from either Tsareena set.</p> <p><strong>Fire-types</strong>: Incineroar counters Tsareena with ease, only fearing the rare High Jump Kick. Although Knock Off obliterates Chandelure and Hisuian Typhlosion, they both can spinblock Tsareena, tank its Power Whip, and OHKO it with their Fire-type attacks barring a well-timed Terastallization.</p>",
    "sets": {
      "Offensive": {
        "description": "<h4>Set Details</h4> <p>Tsareena doubles as a source of entry hazard removal and a potent wallbreaker. Knock Off punishes switch-ins such as Talonflame and Magnezone while obliterating Chandelure, and Triple Axel deletes opposing Grass-types like Vileplume, Venusaur, and Rotom-C as well as Noivern. If you wish to tap further into Tsareena's utility movepool, U-turn is optional over Triple Axel, still giving it an out against any of its checks while enabling its stronger teammates. High Jump Kick is another coverage move you can try, as it's Tsareena's best option for hitting Steel-type hazard setters like Copperajah and Registeel and does good damage to Incineroar. Heavy-Duty Boots lets Tsareena bypass hazard damage, which increases its proficiency as a spinner, but Lum Berry helps against Talonflame's Flame Body and Slowbro's Scald. Tsareena usually shouldn't be Terastallizing, but Tera Dragon potentially lets it KO a Chandelure or Hisuian Typhlosion with Knock Off and gives Tsareena a good sun matchup, while Tera Steel blanks Munkidori's STAB moves, potentially lets Tsareena beat Cloyster, and helps it against Alolan Muk.</p> <p>Tsareena is great at luring in and beating certain Poison-types like Dragalge, Vileplume, and Venusaur with Triple Axel; make sure to pair it with teammates like Mienshao, Thundurus, and Sylveon that can take advantage of this. Furthermore, Mienshao especially, as well as other physical attackers like Gallade and Infernape, appreciate Tsareena removing Talonflame's Heavy-Duty Boots and making it easier to overwhelm with Stealth Rock up. Similarly, teammates like Choice Specs Noivern, Chandelure, and Hisuian Typhlosion all appreciate Tsareena's Rapid Spin, and the latter two can beat Steel-type checks like Klefki, Registeel, and Magnezone for Tsareena. Talonflame is perhaps the most common switch-in to Tsareena, so Pokemon like Diancie and Slowbro that easily switch into it are helpful to have.</p>"
      },
      "Defensive": {
        "description": "<h4>Set Details</h4> <p>Bulky Tsareena is one of the tier's few good answers to the plethora of offensive Ground-types in NU, such as Flygon, Krookodile, and Rhyperior. Although they possess super effective coverage moves for it, they can't OHKO it, and Synthesis keeps Tsareena healthy throughout the game so it can stay out of KO range from these threats. The biggest boon to this set, though, is destroying Klefki; it can't do enough damage with Foul Play thanks to the bulk investment, and Power Whip or Trop Kick will slowly beat it down. Trop Kick can be used over Power Whip for its accuracy, but you lose out on useful damage rolls like 2HKOing Diancie, 2HKOing Assault Vest Reuniclus after Stealth Rock, and OHKOing Krookodile. The Speed EVs ensure Tsareena outspeeds Modest Diancie before it can attack with Meteor Beam, but Tsareena can go even faster if it wants, with relevant targets including Modest Magnezone, Torterra, and Adamant Feraligatr. Tsareena will rarely want to Terastallize, but Tera Poison is nice to consistently answer Fighting-types like Mienshao and non-Meteor Mash Lucario and makes Tsareena immune to poison from Alolan Muk at the cost of becoming weak to Earthquake; Tera Dragon aids against Fire-types like Hisuian Typhlosion and retains several resistances to types like Water, Grass, and Electric; and Tera Steel is useful for checking Fairy- and Poison-types such as Sylveon and Munkidori as well as Cloyster.</p> <p>Tsareena creates great defensive cores with common entry hazard setters like Diancie and Rhyperior. They resist Fire and Flying for Tsareena, while it takes on Water- and Ground-type attacks in return. Its Knock Off support is also favored by many offensive Pokemon, specifically Fighting-types like Mienshao, Gallade, and Infernape, since Tsareena so frequently draws in Talonflame and removes its Heavy-Duty Boots. Stealth Rock-weak Pokemon like Choice Specs Chandelure, Choice Specs Noivern, and itemless Thundurus also desire Tsareena for its Rapid Spin.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 336073, "username": "Rabia"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 295647, "username": "etern"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Palossand": {"sets": {"Physical Wall": {"description": "<p>Scorching Sands allows Palossand to possibly burn targets, but Earth Power provides more power. Sludge Bomb can be preferred over Shadow Ball to hit Grass-types upon switch-in and to fish for poison against bulkier Pokemon. No item allows Palossand to switch in to Poltergeist users like Brambleghast, and it can even wall it with Tera Dragon. On top of that, it receives decreased Knock Off damage, improving its matchup against Toxicroak even more. Alternatively, Leftovers provides recovery, and Rocky Helmet helps to punish physical attackers.</p>"}}},
  "Minior": {"sets": {"Shell Smash": {}}},
  "Thwackey": {"sets": {"Terrain Setter": {}}},
  "Inteleon": {
    "overview": "<p>Inteleon's Speed tier and sky-high Special Attack make it a formidable threat in NU. Not only is it blazing fast, but with Choice Specs, it's also quite powerful and can 2HKO many common special walls like Alolan Muk, Copperajah, and Assault Vest Galarian Slowbro on the switch with Hydro Pump. Even when facing Water-immune Pokemon like Gastrodon, Toxicroak, and Vaporeon, Inteleon still has a way to flip the matchup in its favor in its U-turn, which lets it bring in teammates like Breloom, Flygon, and Toxicroak to take advantage of these checks. On the other hand, Inteleon does face a bit of competition from Basculegion and Paldean Tauros-W, as the former can switch up its moves because it largely uses Mystic Water, the latter has Intimidate, and both have access to priority and easily fit coverage for Toxicroak; however, it isn't hindered by contact punishment such as Talonflame's Flame Body and Vileplume's Rocky Helmet and Effect Spore. It also has to deal with not being able to use its strongest move when up against teams with Water-immune Pokemon, which greatly halts Inteleon's progress-making, as it's almost always forced to use U-turn against them if it doesn't want to give up momentum.</p>",
    "comments": "<h3>Other Options</h3> <p>Inteleon can also run a Scope Lens + Sniper set that is similar to its Choice Specs moveset except with Hydro Pump being traded out for Snipe Shot. When landing a critical hit, Inteleon can dent many Pokemon, but its unreliability makes it weaker overall. Choice Scarf Inteleon reaches a blisteringly fast Speed tier and, with its high Special Attack and U-turn, easily revenge kills many setup sweepers and can create momentum. A moveset of Hydro Pump / Ice Beam / U-turn / Taunt can be run alongside Heavy-Duty Boots to bother passive Pokemon that would easily take advantage of Inteleon otherwise like Alolan Muk, Vaporeon, and Bronzong. Inteleon can drop U-turn in favor of running a second STAB move, like Surf or Snipe Shot, alongside Hydro Pump, letting it choose the right move depending on its situation; however, losing momentum versus Water-immune and -resistant Pokemon can be annoying at times. Tera Blast Grass can be run to snipe Water-immune Pokemon like Vaporeon and Gastrodon, but because Inteleon has to Terastallize to make use of it and already has access to U-turn, it typically is unnecessary and thus isn't used. Tera Dark can be used to boost Dark Pulse, letting Inteleon have a chance against checks like Vaporeon and Milotic, especially after they've been chipped.</p> <h3>Checks and Counters</h3> <p><strong>Water-immune Pokemon</strong>: All of Vaporeon, Gastrodon, and Toxicroak blank Inteleon's STAB attack, and the former two can take the rest of Inteleon's attacks decently well, though the latter drops to Ice Beam. However, with access to U-turn and strong coverage moves, Inteleon can find ways around these matchups.</p> <p><strong>Water- and Dragon-types</strong>: Basculegion and Milotic can switch into Inteleon's Hydro Pump and Ice Beam and proceed to use it for momentum, but neither of them enjoy switching in on a Dark Pulse. Similarly, Dragalge can take Inteleon's Hydro Pump decently but dislikes having to take an Ice Beam.</p> <p><strong>Grass-types</strong>: Brambleghast, Tsareena, and Breloom can take Inteleon's Hydro Pump and proceed to KO it with their Grass-type STAB moves, but they can't do this repeatedly. Similarly, bulkier Grass-types like Brute Bonnet and Vileplume can switch into Hydro Pump and threaten with Seed Bomb or Giga Drain, respectively; however, the former's lack of recovery and the latter's poor Special Defense leads them to being overwhelmed. On top of this, all of these Grass-types must fear Ice Beam.</p> <p><strong>Revenge Killers</strong>: Due to Inteleon's frailty, faster Pokemon like Kilowattrel and Choice Scarf users like Mienshao and Munkidori easily threaten Inteleon with a KO and can use it for momentum, but they fail to switch in reliably with their lack of bulk.</p>",
    "sets": {
      "Choice Specs": {
        "description": "<h4>Set Details</h4> <p>Hydro Pump is the preferred STAB option due to its power, but it can be unreliable at times. Alternatively, Surf can be run for accuracy in exchange for power. Ice Beam complements Inteleon's Water-type STAB move really well by hitting Grass- and Dragon-types like Decidueye, Vileplume, and Goodra super effectively. Dark Pulse provides Inteleon with a coverage move so that it isn't completely useless against Water-types like Vaporeon and Basculegion. U-turn allows Inteleon to pivot on even Water-immune Pokemon like Gastrodon and Vaporeon. Instead of Ice Beam or Dark Pulse, Inteleon could opt for Air Slash to better target Toxicroak and Paldean Tauros-W, but its lower Base Power means that it's worse at breaking through other Water-immune and -resistant Pokemon. Tera Water boosts Inteleon's STAB move to insane levels, but Tera Ghost allows Inteleon to avoid priority like Breloom's Mach Punch and resist Flygon's First Impression while blanking high-Base Power attacks like Mienshao's and Infernape's Close Combat.</p> <p>Inteleon forces in bulky Water-immune and -resistant Pokemon like Gastrodon, Vaporeon, and Tsareena, and it can capitalize on this with U-turn, letting it bring in a threat that takes advantage of them like Brambleghast, Toxicroak, or Incineroar. Toxicroak is an especially noteworthy partner, as it walls the most common Inteleon switch-in in Vaporeon and can use it as either setup fodder or a chance to throw out high-Base Power attacks. In return, Inteleon handles Fire- and Ground-types for the former two and can easily overwhelm physical walls Flygon brings in. Inteleon is quite powerful, but to achieve any of its 2HKOs, especially those against Water-type checks like Milotic and Vaporeon, it requires entry hazards to chip away at its foes; Copperajah, Bronzong, Gligar, and Klefki all synergize well to fill this role. Even without entry hazards, however, most special walls that do not resist Inteleon's STAB attacks like Bronzong, Alolan Muk, and Assault Vest Galarian Slowbro have a hard time switching in, as Bronzong is 2HKOed right away and Alolan Muk and Assault Vest Galarian Slowbro are 2HKOed after minimal chip damage. Special attacking partners like Diancie, Munkidori, and Nasty Plot Toxicroak make for good teammates, as they greatly appreciate Inteleon's ability to overwhelm their checks. Inteleon is threatened by Grass- and Electric-types like Tsareena, Rotom-C, and Kilowattrel, so Grass-types and Flying-resistant Pokemon like Vileplume, Wind Rider Brambleghast, and Diancie make for strong switch-ins to these threats. With Inteleon's frailty, it prefers to have slow pivots like Tsareena, Dragalge, and Incineroar, as they can draw out Fire- and Ground-types for Inteleon to threaten.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 369076, "username": "Tuthur"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Drednaw": {"sets": {"Shell Smash": {}}},
  "Coalossal": {"sets": {"Physically Defensive": {}}},
  "Sandaconda": {"sets": {"Defensive Wall": {}}},
  "Toxtricity": {
    "overview": "<p>Toxtricity is an extremely powerful special wallbreaker thanks to its already high Special Attack being further bolstered by  Punk Rock and powerful moves to take advantage of it. Toxtricity can choose to capitalize on these traits by either equipping Choice Specs to severely limit its switch-ins, which lets it 2HKO special walls like Bronzong and Alolan Muk, or it can run Shift Gear to become a setup sweeper and surpass Choice Scarf Flygon and Mienshao's Speed tier. Comparable wallbreakers like Chandelure and Porygon-Z lack Toxtricity's ability to gain momentum with Volt Switch, and they lack access to a high-power no-drawback move like Boomburst. While Toxtricity has plenty of power, its Speed is lacking, with non-Shift Gear sets being outsped and revenge killed by foes like Basculegion-M, Chandelure, and Paldean Tauros-W. Furthermore, even though its typing has good resistances, it is offset by its fairly meager bulk. This makes Toxtricity vulnerable to priority, such as Toxicroak's Sucker Punch and, particularly after Tera Normal, Breloom's Mach Punch. Toxtricity's lackluster bulk can also be seen when trying to set up on Shift Gear sets, as those require two turns to be fully set up: one to boost its Speed and the other its Special Attack with Throat Spray. If it does just one, it leaves itself open to being revenge killed easily.</p>",
    "comments": "<h3>Other Options</h3> <p>Encore is a reasonable move that can potentially grant Toxtricity turns to set up, but carrying it requires dropping important coverage. Choice item sets can choose to run Choice Scarf to surprise and outspeed normally faster non-Choice Scarf foes like Life Orb Mienshao and Heavy-Duty Boots Munkidori trying to revenge kill it, but it loses breaking power as a result. Toxtricity can choose to run Heavy-Duty Boots for additional flexibility and more longevity.</p> <h3>Checks and Counters</h3> <p><strong>Steel-types</strong>: Steel-types like Bronzong, Copperajah, and Registeel switch into Sludge Wave and Boomburst, but they can be threatened by Overdrive or pivoted on with Volt Switch, so they must be careful to correctly predict Toxtricity's move choice.</p> <p><strong>Ground-types</strong>: Ground-types like Flygon and specially defensive Gastrodon resist both of Toxtricity's STAB attacks, block Volt Switch, and threaten to OHKO Toxtricity with Earthquake and Earth Power. However, neither of them switch well into Boomburst.</p> <p><strong>Revenge-killers</strong>: Toxtricity's relatively lackluster Speed means it can be outsped and potentially revenge killed by many common threats, such as Munkidori, Mienshao, and Flygon. Priority is capable of finishing off Toxtricity as well, meaning Toxicroak's Sucker Punch, Basculegion-M's Aqua Jet, and Breloom's Mach Punch can be threatening.</p>",
    "sets": {
      "Scream (Choice Specs)": {
        "description": "<h4>Set Details</h4> <p>Boomburst 2HKOes Alolan Muk and Assault Vest Galarian Slowbro. Tera Normal lets it OHKO Vileplume, Swampert, and Dragalge. Overdrive gives Toxtricity a way to hit Steel- and Rock-types, notably 2HKOing Bronzong and Diancie after Stealth Rock damage. Volt Switch gives Toxtricity a chance to pivot on potential switch ins like Alolan Muk, Copperajah, and Registeel and gain momentum. Sludge Wave lets Toxtricity hit foes like Brambleghast and Decidueye that are immune to or resist its other attacks. Alternatively, Snarl is a useful option to directly target the aforementioned Ghost-type foes along with other Pokemon like Golurk, Palossand, and Bronzong, as Toxtricity tends to get all the coverage it needs from Boomburst and its Electric-type STAB moves; however, it is weak versus other targets.</p> <p>Toxtricity works well with powerful attacking teammates like Mienshao and Paldean Tauros-W that can be brought in with a Volt Switch on Steel-types like Registeel and Copperajah, which try to switch into a Boomburst. Ground- and Psychic-types are a threat to Toxtricity as well, particularly foes like Flygon and Munkidori, so switch-ins like Bronzong, Orthworm, and Gligar can be helpful. Entry hazard setters like Flygon, Gligar, and Diancie can help limit Toxtricity's switch-ins even more. Teammates like Incineroar and Mienshao bait in physically defensive foes like Vaporeon and Vileplume and can pivot out on them, bringing in Toxtricity to get off a free powerful attack.</p>"
      },
      "Shift Gear": {
        "description": "<h4>Set Details</h4> <p>Tera Normal lets Boomburst OHKO Vileplume and Swampert. A Timid nature allows Toxtricity to outspeed Choice Scarf Munkidori and Mienshao after a Shift Gear boost, and while utilizing a Modest nature for additional power is possible, it typically requires Sticky Web support to avoid being outpaced and revenge killed by the aforementioned common Choice Scarf users.</p> <p>Shift Gear Toxtricity appreciates entry hazard-setting leads like Froslass and Brambleghast that can set up and keep entry hazards up to weaken switch-ins. Sticky Web leads like Galvantula and Araquanid can also be helpful to guarantee that Modest Toxtricity can outspeed even Choice Scarf foes like Munkidori and Mienshao after Shift Gear. Other special wallbreakers like Inteleon and Porygon-Z can combine with Toxtricity to break through special walls like Alolan Muk and Bronzong. Teammates that can facilitate Toxtricity's setup turns are also very helpful, such as Memento Chandelure or a partner like Swords Dance Mienshao that forces in a Pokemon like Vileplume or Sylveon for Toxtricity to take advantage of. Toxtricity also works well with teammates like Cinccino, Tornadus, and Munkidori to beat down shared Steel- and Ground-type checks like Bronzong, Copperajah, and Gastrodon. Teammates that can set up on and revenge kill those Steel- and Ground-types, such as Mienshao, Flygon, and Torterra, can back up Toxtricity as well.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641404, "username": "hammer798"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 336073, "username": "Rabia"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Grimmsnarl": {"sets": {"Offensive": {}, "Bulk Up": {}}},
  "Pincurchin": {"sets": {"Terrain Setter": {}}},
  "Indeedee": {"sets": {"Terrain Setter": {}, "Choice Item": {"description": "<p>Calm Mind should only be used on sets including Trick, so Indeedee can take advantage the newly Choice-locked target</p>"}, "Calm Mind": {}}},
  "Copperajah": {
    "overview": "<p>Copperajah stands out from the other Steel-types for being a defensive tank that packs both firepower and utility. It checks special wallbreakers like Diancie, Munkidori, and Porygon-Z. Additionally, Copperajah's deep movepool gives it a lot of utility options. For example, Knock Off allows it to hit item-reliant Pokemon that commonly switch into it like Rotom-H and Incineroar, letting Copperajah's entry hazards chip away at them, and Whirlwind lets it phaze setup sweepers like Calm Mind Cresselia and Quiver Dance Oricorio-E. However, Copperajah's biggest problem is the lack of reliable recovery, making it a lot harder to consistently switch into special wallbreakers that have STAB attacks that it doesn't resist like Inteleon and Toxtricity. Copperajah also struggles to break through physical walls like Vileplume, Vaporeon, and Milotic, as they can tank its attacks and threaten it back with status.</p>",
    "comments": "<h3>Other Options</h3> <p>An Assault Vest set with an EV spread of 252 Atk / 4 SpD / 252 Spe and an Adamant nature lets Copperajah outspeed foes like Registeel and Dragalge, tank hits from Porygon-Z and Kilowattrel, and be a menacing wallbreaker. Play Rough hits Fighting- and Dark-types like Mienshao, Breloom, and Wo-Chien, but it's rarely used. Supercell Slam targets bulky Water-types like Vaporeon, Milotic, and Tentacruel. However, Copperajah struggles to fit it, and Supercell Slam's risk of recoil damage makes it very niche. Tera Water lets Copperajah better handle Ground- and Water-types like Flygon and Inteleon, but Tera Dragon is preferred for not giving it a weakness to Grass- and Electric-type attacks from Breloom and Kilowattrel. Tera Ghost gives Copperajah a useful immunity to Fighting-type attacks from foes like Mienshao and Toxicroak while spinblocking Tsareena and Brambleghast. However, these Pokemon usually can then proceed to hit it with super effective attacks like Knock Off and Poltergeist.</p> <h3>Checks and Counters</h3> <p><strong>Fighting-types</strong>: Mienshao, Toxicroak, Heracross, and Breloom destroy Copperajah with their STAB Close Combat, but none of them want to switch directly into its STAB attacks. Paldean Tauros-W resists Copperajah's STAB attacks, allowing it to either destroy Copperajah with its STAB Close Combat or force Copperajah to switch, giving it a free opportunity to use Bulk Up.</p> <p><strong>Physical Walls</strong>: Vileplume, Vaporeon, and Milotic can tank Copperajah's attacks very well and threaten it back with status. Orthworm is notable for also taking Copperajah's attacks very well and either using it to set up entry hazards or hitting it back with Body Press.</p> <p><strong>Ground-types</strong>: Flygon, Swampert, and Gligar can KO Copperajah with their STAB Earthquake, but they don't enjoy switching into its Knock Off, and Flygon takes a lot of damage from its Iron Head.</p> <p><strong>Fire-types</strong>: Chandelure and Hisuian Typhlosion can put a lot of pressure on Copperajah with their STAB attacks, but they have to be cautious about switching into its Knock Off. Incineroar can force Copperajah to switch out, allowing it to freely set up with Swords Dance, or destroy Copperajah with its STAB Flare Blitz. Rotom-H can use Copperajah as setup fodder or cripple it heavily with Pain Split. However, Rotom-H doesnt enjoy directly switching into its Knock Off.</p>",
    "sets": {
      "Stealth Rock": {
        "description": "<h4>Set Details</h4> <p>Knock Off allows Copperajah to target item-reliant foes like Rotom-H, Kilowattrel, and Incineroar. For its last move, Copperajah commonly runs Whirlwind, allowing it to phaze bulky setup sweepers like Calm Mind Cresselia and Sylveon. Alternatively, Protect allows Copperajah to scout out Choice item attackers like Flygon, Mienshao, and Munkidori and gives it more Leftovers recovery. Earthquake hits Fire- and Poison-types like Chandelure and Galarian Slowbro and Steel-types like Registeel, Klefki, and opposing Copperajah. The Speed investment allows Copperajah to outpace Bronzong. Tera Dragon gives Copperajah a useful resistance to Fire-type attacks from foes like Chandelure and Rotom-H, while Tera Fairy gives it a better matchup against Flygon and Fighting-types like Mienshao and Breloom.</p> <p>Wish passers like Vaporeon and Sylveon provide massive recovery for Copperajah, letting it repeatedly switch into foes like Munkidori and Porygon-Z. Copperajah best synergizes with physical walls like Galarian Slowbro, Vileplume, and Vaporeon, as they can handle physical wallbreakers like Toxicroak, Paldean Tauros-W, and Basculegion-M. In return, Copperajah checks special wallbreakers like Munkidori, Kilowattrel, and Dragalge. Copperajah is forced out by Fire-types like Chandelure and Hisuian Typhlosion, as they can destroy it with their Fire-type attacks. Thus, it pairs well with Water- and Dragon-types like Vaporeon, Dragalge, and Goodra to check them. Copperajah appreciates Fairy- and Psychic-types like Sylveon, Cresselia, and Diancie, as they can handle foes like Heracross, Flygon, and Incineroar. Wallbreakers such as Flygon, Overqwil, and Paldean Tauros-W appreciate Copperajah's strength, since unlike other Steel-types such as Bronzong, Klefki, and Registeel, it can wear down physical walls like Gligar, Galarian Slowbro, and Swampert.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 609709, "username": "Pika134"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}, {"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Duraludon": {"sets": {"Expert Belt": {}, "Stealth Rock + Eject Pack": {}}},
  "Basculegion": {
    "overview": "<p>Basculegion-M's solid Attack stat, supported by two amazing abilities and high-Base Power STAB moves, makes it one of the most potent wallbreakers available in the tier. An Adaptability-boosted Wave Crash is capable of doing immense damage to bulky walls like Registeel and Swampert and even gets good chip on bulky Water-resistant Pokemon like Milotic and Tsareena. Alternatively, Basculegion-M can opt for Swift Swim on rain teams, becoming an extremely menacing Pokemon that can outspeed and power through bulky and offensive teams alike. While not having much in terms of type coverage, Basculegion-M has access to a solid movepool. Most notably, access to Aqua Jet lets it act as a revenge killer, picking off faster Pokemon such as Mienshao and Gallade with ease. However, the lack of a reliable physical Ghost-type STAB move hurts Basculegion-M greatly, making it susceptible to Pokemon that it otherwise would have a chance against, namely bulky Water-types such as Vaporeon and Gastrodon. Additionally, Basculegion-M's Speed is rather average, leaving it susceptible to being revenge killed by common Pokemon such as Gallade and Brambleghast and Choice Scarf users like Mienshao, Rotom-C, and Munkidori as well.</p>",
    "comments": "<h3>Other Options</h3> <p>A mixed attacking Assault Vest set can function as a decent bulky offensive pivot, leveraging Basculegion-M's solid special bulk against common special attackers like Munkidori. However, Basculegion-M's typing leaves it vulnerable to common special attackers such as Chandelure and Rotom-C, making its defensive use somewhat inconsistent. Additionally, the lack of reliable recovery makes it prone to being chipped down over time, forcing it to be paired with a Wish user and making it much less efficient into common threats. Choice Specs Basculegion-M is a decent option, with its stronger coverage options in Shadow Ball and Ice Beam, alongside Adaptability, compensating for its otherwise middling Special Attack stat. This set can threaten typical counterplay to physical Basculegion-M sets such as Vaporeon, Toxicroak, Dragalge, and Vileplume with either Shadow Ball or Ice Beam.</p> <h3>Checks and Counters</h3> <p><strong>Water-immune Pokemon</strong>: Vaporeon is an excellent answer to Basculegion-M thanks to Water Absorb making it immune to Basculegion-M's Water-type STAB moves alongside strong physical bulk with investment making it hardly deterred by any of Basculegion-M's coverage moves. Gastrodon functions similarly, albeit with more reliable recovery with Recover and the ability to turn Basculegion-M's Water-type moves into an opportunity for offensive momentum thanks to Storm Drain. Toxicroak can also switch into Basculegion-M's Water-type moves courtesy of Dry Skin and use Basculegion-M as fodder for setting up Swords Dance. However, Psychic Fangs obliterates Toxicroak, so it must be mindful of Basculegion-M's choice of coverage.</p> <p><strong>Water- and Dragon-types</strong>: Milotic is generally a solid check to Basculegion-M thanks to Recover giving it extremely important longevity as well as Flip Turn letting Milotic use Basculegion-M as a chance to gain momentum. Inteleon can generally switch into Basculegion-M once and, in return, outspeed and OHKO Basculegion-M with Dark Pulse after some chip damage. Dragalge's solid physical bulk lets it come in on Basculegion-M's Water-type STAB moves and either wear it down with Sludge Bomb or finish it off with Draco Meteor. Paldean Tauros-W's high physical bulk combined with Intimidate and Bulk Up lets it easily come in on Basculegion-M's Water-type STAB moves, but it must exercise caution against sets with Psychic Fangs.</p> <p><strong>Grass-types</strong>: Bulky Grass-types like Vileplume and Tsareena are able to handle Basculegion-M's Water-type moves outside of rain quite effectively and can overwhelm it with their STAB moves. Vileplume in particular can also take advantage of Basculegion-M's presence for longevity with either Giga Drain or Strength Sap. However, both of these Pokemon must be wary of Choice Band Ice Fang, as they are vulnerable to being 2HKOed by it. Vileplume also must look out for Psychic Fangs. Brute Bonnet is another excellent answer, resisting both of Basculegion-M's STAB attacks and OHKOing it in return with any of its STAB attacks. Additionally, Sucker Punch can easily pick off Basculegion-M.</p> <p><strong>Faster Pokemon</strong>: Basculegion-M's bulk, while decent, leaves it vulnerable to various faster Pokemon with super effective coverage. Dark-types and Pokemon with Dark-type coverage such as Mienshao, Gallade, and Inteleon can all OHKO Basculegion-M with their respective Dark-type attacks after some minor chip damage. Other faster offensive Pokemon such as Tsareena, Kilowattrel, and Rotom-C can overwhelm Basculegion-M with super effective moves. However, all of these Pokemon have to be wary of Basculegion-M under rain, and non-Choice Scarf variants have to fear a possible Choice Scarf on Basculegion-M, as the majority of them are susceptible to being OHKOed by Basculegion-M's Wave Crash.</p>",
    "sets": {
      "Rain Sweeper": {
        "description": "<h4>Set Details</h4> <p>Liquidation acts as a recoil-free alternative to Wave Crash at the cost of lower power. This is especially useful late-game, where Basculegion-M can wreck through weakened foes while still maintaining some health as to not be too vulnerable to revenge killers. Alternatively, Aqua Jet has more use outside of rain, being a useful priority tool to revenge kill faster Pokemon like Mienshao, Talonflame, and Cinccino. For Basculegion-M's last move, it tends to opt for Tera Blast alongside Tera Ghost, as it gifts Basculegion-M a powerful and reliable physical Ghost-type STAB move to hit Water-resistant and -immune Pokemon like Vaporeon, Toxicroak, Milotic, and Tsareena. However, it forces Basculegion-M to Terastallize, so it can be off-putting at times as an option. Because of this, Psychic Fangs can be used as alternative to hit Vaporeon neutrally while also hitting checks like Toxicroak and Vileplume super effectively. Ice Fang is another option that hits Dragon- and Grass-types like Dragalge, Tsareena, and Vileplume attempting to switch into Basculegion-M's Water-type attacks. If not running Tera Blast, Tera Water can further boost Basculegion-M's already monstrous offensive profile, letting it 2HKO bulky Water-resistant Pokemon such as Dragalge, Vileplume, and Tsareena with Wave Crash.</p> <p>Choice Band Basculegion-M is a premier threat on rain teams thanks to its immense power and Swift Swim boosting its Speed. As a result, rain setters such as Klefki and Tornadus are necessary picks. In addition to setting rain, the former has access to a vast array of utility moves such as Thunder Wave, which cripples Choice Scarf users like Infernape and Inteleon, and Spikes, while the latter can use rain itself to break through Grass-types like Vileplume, Wo-Chien, and Tsareena. Other Swift Swim Pokemon such as Kingdra, Hisuian Qwilfish, and Ludicolo have solid synergy with Basculegion-M. Kingdra can overwhelm Vaporeon, Toxicroak, and Dragalge, making it less needed for Basculegion-M to Terastallize to hit these Pokemon. Hisuian Qwilfish can function as a late-game cleaner that appreciates Basculegion-M's insane wallbreaking letting it finish off games more easily, as it's able to finish off weakened foes. Ludicolo's Grass-type STAB moves and Ice-type coverage can be monumental in turning the tides against bulky Water-, Grass-, and Dragon- types like Gastrodon, Vaporeon, Vileplume, and Dragalge. Other entry hazard setters such as Flygon and Swampert make for good teammates, further bolstering Basculegion-M's wallbreaking capabilities.</p>"
      },
      "All-out Attacker": {
        "description": "<h4>Set Details</h4> <p>Aqua Jet gives Mystic Water sets a way to pick off faster Pokemon like Chandelure, Cinccino, and Mienshao, while Liquidation helps out Choice Scarf sets by providing a less risky version of Wave Crash with more PP and no recoil. Aqua Jet can even find use on Choice Scarf variants as a means to combat faster Choice Scarf users like Mienshao. Psychic Fangs provides solid coverage, hitting Poison-types that can take Water-type moves like Dragalge, Toxicroak, and Vileplume. Ice Fang instead targets Grass- and Dragon-types like Tsareena, Vileplume, Flygon, and Dragalge, albeit being weaker into the aforementioned Poison-type Pokemon. Mystic Water in tandem with Adaptability makes Basculegion-M's Water-type STAB moves extremely menacing while allowing it to switch its moves. This is further boosted by Tera Water, which makes Basculegion-M's Water-type attacks monstrously strong, doing immense damage to even the bulkiest of physically defensive Pokemon like Avalugg. Alternatively, Choice Scarf patches up Basculegion-M's otherwise average Speed and makes it a formidable revenge killer in its own right. Despite this, Basculegion-M's average Speed stat prevents it from being consistent as a revenge killer, as other Choice Scarf users such as Flygon, Mienshao, Munkidori, and Porygon-Z can effectively outspeed and threaten it.</p> <p>Entry hazard setters like Flygon, Swampert, and Diancie can set up Stealth Rock and Spikes, whittling down foes for Basculegion-M to more easily overwhelm. Hazard removal from the likes of Cinccino, Talonflame, and Tsareena is heavily appreciated, increasing Basculegion-M's longevity and making it more capable offensively late-game. Basculegion-M tends to draw in bulky Water- and Grass-types like Vaporeon, Vileplume, Gastrodon, and Tsareena. As a result, offensive Pokemon that can capitalize on these foes, namely Toxicroak, Incineroar, Rotom-C, and Staraptor, can form potent wallbreaking cores with Basculegion-M. Additionally, the last three Pokemon can reliably bring Basculegion-M in with their pivot moves, giving Basculegion-M an easier time entering battle. Dark-types like Incineroar, Alolan Muk, Scrafty, and Bombirdier can counteract opposing Dark- and Ghost-types and use their presence as an opportunity to generate offensive momentum through pivoting, wearing down foes over time with Knock Off, and, in the case of the first two, status. Setup Pokemon that can boost Speed such as Dragon Dance Flygon and Tidy Up Cinccino, as well as those that increase their physical bulk like Iron Defense Registeel and Bulk Up Scrafty, can pose a problem to Choice Scarf Basculegion-M, as either Basculegion-M's average Speed stat or the lack of an additional power boost can let it down against these threats. Thus, Pokemon that can check these foes such as Orthworm, Chandelure, and Sylveon are appreciated, providing some solid defensive backbone for Basculegion-M to fall back upon. In return, these Pokemon heavily appreciate Basculegion-M's strong offensive presence.</p>"
      },
      "Substitute": {}
    },
    "credits": {"writtenBy": [{"user_id": 487308, "username": "BT89"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 189361, "username": "Lucario"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Overqwil": {"sets": {"Rain Sweeper": {}, "Spikes Setter": {}, "Setup Sweeper": {}}},
  "Pawmot": {"sets": {"Wallbreaker": {}, "Revival Blessing": {}}},
  "Bellibolt": {"sets": {"Physically Defensive": {}}},
  "Kilowattrel": {
    "overview": "<p>Kilowattrel's high Speed, great STAB combination, and access to two great abilities make it a great pivot that can benefit many teams. With how common stat-dropping moves and abilities are in NU, Kilowattrel's Competitive allows it to capitalize on Vileplume's Strength Sap and both Paldean Tauros-W's and Incineroar's Intimidate. On top of that, Kilowattrel being able to fire off a powerful Volt Switch or an unblockable U-turn helps it keep up pressure and momentum, and this aids Kilowattrel with wearing down checks like Diancie, Registeel, and Bronzong. Kilowattrel's counters aren't that common; however, whenever Kilowattrel comes across one like Bellibolt or Rotom-H, it struggles to deal with them and is forced to pivot, giving away free turns. Kilowattrel's low bulk also can be detrimental, as Choice Scarf users like Mienshao can 2HKO it with even a resisted Close Combat. Even Pokemon Kilowattrel would normally take out can beat Kilowattrel one-on-one if they have access to priority moves, like Sucker Punch Toxicroak and Aqua Jet Basculegion, due to its disappointing bulk.</p>",
    "comments": "<h3>Other Options</h3> <p>Kilowattrel can opt for a Choice Specs set to more easily wallbreak, but its weakness to Stealth Rock combined with how much it loves to pivot leads to it usually being worn down too quickly. Kilowattrel can run Weather Ball on rain and snow teams to hit Ground-types like Swampert, Gligar, and Flygon harder than Air Slash can, and notably, Weather Ball on snow teams lets Hurricane Kilowattrel easily dispatch Wind Rider Brambleghast. Thunder is also great for more power on rain teams, taking advantage of the weather. Tera Ghost can be used to avoid a powerful Close Combat from Choice Scarf Mienshao, Heracross, and Paldean Tauros-W; however, the defensive utility that Tera Steel gives Kilowattrel is usually preferred.</p> <h3>Checks and Counters</h3> <p><strong>Electric-types</strong>: Bellibolt, Rotom-H, and Volt Absorb Kilowattrel all can switch into Kilowattrel, wall it repeatedly, and capitalize on their free turn by gaining momentum or, in Rotom-H's case, setting up. The former must be wary of Tera Blast Ground sets, though.</p> <p><strong>Steel-types</strong>: Copperajah, Bronzong, and Registeel easily switch in to Kilowattrel's Air Slash and Hurricane. Since Kilowattrel has to pivot or switch out after they switch in, they can take advantage of their free turn by setting entry hazards or, in the latter two's case, boosting their stats.</p> <p><strong>Faster Pokemon and Priority Users</strong>: Kilowattrel's frailty leaves it open to being quite easily revenge killed by even resisted hits from Choice Scarf users; for example, it gets 2HKOed by Mienshao's Close Combat. Neutral hits from other Choice Scarf users also extremely hurt like Munkidori's Sludge Wave and Inteleon's Hydro Pump. Additionally, priority users like Toxicroak and Mystic Water Basculegion can heavily threaten Kilowattrel, since the former can OHKO it at +2 with a Tera Dark-boosted Sucker Punch, and the latter can 2HKO it with Aqua Jet.</p> <p><strong>Gastrodon</strong>: Gastrodon can both block Kilowattrel's Electric-type STAB moves and can take both Air Slash and Hurricane relatively comfortably; it even has access to recovery and often runs Ice Beam. Because of this, when up against Gastrodon, Kilowattrel is either forced to use U-turn or switch out, giving Gastrodon the chance to set up entry hazards.</p> <p><strong>Rock-types</strong>: Diancie can tank Kilowattrel's attacks quite well, and it can use it as an opportunity to set up Trick Room or set its entry hazards up. Coalossal can also soak up its attacks and set up hazards. However, they must be cautious of Tera Blast Ground variants.</p>",
    "sets": {
      "Offensive Pivot": {
        "description": "<h4>Set Details</h4> <p>Air Slash is preferred, as it is more accurate and can hit Wind Rider Brambleghast, but Hurricane can be used on teams that can handle it through other means. Volt Switch lets Kilowattrel take advantage of Competitive's Special Attack boosts better; however, U-turn helps it keep up momentum in the face of Ground-types like Gastrodon, Flygon, and Swampert. Tera Blast Fairy can even be used, as it lets Kilowattrel hit Flygon super effectively while blanking its Outrage and Scale Shot. On top of that, it lets Kilowattrel maintain its Fighting resistance and gives it a solid defensive typing. Tera Blast Ground is another option that lets Kilowattrel dispatch Diancie, Bellibolt, and Registeel, since they can be annoying for Kilowattrel to get past at times. Roost allows Kilowattrel to continually pivot and gain value from its Competitive, and it can help counteract Life Orb chip damage. Heavy-Duty Boots is preferred to let Kilowattrel come in safely and repeatedly during a match. Alternatively, Life Orb can by used on more offensive teamstyles that can both keep up enough pressure to prevent Stealth Rock from being set up and take advantage of the extra boost it gives Kilowattrel. Competitive allows Kilowattrel to capitalize on common Pokemon's abilities and moves like both Overqwil's and Incineroar's Intimidate as well as Vileplume's Strength Sap. On the other hand, Volt Absorb can be run to take advantage of Galvantula, Rotom-C, and opposing Competitive Kilowattrel. Tera Steel allows Kilowattrel to resist many common attacks like Cinccino's Tail Slap, Inteleon's Ice Beam, and Munkidori's Sludge Wave and Psychic.</p> <p>Entry hazard setters like Klefki, Flygon, Copperajah, and Gligar are great partners for Kilowattrel, as their hazards can punish the opponent's switches, while Kilowattrel helps keep the hazards up by pressuring stray Defoggers like Scyther and Decidueye. Similarly, Kilowattrel can work with hyper offense leads like Galvantula, Araquanid, and Froslass. While Kilowattrel can pressure Defoggers, it fails to stop spinners like Brambleghast, Avalugg, and Tsareena, so pairing it with a Ghost-type like Basculegion, Brambleghast, or Hisuian Typhlosion is a good idea. Kilowattrel can pressure Water-types like Vaporeon, Milotic, and Basculegion quite easily, meaning Pokemon that struggle dealing with them or can force them in like Flygon, Incineroar, and Inteleon have good synergy. Special walls like Gastrodon, Copperajah, and Bronzong can be difficult to take down alone, so physical wallbreakers like Incineroar, Breloom, and Mienshao are great to deal with them, and Kilowattrel can form VoltTurn cores with many of them. Electric- and Rock-types like Bellibolt, Volt Absorb Kilowattrel, and Diancie are difficult for Kilowattrel to KO; because of this, Ground-type teammates like Flygon, Gastrodon, and Palossand make for good partners. Since Life Orb Kilowattrel is highly susceptible to being worn down by Stealth Rock, a hazard-removing teammate like Cinccino, Tsareena, or Brambleghast is appreciated, especially the former thanks to the offensive pressure it exerts.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 583607, "username": "PowerOfMemes"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 641404, "username": "hammer798"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Brambleghast": {
    "overview": "<p>Brambleghast is the premier Rapid Spin user in NU thanks to its high-Base Power STAB moves, typing that lets it beat common entry hazard setters like Swampert, Diancie, and Bronzong one-on-one, and solid Speed. Brambleghast's useful Wind Rider ability lets it block a possible Hurricane from Kilowattrel and Tornadus. Additionally, Brambleghast is a great wallbreaker, since not many Pokemon can take both of its STAB attacks. Choice Band makes Brambleghast into a dangerous threat, as defensive foes like Vileplume and Tsareena get 2HKOed by Poltergeist on the switch. However, Brambleghast's poor bulk makes it poor at checking wallbreakers like Mienshao, Flygon, and Paldean Tauros-W, as they can threaten it with a 2HKO from their coverage or Choice Band-boosted attacks, forcing Brambleghast to constantly use Strength Sap. Additionally, Brambleghast's typing leaves it weak to common Dark- and Fire-types like Alolan Muk, Incineroar, and Chandelure. While Brambleghast does have good Speed, it's still outsped and revenge killed by foes like Inteleon and Munkidori or by priority attacks like Sucker Punch Toxicroak and Shadow Sneak Alolan Muk.</p>",
    "comments": "<h3>Other Options</h3> <p>Infiltrator lets Brambleghast target Substitute users like Flygon and Paldean Tauros-W and -F. Brambleghast can go itemless, reducing the power of Knock Off from Mienshao and Tsareena and walling opposing Brambleghast. Leech Seed can be run on defensive sets, letting Brambleghast make progress on foes like Incineroar, Registeel, and Sylveon. Night Shade lets Brambleghast do consistent damage against Dark-types like Bombirdier and Alolan Muk. A set with Spikes / Poltergeist / Rapid Spin / Curse and a Focus Sash turns Brambleghast into a solid lead hazard setter, as it can set up Spikes and punish foes like Incineroar and Alolan Muk with Curse damage. Tera Water gives it a useful resistance against Fire-type attacks, but it makes Brambleghast weak to other Grass-types like Tsareena and Rotom-C.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: Incineroar, Alolan Muk, and Bombirdier resist both of Brambleghast's STAB attacks and can destroy it with their own STAB attacks. Umbreon can threaten Brambleghast with either Foul Play or Toxic, but it is wary of switching into Choice Band-boosted Power Whip.</p> <p><strong>Fire-types</strong>: Chandelure and Hisuian Typhlosion destroy Brambleghast with their STAB attacks. Hisuian Typhlosion can outspeed Brambleghast, while Chandelure requires a Choice Scarf to outspeed it, but they are wary of switching into its Poltergeist and can be picked off by Shadow Sneak. Talonflame outspeeds Brambleghast, and it can threaten it back with either a KO from its Brave Bird or cripple Brambleghast with burn from Will-O-Wisp or Flame Body. However, Talonflame doesn't enjoy directly switching into Poltergeist.</p> <p><strong>Physical Walls</strong>: Vileplume and Avalugg can tank Brambleghast's attacks and both of them having recovery makes it a lot more difficult for Brambleghast to break through them. However, Vileplume can't directly switch into Choice Band Brambleghast, as it gets 2HKOed. Other physical walls like Dragalge, Talonflame, and bulky Tsareena can tank Choice Banded Brambleghast's attacks and threaten it back with their own attacks, but they have to predict correctly or they take significant damage.</p> <p><strong>Revenge Killers</strong>: Faster foes like Inteleon, Munkidori, and Air Slash Kilowattrel can threaten Brambleghast with their attacks due to its poor bulk or use it for momentum, but they don't enjoy switching into Brambleghast's STAB attacks. Priority users like First Impression Flygon and Sucker Punch Toxicroak can easily revenge kill Brambleghast after it's been weakened.</p>",
    "sets": {
      "Offensive Utility": {
        "description": "<h4>Set Details</h4> <p>Strength Sap lets Brambleghast check physical wallbreakers like Flygon, Paldean Tauros-W, and Breloom. However, Spikes can be used instead, letting Brambleghast become a solid entry hazard setter. Alternatively, Shadow Sneak lets it revenge kill weakened foes like Flygon, Munkidori, and Mienshao. Heavy-Duty Boots lets Brambleghast ignore entry hazards, meaning it can more reliably remove them, while Colbur Berry lets it tank Dark-type attacks such as Mienshao's Knock Off and Toxicroak's Sucker Punch, letting Brambleghast use Strength Sap on them or hit them back with its STAB attacks. Brambleghast can run a defensive set with an EV spread of 252 HP / 80 Def / 176 Spe and a Jolly nature on utility sets, as it lets Brambleghast better handle physical wallbreakers like Iron Thorns, Paldean Tauros-W, and Mienshao while letting it outspeed base 80 Speed Pokemon like Chandelure. Tera Fairy provides a Dark resistance while not throwing away its matchup into Fighting-types and Flygon. Alternatively, Tera Ghost gives both Poltergeist and Shadow Sneak a power boost, letting it 2HKO foes like Vileplume, Dragalge, and Copperajah with the former.</p> <p>Fighting-types like Mienshao, Toxicroak, and Heracross are great partners for Brambleghast, as they can check Dark-types like Incineroar, Alolan Muk, and Umbreon; in return, Brambleghast pressures Ghost- and bulky Psychic-types like Chandelure, Cresselia, and Galarian Slowbro. Incineroar is an exceptionally great partner for Brambleghast due to how it beats Grass-, Steel-, and Dark-types for Brambleghast, and in return, Brambleghast can check Fighting-, Ground-, and Water-types for Incineroar. Fire-types like Choice Scarf Chandelure and Talonflame outspeed Brambleghast and destroy it with their STAB attacks. Thus, it best pairs with bulky Water-types like Vaporeon, Milotic, and Tentacruel to check the aforementioned Fire-types. Faster Pokemon like Flygon, Mienshao, and Talonflame can easily revenge kill Brambleghast, so it synergizes well with defensive tanks like Sylveon, Galarian Slowbro, and Diancie that check them. Brambleghast appreciates special wallbreakers like Munkidori, Inteleon, and Kilowattrel for handling physical walls like Vileplume and Avalugg. Brambleghast can spinblock for hazard setters like Bronzong, Diance, and Swampert. Stealth Rock-weak Pokemon like Chandelure, Hisuian Typhlosion, and Staraptor that won't have Heavy-Duty Boots appreciate Brambleghast for its hazard removal.</p>"
      },
      "Choice Band": {
        "description": "<h4>Set Details</h4> <p>Choice Band allows Brambleghast to 2HKO Vileplume with Poltergeist and OHKO Vaporeon with Power Whip. Shadow Sneak lets Brambleghast pick off weakened foes like Flygon and Breloom. Tera Blast Ghost is a good alternative to Poltergeist, as it neither requires the foe to have an item nor can it miss. Tera Blast Ground could be used to hit common walls like Incineroar and Alolan Muk, but because Brambleghast needs to Terastallize for it to work and it almost always prefers a reliable Ghost-type STAB move, it isn't run.</p> <p>Ground-types like Flygon, Gligar, and Swampert appreciate Brambleghast for checking Water-types like Vaporeon, Milotic, and Paldean Tauros-W; in return, they can handle Fire-types like Talonflame and Chandelure. Brambleghast appreciates Fighting- and Fairy-types like Toxicroak, Heracross, and Diancie for checking Dark-types like Incineroar, Alolan Muk, and Umbreon. Physical walls like Vileplume, Avalugg, and Tera Fairy Galarian Slowbro can tank many of Brambleghast's attacks very well, so it best synergize with special wallbreakers like Kilowattrel, Munkidori, and Chandelure to handle the physical walls. Brambleghast partners well with Pokemon like Cresselia, Munkidori, Meloetta, and Incineroar, as they can overwhelm shared checks like Alolan Muk and opposing Incineroar.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 609709, "username": "Pika134"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 641404, "username": "hammer798"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Bombirdier": {"sets": {"Stealth Rock": {"description": "<p>U-turn provides unwallable pivoting, but Parting Shot can be used to lower the foe's offenses but gets stopped by Magic Bounce Espeon and Clear Body Diancie and Registeel. The Speed EVs help to outpace Adamant Incineroar, letting Bombirdier use Knock Off and pivot before getting attacked.</p>"}}},
  "Orthworm": {"sets": {"Utility": {}}},
  "Flamigo": {"sets": {"Choice Item": {}}},
  "Cetitan": {"sets": {"Belly Drum": {}}},
  "Veluza": {
    "overview": "<p>Fillet Away in conjunction with Sharpness-boosted STAB moves turns Veluza into a terrifying sweeper capable of shredding teams with only a single turn of setup. Veluza is an excellent choice for hyper offense teams, where it acts as a deadly wallbreaker and late-game cleaner. Veluza can easily find setup opportunities against passive foes, such as Vaporeon, and Choice-locked foes, such as a Passimian that just used Close Combat. Although Veluza is extremely powerful after setting up, it may not always get the chance to do so due to its frailty. Veluza's defensive typing is also relatively poor; it is weak to common attacks, including pivoting moves like U-turn from Scyther and Volt Switch from Rotom. Furthermore, Veluza's speed and firepower are rather mediocre prior to setup.</p>",
    "comments": "<h3>Other Options</h3> <p>Tera Ground enables Veluza to turn the tables on a Jolteon or Rotom trying to grab momentum with Volt Switch. Tera Electric is another option that lets Veluza avoid paralysis from Chansey and Sandaconda while also turning its Electric weakness into a resistance.</p> <h3>Checks and Counters</h3> <p><strong>Offensive Pressure</strong>: Veluza's mediocre bulk and need to sacrifice half of its health to set up means that sufficient offensive pressure can prevent it from taking over a game.</p> <p><strong>U-turn and Volt Switch</strong>: Veluza's poor defensive typing renders it weak to both U-turn and Volt Switch, which means that foes such as Jolteon and Scyther can easily gain momentum on or KO it.</p> <p><strong>Cacturne</strong>: Cacturne is immune to Psycho Cut and Aqua Cutter, enabling it to completely wall any Veluza not running Tera Fairy Tera Blast.</p>",
    "sets": {
      "Physical Sweeper": {
        "description": "<h4>Set Details</h4> <p>Fillet Away is one of the best setup moves in the game, doubling Veluza's Speed and power at the cost of half its health. Aqua Cutter and Psycho Cut are both boosted by Sharpness, and after a Fillet Away will OHKO many neutral targets, such as Rotom, Mabosstiff, and Clawitzer. For Veluza's last move, Substitute can be used to ease prediction, facilitate setup, and avoid Sucker Punch. Aqua Jet can also be used to revenge kill weakened foes and, after setup, outprioritize other priority moves such as Lycanroc's Accelerock. Tera Blast is an option with Tera Fairy to blast past Cacturne, which otherwise completely walls it. Otherwise, Tera Water is good choice to further boost the power of Veluza's Aqua Cutter, giving it a guaranteed OHKO on specially defensive Umbreon after Stealth Rock. Sitrus Berry helps Veluza set up sucessfully, and 4 HP EVs ensure that it will activate after a Fillet Away. An Adamant nature is preferred to maximize Veluza's damage output, but a Jolly nature enables Veluza to outspeed Timid Farigiraf prior to setup and Choice Scarf Zoroark post-setup.</p> <p>Veluza's incredible Speed and power after setup make it an excellent choice for hyper offense teams. Entry hazard support from Lycanroc and Qwilfish can help chip Veluza's checks into range of its attacks. Bulk Up Paldean Tauros is a great partner for Veluza, as it can easily switch into and set up against Pokemon that give Veluza trouble, such as Cacturne. In return, Veluza can set up on Pokemon used to revenge kill or force out Paldean Tauros, like a Choice Scarf Indeedee-F locked into Psychic or Psyshock. Paldean Tauros also helps Veluza break past shared walls in Vaporeon and Tera Water Sandaconda, enabling one of them to sweep late-game. Other good offensive partners to pair with Veluza include Jolteon and Quiver Dance Vivillon. Jolteon provides an Electric immunity for the team while also giving Veluza points of entry through Volt Switch. Vivillon threatens Cacturne, and its Sleep Powder may cripple one of Veluza's checks, allowing it to sweep. Indeedee-F is another good teammate for Veluza, as Psychic Terrain shields Veluza from priority attacks, such as Sucker Punch, while boosting the power of Psycho Cut to absurd levels.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 272785, "username": "nimzowitsch"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 583793, "username": "Sabelette"}, {"user_id": 423085, "username": "Deezcastforms"}]}]}
  },
  "Dudunsparce": {"sets": {"Coil": {}, "Calm Mind": {}, "Stealth Rock": {}}},
  "Scream Tail": {"sets": {"Utility": {}, "Scream 2 (Booster Energy Calm Mind)": {"description": "<p>216 Speed EVs allows Scream Tail to outpace Choice Scarf Munkidori after activating its Speed-boosting Booster Energy.</p>"}, "Lead": {}}},
  "Brute Bonnet": {"sets": {"Covert Cloak": {}}},
  "Wo-Chien": {"sets": {"Defensive": {}}},
  "Munkidori": {
    "overview": "<p>Munkidori is a strong special attacker and pivot. Its typing allows it to hit much of the tier for at least neutral damage with its STAB moves, with Sludge Bomb and Sludge Wave targeting Fairy- and Grass-types like Sylveon and Tsareena, while Psychic and Psyshock target Poison- and Fighting-types like Vileplume and Breloom. Munkidori's Nasty Plot set loves to capitalize on the switches that it forces against these Pokemon, and with its excellent Speed tier, it can outspeed common threats like Mienshao and Flygon. Munkidori's U-turn is also incredibly potent, as it easily spreads poison with Toxic Chain to chip away at walls like Diancie, Incineroar, and Umbreon so that it can KO them more easily later. It also runs moves like Focus Blast and Tera Blast Ground to hit its poison-immune checks such as Steel-types like Copperajah and Registeel and Poison-types like Alolan Muk. Trick can also limit opposing setup sweepers like Cresselia and Iron Thorns or cripple specially defensive walls upon switch-in like Bronzong and Alolan Muk. However, Munkidori is vulnerable to opposing Dark-types like Incineroar and Brute Bonnet and can be limited by Steel-types if not carrying sufficient coverage. Its poor bulk also means it can be easily revenge killed by faster Choice Scarf users like Inteleon and Infernape or Pokemon with priority such as Sucker Punch Toxicroak and Aqua Jet Basculegion.</p>",
    "comments": "<h3>Other Options</h3> <p>Fake Out is a niche option that can be used on Toxic Chain sets with the intention of giving Munkidori as many opportunities as possible to poison the opposing Pokemon. Parting Shot can also be used as an alternative to U-turn, avoiding contact and lowering the foe's stats, but Munkidori's main draw is its ability to poison Pokemon without having to waste a turn using a status move like Toxic. Psychic Noise can also be used on pivot sets while attempting to chip down bulkier foes, preventing them from recovering while a more effective attacker switches in. Shadow Ball can be run alongside Tera Ghost to hit Bronzong, which otherwise walls Munkidori, and it can provide an immunity to priority moves like Mienshao's Fake Out and Breloom's Mach Punch. Grass Knot is a niche option alongside Tera Grass to target potential threats like specially defensive Swampert and Gastrodon but leaves Munkidori helpless against Steel-types. Tera Fairy can also be used as an alternative to Tera Fighting that maintains Munkidori's resistance to Fighting-type attacks at the cost of the potential boost to Focus Blast. Frisk is an option to regularly gain information on the foe's items but loses the potential status effects and chip damage of Toxic Chain.</p> <h3>Checks and Counters</h3> <p><strong>Dark-types</strong>: Dark-types, such as Incineroar, Brute Bonnet, and Tera Dark Toxicroak are immune to Munkidori's Psychic-type STAB moves and threaten it back with powerful moves like Knock Off and Sucker Punch. However, with access to moves like Sludge Wave, Focus Blast, Tera Blast Ground and the ability to Terastallize into a Dark-resistant Tera type, they must be cautious.</p> <p><strong>Steel-types</strong>: Steel-types such as Copperajah, Klefki, and Registeel can handle Munkidori's STAB attacks easily, forcing it to rely on coverage like Focus Blast and Tera Blast Ground or its teammates to break through. They also are immune to poison, preventing Munkidori from wearing them down with Toxic Chain.</p> <p><strong>Revenge Killers</strong>: While Munkidori, particularly with Choice Scarf, is quite fast, it can be outsped and its physical bulk is somewhat lacking, meaning faster Choice Scarf users like Inteleon and Infernape and priority such as Basculegion's Aqua Jet and Brute Bonnet's Sucker Punch can easily pick it off it its health gets low enough.</p> <p><strong>Specially defensive Poison-types</strong>: Alolan Muk and Assault Vest Galarian Slowbro can be difficult for Munkidori to break through due to their bulk, strong defensive typing, and immunity to being poisoned.</p>",
    "sets": {
      "Pivot": {
        "description": "<h4>Set Details</h4> <p>Sludge Bomb provides a greater chance of poisoning the foe, while Sludge Wave provides greater power. Psychic targets physically defensive walls like Vileplume and Galarian Slowbro, notably OHKOing Vileplume after Stealth Rock. However, Psyshock gives Munkidori an answer to specially defensive Poison-types like Tentacruel and Tera Poison Calm Mind Cresselia. U-turn lets Munkidori pivot and possibly poison specially defensive walls switching in like Diancie and Umbreon. Focus Blast targets Steel-types like Copperajah and Dark-types like Incineroar, 2HKOing both. Tera Blast Ground is a viable alternative that better targets Alolan Muk, which is 2HKOed after Stealth Rock. On Choice Scarf sets, Trick allows Munkidori to cripple walls like Alolan Muk and Registeel and setup sweepers like Dragon Dance Flygon and Calm Mind Cresselia. Heavy-Duty Boots allows Munkidori to pivot frequently and lets it not be locked into a move. On the other hand, Choice Scarf makes Munkidori one of the fastest Pokemon in the tier, as it is only outsped by opposing Choice Scarf users like Infernape and Inteleon. Tera Fighting works twofold; it lets Munkidori resist Dark-type attacks and boosts the power of Focus Blast. Tera Ground, however, should only be used alongside Tera Blast. A defensive Tera type of Tera Flying also works on Munkidori, as it helps it avoid Earthquake from Flygon and retains its Fighting resistance.</p> <p>Munkidori benefits from teammates that can break through special walls, such as Copperajah, Bronzong, and Alolan Muk, that it struggles to deal with itself. Physical wallbreakers like Gallade, Infernape, and Mienshao help to take care of the specially defensive Steel- and Dark- types that might otherwise give Munkidori trouble. In return, Munkidori handles physical walls like Vileplume, Dragalge, Sylveon, and Avalugg. Entry hazard setters like Swampert and Klefki can be useful teammates, as their hazards alongside Munkidori's constant pivoting and threat of poison can help wear down foes over time and get them into range for Munkidori to finish them off. The poison caused by Toxic Chain makes bulky teammates like Avalugg, Vaporeon, and Sylveon good teammates, as it lets them stall out foes more easily with poison chipping away at them.</p>"
      },
      "Nasty Plot": {
        "description": "<h4>Set Details</h4> <p>At +2, Psychic OHKOes Galarian Slowbro and Avalugg, while Psyshock OHKOes Vileplume. A Nasty Plot-boosted Sludge Wave OHKOes Assault Vest Brute Bonnet, while Sludge Bomb gives Munkidori a higher chance to poison foes. Focus Blast lets Munkidori deal with Umbreon and Copperajah more easily, but boosted Tera Blast Ground can be used, as it handles Alolan Muk and Incineroar more reliably. U-turn could also be used as a last move so that Munkidori can support its team early-game, but it then heavily relies on its teammates to deal with Steel-types. Heavy Duty-Boots allows Munkidori to repeatedly switch in without concern for entry hazard chip damage, letting it use Nasty Plot repeatedly over the course of a battle. Tera Fighting is used to further boost Focus Blast's damage while letting Munkidori resist Dark-type attacks, while Tera Ground is used alongside Tera Blast to blow through checks like Alolan Muk. Tera Flying is used defensively against opposing Ground-type attackers like Swampert or Flygon, providing additional opportunities to boost with Nasty Plot.</p> <p>Pokemon that can overwhelm opposing Steel- and Dark-types are appreciated by Munkidori, so teammates like Cinccino, Porygon-Z, and Brambleghast pair well with it. Hazard setters like Swampert, Diancie, and Klefki can set up Stealth Rock or Spikes to further wear down opposing walls, and on hyper offense builds, hazard-setting leads like Froslass and Brambleghast work well alongside Munkidori. Since Dark- and Ground-types like Incineroar, Tera Dark Toxicroak, and Choice Scarf Flygon threaten Munkidori, teammates such as Diancie, Dragalge, and Talonflame provide switch-ins for these sweep-ending threats.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641404, "username": "hammer798"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 583607, "username": "PowerOfMemes"}, {"user_id": 400664, "username": "Stories"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  }
}