{
  "Arcanine-Hisui": {
    "outdated": true,
    "sets": {
      "Magic Guard": {
        "description": "<p>Hisuian Arcanine is a strong wallbreaker, capable of denting many physically defensive Pokemon such as Scream Tail while taking advantage of Magic Guard by using Head Smash and Flare Blitz in combination with Life Orb without any drawbacks. Close Combat allows Hisuian Arcanine to hit Ting-Lu and Well-Baked Body Iron Treads, while Will-O-Wisp threatens burns on checks like physically defensive Quaquaval and Garchomp. Extreme Speed is useful priority that picks off weakened targets, Stealth Rock allows Hisuian Arcanine to act as an offensive entry hazard setter that pressures Corviknight and Iron Treads, and Flame Charge boosts its Speed to thwart potential revenge killers. As Hisuian Arcanine places a lot of pressure on physical walls, other physical cleaners like Meowscarada and Chien-Pao can be partnered with Hisuian Arcanine to clean up after it has broken those walls while providing speed control. Since Hisuian Arcanine is checked by Garchomp and bulky Water-types like Quaquaval, Refrigerate Regieleki makes a good partner for it by forcing these Pokemon out, pivoting Hisuian Arcanine in, and helping to deal with faster threats through its raw Speed. Hisuian Arcanine's middling Speed makes slow pivots like Corviknight good partners due to their ability to bring it in safely; alternatively, Corviknight's dual screens set allows Arcanine to take a hit and strike back.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Muk-Alola": {
    "outdated": true,
    "sets": {
      "RegenVest": {
        "description": "<p>With a great defensive typing, solid special bulk, and Knock Off, Alolan Muk is a great RegenVest user, repeatedly entering the battle and disrupting fierce special attackers like Iron Moth and Zapdos. Knock Off provides critical utility and disruption, deters potential answers from switching into it, and provides decent uninvested damage output against neutral targets. Poison Fang semi-reliably spreads Toxic poison onto opposing walls, while Poison Jab can 2HKO Enamorus-T and Meowscarada. Rock Slide hits Zapdos, Volcanion, Talonflame, and Volcarona hard, punishing them for switching in. Ice Punch nails common switch-ins like Landorus-T and Garchomp, while Thunderbolt snipes Corviknight. Physical walls like Corviknight, Unaware Scream Tail, and Quaquaval are a natural pairing, as they can better deal with the physical attackers that threaten Alolan Muk like Garchomp, Chien-Pao, and Galarian Zapdos. Mixed attackers like Magic Guard Volcanion and Heatran threaten Alolan Muk out, so offensive answers to these like Sword of Ruin Garchomp, Chien-Pao, and Galarian Zapdos are recommended. Entry hazards wear down Alolan Muk over the course of the game and prevent it from properly dealing with repeated attacks from threats like Iron Moth and Iron Jugulis, so hazard removers like Iron Treads, Quaquaval, and Corviknight are all recommended teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Cloyster": {"outdated": true, "sets": {"Technician": {}}},
  "Gengar": {
    "sets": {
      "Sheer Force": {
        "description": "<p>Gengar makes for an amazing wallbreaker, breaking through offensive threats like Gholdengo, Great Tusk, and Enamorus-T, as well as having a decent Speed tier. Focus Blast hits Dark-types that try to switch in such as Chien-Pao and Roaring Moon as well as Steel-types such as Heatran and Hisuian Goodra. Nasty Plot turns Gengar into a threatening wallbreaker, allowing it to 2HKO RegenVest Hisuian Goodra and Manaphy with its coverage options. Sludge Wave hits Fairy- and Grass-types like Enamorus-T, Hisuian Electrode, and Ogerpon-W. Energy Ball hits Ground-types like Swampert and Great Tusk, while Thunderbolt hits non-Volt Absorb Corviknight and Mandibuzz. Gengar is great at threatening physical walls like Corviknight and Deoxys-D, so it partners well with physical wallbreakers like Galarian Zapdos and Chien-Pao; in return, they can pressure special walls that Gengar struggles to break through like Hisuian Goodra and Blissey. Due to Gengar's frailty, it struggles against faster threats such as Azelf, Roaring Moon, and Chien-Pao, so defensive switch-ins to them like Mandibuzz, Great Tusk, and Intimidate Corviknight make for good partners. Gengar greatly appreciates Knock Off support from Pokemon like Swampert, Manaphy, and Deoxys-D to remove Assault Vest from RegenVest Pokemon such as Swampert, Hisuian Goodra, and Meloetta, allowing it to have an easier time breaking past the opposing team.</p>"
      },
      "Normalize": {
        "description": "<p>Normalize Gengar not only threatens to remove opposing RegenVest pivots, often the best check to more conventional Gengar sets, but also reliably sets Toxic Spikes and wins one-on-one against slower setup threats like Swords Dance Iron Hands and Calm Mind Cresselia. Mean Look in conjunction with Skill Swap traps and removes opposing specially defensive walls like Swampert, Manaphy, and Empoleon that are aiming to check it. Skill Swap also reliably forces out and generates a free turn against any Pokemon slower than Gengar such as Sandy Shocks and Beads of Ruin Walking Wake, as they will be unable to hit it through Normalize. This makes Gengar one of the most reliable Toxic Spikes setters, as it threatens most common removal options like Corviknight and Great Tusk. Gengar is an excellent teammate for fast special cleaners like Azelf, Deoxys-S, and Iron Moth, as they benefit tremendously from opposing special walls being removed or weakened with Toxic Spikes. Gengar struggles against teams with fast Dark-types like Roaring Moon, Meowscarada, and Chien-Pao, as it cannot meaningfully damage them and is immensely threatened by them, making Pokemon like Fluffy Corviknight and physically defensive Manaphy great partners; they can also provide a slow pivot to get Gengar in safely. Weather Ball from Pokemon with Primordial Sea or Desolate Land bypasses Normalize, meaning Gengar cannot reliably force out common users like Walking Wake and Volcanion, so sturdy checks to them like RegenVest Swampert and Blissey make solid teammates.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "UT", "user_id": 523866}, {"username": "skippergamez", "user_id": 620268}], "teams": [{"name": "Quality checked by", "members": [{"username": "Slither Wing", "user_id": 603931}, {"username": "LordBox", "user_id": 611238}, {"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "cat", "user_id": 580765}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Electrode-Hisui": {"sets": {"Magic Guard": {}}},
  "Gyarados": {"outdated": true, "sets": {"Dragon Dance": {}}},
  "Vaporeon": {"outdated": true, "sets": {"Defensive": {}}},
  "Zapdos": {
    "sets": {
      "Primordial Sea": {},
      "Defensive": {
        "outdated": true,
        "description": "<p>Zapdos serves as a valuable defensive pivot, checking many of the tier's physical wallbreakers and pivots like Dragonite, Great Tusk, and its Galarian counterpart. Discharge's nasty paralysis chance further increases the utility Zapdos provides and cripples switch-ins like Blissey and Hisuian Goodra. Heat Wave is an option over Hurricane to hit Iron Treads and Volt Absorb Corviknight while 2HKOing non-Well-Baked Body Kingambit. U-turn allows Zapdos to switch in on the aforementioned physical threats and pivot out to a wallbreaker that threatens them. Intimidate is an option to weaken hits even after Zapdos switches out and also allow it to act as a check to Fire-types like Cinderace and Ceruledge. 108 Speed EVs notably allow it to outspeed Timid Volcanion and Adamant Slither Wing. Zapdos's inability to check Ice-types like Mamoswine and Chien-Pao and tendency to get worn down quickly makes other physical walls like Corviknight and Quaquaval great partners that can additionally switch into Knock Off from the likes of Great Tusk and Roaring Moon. Wallbreakers and pivots like Ogerpon-C, Azelf, and Barraskewda appreciate Zapdos's ability to switch into revenge killers like Roaring Moon, Choice Scarf Meowscarada, and opposing Barraskewda and pivot out, generating momentum for the team. If Zapdos is using Fluffy, a sturdy Fire-type check like Quaquaval or physically defensive Garchomp, which can switch into Pokemon like Cinderace and Ceruledge, pairs well with it.</p>"
      },
      "No Guard": {
        "outdated": true,
        "description": "<p>No Guard Zapdos is a potent offensive pivot that can reliably spread status with Zap Cannon. U-turn allows Zapdos to pivot while also gaining momentum for its team and can form a VoltTurn core with pivots such as Azelf and Barraskewda, although Heat Wave can be used instead to hit Steel-types such as Iron Treads and non-Well-Baked Body Kingambit. Pivots such as Roaring Moon, Iron Moth, and Meowscarada form a strong pivoting core with Zapdos, as Zapdos baits in Hisuian Goodra and Volt Absorb Empoleon allowing for free switch-in opportunities for these allies. Physical wallbreakers such as Great Tusk and Barraskewda are notable partners for Zapdos, as Zapdos threatens out Corviknight and Kommo-o while pivoting these teammates into Zapdos's checks such as Hisuian Goodra and Heatran, putting the opponent in a unfavorable position. Slow wallbreakers such as Great Tusk and Ceruledge benefit from Zapdos using Zap Cannon to paralyze opposing Pokemon. Slow pivots such as Corviknight switch in on strong offensive threats that Zapdos is scared of such as Ogerpon-C and Chien-Pao while providing Zapdos switch-in opportunities via U-turn. Zapdos struggles against strong special walls such as Garchomp and Volt Absorb Empoleon, so Pokemon that can threaten them out such as Great Tusk make excellent partners.</p>"
      }
    }
  },
  "Zapdos-Galar": {
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Galarian Zapdos is an excellent wallbreaker whose power is further boosted by Sword of Ruin. Boasting two powerful STAB moves with excellent neutral coverage in Close Combat and Brave Bird, Galarian Zapdos can most notably 2HKO Deoxys-D and Intimidate Corviknight. Knock Off beats Gholdengo and hinders switch-ins like Fluffy Corviknight and defensive Zapdos, while U-turn allows for pivoting against Fluffy users. Adamant is the preferred nature for better odds to 2HKO Intimidate Corviknight, while Jolly allows Galarian Zapdos to Speed tie with the plethora of base 100 Speed Pokemon, at the cost of only 3HKOing Intimidate Corviknight. Galarian Zapdos is a relatively slow and frail wallbreaker and is forced out by offensive threats such as Azelf and Chien-Pao, so it appreciates being brought in by pivots such as Azelf and Walking Wake; in return, it can threaten special walls like Swampert and Hisuian Goodra for them. Slow pivots like Corviknight and Swampert are also appreciated, as they can take a hit for it and pivot it in safely, with the former also providing entry hazard control, extending Galarian Zapdos's longevity. Galarian Zapdos struggles against Fluffy walls such as Corviknight, so Fire-types such as Gouging Fire and Iron Moth make for great teammates. Stealth Rock setters such as Great Tusk and Deoxys-D are also good teammates, allowing Galarian Zapdos to always 2HKO Intimidate Corviknight; in return, it can threaten opposing Great Tusk, preventing it from removing entry hazards. Galarian Zapdos's wallbreaking prowess is further empowered when paired with other offensive threats such as Barraskewda and Roaring Moon, as they can wear down shared checks like Fluffy Corviknight.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Vertigo", "user_id": 543620}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic", "user_id": 552227}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Moltres": {"outdated": true, "sets": {"Magic Guard": {}, "Desolate Land": {}}},
  "Moltres-Galar": {"outdated": true, "sets": {"Double Dance": {}}},
  "Dragonite": {
    "sets": {
      "Dragon Dance": {
        "description": "<p>Dragonite provides a variety of offensive utility, being an incredibly strong anti-offense tool, a potent setup sweeper, and a nigh-unparalleled late-game cleaner. Earthquake threatens Rock- and Steel-types like non-Earth Eater Garganacl, Kingambit, and Gholdengo, while Ice Spinner threatens select Electric-types like Sandy Shocks and Zapdos and removes Azelf's Psychic Terrain. Roost provides Dragonite with much-needed longevity, notably allowing it to turn Corviknight into setup fodder. Sharp Beak is an option over Life Orb to ensure that Dragonite does not wear itself down as quickly; alternatively, Heavy-Duty Boots improves its longevity, allowing it to pose a threat multiple times in a game and leverage its typing to act as a passable check to Water- and Fire-types like Barraskewda and Iron Moth. Dragonite's ability to clean late-game is appreciated by wallbreakers that can break open holes in the opposing team earlier in the game, like Volcarona and Chien-Pao. Its ability to act as potent speed control also allows it to make up for teammates that have middling Speed tiers like Ceruledge, Galarian Zapdos, and Choice Specs Walking Wake. Dragonite's tendency to get forced out by Azelf means it requires a partner that can consistently switch into it like Empoleon, RegenVest Manaphy, or Swampert. When not using Heavy-Duty Boots, entry hazard control from teammates like Corviknight, Great Tusk, and Mandibuzz is a must-have.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "Slither Wing", "user_id": 603931}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Mew": {
    "outdated": true,
    "sets": {
      "Choice Scarf Regenerator": {
        "description": "<p>Choice Scarf Regenerator Mew is a strong utility pivot that checks fast physical attackers with the combination of Will-O-Wisp + Volt Switch while still pressuring defensive cores with entry hazards and Trick. Ice Beam can be used as an alternative to Spikes to pressure Pokemon like Garchomp and Landorus-T. Trick can be used to neutralize support Pokemon and defensive pivots like Corviknight while serving as an emergency stop to bulky setup sweepers like Calm Mind Enamorus-T. 136 Speed EVs with a Timid nature ensure that Mew outspeeds Chien Pao, Hisuian Electrode, and +1 Jolly Quaquaval, as well as positive natured Slither Wing and Heatran after Trick. Bulky teammates like Corviknight, Garganacl, Zapdos, and Skeledirge benefit from Mew's ability to spread burns and set hazards, allowing them to absorb more hits from physical attackers and whittle down these attackers more quickly; Mew can also pressure fast attackers like Meowscarada and Talonflame that they struggle with. Additionally, late-game cleaners like Chien-Pao, Hisuian Arcanine, and Quaquaval benefit from Mew's ability to chip defensive switch-ins and hinder walls by giving them a Choice Scarf.</p>"
      },
      "Prankster": {
        "description": "<p>Prankster Mew is a good dual screens lead for hyper offense teams thanks to its good bulk, Speed, and movepool. Taunt blocks foes such as Garchomp, Landorus-T, and Iron Treads from setting entry hazards, Corviknight from clearing screens with Defog, and opposing setup sweepers like Volcarona from taking advantage of free turns. U-turn lets it pivot into its teammates and potentially re-set screens later in the game. Stealth Rock or Spikes can be used over U-turn to chip foes for teammates to KO. 96 Speed EVs and a Jolly Nature ensure that Mew always moves first against opposing leads like Prankster Corviknight and Masquerain, allowing Mew to hinder them with Taunt. Prankster Mew should only be used as a dual screens lead on hyper offense teams. Teammates such as Chien-Pao, Polteageist, Volcarona, and Roaring Moon all appreciate screens, which allow them to easily set up and make them less susceptible to revenge killers. The aforementioned Pokemon also provide good options for Mew to pivot into and gain momentum. Dark-type Pokemon such as Ting-Lu, Meowscarada, and Chien-Pao are immune to Prankster Taunt and can take advantage of Mew, so counters to them such as Zamazenta-C and Triage users, like Enamorus-T and Ursaluna, are good teammates.</p>"
      },
      "All-Out Attacker": {
        "description": "<p>Life Orb Mew is a very dangerous mixed wallbreaker that can decimate various walls with its colorful coverage. Ice Beam hits Ground- and Flying-types such as Garchomp, Landorus-T, and Zapdos. Gunk Shot 2HKOes Scream Tail, which otherwise switches into Mew freely. Close Combat takes care of Blissey and Steel-types such as Hisuian Goodra, Kingambit, and Heatran. Flamethrower 2HKOes non-Well-Baked Body Corviknight and Zamazenta-C, dissuading the latter from using Mew as setup fodder. A Mild nature helps Mew exert as much pressure as possible with Ice Beam and Flamethrower, while a Hasty nature most notably lets it outspeed Hydreigon and Speed tie Zapdos. Magic Guard negates chip damage from Life Orb and entry hazards, helping Mew stay healthy for longer and allowing it to better utilize its natural bulk to come into play. Sheer Force is an alternative particularly if Mew is used alongside a teammate with Magic Guard, such as Hisuian Electrode. It greatly increases Mew's power, notably letting it OHKO Garchomp and Iron Treads and pressure otherwise solid checks such as Meloetta, at the cost of its longevity. Bulky pivots such as Corviknight, Quaquaval, Iron Treads, and Meloetta can take on fast threats to Mew such as Chien-Pao, Roaring Moon, and Iron Moth and switch Mew in safely. Fast offensive pivots such as Meowscarada and Sandy Shocks are also strong partners that can give Mew opportunities to come into play and clean up late-game after it softens up their checks. Garchomp and Ting-Lu can set entry hazards to help Mew break down its checks over time.</p>"
      },
      "Setup Sweeper": {}
    },
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}, {"username": "Frozoid", "user_id": 532881}, {"username": "memesketch", "user_id": 537558}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "Adeleine", "user_id": 517429}, {"username": "Tea Guzzler", "user_id": 577920}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Typhlosion-Hisui": {
    "outdated": true,
    "sets": {
      "Desolate Land": {
        "description": "<p>Hisuian Typhlosion is a solid wallbreaker, exerting great offensive pressure with its great typing and offensive STAB move combinations. Eruption is Hisuian Typhlosion's go-to move, as Choice Specs boosts it enough to 2HKO common specially defensive walls such as Meloetta, Blissey, and Hisuian Goodra. Shadow Ball hits Fire-immune foes like Well-Baked Body Corviknight as well as Primordial Sea users like Volcanion, Zapdos, and Kilowattrel. Focus Blast notably 2HKOes RegenVest Roaring Moon and OHKOes Well-Baked Body Steel-types like Kingambit and Iron Treads. A Modest nature guarantees that Choice Specs Hisuian Typhlosion can 2HKO the previously mentioned special walls, but Timid can be used to outspeed max speed Quaquaval and Ceruledge. Choice Scarf and a Timid nature can turn Hisuian Typhlosion from a wallbreaker into a potent revenge killer that outspeeds and OHKOes other fast targets like Chien-Pao, Meowscarada, and Hisuian Electrode. Hisuian Typhlosion is very frail and struggles greatly against entry hazards, which also reduce Eruption's base power, so teammates that can clear hazards and pivot into it safely like Corviknight and Iron Treads are essential. Hisuian Typhlosion also has a mediocre Speed stat without Choice Scarf, so partners that can provide speed control like Regieleki, Chien-Pao, and Hisuian Electrode are also appreciated.</p>"
      },
      "Magic Guard": {}
    },
    "credits": {"writtenBy": [{"username": "Slither Wing", "user_id": 603931}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Slowking": {"outdated": true, "sets": {"Defensive Pivot": {}}},
  "Slowking-Galar": {"outdated": true, "sets": {"Specially Defensive Pivot": {}}},
  "Donphan": {"outdated": true, "sets": {"Fluffy": {}, "RegenVest": {"outdated": true, "description": "<p>Assault Vest Donphan is a solid special pivot that can check the likes of Sandy Shocks while also removing entry hazards with Rapid Spin. Knock Off cripples switch-ins and can support offensive teammates. Body Press is used as a coverage option for Earth Eater Kingambit and Iron Treads, which would otherwise wall Donphan. Offensive Pokemon susceptible to hazards such as Chien-Pao and Dragonite appreciate Donphan's spinning capabilities. Physically defensive Pokemon like Corviknight and Garganacl also pair well with Donphan, as it can handle special attackers like Sandy Shocks that threaten them. Donphan can be prone to residual damage, so it's recommended to pair it with a Wish user like Scream Tail or Florges to extend its longevity.</p>"}}},
  "Smeargle": {
    "sets": {
      "Sticky Web": {
        "description": "<p>Smeargle functions incredibly as an entry hazard lead on hyper offense teams thanks to its ability to lay Sticky Web and Stealth Rock via Stone Axe. Taunt can prevent hazards from Deoxys-D and Skarmory and sweepers such as Gouging Fire and Dragonite from setting up, while Memento can allow safe switch-ins for other frail Pokemon like Gengar and Chien-Pao. Smeargle is exclusively used on hyper offense teams due to it more or less being a suicide lead. Some notable partners include frail attackers such as Swords Dance Iron Boulder and Sheer Force Gengar, which benefit greatly from Sticky Web and the safe switch-in Memento provides. Some counters to Smeargle include Roaring Moon and Chien-Pao, since they are both immune to Taunt and Memento, enabling them to use it as setup fodder; as a result, Fighting-types such as offensive Bulk Up Great Tusk and Iron Hands are good partners. Another Pokemon that annoys Smeargle is Great Tusk due to its hazard removal capabilities, making threats such as Swords Dance Ceruledge, Ogerpon-C, and Tail Glow Manaphy much appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gambit_Gamin", "user_id": 652656}], "teams": [{"name": "Quality checked by", "members": [{"username": "Slither Wing", "user_id": 603931}, {"username": "cat", "user_id": 580765}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Blissey": {
    "sets": {
      "Special Wall": {
        "description": "<p>Blissey is a decent, albeit niche, wall and utility Pokemon in AAA with its ability to check most special attackers and extremely diverse movepool. Seismic Toss allows Blissey to not be completely passive and gives it consistent damage. Blissey's last two moveslots are flexible. Calm Mind + Shadow Ball is enough to beat the few special attackers that can otherwise defeat Blissey one-on-one such as Sheer Force Gengar and Gholdengo. Stealth Rock provides entry hazard support to free up a moveslot for a teammate, while Thunder Wave spreads status, crippling Pokemon like Azelf and Manaphy, and Heal Bell allows Blissey to operate as a cleric. Unaware allows Blissey to check special attackers attempting to set up on it like Gholdengo, Tail Glow Manaphy, and Iron Moth, while Well-Baked Body allows it to check Iron Moth while also giving it a more favorable matchup into Volcarona and Heatran. Magic Guard allows Blissey to avoid chip damage from entry hazards, letting it function as a better wall. Blissey most commonly runs Leftovers, as the extra healing can be extremely helpful, although on teams with more shaky hazard control, Heavy-Duty Boots can be opted for instead. A Calm nature is used to make Blissey function better as a special wall, notiably allowing it to always avoid the 2HKO from Sheer Force Gengar's Focus Blast. Blissey is most notably a special wall that does not require the use of Regenerator, which allows physical walls such as Great Tusk to run it instead. Blissey is most commonly seen on stall and fat team structures. Physically defensive walls like Corviknight and Deoxys-D are a must, as they help deal with Blissey's weakness to physical attackers and make a potent defensive core with it.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "Slither Wing", "user_id": 603931}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Swampert": {
    "sets": {
      "RegenVest": {
        "description": "<p>With an excellent defensive typing, solid bulk, Flip Turn, and good utility with Knock Off, Swampert is a premier RegenVest pivot that checks notable special attackers such as Gholdengo, Zapdos, and Iron Moth while also getting in offensive teammates with its slow pivoting. Stone Edge hits Zapdos, Volcarona, and Dragonite, while Mirror Coat can be used against setup attackers like Enamorus-T and strong special attackers such as Walking Wake and Latios. Flying-types like Corviknight and Mandibuzz appreciate Swampert's Electricimmunity, letting them reliably check physical attackers and remove entry hazards. Frail offensive Pokemon like Azelf, Chien-Pao, and Barraskewda benefit from Swampert, as its slow pivoting lets them come in more safely, and they can also take advantage of its Knock Off removing items from their common checks such as Deoxys-D and Corviknight. Swampert maintains much of its special bulk through its Assault Vest, so it's vital to have Knock Off absorbers such as Corviknight and Great Tusk for Swampert to more reliably check special attackers. Grass-resistant Pokemon like Heatran and Well-Baked Body Gholdengo are also good teammates for Swampert, as special attackers such as Iron Moth and Deoxys-S frequently run Grass-type coverage predominantly for it.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "UT", "user_id": 523866}, {"username": "Kinetic", "user_id": 552227}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Gardevoir": {"outdated": true, "sets": {"Tinted Lens": {}, "Prankster": {}, "Hadron Engine": {}}},
  "Masquerain": {"outdated": true, "sets": {"Sticky Web Lead": {}}},
  "Salamence": {"outdated": true, "sets": {"Aerilate": {}}},
  "Deoxys-Defense": {
    "sets": {
      "Unaware": {
        "description": "<p>Boasting high defensive stats and a plethora of utility moves, Deoxys-D makes for an excellent Unaware wall that can check Iron Hands and setup Great Tusk while also providing additional utility like setting entry hazards and pivoting. Spikes is the preferred hazard, as Deoxys-D can usually set multiple layers, but Stealth Rock is an alternative for teams that lack a Stealth Rock setter otherwise, and Knock Off can be used to limit opposing setup threats like Iron Boulder and Quaquaval while also debilitating walls like Corviknight and Swampert. Teleport can be used in conjunction with Deoxys-D's low Speed to safely switch Pokemon in, while Thunder Wave can be used to cripple Gouging Fire and Iron Boulder. Leftovers is the preferred item for extra longevity, but Heavy-Duty Boots is an option on Teleport sets to enable easier pivoting. Defensive Pokemon like Corviknight and Mandibuzz appreciate Deoxys-D being able to take on setup threats such as Iron Hands and Iron Boulder, allowing them to better handle Dark-types like Roaring Moon. Offensive Pokemon like Galarian Zapdos, Chien-Pao, and Ceruledge appreciate Deoxys-D being able to weaken opposing walls with hazards or Knock Off, as well as potentially getting them in safely if it's running Teleport. Deoxys-D narrowly avoids 2HKOs from stronger wallbreakers like Iron Boulder, so hazard control options like Scrappy Great Tusk and Corviknight are highly recommended so that Deoxys-D can have more longevity.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "Kinetic", "user_id": 552227}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Deoxys-Speed": {
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Deoxys-S is an incredible wallbreaker, boasting powerful Psychic Terrain-boosted Expanding Force alongside the highest relevant base Speed stat in the tier. Ice Beam hits Roaring Moon, Mandibuzz, and Dragonite for massive damage, while Knock Off debilitates foes, especially RegenVest users like Manaphy, Swampert, and Meloetta. Energy Ball hits Swampert and Iron Boulder; alternatively, Dark Pulse OHKOes Azelf and 2HKOes Gholdengo and Deoxys-D while still hitting Iron Boulder. Trick can debilitate defensive Pokemon, but it comes with the cost of weakening Deoxys-S. A Timid nature allows Deoxys-S to outspeed +1 Gouging Fire, +1 Volcarona, and Choice Scarf Sandy Shocks, while a Modest nature gives it more power, allowing it to always 2HKO defensive Gholdengo after slight chip damage. Other special wallbreakers like Iron Moth, Walking Wake, and Latios are appreciated, as they can break down shared checks such as RegenVest users like Manaphy, Swampert, Meloetta, and Hisuian Goodra with Deoxys-S. Deoxys-S is very frail, so slow pivots like Corviknight, Swampert, and Manaphy are very helpful. Additionally, entry hazard support from allies such as Great Tusk and Heatran can help chip would-be checks into range of a KO.</p>"
      },
      "Sheer Force": {
        "description": "<p>With its sky-high Speed stat and fantastic coverage, Deoxys-S is able to outspeed a significant portion of the metagame and threaten many common metagame threats with huge damage thanks to Sheer Force. Ice Beam OHKOes Zapdos and offensive Roaring Moon after some chip damage and 2HKOes Mandibuzz. Energy Ball 2HKOes RegenVest Swampert, while Thunderbolt can be run instead to threaten Corviknight. Focus Blast lets Deoxys-S damage Steel-types like Heatran and Hisuian Goodra, while Dark Pulse can be used instead to 2HKO Deoxys-D and Gholdengo. Knock Off is another option that can be used to debilitate opposing Pokemon like Swampert and Manaphy by removing their held items, making them easier for Deoxys-S and its teammates to deal with. Deoxys-S struggles against specially defensive Pokemon like Meloetta and Manaphy, so it pairs well with physically offensive partners like Chien-Pao, Meowscarada, and Galarian Zapdos that can effectively force them out. Due to its relative frailty and lack of recovery, Deoxys-S benefits from pivots like Corviknight and entry hazard removers like Great Tusk that allow it to come in safely. Entry hazard setters like Skarmory, Scream Tail, and Smeargle can also help weaken foes, making them easier for Deoxys-S to handle.</p>"
      },
      "Lead": {
        "description": "<p>Deoxys-S is one of the best hyper offense leads due to its high base Speed and access to dual screens, Taunt, and Stealth Rock. Taunt shuts down entry hazard setters like Deoxys-D and Smeargle; setup sweepers such as Gouging Fire, Manaphy, and Iron Boulder; and Defoggers like Corviknight. Pokemon such as Gouging Fire and Chien-Pao that threaten Defog users pair well with Deoxys-S, since Defog threatens to remove dual screens after Deoxys-S has left the field. Mandibuzz is the biggest threat to Deoxys-S's dual screens, since its Defog cannot be blocked by Prankster Taunt. Since Deoxys-S is usually used as a suicide lead, it should only be used on hyper offense teams. Deoxys-S pairs well with setup sweepers like Manaphy, Roaring Moon, and Chien-Pao, since it's able to reliably get up dual screens, which allow them set up more easily and make harder to revenge kill. Pokemon weak to entry hazards such as Volcarona appreciate Deoxys-S's ability to block them from being set with Taunt. Dark-types, such as Dragon Dance Roaring Moon, are able to set up in front of Deoxys-S due to being immune to Prankster Taunt, so switch-ins like Great Tusk are required.</p>"
      },
      "Protean": {
        "description": "<p>Protean Deoxys-S is a fast mixed wallbreaker and late-game cleaner, using its wide list of coverage to its advantage. Thunderbolt is Deoxys-S's most spammable move, as it hits a majority of the metagame for solid damage such as Primarina, Manaphy, non-Volt Absorb Corviknight, and Gholdengo. Ice Beam is used to hit Ground- and Dragon-types hard, such as Great Tusk, Dragonite, and Roaring Moon. Energy Ball can be used to beat Swampert while also pressuring Water- and Ground-types instead of being forced to predict. Superpower acts as Deoxys-S's main physical attack, being able to hit specially defensive walls such as Hisuian Goodra, Blissey, and Meloetta. Knock Off helps Deoxys-S and its teammates by crippling RegenVest users to be taken on better later in the game. Entry hazards like Stealth Rock and Spikes let Deoxys-S potentially weaken defensive checks for itself and its teammates. Life Orb is used to more easily use Deoxys-S's mixed potential but can reduce how many times how many times its able to switch in. Choice Specs can be used instead as an easier way for Deoxys-S to hit 2HKO damage rolls on RegenVest Pokemon and give it more switch-in opportunities, but this gives it less flexibility and physical power. With 236 Speed EVs and a Naive nature, Deoxys-S is able to outrun +1 Jolly Gouging Fire and Garchomp as well as neutral Regieleki. Setup sweepers and Choice-locked Pokemon like Roaring Moon, Chien-Pao, and Manaphy appreciate Deoxys-S's presence, as it can help with weakening or taking out any of their checks such as Great Tusk, Primarina, and RegenVest users. Teams containing slower attackers also appreciate Deoxys-S, as it can act as a form of speed control. Deoxys-S does struggle with making it onto the field safely due to both hazards and having minimal bulk, so having a defensive pivot or a hazard remover would help it, like Great Tusk, Corviknight, or Mandibuzz.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}, {"username": "Orangex", "user_id": 594122}, {"username": "Hiusi guy", "user_id": 603640}, {"username": "skippergamez", "user_id": 620268}], "teams": [{"name": "Quality checked by", "members": [{"username": "Slither Wing", "user_id": 603931}, {"username": "LordBox", "user_id": 611238}, {"username": "UT", "user_id": 523866}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "zastra", "user_id": 558636}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Empoleon": {
    "outdated": true,
    "sets": {
      "Special Wall": {
        "description": "<p>Empoleon is a fantastic special wall and bulky slow pivot thanks to its bevy of resistances and great Special Defense, giving it a plethora of switch-in opportunities. Defensive abilities enhance Empoleon's utility, with Bulletproof letting it wall Gengar and Gholdengo, Volt Absorb allowing it to switch into Zapdos and Regieleki, and Earth Eater letting it wall Garchomp, as well as Great Tusk lacking Close Combat. Flip Turn allows Empoleon to take a hit and pivot out, Stealth Rock lets it rack up passive damage, and Knock Off allows it to hinder switch-ins such as Manaphy and Kommo-o. Ice Beam is an option over Surf, giving Empoleon a super effective move against Dragonite, Kommo-o, and Garchomp, while Earthquake can threaten Iron Moth and Heatran. 0 Speed IVs let Empoleon pivot out as slow as possible, maximizing its defensive utility. Empoleon has average physical bulk, so it appreciates physically defensive teammates like Corviknight, Zapdos, and Kommo-o that can take on physical foes like Great Tusk, Galarian Zapdos, and Ogerpon-H that otherwise threaten it, while Empoleon takes on special attackers like Gholdengo, Azelf, and Manaphy. Offensive teammates such as Walking Wake, Gengar, and Ogerpon-C all appreciate Empoleon's slow pivoting to bring them onto the field safely, giving them a natural synergy with Empoleon, which is relatively passive on its own. Empoleon is vulnerable to being overwhelmed by special attackers like Sandy Shocks and, depending on its ability, Gengar, Zapdos, and Landorus, so a secondary special wall like Blissey, Garchomp, or RegenVest Manaphy can make a good teammate.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "Kinetic", "user_id": 552227}]}, {"name": "Grammar checked by", "members": [{"username": "berry", "user_id": 226455}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Gastrodon": {"outdated": true, "sets": {"Fluffy": {}}},
  "Mismagius": {"outdated": true, "sets": {"Normalize": {}, "Triage": {}}},
  "Garchomp": {
    "outdated": true,
    "sets": {
      "Specially Defensive": {
        "description": "<p>With solid defensive stats, a great defensive typing, and powerful phazing in Dragon Tail, Garchomp is a choice entry hazard setter and special wall, capable of switching into and pivoting around powerful attackers like Iron Moth, Zapdos, Sandy Shocks, and Gengar. Stealth Rock is an option over Spikes if a teammate like Ogerpon-H or Sandy Shocks is already running the latter move. Swords Dance can turn Garchomp into a potential wallbreaking threat, notably OHKOing unboosted Zamazenta-C and threatening a 2HKO on defensive Kommo-o and RegenVest Manaphy at +2, while Fire Blast chips Corviknight and Earth Eater Gholdengo. A Sassy Nature is preferred if running Fire Blast, sacrificing Speed to avoid a cut to Special Attack. Regenerator allows Garchomp to come in repeatedly over the course of a game. Strong attackers like Tail Glow Manaphy, Dragonite, and Zamazenta-C appreciate the entry hazards set by Garchomp softening up foes to be more vulnerable to their powerful attacks while also appreciating the defensive backbone Garchomp provides. Corviknight is an ideal partner for Garchomp, handling monstrous physical threats like Chien-Pao and Roaring Moon, while Garchomp handles special attackers like Iron Moth, Zapdos, and Heatran in return. Garchomp is vulnerable to being overwhelmed by foes such as Walking Wake, Manaphy, and Hisuian Electrode, especially without Regenerator, so Pokemon that can handle these powerful special attackers like Blissey, Empoleon, and Hisuian Goodra make great teammates.</p>"
      },
      "Mixed Attacker": {
        "description": "<p>Mixed Attacker Garchomp is a reliable entry hazard setter that packs enough power and Speed to consistently deter common hazard removal options like Corviknight and Great Tusk from safely switching in. Draco Meteor is the STAB move of choice, surprising offensive Great Tusk with a 2HKO, while Fire Blast 2HKOes Corviknight. Download is a niche option over Regenerator, letting it secure a 2HKO on Mandibuzz and offensive Manaphy with Draco Meteor while also freeing your Regenerator slot for a teammate like Kommo-o or Great Tusk, but it comes at the cost of cutting into Garchomp's longevity. Life Orb notably guarantees the 2HKO on specially defensive Garchomp with Draco Meteor. Offensive threats like Manaphy, Azelf, and Iron Moth appreciate Garchomp for its entry hazards and ability to threaten common defensive foes, chipping them down to be picked off later in the game. Defensive pivots such as Corviknight, Zapdos, and RegenVest Manaphy appreciate Garchomp outspeeding and threatening powerful offensive threats such as Great Tusk, Ceruledge, and Sandy Shocks, while Garchomp appreciates these defensive partners handling the faster attackers like Azelf and Chien-Pao that force Garchomp out. Garchomp is worn down very easily by hazards and appreciates Rapid Spin users like Great Tusk and Quaquaval and Wish support from Scream Tail, allowing it to come in repeatedly over the course of the game while greatly improving its longevity, especially if running Download. Garchomp also struggles to break through common defensive foes like Scream Tail and Earth Eater Empoleon, so it appreciates teammates such as Gengar and Zamazenta-C, which can break down these walls.</p>"
      },
      "Physically Defensive": {
        "description": "<p>Garchomp is an excellent entry hazard setter that checks many of the tier's Fire-types like Cinderace, Talonflame, and Ogerpon-H lacking Play Rough. Stealth Rock is an option over Spikes if a teammate like Ogerpon-H is carrying the move. Swords Dance allows Garchomp to threaten hazard removers like Quaquaval and act as a potential wincon late-game, while Dragon Tail forces switches, racking up entry hazard chip damage and preventing setup, and Liquidation hits both Landorus formes and Levitate Iron Treads and chips Corviknight. Regenerator allows it to switch in more times throughout a game to find opportunities to set up entry hazards or Swords Dance, while Well-Baked Body punishes Fire-types like Cinderace and Ceruledge for clicking their strong STAB moves and increases its walling capabilities. Garchomp's inability to check threats like Chien-Pao and Galarian Zapdos facilitates another physical wall like Corviknight or Zapdos, which can switch into them and pivot out. Garchomp's inability to check special threats like Azelf, Gengar, and Walking Wake makes special walls like RegenVest Manaphy and Goodra great partners if Garchomp is not using Regenerator; if Garchomp is using Regenerator, Blissey and Empoleon are alternative options as special walls.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Kinetic", "user_id": 552227}, {"username": "Isaiah", "user_id": 375662}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}, {"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Lucario": {
    "outdated": true,
    "sets": {
      "Magic Guard": {
        "description": "<p>Lucario is a devastating mixed wallbreaker, capable of tearing apart most defensive cores with ease thanks to its strong STAB moves and great mixed attacking stats. Close Combat and Steel Beam have excellent neutral coverage together and hit common walls like Hisuian Goodra and Scream Tail on their weaker defensive stat. Focus Blast 2HKOes standard Corviknight, while Aura Sphere provides a more consistent special attack. In the final moveslot, Nasty Plot allows Lucario to overwhelm slower teams, while Stone Edge provides coverage for Skeledirge and Zapdos. Bullet Punch is also an option that can turn the tables on would-be revenge killers such as Chien-Pao and Meowscarada after some chip damage. Naive is the recommended nature due to its ability to always outspeed Quaquaval and at worst Speed tie with Hisuian Arcanine. Lucario is best used as a mid-game wallbreaker that can pave the way for sweepers like Zamazenta-C and Hisuian Electrode by breaking through Pokemon like Corviknight and Garchomp. Lucario also heavily benefits from slow pivots like Meloetta, Corviknight, and Landorus-T; in return, they switch into Pokemon that threaten Lucario out, like Zapdos, Iron Treads, and Cinderace. While Lucario has limited switch-ins, the ones it does have, like Toxapex and Skeledirge, are very effective without using niche coverage options, so partners that can threaten them, like Zapdos and Quaquaval, are recommended; they can also bring Lucario in on their checks, like Goodra and Corviknight, with U-turn.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Hera", "user_id": 414072}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Hippowdon": {"outdated": true, "sets": {"Defensive": {}, "Fluffy": {"outdated": true, "description": "<p>Fluffy Hippowdon is a remarkable physical wall thanks to its defensive stats, reliable recovery in Slack Off, and pure Ground typing, letting it check offensive threats like Ceruledge, Kingambit, and Slither Wing. Whirlwind prevents foes like Talonflame from setting up. Rocky Helmet punishes the physical attackers it checks and lets it pseudo-spinblock Cyclizar and Iron Treads; alternatively, Leftovers gives it extra recovery without having to waste Slack Off PP. 25 Speed IVs let it underspeed Corviknight, allowing it to punish its Roost with Earthquake. Specially defensive walls like Corviknight, Florges, and Blissey can compensate for Hippowdon's poor Special Defense and check foes like Chi-Yu and Greninja. In return, they appreciate Hippowdon dealing with Ceruledge, Kingambit, and Slither Wing.</p>"}}},
  "Rotom-Wash": {
    "outdated": true,
    "sets": {
      "Choice Item": {
        "description": "<p>Rotom-W can act as a good offensive pivot and revenge killer with Choice Scarf or as a wallbreaker with Choice Specs, as its formidable typing allows it to threaten a plethora of Pokemon including Ground-types such as Iron Treads, Landorus-T, and Garchomp with its Water-type moves while dealing with Desolate Land users such as Heatran, Skeledirge, and Ceruledge with its Electric-type moves. Hadron Engine boosts Rotom-W's Special Attack and Electric-type moves, while Primordial Sea provides an immunity to Fire-type moves and makes Thunder perfectly accurate. Will-O-Wisp and Trick provide good utility and cripple switch-ins such as Garchomp and Hisuian Goodra for teammates by burning them or removing their Assault Vest. However, Rotom-W can get worn out quickly due to entry hazards, so hazard removal options such as Iron Treads and Corviknight are good teammates. These two also provide slow pivoting support to Rotom-W. Similarly, hazard setters such as Garchomp, Ting-Lu, and Clodsire are good teammates, as Rotom-W can take advantage of chipped foes such as Garchomp and RegenVest users such as Meloetta, Goodra, and Hisuian Goodra. Rotom-W struggles a lot against specially defensive walls such as Goodra, Meloetta, and Hisuian Goodra, so threats to them in physical attackers such as Chien-Pao, Slither Wing, and Galarian Zapdos are good teammates, with the latter two also forming a good VoltTurn core with Rotom-W to put pressure on each other's checks.</p>"
      },
      "Nasty Plot": {},
      "Defensive": {}
    },
    "credits": {"writtenBy": [{"username": "Frozoid", "user_id": 532881}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Azelf": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Thanks to Azelf's great Speed tier, expansive movepool, and extremely spammable STAB move under Psychic Surge in Expanding Force, it is one of AAA's most dangerous offensive pivots and cleaners. U-turn allows Azelf to generate momentum for its team while also providing solid damage into Pokemon like Roaring Moon and Chien-Pao as well as pivoting on RegenVest users like Swampert and Hisuian Goodra. The final two moveslots are very flexible. Knock Off debilitates switch-ins like Swampert, Manaphy, and Hisiuan Goodra. Dazzling Gleam threatens to OHKO offensive Roaring Moon and does good damage to Mandibuzz and Chien-Pao, while Flamethrower allows Azelf to still hit the latter while having coverage into Corviknight and non-Well-Baked Body Gholdengo. Trick can punish switch-ins like Hisuian Goodra and Manaphy while also debilitating other walls like Deoxys-D, but it makes Azelf a less reliable form of Speed control. Defensive pivots like Corviknight and Swampert give Azelf a Pokemon to fall back on and a slow pivot to get it in safely, while offensive pivots like Barraskewda and Roaring Moon appreciate Azelf setting up Psychic Terrain to get rid of their weakness to priority moves. Depending on its coverage, Azelf can struggle breaking through Steel- and Dark-type Pokemon like Hisuian Goodra and Mandibuzz as well as bulky special walls like Swampert and the rare Blissey, so wallbreakers like Great Tusk and Galarian Zapdos make excellent partners, as they can deal with these Pokemon, and the former also removes entry hazards Azelf can struggle against. Other offensive Pokemon that are weak to priority moves like Ogerpon-W, Roaring Moon, and Chien-Pao also make excellent partners with Azelf due to the Psychic Terrain it sets up.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Bella", "user_id": 567483}], "teams": [{"name": "Quality checked by", "members": [{"username": "Slither Wing", "user_id": 603931}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Heatran": {
    "sets": {
      "Desolate Land": {
        "description": "<p>Heatran's useful typing and high natural Special Attack make it an effective Stealth Rock setter capable of dissuading common entry hazard removers like Corviknight and Great Tusk from switching in. Desolate Land allows Heatran to soft check opposing Water-types such as offensive Manaphy and users of Primordial Sea like Zapdos, Walking Wake, and Ogerpon-W while also amplifying the power of Magma Storm. Solar Beam allows Heatran to 2HKO opposing RegenVest Swampert, which would otherwise easily switch into it. Will-O-Wisp allows Heatran to incapacitate opposing physical attackers like Roaring Moon, Dragonite, and Iron Boulder that may otherwise be willing to switch into it. Alternatively, Earth Power can hit opposing Heatran, Iron Moth, and Well-Baked Body Gholdengo, while Power Gem can hit opposing Primordial Sea Zapdos and Well-Baked Body Mandibuzz. 60 Speed EVs allow Heatran to outspeed uninvested Gholdengo, with the remaining EVs maximizing its special bulk to better check Pokemon like Azelf and Deoxys-S. Heatran struggles to offensively break through opposing specially defensive Pokemon such as RegenVest Manaphy and Swampert, so physically offensive wallbreakers like Roaring Moon and Chien-Pao are good teammates; in return, Heatran can keep up Stealth Rock in front of entry hazard removers like Corviknight. Heatran's 4x Ground weakness mandates teammates like Corviknight and Zapdos that can answer opposing Ground-types like Great Tusk. Pokemon using Primordial Sea such as Zapdos and Ogerpon-W can switch into and threaten Heatran, so teammates that can check these Pokemon such as Swampert and Dragonite are useful.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "abriel", "user_id": 473082}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic", "user_id": 552227}, {"username": "Slither Wing", "user_id": 603931}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Cresselia": {"sets": {"Unaware": {}}},
  "Manaphy": {
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Manaphy's good natural bulk and bevy of utility moves let it serve as a great blanket special switch-in and bring in teammates with a slow U-turn. Scald's burn chance looms over physical attackers looking to take advantage of Manaphy's lower physical bulk. Knock Off is used to remove key items like Heavy-Duty Boots and Assault Vest from potential switch-ins like Swampert, Corviknight, and Desolate Land Gouging Fire. Ice Beam dissuades Roaring Moon and Dragonite from setting up on Manaphy. Energy Ball is optionally usable to hit Swampert and opposing Manaphy. Manaphy is excellent at switching into attacks from Heatran, Gholdengo, and Walking Wake, utilizing a slow U-turn to bring in strong but frail wallbreakers like Chien-Pao and Iron Boulder. Great Tusk is a good partner, being immune to the Electric-type attacks Manaphy is weak to, doubling as a top tier entry hazard remover, switching into Knock Off attempts from the likes of Roaring Moon and Mandibuzz. Manaphy should be aware of Knock Off, as it is heavily reliant on Assault Vest to provide defensive value. Manaphy can be overwhelmed by teams with multiple special wallbreakers like Deoxys-S, Hisuian Electrode, Azelf, and Walking Wake, so it should be run either with a secondary special wall or on more offensive teams that limit opposing wallbreakers. Investing in Defense is also an option, allowing Manaphy to switch into threats like Chien-Pao, Barraskewda, and Cinderace and pivot out while using Assault Vest to function as a mixed wall.</p>"
      },
      "Tail Glow": {
        "description": "<p>Manaphy is a potent late-game sweeper and wallbreaker with the combination of Tail Glow's immediate power boost, its good bulk, and its decent speed to overwhelm foes. It can use either Protosynthesis to restrict foes' ability to revenge kill it or Primordial Sea to help with wallbreaking and give it more switch-in opportunities. Scald is used as its main STAB move but can be substituted for Weather Ball on Primordial Sea sets as a stronger STAB move and a way to hit incoming Desolate Land Pokemon like Ceruledge and Heatran. Ice Beam helps deal with Dragon-types like Latios, Roaring Moon, and Dragonite. Energy Ball helps with taking on Water-types likes Swampert, Primarina, and opposing Manaphy. Finally, Tail Glow-boosted Psychic OHKOes Iron Moth and Toxapex and 2HKOes Desolate Land Ceruledge. Manaphy appreciates pivots such as Corviknight, Mandibuzz, and Deoxys-D that have the ability to safely get it onto the field to let it clean up games much easier and help it get through its sweep by providing entry hazard control. Manaphy is also able to help these pivots by providing offensive pressure and being able to end games for them. Manaphy struggles to deal with specially bulky walls such as Blissey, Hisuian Goodra, and Unaware Deoxys-D, so it partners up well with Pokemon like Galarian Zapdos, Roaring Moon, and Latios to help deal with them and pressure them into more unfavorable positions. Manaphy also works well on hyper offense teams if using Protosynthesis due to Booster Energy being single-use; on these teams, it likes to be supported by other special wallbreakers such as Latios, Gholdengo, and Azelf that can help to wear down specially bulky checks for Manaphy like Blissey, Iron Moth, and Ceruledge.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Hiusi guy", "user_id": 603640}, {"username": "olivia7", "user_id": 620359}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "LordBox", "user_id": 611238}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Samurott-Hisui": {
    "outdated": true,
    "sets": {
      "Choice Band": {
        "description": "<p>Hisuian Samurott is a decent wallbreaker due to Adaptability, Choice Band, and a great STAB combination that also pressures the ever-present Corviknight to choose between recovery and Defogging. Ceaseless Edge is a versatile move that deals good damage to foes while also setting up Spikes, helping Hisuian Samurott's teammates or even itself to pick off chipped foes later in the game. Knock Off provides utility by removing items from switch-ins such as Corviknight and Quaquaval. Sucker Punch is a good priority move that lets Hisuian Samurott deal heavy damage to faster foes such as Cinderace, Iron Moth, and Zapdos. Brick Break can be used instead to deal with dual screens leads such as Corviknight and Mew. Hisuian Samurott's ability to set up Spikes and pester defensive Pokemon such as Corviknight and Scream Tail by removing their items is appreciated by various offensive teammates such as Chien-Pao and Galarian Zapdos that can take advantage of chipped foes. Fluffy and Intimidate Quaquaval wall Hisuian Samurott very easily, so spinblockers such as Desolate Land Skeledirge and Ceruledge are good partners as they can pressure Quaquaval and block it from removing Spikes set by Hisuian Samurott. Hisuian Samurott is susceptible to getting revenge killed due to low Speed and bulk, so robust walls such as Corviknight and Meloetta that can pivot and provide safe switch in opportunities to it are appreciated.</p>"
      },
      "Swords Dance": {"description": "<p>After a Swords Dance boost, Hisuian Samurott becomes a terrifying wallbreaker that can dent physically defensive walls like Corviknight. Sucker Punch acts as speed control against Pokemon like Zapdos and Iron Moth. Ceaseless Edge forces defensive Pokemon, such as Corviknight, to switch in and choose between entry hazard removal or healing. Black Glasses is the item of choice, boosting its Dark-type moves without the recoil of Life Orb. Pokemon like Thundurus and Iron Moth are very useful teammates, as they compensate for Hisuian Samurott's average Speed tier and can heavily damage physical walls that counter Hisuian Samurott like Quaquaval and Zamazenta-C. In return, Hisuian Samurott wears down special walls with its ability to set up a layer of Spikes. Additionally, due to its unimpressive bulk, Hisuian Samurott relies on walls such as Corviknight and Hisuian Goodra to compensate for the lack of defensive utility it brings.</p>"}
    },
    "credits": {"writtenBy": [{"username": "Frozoid", "user_id": 532881}, {"username": "LOrd Fernado", "user_id": 629794}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Atha", "user_id": 450411}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Lilligant-Hisui": {"outdated": true, "sets": {"Fluffy": {}, "Sword of Ruin": {}}},
  "Haxorus": {"outdated": true, "sets": {"Protean": {}}},
  "Mandibuzz": {
    "sets": {
      "Physically Defensive": {},
      "Volt Absorb": {
        "outdated": true,
        "description": "<p>Volt Absorb Mandibuzz acts as an excellent special wall, checking some of the tier's best pivots like Zapdos, Sandy Shocks, and Azelf. Knock Off cripples switch-ins like Corviknight and Great Tusk, while U-turn allows it to pivot out after switching into the aforementioned threats. Defog further increases Mandibuzz's utility by removing entry hazards, allowing teammates like Chien-Pao and Barraskewda to switch in safely, while Toxic cripples its switch-ins like Great Tusk and Garchomp. A Sassy nature and 0 Speed IVs allow Mandibuzz to pivot out as slowly as possible. Mandibuzz's defensive utility and slow pivoting is appreciated by wallbreakers and pivots like Chien-Pao, Dragonite, and Meowscarada. Mandibuzz also appreciates teammates like Scream Tail and Corviknight that can switch into Knock Off and handle threats like Chien-Pao and Galarian Zapdos. In return, Mandibuzz can check Pokemon that threaten these teammates such as Sandy Shocks and Hisuian Electrode. Mandibuzz is prone to getting worn down quickly by special threats like Walking Wake and Iron Moth, making other specially defensive teammates like Empoleon and RegenVest Manaphy good partners.</p>"
      }
    }
  },
  "Hydreigon": {
    "outdated": true,
    "sets": {
      "Nasty Plot": {},
      "The Clicker (Choice Specs)": {
        "description": "<p>Utilizing its high Special Attack, Beads of Ruin, powerful STAB attacks, and solid coverage options, Hydreigon is a formidable wallbreaker that can tear down the tiers most robust special walls like Hisuian Goodra, Meloetta, and Blissey over the course of a game. Focus Blast is a powerful option to muscle past Hisuian Goodra, Blissey and Zamazenta-C. U-turn allows Hydreigon to provide additional utility as a pivot, ease prediction, and maintain momentum against switch-ins like Blissey and Diancie, while Flash Cannon serves as an option to handle the Fairy-type switch-ins like Enamorus-T and Diancie that Hydreigon would otherwise struggle to beat. Hydreigon has unimpressive Speed and can be revenge killed quite easily by threats such as Slither Wing, Chien-Pao, and Pixilate Scream Tail, so walls that can handle these like RegenVest users, Corviknight, and Quaquaval are appreciated, with the latter two being able to pivot Hydreigon in. Powerful physical wallbreakers like Galarian Zapdos and Slither Wing are appreciated, forming a potent VoltTurn core with Hydreigon if it opts for U-turn, handling the special walls that Hydreigon can struggle against, and pivoting in Hydreigon to break the physical walls they may struggle with.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "Tranquility", "user_id": 475288}, {"username": "KarpeChan", "user_id": 536333}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Volcarona": {
    "sets": {
      "Quiver Dance": {
        "description": "<p>Volcarona serves as a ferocious wallbreaker found on hyper offense teams, capable of denting large holes into specially defensive walls like Blissey and RegenVest Hisuian Goodra, allowing itself or its teammates to clean up late-game. Giga Drain chunks bulky Water-types like Swampert and Manaphy, while Psychic provides neutral coverage against foes that resist Fire- and Bug-type moves like Primordial Sea Zapdos and Ceruledge, and Bug Buzz acts as a more reliable secondary STAB move, sniping targets like Walking Wake and RegenVest Meloetta. While Sheer Force grants Volcarona stupefying levels of power, notably threatening an OHKO with Psychic against Zapdos, Turboblaze lets it melt Well-Baked Body Steel-types like Corviknight and Gholdengo into liquid metal. Life Orb is the preferred item, since Volcarona wants as much power as possible; however, Heavy-Duty Boots improves its longevity by allowing it to come in multiple times in a game without fear of being worn down by entry hazards. Teammates that appreciate Volcarona's wallbreaking capabilities like Walking Wake and Tail Glow Manaphy should be paired with it to clean up late-game. Offensive Bulk Up Great Tusk is an excellent partner for Volcarona on hyper offensive teams, notably clearing hazards that impede Volcarona's wallbreaking ability. Dual screens setters like Corviknight and Deoxys-S are great partners for Volcarona, allowing it to safely set up with Quiver Dance and survive a hit in a pinch. Revenge killers like Dragonite, Choice Band Barraskewda, and non-Dragon's Maw Choice Scarf Walking Wake threaten Volcarona, so having a teammate that can use them as setup fodder like Cresselia or Dragon Dance Roaring Moon is recommended.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Slither Wing", "user_id": 603931}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Thundurus": {
    "outdated": true,
    "sets": {
      "Nasty Plot": {
        "description": "<p>Thundurus's excellent Special Attack, good Speed and coverage, and access to Nasty Plot allow it to function as a great wallbreaker. Focus Blast threatens RegenVest Roaring Moon, Hisuian Goodra, and Volt Absorb Empoleon. Psychic threatens Kommo-o, Great Tusk, and Iron Moth, while Sludge Bomb threatens Scream Tail. Sheer Force offers more power, letting Thundurus OHKO Garganacl with Focus Blast. Magic Guard lets Thundurus avoid chip damage and lets Sludge Bomb potentially poison switch-ins such as Kommo-o, specially defensive Garchomp, and Volt Absorb Mandibuzz; however, the drop in power significantly compromises its ability as a wallbreaker in exchange for utility. Fast cleaners like Meowscarada and Roaring Moon appreciate Thundurus being able to pressure their walls like Corviknight and Great Tusk, opening up the way for them to sweep late-game. Thundurus appreciates entry hazard support from the likes of Empoleon, Garchomp, and Sandy Shocks, as the chip damage from hazards allows Thundurus to secure OHKOs against Pokemon such as Hisuian Goodra and specially defensive Garchomp after a Nasty Plot, as well as Kommo-o, Iron Moth, and Volt Absorb Empoleon. Thundurus's poor bulk means it's OHKOed by most Pokemon faster than it, so walls such as Corviknight and Manaphy that can take hits for it and pivot it in are appreciated. Thundurus is prone to being worn down by Stealth Rock if not running Magic Guard, so entry hazard removers such as Great Tusk and the aforementioned Corviknight are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "Clouds", "user_id": 356215}]}]}
  },
  "Thundurus-Therian": {
    "outdated": true,
    "sets": {
      "Nasty Plot": {
        "description": "<p>A sky-high Special Attack stat combined with powerful coverage moves boosted by Sheer Force and access to Nasty Plot makes Thundurus-T a dangerous wallbreaker, able to threaten many common special walls such as Empoleon, RegenVest Manaphy, and Roaring Moon. Focus Blast threatens an OHKO on Volt Absorb Empoleon and a 2HKO on Blissey, RegenVest Roaring Moon, and Hisuian Goodra. Psychic threatens an OHKO on Kommo-o, Great Tusk, and Iron Moth. Fast cleaners like Azelf and Hisuian Electrode appreciate Thundurus-T being able to pressure their walls like Empoleon and Hisuian Goodra, respectively, opening up the way for them to sweep late-game. Thundurus-T appreciates entry hazard support from the likes of Kommo-o, Garchomp, and Sandy Shocks letting it more reliably OHKO specially defensive Garchomp and Hisuian Goodra after a Nasty Plot. Thundurus-T is prone to being chipped down by Stealth Rock and put in KO range of strong priority moves from threats like Dragonite and Ceruledge, so hazard removers like Great Tusk and Corviknight are appreciated. Thundurus-T is also easily revenge killed by most Pokemon that are faster than it like Chien-Pao and Meowscarada due to its low bulk and middling Speed, so walls such as Manaphy and the aforementioned Corviknight that can take a hit for it and safely pivot it in are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Landorus": {"outdated": true, "sets": {"Sheer Force": {}, "Desolate Land": {}}},
  "Landorus-Therian": {
    "outdated": true,
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Landorus-T is a specially defensive pivot with respectable offensive power to boot. Earthquake is its main STAB move, threatening offensive Steel- and Fire-types like Heatran and Iron Moth that fail to OHKO Landorus-T. U-turn allows Landorus-T to gain momentum and switch out, giving powerful-but-frail attackers like Chien-Pao and Iron Moth the ability to switch in for free. Rock Tomb and Sludge Bomb are used to whittle down Earth Eater Fire-types like Skeledirge and defensive Fairy-types like Scream Tail, respectively, with Rock Tomb being able to heavily damage Zapdos. Alternatively, Smack Down can be used to threaten switch-ins like Corviknight, (add comma) while Sandsear Storm can burn pivots like Garchomp. A Sassy nature with 0 Speed IVs lets Landorus-T underspeed defensive pivots like Garchomp, Scream Tail, and non-minimum Speed Corviknight with U-turn. RegenVest Landorus-T can form a powerful defensive VoltTurn core with physically defensive pivots like Corviknight and Iron Treads. Additionally, fast revenge killers and late-game sweepers like Chien-Pao and Hisuian Electrode benefit from slow pivots that can get them on the field without having to absorb an attack themselves. Due to its typing, Landorus-T does not act as an adequate switch-in to Water-type attackers like Volcanion; Water-resistant teammates like Dondozo and Water Absorb Iron Treads help mitigate this weakness.</p>"
      },
      "Fluffy": {
        "description": "<p>Fluffy makes Landorus-T a decent defensive pivot that can take hits from physical attackers such as Slither Wing, Kingambit, and Ursaluna. Stealth Rock + Smack Down makes Landorus-T a decent entry hazard setter against Corviknight, the most common hazard removal option; Smack Down also ensures that Talonflame can't use Landorus-T as setup fodder. Taunt can also be used to deny recovery to Corviknight and Scream Tail and setup opportunities to foes, such as Talonflame and Roaring Moon. Landorus-T best fits on balance and bulky offense teams, where it can provide defensive support against the aforementioned physical attackers. Common defensive Pokemon such as Corviknight, Hisuian Goodra, and Scream Tail are good teammates that can switch into Pokemon that threaten Landorus-T, such as Chien-Pao, Zapdos, and Quaquaval; Scream Tail can also provide Wish support. Landorus-T struggles to beat offensive Pokemon one-on-one, but its ability to safely pivot into teammates benefits fast offensive Pokemon such as Iron Moth, Greninja, and Chien-Pao.</p>"
      },
      "Well-Baked Body": {
        "description": "<p>With an added immunity to Fire, Landorus-T becomes a fantastic check to many of the Fire-types in the tier such as Cinderace, Ceruledge, and Iron Moth that also doubles as an entry hazards setter and a pivot. It differentiates itself from Garchomp as a Fire-type answer with its immunity to Will-O-Wisp as well as access to U-turn and Smack Down, allowing it to generate momentum and pressure Corviknight and other Flying-types. It can further capitalize on this added offensive presence with Swords Dance, especially if it has activated Well-Baked Body beforehand. Alternatively, running Hammer Arm over Smack Down allows it to still beat Earth Eater Heatran by itself and potentially hit Earth Eater Iron Treads hard on the switch. As a Fire-type answer, it makes a fantastic partner for Corviknight, which also appreciates its Fighting resistance to help against Pokemon like Slither Wing and in turn can handle many strong wallbreakers such as Roaring Moon and Chien-Pao that Landorus-T lacks the bulk and recovery to answer. Landorus-T also benefits RegenVest Pokemon such as Hisuian Goodra and Meloetta by preventing them from getting overwhelmed by strong Fire-type attacks and, in the case of Hisuian Goodra, helping against Ground-types such as Sandy Shocks and Landorus, while in return they handle the many special attackers in the tier. Water-immune partners, such as Desolate Land Heatran and Ceruledge, make good teammates for Landorus-T as well. Frail wallbreakers such as Chien-Pao and Cinderace also benefit from its pivoting ability to enter the battlefield safely as well as the hazards its sets to wear down their checks.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}, {"username": "Don Vascus", "user_id": 322272}, {"username": "Frozoid", "user_id": 532881}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "UT", "user_id": 523866}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Meloetta": {
    "sets": {
      "RegenVest": {
        "description": "<p>RegenVest Meloetta is a capable pivot thanks to its ability to switch into most special attackers like Gholdengo, Walking Wake, Deoxys-S, and Iron Moth. Knock Off gives Meloetta an option to support its teammates by removing key items such as Assault Vest from Swampert and Hisuian Goodra, while Thunderbolt hits Manaphy and non-Volt Absorb Corviknight for high damage. Low Kick lets Meloetta chip Hisuian Goodra and Heatran, but Energy Ball can be used instead to 2HKO Swampert after its Assault Vest has been removed. Good teammates include Pokemon like Roaring Moon, Galarian Zapdos, Barraskewda, Chien-Pao, and Ceruledge because Meloetta can safely get them into the field with a slow U-turn. Physical attackers like Roaring Moon and Chien-Pao naturally threaten Meloetta out, so Pokemon that can deal with them, like Corviknight, Great Tusk, and defensive Quaquaval, make for good partners. Lastly, Meloetta appreciates entry hazard removal from the likes of Corviknight, Great Tusk, and Mandibuzz, to keep its HP high enough to switch into strong attackers.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "corvere", "user_id": 306317}], "teams": [{"name": "Quality checked by", "members": [{"username": "Slither Wing", "user_id": 603931}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Chesnaught": {"outdated": true, "sets": {"Triage": {}, "Well-Baked Body": {}}},
  "Greninja": {
    "outdated": true,
    "sets": {
      "Choice Specs": {
        "description": "<p>Choice Specs Greninja is a powerful offensive threat and pivot that uses its rain-boosted attacks to break past most neutral foes. Dark Pulse helps deal with common Desolate Land users like Iron Moth and Cinderace. Ice Beam provides coverage against Dragon-types like Goodra and Roaring Moon, while Surf lets Greninja clean up weakened teams without relying on the low PP and accuracy of Hydro Pump. U-turn lets Greninja switch out from its checks while still maintaining momentum, forming a VoltTurn core with physical wallbreakers like Galarian Zapdos and Cinderace that can threaten the specially defensive Pokemon that wall Greninja like Blissey and Hisuian Goodra. Greninja pairs well with entry hazard setters such as Ting-Lu and Garchomp, which can help it wear down its checks. Greninja also appreciates hazard removal from Pokemon like Corviknight and Iron Treads to avoid getting worn down when switching in; these two Pokemon can also pivot in Greninja.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Talonflame": {
    "outdated": true,
    "sets": {
      "Magic Guard": {
        "description": "<p>Talonflame is a fast late-game sweeper that uses its good Speed tier, powerful Brave Bird, and bevy of utility options to pick and choose its counters. With Swords Dance, it's able to set up and clean up games while being able to and take on pokemon Pokemon that would normally take its Brave Bird like Corviknight, physically defensive Manaphy, and Ogerpon-C, while Flare Blitz can be used as a way to break through other foes that would otherwise take on its Brave Bird such as Fluffy Zapdos and Heatran. Taunt allows Talonflame to set up on Pokemon with Unaware that would usually slow it down or wall it with healing like Blissey, Scream Tail, and Cresselia, while Will-O-Wisp can be used to cripple switch-ins, support teammates, and wear down checks to Talonflame like Garganacl, Primordial Sea Zapdos, and Garchomp. Pivots such as Corviknight, Barraskewda, and Manaphy like being able to pivot into Talonflame for it to set up a sweep or to take down certain threats and walls for them like Ogerpon-H, Ogerpon-W, and Kommo-o. Talonflame is forced out by Pokemon that are faster than it or have strong priority such as Barraskewda, Chien-Pao, Dragonite, and Choice Scarf Azelf, which can be taken on with teammates like Corviknight, Scream Tail, and Gholdengo.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Hiusi guy", "user_id": 603640}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic", "user_id": 552227}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "Gangsta Spongebob", "user_id": 535530}, {"username": "autumn", "user_id": 384270}]}]}
  },
  "Florges": {"outdated": true, "sets": {"Defensive": {}}},
  "Sylveon": {"outdated": true, "sets": {"Unaware": {}}},
  "Hawlucha": {"outdated": true, "sets": {"Magic Guard": {}}},
  "Goodra": {
    "outdated": true,
    "sets": {
      "RegenVest": {
        "description": "<p>Goodra serves as a solid special wall, leveraging its massive bulk and pure Dragon typing to properly check dangerous threats like Hadron Engine Sandy Shocks, and Sheer Force Thundurus and Gengar its Hisuian counterpart falters against. Knock Off provides utility and a reliable way to threaten Ghost-types like Gholdengo and Gengar, and Dragon Tail enables Goodra to accumulate chip damage and force out threatening setup sweepers like Volcarona and Manaphy. Draco Meteor provides a powerful neutral STAB move, Ice Beam allows Goodra to better threaten Zapdos and both Thundurus formes, and Scald provides an option to spread chip damage and potential burns to dissuade switch-ins. Thunderbolt allows Goodra to threaten Corviknight directly, while Earthquake allows it to OHKO Iron Moth and Heatran. Goodra suffers from having low physical bulk, meaning physically defensive teammates like Corviknight and Intimidate Quaquaval are recommended to handle them; these teammates also provide entry hazard removal, which is greatly beneficial for its survivability. Goodra also fails to check Walking Wake and Enamorus-T as a special wall, meaning it pairs well with teammates like Empoleon and Well-Baked Body or Earth Eater Gholdengo to handle these threats.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "LordBox", "user_id": 611238}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Kinetic", "user_id": 552227}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Goodra-Hisui": {"sets": {"RegenVest": {}}},
  "Diancie": {"outdated": true, "sets": {"Defensive": {}, "Triage": {}}},
  "Hoopa": {
    "outdated": true,
    "sets": {
      "Special Wallbreaker": {
        "description": "<p>Hoopa is a passable wallbreaker that fits on offensive teams, particularly when paired with Sticky Web support from Masquerain and Spidops and teammates that can pivot it in safely. Psyshock allows Hoopa to hit special walls like Blissey on their weaker physical bulk, while Knock Off cripples RegenVest users like Alolan Muk and Meloetta that can otherwise take a hit and threaten a KO or pivot out to a faster offensive threat like Chien-Pao. Focus Blast 2HKOes Hisuian Goodra and KOes Kingambit that would attempt to switch in. Defensive pivots that can take a hit and pivot out like Corviknight and Meloetta can get Hoopa in safely. Dual screens setters like Prankster Corviknight and Mew also make for a good partner, as they allow Hoopa to have an easier time setting up with Nasty Plot or tank a hit in a pinch and retaliate. Offensive pivots like Slither Wing and Galarian Zapdos pair well with Hoopa with their ability to bait in and pivot out on checks like Corviknight and defensive Zapdos, allowing Hoopa to set up and threaten a KO; faster offensive threats like Chien-Pao and Barraskewda also pair well with it by making up for its lackluster Speed while Hoopa threatens out their checks like defensive Quaquaval.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Volcanion": {
    "outdated": true,
    "sets": {
      "Primordial Sea": {
        "description": "<p>Primordial Sea Volcanion excels as a fantastic wallbreaker with its great Special Attack and offensive typing. Rain-boosted Steam Eruption combined with Choice Specs allows Volcanion to 2HKO most Pokemon in tier, including most specially defensive walls such as RegenVest Garchomp, Meloetta, and Alolan Muk. Weather Ball dissuades promient Desolate Land users that might want to switch in to Volcanion such as Cinderace and Iron Moth. Earth Power is a more reliable way to deal with Desolate Land users like Iron Moth and Heatran, and it's a reliable way to hit Hisuian Goodra without missing. Focus Blast 2HKOes a would-be check in RegenVest Roaring Moon, as well as Hisuian Goodra after Spikes chip. Volcanion pairs well with entry hazard setters like Ting-Lu and Garchomp, which help wear down common RegenVest Pokemon like Goodra and Hisuian Goodra, and hazards also guarantee a 2HKO on Meloetta. Due to Volcanion's Stealth Rock weakness it pairs well with hazard removers like Corviknight and Quaquaval, which can also help pivot it in safely. Volcanion also pairs well with offensive pivots like Zapdos and Roaring Moon, which can help bring it in on targets like Corviknight.</p>"
      },
      "Magic Guard": {
        "description": "<p>Magic Guard Volcanion serves as a great mixed wallbreaker with a typing that also offers defensive utility. Flare Blitz is notably able to 2HKO RegenVest users like Hisuian Goodra and Meloetta, and Steam Eruption's burn chance deters would-be switch-ins like defensive Quaquaval and Garchomp. Earth Power reliably threatens Toxapex and Desolate Land users such as Iron Moth, Skeledirge, and Cinderace. Taunt can be used to hinder defensive walls with recovery such as Scream Tail and Quaquaval, while Will-O-Wisp is able to reliably burn switch-ins like defensive Quaquaval and Garchomp. Flame Charge is also a niche option to outspeed common revenge killers to Volcanion like Zapdos, Hisuian Arcanine, and Choice Band Galarian Zapdos. Magic Guard helps Volcanion with its weakness to entry hazards while also negating recoil from Flare Blitz and Life Orb. Offensive pivots such as Slither Wing and Iron Moth can bring Volcanion in against defensive cores featuring staples like Intimidate Corviknight and RegenVest users. Fast late-game cleaners like Chien-Pao and Regieleki also appreciate Volcanion's ability to weaken defensive checks like Quaquaval and common RegenVest users, which can allow them to take over games, while also providing speed control against faster threats to Volcanion like Zapdos, Hisuian Electrode, and Roaring Moon. Volcanion's susceptibility to being revenge killed by aformetioned threats makes defensive partners such as Corviknight and Meloetta essential, as they can tank hits and also help pivot to bring in Volcanion safely. Despite being immune to hazards, Volcanion still lacks recovery, so a teammate that can grant it longevity like Wish Scream Tail is also appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Slither Wing", "user_id": 603931}, {"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "LordBox", "user_id": 611238}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Decidueye": {"outdated": true, "sets": {"Defensive": {}}},
  "Lycanroc": {"outdated": true, "sets": {"Rocky Payload": {}}},
  "Toxapex": {
    "outdated": true,
    "sets": {
      "Physically Defensive": {
        "description": "<p>Toxapex is a stout physically defensive wall that deters common physical attackers like Galarian Zapdos and Ceruledge. Toxic targets foes that commonly run Heavy-Duty Boots or are Ground immune like Cinderace and Galarian Zapdos, while Toxic Spikes provides excellent team support; Corrosion variants should always run Toxic to punish common switch-ins like Corviknight and Hisuian Goodra that otherwise might use Toxapex as free recovery. Prankster + Haze, on the other hand, is an excellent tool to frustrate hyper offense teams and stop dangerous setup sweepers like Chien-Pao, Polteageist, and Chesnaught. While the consistent recovery of Black Sludge is generally preferred, Rocky Helmet allows Toxapex to annoy non-Magic Guard Galarian Zapdos and Chien-Pao even when it is forced to use Recover. Toxapex is utterly unable to threaten most Magic Guard users, like Galarian Zapdos and especially Water-resistant ones like Hisuian Electrode and Quaquaval, so reliable checks to them like Hisuian Goodra and Fluffy Corviknight are recommended. Toxic Spikes variants appreciate spinners like Iron Treads, as they can provide entry hazard removal without removing Toxic Spikes as well. Toxapex can easily be overwhelmed by multiple attackers, so it should always have a secondary physically defensive teammate, especially one that handles Ground-types, like Intimidate Corviknight; this also relieves some of the pressure off of Toxapex of checking pivots without Regenerator.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "UT", "user_id": 523866}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Lumari", "user_id": 232216}]}]}
  },
  "Kommo-o": {
    "sets": {
      "Triage": {},
      "Defensive": {
        "outdated": true,
        "description": "<p>Kommo-o uses its unique typing and excellent bulk to serve as an fantastic physical wall, taking on the likes of Barraskewda, Meowscarada, and Roaring Moon while also taking advantage of the turns it generates by forcing these wallbreakers out to set up Stealth Rock. Body Press chips hazard removal options like Corviknight and Quaquaval, while Dragon Tail forces foes out, quickly racking up entry hazard chip on the opposing team. Iron Defense bolsters Kommo-o's walling capabilities and Body Press's damage output, turning it into a potential late-game wincon. Intimidate Corviknight is a good partner for Kommo-o, taking on the Ice-, Flying-, and Dragon-types that threaten it like Chien-Pao, Galarian Zapdos, and Dragonite, while Kommo-o takes on the Electric- and Fire-types like Hisuian Electrode, Ogerpon-H, and Ceruledge that Corviknight struggles with. Empoleon particularly makes for another good partner with its ability to check Fairy- and Psychic-types like Enamorus-T and Azelf. Offensive pivots like Azelf and Barraskewda appreciate Kommo-o wearing down their checks like Corviknight and Roaring Moon, allowing them to form powerful a VoltTurn core that takes advantage of Kommo-o's Stealth Rock to quickly wear down those checks.</p>"
      },
      "Galvanize": {
        "outdated": true,
        "description": "<p>Galvanize Kommo-o stands out as one of the tier's few mixed attackers while being flexible in its role as a Stealth Rock setter or setup sweeper depending on what its team requires. Boomburst denies Corviknight, Mandibuzz, and Quaquaval from removing hazards by unexpectedly OHKOing them, while Clanging Scales 2HKOes Great Tusk. Close Combat allows Kommo-o to threaten special walls like Hisuian Goodra and Blissey looking to switch into it and tank its special moves freely. With Kommo-o's ability to maintain Stealth Rock, it becomes an extremely effective offensive Stealth Rock setter when running it as its 4th move; alternatively, Clangorous Soul improves its bulk, damage output, and Speed, making it harder to revenge kill and allowing it to clean teams late-game. A Life Orb is preferred on Stealth Rock variants for consistency, while Throat Spray is better for Clangorous Soul variants to reduce the chip taken by Kommo-o while still increasing its damage output. Wallbreakers like Meowscarada and Chien-Pao appreciate Kommo's ability to remove checks like Corviknight and Quaquaval, allowing them to clean up after. Faster offensive pivots like Azelf and Barraskewda appreciate Kommo-o's Stealth Rock when forming a VoltTurn core, which wears down the opposing team quickly, or Kommo-o's ability to clean up with Clangorous Soul after they have heavily chipped the opposing team. Kommo-o requires good defensive pivots like Corviknight and RegenVest Manaphy as teammates, with their ability to switch into revenge killers that threaten Kommo-o like Chien-Pao, Dragonite, and Enamorus-T and pivot out.</p>"
      }
    }
  },
  "Cinderace": {
    "outdated": true,
    "sets": {
      "Swords Dance": {
        "description": "<p>Cinderace's high Attack and Speed combined with great coverage options and Swords Dance turn it into a powerful wallbreaker and cleaner. High Jump Kick threatens Roaring Moon and OHKOes Well-Baked Body Kingambit, while Gunk Shot threatens to cripple switch-ins such as Manaphy, Zapdos, Kommo-o, and physically defensive Garchomp. Life Orb lets High Jump Kick OHKO RegenVest Roaring Moon and lets Gunk Shot 2HKO Primordial Sea Zapdos, while Heavy-Duty Boots increases Cinderace's longevity. Desolate Land lets Cinderace come in on and force out Primordial Sea users like Zapdos if safely pivoted in by a teammate while also letting +2 Life Orb-boosted Pyro Ball OHKO defensive Great Tusk. Sword of Ruin + Heavy-Duty Boots provides more damage on Cinderace's coverage moves at the cost of a worse matchup into Primordial Sea and lowered damage on Pyro Ball. Fast cleaners such as Barraskewda and Dragonite appreciate Cinderace's ability to pressure their walls like Corviknight and Scream Tail, opening up the way for them to sweep late-game. Special pivots like Azelf, Zapdos, and Walking Wake are appreciated, as they can pivot Cinderace in against their switch-ins, such as Empoleon and Hisuian Goodra. Cinderace's frailty means it's easily revenge killed by most Pokemon faster than it like Chien-Pao and Choice Scarf Azelf, so teammates that can take a hit for it and pivot it in such as Corviknight and Manaphy are appreciated. Cinderace is also completely walled by Well-Baked Body Gholdengo, so teammates that can threaten it like Garchomp and Roaring Moon are appreciated.</p>"
      },
      "Utility": {
        "description": "<p>Cinderace is a good utility pivot thanks to its high Speed and great supporting movepool. U-turn lets it pivot out against Well-Baked Body Pokemon like Corviknight, Gholdengo, and Kingambit, as well as Primordial Sea users like Zapdos, Walking Wake, and Manaphy. Court Change punishes opposing teams for setting entry hazards or dual screens. Super Fang can be used instead to chip switch-ins like Kommo-o, Garganacl, and Quaquaval that Cinderace cannot meaningfully damage otherwise. Taunt prevents status moves, entry hazards, and recovery, which can help against foes like Scream Tail, while Will-O-Wisp cripples checks like Garchomp, Kommo-o, and Primordial Sea Zapdos. Cinderace is threatened by Primordial Sea users like Barraskewda, Ogerpon-W, and Walking Wake, which force it out, making walls like defensive Zapdos, Kommo-o, and Empoleon pair well with it. Offensive pivots such as Galarian Zapdos, Meowscarada, and Sandy Shocks pair well with Cinderace, as they form a VoltTurn core with it, being able to pivot it in to threaten walls like Corviknight, Meloetta, Hisuian Goodra. In return, Cinderace can pivot these teammates in to threaten its switch-ins like Kommo-o, Garaganacl, and Quaquaval.</p>"
      },
      "Magic Guard": {
        "description": "<p>Magic Guard Cinderace provides a blend of utility and firepower in a single teamslot; this in combination with its excellent Speed tier lets it serve as either a strong pivot or wallbreaker. Magic Guard allows Cinderace to fire off its strong Flare Blitz and use Life Orb without recoil while negating entry hazard chip damage. High Jump Kick forces out Garganacl and Well-Baked Body Kingambit as well as being the strongest move against neutral targets like Quaquaval and Mandibuzz. U-turn allows Cinderace to pivot out on switch-ins like Well-Baked Body Corviknight and Quaquaval, while Swords Dance changes its role from a pivot to a wallbreaker and late-game cleaner. Gunk Shot further increases its coverage, preying on Fairy-types like Scream Tail and Enamorus-T and threatening switch-ins like Primordial Sea Zapdos and Dragonite, while Will-O-Wisp allows it to cripple its switch-ins like Regenerator Great Tusk and physically defensive Garchomp, and Court Change allows it to control hazards in a pinch. Cinderace's ability to force out Steel-types like Corviknight is greatly appreciated by other physical wallbreakers like Chien-Pao and Galarian Zapdos, which in return can remove Corviknight if it is running Well-Baked Body for Cinderace so it can clean up afterwards. Cinderace is vulnerable to revenge killers like Dragonite, Barraskewda, and Azelf, making walls like Corviknight, defensive Zapdos, and RegenVest Manaphy good partners that can switch into these revenge killers and pivot out. Well-Baked Body Gholdengo completely shuts down Cinderace, so teammates that can remove it like Gengar and offensive Roaring Moon make for great partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic", "user_id": 552227}, {"username": "cat", "user_id": 580765}, {"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Kinetic", "user_id": 552227}, {"username": "LordBox", "user_id": 611238}, {"username": "cat", "user_id": 580765}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Inteleon": {
    "outdated": true,
    "sets": {
      "Primordial Sea": {
        "description": "<p>Inteleon is a strong wallbreaker that fits well on balance and bulky offense teams. U-turn allows it to pivot out on switch-ins like Hisuian Goodra and Blissey while also forming strong VoltTurn cores with other pivots like Galarian Zapdos and Slither Wing that can wear down each other's checks with entry hazards up. Mud Shot allows it to threaten Desolate Land Fire-types like Iron Moth and Cinderace that would otherwise switch into Inteleon freely. Ice Beam allows it to chip specially bulky Dragon-types like RegenVest Roaring Moon and Goodra, while Surf acts as a more reliable option late-game when the opposing team has been heavily chipped or to snipe frailer or slower targets like Azelf and both Zapdos formes. Physical wallbreakers like Chien-Pao and Roaring Moon appreciate Inteleon pivoting into them on its switch-ins like the aforementioned Hisuian Goodra and Blissey as well as Inteleon's ability to threaten physical walls like Corviknight and defensive Quaquaval. Inteleon brings close to no defensive utility bar a Fire-type move immunity, which means that walls like Corviknight and Goodra are a must-have to make up for the lack of defensive utility; these Pokemon also switch into revenge killing attempts from Slither Wing and Regieleki. Inteleon appreciates Spikes support from Pokemon like Garchomp and Ting-Lu that helps it to wear down RegenVest Pokemon like Meloetta and Alolan Muk.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "KarpeChan", "user_id": 536333}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Tranquility", "user_id": 475288}]}]}
  },
  "Corviknight": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Corviknight's unparalleled role compression as a physical wall, entry hazard remover, and slow pivot that doesn't need Regenerator makes it a defensive staple on the majority of teams. Fluffy provides the most protection against wallbreakers like Choice Band Galarian Zapdos, Iron Boulder, and Roaring Moon while not letting Corviknight fall victim to Scrappy Great Tusk, whereas Intimidate provides additional protection against Chien-Pao and Ogerpon-C at the cost of needing a secondary physical check to deal with the aforementioned threats reliably. Brave Bird is Corviknight's strongest neutral move and hits Ghost-types and key targets like Great Tusk and Galarian Zapdos, while Body Press fits well on Intimidate sets to do more damage to Roaring Moon, Ogerpon-C, and Chien-Pao. Corviknight is exceedingly passive, so it needs powerful and fast offensive teammates like Barraskewda and Azelf to re-gain momentum; in exchange, it provides them safe entry with its slow U-turn and entry hazard removal. Slower wallbreakers like Galarian Zapdos and Ceruledge also appreciate Corviknight's slow pivoting services. Corviknight, especially Fluffy variants, needs a teammate like Swampert, Manaphy, or Well-Baked Body Gholdengo to handle the Fire-types it cannot check. Hazard-weak teammates like Chien-Pao and the Ogerpon formes appreciate Corviknight's ability to remove hazards semi-reliably.</p>"
      },
      "Dual Screens": {"description": "<p>Prankster and an excellent defensive typing enable Corviknight to set dual screens multiple times a battle for hyper offense teams. Taunt lets Corviknight prevent opposing Corviknight from removing dual screens with Defog, stop Pokemon like Deoxys-D and Great Tusk from setting entry hazards, and prevent Pokemon like Dragonite and Gholdengo from setting up. U-turn is used to pivot out once dual screens have been set up. Prankster Corviknight should be used with setup sweepers that appreciate dual screens support such as Gouging Fire, Dragonite, Volcarona, and Iron Boulder. Fire-types like Gouging Fire, Iron Moth, and Ceruledge and Electric-types like Zapdos can deal heavy damage to Corviknight, so having Dragon-types that can check them like Roaring Moon, Gouging Fire, and Dragonite is appreciated.</p>"}
    },
    "credits": {"writtenBy": [{"username": "UT", "user_id": 523866}, {"username": "Orangex", "user_id": 594122}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic", "user_id": 552227}, {"username": "Slither Wing", "user_id": 603931}, {"username": "Isaiah", "user_id": 375662}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Drednaw": {"outdated": true, "sets": {"Shell Smash": {}}},
  "Barraskewda": {
    "sets": {
      "Choice Band": {
        "description": "<p>With great offensive stats and a spammable move in Flip Turn, Barraskewda serves as an excellent offensive pivot that's capable of outpacing the majority of the metagame. Close Combat lets it deal with foes that resist its Water-type moves such as Roaring Moon, Ogerpon-W, and Walking Wake, while Aqua Jet lets it pick off weakened foes that normally outspeed it such as Choice Scarf Sandy Shocks and Hisuian Electrode, as well as foes that have set up, such as Volcarona and Great Tusk. Drill Run and Psychic Fangs also threaten Water-resistant foes, with Drill Run OHKOing Desolate Land Fire-types such as Iron Moth, Heatran, and Ceruledge and Psychic Fangs threatening Quaquaval and Kommo-o. Barraskewda takes great advantage of weakened walls such as Corviknight and Deoxys-D, making physical wallbreakers such as Iron Boulder, Galarian Zapdos, and Ceruledge good partners. Specially offensive pivots such as Hisuian Electrode and Azelf form great VoltTurn cores with Barraskewda, since they're able to threaten each other's checks, with Barraskewda forcing out special walls such as Meloetta and Swampert while they threaten physical walls such as Corviknight and Quaquaval in return. Barraskewda is very frail and easily OHKOed by faster foes such as Choice Scarf Roaring Moon and Azelf, which makes defensive pivots such as Corviknight, Mandibuzz, and Swampert necessary. It also struggles a lot with entry hazards, making hazard removers such as Great Tusk and Corviknight appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Slither Wing", "user_id": 603931}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic", "user_id": 552227}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Toxtricity": {"outdated": true, "sets": {"Shift Gear": {}, "Choiced Attacker": {}}},
  "Polteageist": {
    "outdated": true,
    "sets": {
      "Queenly Majesty": {},
      "Fluffy": {},
      "Shell Smash": {
        "outdated": true,
        "description": "<p>Polteageist is a dangerous setup sweeper and cleaner thanks to Shell Smash, Stored Power, and its excellent Special Attack, allowing it to sweep with a single turn of setup. Giga Drain provides coverage for Ting-Lu and Garganacl, Strength Sap gives Polteageist a way to restore its Focus Sash after chip damage and set up on weaker physical attackers, while Substitute allows for safe setup on status-reliant walls like Blissey. Focus Sash the preferred item to safely ensure Polteageist can use Shell Smash. Polteageist can often struggle to get itself onto the field safely, so it appreciates a slow pivot from Corviknight or Shed Tail Cyclizar who can also facilitate Polteageist's setup with screens or a passed Substitute. Polteageist pairs well with physical wallbreakers like Swords Dance Cinderace that can break through opposing walls. Due to its reliance on Focus Sash, Polteageist needs reliable entry hazard removal like Cyclizar and Iron Treads.</p>"
      }
    }
  },
  "Hatterene": {"outdated": true, "sets": {"Triage": {}}},
  "Zamazenta-Crowned": {
    "outdated": true,
    "sets": {
      "IronPress": {
        "description": "<p>Zamazenta-C leverages its high bulk and Speed to be an excellent setup sweeper with Iron Defense + Body Press while also being able to check many of the tier's dangerous offensive threats with its excellent defensive typing. Zamazenta-C can only use Dauntless Shield, which increases its potency as a setup sweeper while boosting Body Press. Stone Edge threatens an OHKO on Iron Moth while 2HKOing Dragonite, Ceruledge, and Primordial Sea Zapdos. Substitute can be used to block status and phazing moves, notably surviving a Scald from defensive Manaphy and a Dragon Tail from Garchomp, as well as pivoting moves from defensive Pokemon such as Corviknight, Empoleon, Mandibuzz, and Manaphy. Special wallbreakers such as Gengar, Azelf, and Walking Wake appreciate Zamazenta-C being able to threaten switch-ins to them such as Empoleon, Hisuian Goodra, and RegenVest Roaring Moon, as well as offensive checks such as Chien-Pao, Roaring Moon, and Ogerpon-C, as the aforementioned teammates are otherwise forced out by the threat of an OHKO; in return, they can remove Zamazenta-C's checks, such as defensive Kommo-o and Zapdos. Zamazenta-C struggles with physically defensive Pokemon that can counter it by setting up on their own, such as Iron Defense Kommo-o and Corviknight, as well as Bulk Up Great Tusk, so teammates that can check them such as Zapdos and Scream Tail are appreciated, with the latter being able to pass Wishes to Zamazenta-C. Zamazenta-C is also weak to entry hazards, so teammates that can remove hazards such as Corviknight and Great Tusk are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Milak", "user_id": 262594}]}]}
  },
  "Zarude": {"outdated": true, "sets": {"Adaptability": {}, "Fluffy": {}}},
  "Regieleki": {
    "outdated": true,
    "sets": {
      "Refrigerate": {
        "description": "<p>An amazing Speed stat combined with Refrigerate earns Regieleki a niche as a spinner that cannot be spinblocked and a pivot that can threaten common Pokemon that block Volt Switch such as Garchomp and Great Tusk. Extreme Speed OHKOes Dragonite and offensive Garchomp and 2HKOes Roaring Moon and offensive Zapdos. Tera Blast 2HKOes defensive Great Tusk and chips defensive Kommo-o and Zapdos, while Thunderbolt can be used to better pressure Corviknight and Ice-resistant foes such as Manaphy, Iron Moth, and Heatran attempting to switch in. Heavy-Duty Boots lets Regieleki ignore the entry hazards it removes, while Never-Melt Ice lets Extreme Speed OHKO Hisuian Electrode and specially defensive Garchomp and lets Tera Blast 2HKO defensive Zapdos. Wallbreakers such as Ceruledge and Ogerpon-H appreciate Regieleki being able to safely pivot them in on Pokemon they threaten such as Iron Moth and Heatran while also removing the entry hazards they're weak to; in return, they can threaten the bulky Pokemon that Regieleki struggles to break through such as Scream Tail, Hisuian Goodra, and Volt Absorb Empoleon. Additionally, Regieleki's ability to outspeed and threaten Choice Scarf Azelf is valuable, as Azelf can OHKO the aforementioned wallbreakers after Stealth Rock chip. Regieleki's poor bulk makes it an unreliable entry hazard remover on its own; therefore it's recommended to pair it with another hazard remover such as Great Tusk, Corviknight, or Mandibuzz, with the latter two forming a VoltTurn core with the momentum they generate from their pivoting moves. Physical pivots such as Barraskewda, Roaring Moon, and Meowscarada are also recommended teammates, as they also create a VoltTurn core, while Regieleki lures in special walls such as Heatran, Meloetta, and Manaphy that they can force out.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Enamorus-Therian": {"sets": {"Triage": {}}},
  "Meowscarada": {
    "outdated": true,
    "sets": {
      "Choice Item": {
        "description": "<p>Meowscarada serves as a strong pivot and revenge killer that leverages its excellent STAB combination to threaten some of the tier's strongest physical walls like Quaquaval, Great Tusk, and Garganacl. U-turn allows Meowscarada to pivot out on its switch-ins like Corviknight and defensive Kommo-o. With Choice Band, Low Kick OHKOes Zamazenta-C on the switch and forces out Hiusian Goodra, Play Rough threatens to OHKO Kommo-o while chipping Sap Sipper Great Tusk, and Lash Out punishes chipped Intimidate Corviknight switching in. Choice Scarf is an option over Choice Band that trades the ability to OHKO defensive Kommo-o and 2HKO Scream Tail and Sap Sipper Great Tusk for being an exceptional Speed control option and having the ability to revenge kill slower Choice Scarf users like Azelf and Roaring Moon, as well as unboosted, naturally faster targets like Barraskewda and Hisuian Electrode. Meowscarada's ability to force out special walls like Hisuian Goodra, RegenVest Manaphy, and Roaring Moon is greatly appreciated by special wallbreakers and pivots like Walking Wake, Iron Moth, and Choice Specs Azelf, which in return force out the physical walls that wall Meowscarada like Corviknight and defensive Zapdos. Meowscarada is vulnerable to revenge killers like Dragonite, Zamazenta-C, and Chien-Pao, so teammates that can switch into these threats like Corviknight and Quaquaval make good partners.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic", "user_id": 552227}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Skeledirge": {
    "outdated": true,
    "sets": {
      "Spinblocker": {
        "description": "<p>Thanks to its typing and good physical bulk, Skeledirge serves as an excellent spinblocker that can wall common spinners such as Iron Treads with Earth Eater and Quaquaval with Desolate Land. It also walls threats like Choice Band Cinderace and Zamazenta-C and, depending on its ability, Garchomp and Primordial Sea Zapdos. Skeledirge can then use Torch Song to set up on passive opponents like Scream Tail and non-Well-Baked Body Blissey or Will-O-Wisp to burn an incoming foe, including switch-ins like Hisuian Goodra and Alolan Muk. Hex alongside Will-O-Wisp does more damage, but Shadow Ball can be used for more consistent damage. Skeledirge pairs well with hazard setters such as Garchomp and Iron Treads, as it allows them to keep their hazards on the field, and they can in turn handle opposing Well-Baked Body Pokemon. Due to its middling Special Defense, Skeledirge appreciates specially defensive teammates like Blissey and Hisuian Goodra. Additionally, a teammate that covers the type that Skeledirge chooses not to be immune to, such as Quaquaval for Earth Eater variants and Corviknight for Desolate Land variants, helps form a strong defensive core. Dark-types like Meowscarada and Chien-Pao also OHKO Skeledirge with a bit of chip damage, so Pokemon like Galarian Zapdos and Slither Wing that can threaten them are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "cat", "user_id": 580765}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Quaquaval": {
    "sets": {
      "Physically Defensive": {},
      "Magic Guard": {},
      "Intimidate": {"outdated": true},
      "Defensive": {
        "outdated": true,
        "description": "<p>Defensive Quaquaval uses its good physical bulk and typing to act as a physically defensive pivot, checking dangerous threats like Kingambit, Chien-Pao, and Hisuian Arcanine. Intimidate allows Quaquaval to weaken foes like Chien-Pao and Cinderace for its teammates, while Fluffy grants better bulk to better check Slither Wing and Roaring Moon. U-turn allows Quaquaval to maintain momentum and allows frailer teammates like Slither Wing and Hydreigon to pivot in safely while Rapid Spin offers role compression by allowing it to remove hazards while having a good matchup against entry hazard setters like Iron Treads and Garchomp. A Relaxed nature and 0 Speed IVs allow it to pivot out as slow as possible. Meloetta is a valuable teammate that can switch in on special threats such as Iron Moth and Zapdos that force Quaquaval out. Physical wallbreakers like Meowscarada and Talonflame have a good type matchup against Quaquaval, hence teammates that can force them out like Zamazenta-C and Regieleki make solid partners.</p>"
      }
    }
  },
  "Spidops": {"outdated": true, "sets": {"Sticky Web Setter": {}}},
  "Pawmot": {"outdated": true, "sets": {"Offensive": {}}},
  "Garganacl": {
    "outdated": true,
    "sets": {
      "Immunity Ability": {},
      "Specially Defensive": {
        "outdated": true,
        "description": "<p>Garganacl finds itself as a Stealth Rock setter that fits on balance and stall teams with its ability to force progress through passive damage and maintain entry hazards by annoying popular hazard removal options with Salt Cure. Toxic Debris allows Garganacl to punish weak physical attacks like U-turn from Corviknight and Meloetta, while Earth Eater allows it to check and set up with Iron Defense or Curse on Ground-types like Iron Treads, Landorus-T, and Garchomp, and Water Absorb allows it to check Greninja, Inteleon, and Quaquaval lacking Close Combat. Stealth Rock pairs well with Salt Cure, as Salt Cure heavily chips common hazard removal options like Iron Treads and Corviknight, while Iron Defense and Curse allow Garganacl to act as a bulky cleaner late-game. Protect allows Garganacl to scout the opponent's move, heal with Leftovers, and force more passive damage on foes, while Earthquake and Body Press hit Magic Guard Pokemon like Quaquaval and Heatran that otherwise switch in freely. Garganacl's inability to check common special wallbreakers like Sheer Force Iron Moth and Enamorus-T makes pivots like Regieleki and Slither Wing and physical wallbreakers like Chien-Pao great partners; in return, they appreciate Garganacl's ability to maintain Stealth Rock on the field and annoy their checks like Hisuian Goodra and Corviknight with Salt Cure. Garganacl gets rapidly worn down by entry hazards when carrying Leftovers, making physically defensive hazard removal options like Corviknight and defensive Quaquaval good partners; these Pokemon also check physical wallbreakers that threaten Garganacl like Galarian Zapdos, while it checks the special wallbreakers that threaten them. The aforementioned Magic Guard Quaquaval checks Garganacl lacking Iron Defense + Body Press and can spin away Garganacl's Stealth Rock; Desolate Land Skeledirge can spinblock Quaquaval effectively, making it a good partner for Garganacl.</p>"
      }
    }
  },
  "Ceruledge": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Swords Dance Ceruledge is one of the tier's most potent wallbreakers and setup sweepers thanks to its high base Attack, great STAB coverage, and Swords Dance. Shadow Sneak picks off weakened foes like Gholdengo and Iron Boulder and OHKOes frailer targets like Sheer Force Deoxys-S, while Close Combat nails potential Dark-type switch-ins like Roaring Moon. Sword of Ruin offers the most all-around damage amplification, while Desolate Land supercharges Bitter Blade and provides a useful immunity to Water; similarly, Life Orb provides extra power, letting Ceruledge achieve feats like OHKOing Deoxys-D, while Heavy-Duty Boots is useful on teams with weak entry hazard removal. Ceruledge can be overwhelmed by Pokemon like Barraskewda, Ogerpon-W, and Psychic Surge Deoxys-S, making defensive Pokemon like Corviknight and Deoxys-D good teammates. Ceruledge's low Speed means that it can easily be outsped by foes, making offensive Pokemon like Choice Scarf Azelf, Dragonite, and Chien-Pao good teammates that help make up for it thanks to their high Speed. Ceruledge's poor defenses and weakness to entry hazards makes slow, hazard-removing pivots like Corviknight and Mandibuzz ideal teammates. Because Ceruledge relies heavily on Poltergeist, it has poor synergy teammates that frequently use Knock Off such as Manaphy and Swampert.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "LordBox", "user_id": 611238}, {"username": "cat", "user_id": 580765}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Kilowattrel": {
    "outdated": true,
    "sets": {
      "Primordial Sea": {
        "description": "<p>Choice Specs Primordial Sea Kilowattrel is an explosive special attacker that takes advantage of Hurricane's and Thunder's accuracy buff in rain to rain down terror on unprepared while also checking Desolate Land users like Iron Moth and Cinderace. Weather Ball is Kilowattrel's best option against Ground-types like Iron Treads and Landorus-T which shrug off its other offensive options while also chipping Desolate Land Heatran and Cinderace. Pivoting partners like Landorus-T and Corviknight pair with Killowattrel to create a potent VoltTurn core, constantly creating momentum to easily bring each other in and deal big damage. Because of its ability to force switches, Kilowattrel appreciates teammates like Garchomp and Scream Tail that can both set entry hazards and mitigate its own frailty by switching in. Additionally, because of its weakness to Stealth Rock and inability to heal itself, hazard removers like Corviknight and Iron Treads are required to prolong its life and maximize the amount of times it can switch in. Finally, RegenVest users like Hisuian Goodra and Meloetta both comfortably shrug off Kilowattrel's attacks, so physically offensive teammates like Slither Wing and Chien-Pao can chip or remove them, escalating Kilowattrel's potency as a sweeper.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "berry", "user_id": 226455}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Brambleghast": {"outdated": true, "sets": {"Physically Defensive": {}}},
  "Tinkaton": {
    "outdated": true,
    "sets": {
      "Well-Baked Body": {},
      "Tinted Lens": {
        "description": "<p>Tinted Lens Tinkaton is a solid physical wallbreaker that provides utility while using Tinted Lens to bypass resistances to Gigaton Hammer, turning the tables on defensive Quaquaval and Corviknight, activating teammates like Choice Band Chien-Pao that are hindered by these Pokemon. Metal Coat can be considered as it grants Tinkaton a boosting option for Gigaton Hammer without recoil, granting good odds of OHKOing frailer offensive Pokemon like Ceruledge and Magic Guard Quaquaval after minor chip. Swords Dance allows Tinkaton to more effectively wallbreak, Knock Off is excellent utility that cripples switch-ins like Magic Guard Heatran and Volcanion while annoying switch-ins like Corviknight and Iron Treads, Stealth Rock allows it to act as an offensive entry hazard setter, Protect allows it to gain more Leftovers recovery on Gigaton Hammer's cooldown turn, and Thunder Wave cripples setup sweepers that may try to capitalize on Gigaton Hammer's cooldown turn. Tinkaton appreciates slow pivots like Corviknight and Meloetta that can live a hit and pivot in Tinkaton safely. Tinkaton also appreciates faster teammates that make up for its lackluster Speed like Roaring Moon and Hisuian Electrode. Entry hazard setters like Garchomp and Ting-Lu pair well with Tinkaton, as it forces numerous switches and removes Heavy-Duty Boots.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "cat", "user_id": 580765}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tranquility", "user_id": 475288}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Palafin": {
    "outdated": true,
    "sets": {
      "Palafin": {
        "description": "<p>Palafin's powerful priority offense and pivoting make it a dangerous threat even with its standard ability. Jet Punch from Palafin-H easily revenge kills dangerous threats like Kilowattrel, Sandy Shocks, and Talonflame, as well as Chien-Pao after minor chip damage. Palafin is heavily hampered by Desolate Land; to take down their users, Zen Headbutt from Palafin-H easily OHKOes Iron Moth and 2HKOes Ceruledge, while Close Combat flings Cinderace into the sun. Pivoting teammates such as Kilowattrel, Meowscarada, and Corviknight not only form dangerous pivoting cores with Palafin, but also position it to both activate Zero to Hero and fire off its powerful Jet Punch. Due to its frequent need to switch and reliance on a recoil move to wallbreak, Palafin requires effective entry hazard removers like Corviknight and Donphan; WishPass Scream Tail is also a great teammate to heal off chip damage. Even with its strong coverage moves, Palafin struggles mightily against opposing Desolate Land, so reliable switch-ins like Well-Baked Body Slither Wing are strongly recommended. Palafin struggles against Dondozo, making teammates that can punish it like Meowscarada and Spikes Garchomp good additions.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "UT", "user_id": 523866}], "teams": [{"name": "Quality checked by", "members": [{"username": "Alexender", "user_id": 313542}, {"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Glimmora": {"outdated": true, "sets": {"Defensive": {}}},
  "Dondozo": {"outdated": true, "sets": {"Curse": {}}},
  "Clodsire": {"outdated": true, "sets": {"Specially Defensive": {}}},
  "Kingambit": {
    "outdated": true,
    "sets": {
      "Immunity Ability": {},
      "Swords Dance": {
        "outdated": true,
        "description": "<p>Swords Dance Kingambit excels as a mid-game wallbreaker that can boost on passive foes and tear through the opponent's team with its Adaptability-boosted STAB attacks. Kowtow Cleave and Iron Head are Kingambit's main attacks, heavily damaging defensive pivots like Corviknight, Hisuian Goodra, Scream Tail, and Garganacl. Sucker Punch lets it predict and punish faster attackers like Quaquaval, Volcarona, and Slither Wing that try and come in to revenge kill. 140 Speed EVs let Kingambit outspeed uninvested Corviknight and Skeledirge. Black Glasses lets Kingambit OHKO Iron Moth with Sucker Punch. Immunity abilities like Well-Baked Body and Earth Eater are options to pick up additional setup chances. Fast endgame sweepers like Chien-Pao, Meowscarada, and Hisuian Electrode benefit from Kingambit's early-game presence, capitalizing on chipped foes and scoring easy KOs. Defensive pivots like Intimidate Corviknight, RegenVest Meloetta, and Fluffy Landorus-T can thwart revenge killers targeting Kingambit and use U-turn to bring it in safely again. Finally, Primordial Sea Zapdos can help Kingambit by forcing Corviknight and Quaquaval, two of its most consistent checks, letting it chip them on their switch-in repeatedly.</p>"
      }
    }
  },
  "Great Tusk": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Great Tusk's gargantuan physical bulk and access to valuable utility moves make it a valuable defensive presence in the metagame, especially since it is the best user of Rapid Spin and one of the few viable forms of entry hazard control. Body Press, when coupled with maximum Defense investment, deals consistent damage to Corviknight, while Ice Spinner can be used to hit Flying-type switch-ins like both Zapdos formes and Dragonite. Knock Off debilitates switch-ins like Corviknight and Zapdos by removing their Leftovers and Heavy-Duty Boots, respectively. Alternatively, Great Tusk can use Stealth Rock if none of its teammates are capable of setting it. Bulk Up can also be considered to increase Great Tusk's offensive presence, but is typically less preferred than other utility options. Scrappy notably prevents Ghost-types like Gholdengo and Pecharunt from spinblocking Great Tusk. Alternatively, Regenerator provides Great Tusk with reliable recovery it otherwise lacks, while Fluffy allows it to better check attackers such as Roaring Moon and allows a teammate like Swampert to use Regenerator instead. Heavy-Duty Boots ensures Great Tusk can more reliably remove entry hazards by avoiding chip damage from them, while Leftovers provides recovery for non-Regenerator sets, and Rocky Helmet can be used to punish attackers that make contact. Offensive Pokemon that appreciate entry hazards off the field such as Azelf and Chien-Pao pair well with Great Tusk's Rapid Spin support. Due to its poor special bulk, Great Tusk appreciates specially bulky Pokemon, such as Heatran, Empoleon, and if not using Regenerator, RegenVest Pokemon such as Manaphy and Swampert. Certain physical wallbreakers such as Chien-Pao and Galarian Zapdos are significant threats to Great Tusk, so it appreciates a secondary physical wall capable of checking these Pokemon such as Corviknight or Skarmory.</p>"
      },
      "Offensive Bulk Up": {
        "description": "<p>Impressive offensive and defensive utility combined with the ability to remove entry hazards cements Great Tusk as a threatening sweeper that also takes on threats like Gouging Fire, Iron Hands, and Roaring Moon. Ice Spinner lets Great Tusk hit Flying-types like Dragonite, Zapdos, and Mandibuzz, while Knock Off instead debilitates defensive switch-ins like Mandibuzz, Fluffy Corviknight, and opposing Great Tusk. Headlong Rush helps deal with Poison-types like Pecharunt and Iron Moth as well as being Great Tusk's best option against Fairy-types like Scream Tail. Scrappy + Rapid Spin grants Great Tusk hazard removal that's not blocked by Ghost-types like Gholdengo and Pecharunt. Scrappy also notably enables Great Tusk to turn Intimidate Corviknight into setup fodder. Hazard-weak Pokemon such as Chien-Pao, Ceruledge, and Ogerpon-H appreciate Great Tusk's role as a spinner; in return, they can help threaten physically defensive checks like Fluffy Corviknight and Deoxys-D, making it easier for it to set up. Due to its mediocre Special Defense, Great Tusk is forced out by common threats such as Azelf, Deoxys-S, and Walking Wake, making specially defensive teammates such as RegenVest Swampert, Meloetta, and Manaphy necessary. Despite its fantastic natural physical bulk, Great Tusk is troubled by certain wallbreakers such as Chien-Pao, Galarian Zapdos, and all Ogerpon formes, making physically defensive teammates such as Intimidate Skarmory, Fluffy Corviknight, and Unaware Deoxys-D greatly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "abriel", "user_id": 473082}, {"username": "Slither Wing", "user_id": 603931}], "teams": [{"name": "Quality checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "cat", "user_id": 580765}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Scream Tail": {
    "sets": {
      "Pixilate": {},
      "Unaware": {
        "description": "<p>Scream Tail uses its good bulk and great typing to be a superb Unaware wall, taking hits from boosted attackers such as Dragonite, Great Tusk, and Tail Glow Manaphy. It can also act as a Wish passer for teammates without reliable healing such as Roaring Moon, non-Regenerator Great Tusk, and Primarina. Calm Mind can be used in order to take on special threats like Zapdos and Deoxys-S, while Thunder Wave is an option to cripple switch-ins like Iron Moth, Gholdengo, and Ceruledge. Offensive Pokemon like Barraskewda, Roaring Moon, and Chien-Pao appreciate Scream Tail being able to take on Pokemon like Iron Hands, Great Tusk, and Dragonite while also providing them with healing. Scream Tail struggles with Ghost-types such as Gholdengo, Gengar, and Ceruledge, so having checks to them like Manaphy, Mandibuzz, and Roaring Moon can help.Teammates like Corviknight and Great Tusk can aid Scream Tail by removing the entry hazards that can wear it down. Finally, Scream Tail appreciates the presence of defensive checks to Chien-Pao, Ogerpon-W, and Iron Boulder such as Manaphy, Mandibuzz, and Corviknight, as it struggles to take them on repeatedly.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Hiusi guy", "user_id": 603640}], "teams": [{"name": "Quality checked by", "members": [{"username": "Slither Wing", "user_id": 603931}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Slither Wing": {
    "sets": {
      "Choice Band": {
        "description": "<p>Slither Wing's massive Attack stat alongside its powerful STAB moves makes it a strong wallbreaker, pivot, and revenge killer, able to threaten common physical walls like Corviknight, Deoxys-D, and Mandibuzz. First Impression lets Slither Wing pick off faster offensive threats like Chien-Pao, Latios, and Roaring Moon. Flare Blitz threatens Fluffy users like Corviknight, Zapdos, and Great Tusk as well as non-Well-Baked Body Gholdengo, while Earthquake threatens Ceruledge, Pecharunt, and non-Earth Eater Gholdengo. Tinted Lens helps Slither Wing revenge kill offensive threats like Dragonite, Zapdos, and Volcarona and boosts the power of U-turn against foes like Great Tusk, while Sword of Ruin lets Slither Wing OHKO Deoxys-D after entry hazard chip damage with U-turn, OHKO Fluffy Corviknight with Flare Blitz, OHKO Gholdengo with Earthquake, and 2HKO Defensive Great Tusk with Close Combat. While more niche, Scrappy lets it OHKO Gholdengo with Close Combat while still 2HKOing Intimidate Corviknight. Fast cleaners like Chien-Pao, Meowscarada, and Iron Boulder appreciate Slither Wing's ability to pressure their walls like Corviknight and Gholdengo, letting them sweep late-game once those walls have been chipped down or removed. Slither Wing's middling speed and only decent bulk leaves it vulnerable to offensive threats that do not fear First Impression like Ceruledge, Dragonite, and Azelf, making checks to them like Great Tusk, Corviknight, and Heatran, respectively, valuable teammates. Slither Wing is also prone to getting worn down by entry hazards, so hazard removers like Mandibuzz and the aforementioned Great Tusk and Corviknight are greatly appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "Slither Wing", "user_id": 603931}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Sandy Shocks": {
    "sets": {
      "Hadron Engine": {},
      "Immunity Ability": {
        "outdated": true,
        "description": "<p>Immunity ability Sandy Shocks is a decent physical tank when it gets going due to its access to Iron Defense + Body Press and utility like Spikes. Iron Defense allows it to defend itself from common physical attackers like Great Tusk and Ogerpon-H, and Body Press threatens Electric-immune Pokemon like Volt Absorb Empoleon and Corviknight, as well as Motor Drive Manaphy. However, Spikes + Earth Power is an alternative to Iron Defense + Body Press, as it provides entry hazard utility and a secondary STAB move option. Substitute takes advantage of the free turns it can generate with its immunity ability and can block status from slower walls. Since Sandy Shocks doesn't have any form of reliable recovery, Leftovers is the preferred item. The ability choice comes down to team need; Earth Eater punishes Great Tusk, Iron Treads, and Garchomp, while Water Absorb is an excellent check to Barraskewda and Zapdos that also can block pivoting from Empoleon. Sandy Shocks works well on hyper and bulky offense, as it can set up easier and can counter passive walls. Therefore, Pokemon that appreciate this ability like Chien-Pao and Dragonite make for good teammates. Despite its ability to increase its physical bulk, it is very vulnerable on the special side, making Pokemon like Gengar and Iron Moth threatening foes. Because of this, Pokemon like RegenVest Roaring Moon and Manaphy make for good teammates.</p>"
      }
    }
  },
  "Iron Treads": {
    "outdated": true,
    "sets": {
      "Ground Immunity": {
        "description": "<p>Iron Treads is an excellent spinner that is able to switch into common entry hazard setters such as Garchomp and Landorus-T with its own Levitate while also being able to use Knock Off on common switch-ins such as Corviknight. Iron Treads can opt to be a hazard setter itself with Stealth Rock, keep up momentum with Volt Switch on targets like Corviknight, or use Heavy Slam as a strong STAB option for Scream Tail and Chien-Pao. Levitate allows Iron Treads to be immune to Spikes while also being able to spin them away, whereas Earth Eater can be used as an alternative for better longevity against hazard setters like Garchomp and Smack Down Landorus-T. Offensive Pokemon that are weak to hazards such as Chien-Pao and Thundurus-T appreciate Iron Treads's ability to keep hazards off the field, as well as being able to pivot them in safely with Volt Switch. Strong physical attackers like Galarian Zapdos and Kingambit also are good teammates for Iron Treads, as they can more easily break through Corviknight with Knock Off support from Iron Treads. Iron Treads can be overwhelmed by coverage options from hazard setters such as Liquidation Garchomp, so running Wish Scream Tail, which can increase Iron Treads's longevity, or a secondary hazard remover like Corviknight and Quaquaval, which can also stave off hits, is recommended. Iron Treads is also vulnerable to strong Fighting-type attackers such as Galarian Zapdos and Slither Wing, so it is advised to pair it with a Fighting-resistant teammate such as Scream Tail or Fluffy Zapdos.</p>"
      },
      "Fire Immunity": {
        "description": "<p>Well-Baked Body Iron Treads is a spinner with a great defensive typing in addition to a Fire immunity and ability to compress several roles such as item and entry hazard removal into one Pokemon. It is notably able to threaten the tier's premier spinblocker in Skeledirge, allowing it to remove hazards freely. If there is already a Stealth Rock user on the team, Iron Treads can instead use Heavy Slam to check Calm Mind Scream Tail and Enamorus-T, Rock Slide to OHKO Talonflame and Volcarona, or Volt Switch to bring in teammates safely. 236 Speed EVs are used to outspeed and threaten an OHKO on Jolly Hisuian Arcanine. Pixilate Scream Tail and Primordial Sea users like Inteleon, Greninja, and Quaquaval all appreciate Iron Treads switching into their checks in Desolate Land Fire-types like Iron Moth and Ceruledge. Physical wallbreakers like Chien-Pao and Hisuian Arcanine appreciate Iron Treads removing items from shared switch-ins like Corviknight and Quaquaval. Fighting- and Ground- types like Galarian Zapdos, Slither Wing, and Garchomp threaten Iron Treads, so defensive partners like Scream Tail, Quaquaval, and Corviknight are recommended. Iron Treads's Rapid Spin also supports the hazard stacking effort from partners like Garchomp and Ting-Lu. Certain Fire-types like Cinderace and Ceruledge can still threaten Iron Treads with their coverage moves, so it appreciates a secondary check to them like Primordial Sea Zapdos.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tranquility", "user_id": 475288}, {"username": "KarpeChan", "user_id": 536333}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "LordBox", "user_id": 611238}, {"username": "Tranquility", "user_id": 475288}, {"username": "cat", "user_id": 580765}]}, {"name": "Grammar checked by", "members": [{"username": "berry", "user_id": 226455}, {"username": "Lumari", "user_id": 232216}, {"username": "ken", "user_id": 594478}]}]}
  },
  "Iron Jugulis": {
    "outdated": true,
    "sets": {"Sheer Force": {"description": "<p>With high-Base Power moves and decent Special Attack and Speed, Iron Jugulis is a solid wallbreaker that can outspeed and threaten common specially defensive foes, like Garchomp and Garganacl. Iron Jugulis offers a notable niche, as Hurricane + Dark Pulse + Focus Blast can hit every viable Pokemon for neutral damage. Taunt disrupts attempts to heal, set up, or set entry hazards, allowing Iron Jugulis to better handle Pokemon such as Blissey and Clodsire. Iron Jugulis struggles against special walls like Florges and Scream Tail, so physically offensive teammates like Cinderace and Ceruledge are necessary to break through them. Due to its frailty, it enjoys teammates like Slither Wing and Corviknight that can pivot it in, the latter of which can also remove hazards with Defog. Iron Jugulis also appreciates entry hazard setters such as Ting-Lu, which can enable it to secure KOs that it would typically miss, such as Garganacl.</p>"}},
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "Alexender", "user_id": 313542}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Iron Moth": {
    "sets": {
      "Desolate Land": {
        "description": "<p>Iron Moth functions as an offensive pivot that can also opt to spread status. U-turn allows Iron Moth to gain momentum on switch-ins such as Manaphy, Swampert, and Meloetta, as well as Fire-immune foes such as Well-Baked Body Gholdengo and Corviknight. Toxic and Toxic Spikes allow Iron Moth to chip down defensive Pokemon. Energy Ball is decent coverage against would-be switch-ins like Manaphy, Swampert, and Primordial Sea Barraskewda. Dazzling Gleam hits Dragon-types like Roaring Moon, Walking Wake, and Dragonite. Discharge hits Manaphy and Well-Baked Body Corviknight and can notably paralyze Well-Baked Body Gholdengo. Desolate Land effectively grants Iron Moth a Water immunity, enabling it to switch into Ogerpon-W, Barraskewda, and Primarina for its team. Pokemon with setup moves like Gouging Fire and Ogerpon-W appreciate Iron Moth's ability to bait in RegenVest users like Manaphy and Meloetta and pivot on them. Iron Moth does pitiful damage to RegenVest users like Manaphy, Meloetta, and Hisuian Goodra, so it benefits from special wallbreakers like Deoxys-S, Walking Wake, and Latios that can lure in and help wear down shared checks; they also appreciate Iron Moth chipping said checks, especially with Toxic or Toxic Spikes.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Orangex", "user_id": 594122}], "teams": [{"name": "Quality checked by", "members": [{"username": "Slither Wing", "user_id": 603931}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Iron Thorns": {"outdated": true, "sets": {"Dragon Dance": {}}},
  "Gholdengo": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Gholdengo's naturally good offensive presence, fantastic typing, and access to reliable recovery combine to make it a staple defensive piece. Hex can be run over Shadow Ball in conjunction with Thunder Wave to increase its maximum Base Power while spreading paralysis to support Gholdengo's teammates. Well-Baked Body allows Gholdengo to wall Pokemon reliant on Fire-type moves to beat it, such as Gouging Fire lacking Earthquake, Iron Moth, and Cinderace. Similarly, Earth Eater handles opposing Ground-types such as non-Scrappy Great Tusk. Bulletproof is used to negate Shadow Ball from Gengar, Hisuian Zoroark, and opposing Gholdengo. Gholdengo's natural typing allows it to use nearly any immunity ability effectively, so options like Water Absorb and Volt Absorb can also be used depending on the needs of its team, although these are generally less effective. 28 Speed EVs are used to outspeed minimally invested Great Tusk, with the remaining EVs being used to maximize Gholdengo's physical bulk to better check physical attackers. Gholdengo is particularly vulnerable to Dark-types like Roaring Moon and Chien-Pao, and many Pokemon like Iron Boulder and Ogerpon-C run Dark-type coverage specifically to hit all variants of it. Thus, Pokemon that can take hits from Dark-type attackers such as Corviknight and Great Tusk make good partners. Gholdengo cannot check most special attackers, so it appreciates having special walls such as Swampert and Manaphy as teammates. Finally, Gholdengo can be taken advantage of and used for momentum by RegenVest Pokemon such as Swampert and Meloetta, so it appreciates strong wallbreakers such as Roaring Moon and Galarian Zapdos to bust through these walls.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "abriel", "user_id": 473082}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic", "user_id": 552227}, {"username": "LordBox", "user_id": 611238}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Chien-Pao": {
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Chien-Pao is a strong wallbreaker, being able to blast through many teams on its own. Its high Attack and Speed combined with its good STAB moves and Choice Band to bolster its damage even further make it extremely difficult to handle. Lash Out can be used over Crunch to hit Intimidate Corviknight harder. Ice Shard helps to pick up KOs on weakened, faster foes like Galarian Zapdos and Choice Scarf Roaring Moon; it can also OHKO frail targets like Hisuian Electrode from full HP. Sacred Sword hits Dark-, Steel-, and Rock-types like Kingambit, Heatran, and Garganacl. Chien-Pao can have a hard time breaking through defensive Pokemon like Intimidate Corviknight and Quaquaval, making partners like Gouging Fire and Dragonite appreciated. Choice Scarf users like Walking Wake can be tough foes for Chien-Pao, forcing it out; this makes slow pivots like Meloetta and RegenVest Manaphy good teammates, as they can deal with these Choice Scarf users and also help bring it in safely after taking a hit. Chien-Pao's weakness to Stealth Rock can become a problem quickly if not accounted for, so entry hazard removers like Great Tusk and Mandibuzz are good partners.</p>"
      },
      "Swords Dance": {
        "description": "<p>Access to Swords Dance and a high Attack and Speed stat make Chien-Pao a powerful wallbreaker and sweeper. It also has a STAB combination that is resisted by few Pokemon; hits physical walls like Mandibuzz, Deoxys-D, and Great Tusk super effectively; and can OHKO many offensive threats like Walking Wake after a Swords Dance. Ice Shard picks off faster foes like Hisuian Electrode and, after some chip damage, Choice Scarf Roaring Moon and Sandy Shocks. Adaptability lets Chien-Pao OHKO Gouging Fire at +2 and makes breaking through walls like Intimidate Corviknight easier, while Magic Guard offers more longevity. Special attackers like Latios and Azelf appreciate Chien-Pao being able to threaten their switch-ins like Gholdengo and Swampert, letting them rip massive holes in or sweep teams; they can also safely pivot it in, allowing more opportunities for it to deal significant damage. Chien-Pao appreciates other physical wallbreakers like Choice Band Roaring Moon and Galarian Zapdos helping break through walls like Intimidate Corviknight that it struggles to deal with. Chien-Pao is also prone to getting revenge killed by Choice Scarf users such as Walking Wake and Azelf, so teammates that can switch into them and safely pivot it in like Swampert and Empoleon are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Kinetic", "user_id": 552227}, {"username": "yoko", "user_id": 617542}], "teams": [{"name": "Quality checked by", "members": [{"username": "Slither Wing", "user_id": 603931}, {"username": "LordBox", "user_id": 611238}, {"username": "cat", "user_id": 580765}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Ting-Lu": {
    "outdated": true,
    "sets": {
      "Regenerator": {},
      "Specially Defensive": {"outdated": true, "description": "<p>Ting-Lu's absurd mixed bulk and unusual typing make it a formidable mixed wall, capable of checking several key threats such as Kingambit, Ceruledge, and Iron Moth. Ting-Lu's best entry hazard depends on its team, as it can form a strong hazard-stacking core with Stealth Rock and/or Spikes setters like Garganacl and Glimmora. Ruination spreads consistent damage, especially against Ground-immune foes like Earth Eater Kingambit, and forces defensive Pokemon like Corviknight, Hippowdon, and Blissey to waste their recovery PP. Whirlwind forces entry hazard damage onto foes and ensures Ting-Lu isn't setup fodder for threats like Talonflame and Quaquaval. The Speed IVs let it underspeed Corviknight to punish its Roost with Earthquake. Foes like Scream Tail and Lucario can endanger Ting-Lu by targeting its weaknesses, so Corviknight is a good teammate that also provides Defog.</p>"},
      "RegenVest Wall": {"outdated": true, "description": "<p>Ting-Lu's excellent defensive stats and useful typing let it check a plethora of special attackers such as Hydreigon and Iron Moth. Throat Chop provides STAB damage and lets it beat Boomburst users, Ruination + Sand Tomb traps and eliminates opposing Ting-Lu and Skeledirge, while also draining recovery PP from Hippowdon and Blissey. Some special attackers like Scream Tail can prove dangerous, so pairing Ting-Lu with Corviknight and Desolate Land Iron Moth are good options. Ting-Lu can switch into weaker physical attackers like Roaring Moon, but it should be used as help for the main physical wall on the team. Ting-Lu is vulnerable to opposing setup sweepers, so teammates like Unaware Corviknight are greatly appreciated. Corviknight can also reduce Ting-Lu's weakness to entry hazards.</p>"}
    }
  },
  "Chi-Yu": {
    "outdated": true,
    "sets": {
      "Choice Item Attacker": {
        "description": "<p>Chi-Yu's strong base stats and excellent STAB coverage make it a flexible offensive threat. Choice Specs provides maximum wallbreaking power, notably allowing it to OHKO physically defensive Ting-Lu with Desolate Land + Overheat, whereas Choice Scarf gives it the Speed to clean late-game and chase out faster threats like Cinderace and Chien-Pao. Desolate Land provides the most damage amplification and comes with an immunity to Water, whereas No Guard enables Chi-Yu to liberally spread burns with Inferno. Psychic is useful coverage to hit Clodsire and Iron Moth super effectively; alternatively, Will-O-Wisp allows Desolate Land sets to reliably spread burn, however Chi-Yu's poor bulk means it can be dangerous to use. Chi-Yu's best fit is on balance and offense teams that appreciate its high damage output, as well as its good matchups against common special walls like RegenVest Iron Treads. Bulky pivots, like the aforementioned Corviknight and Iron Treads, make particularly good Chi-Yu partners because both can clear entry hazards, particularly Stealth Rock.</p>"
      },
      "Nasty Plot": {
        "description": "<p>Thanks to its high Special Attack and decent Speed, Chi-Yu is a potent wallbreaker that makes use of Nasty Plot and its unresisted STAB combination to tear through common walls like Sand Stream Garganacl and non-Unaware Florges. Chi-Yu generally prefers to run Heavy-Duty Boots to avoid entry hazard damage, but Life Orb can be run on Sheer Force sets for extra power. Chi-Yu also has several Fire-type STAB moves to choose from: Fire Blast is the most powerful, Flamethrower is the most consistent option, and Inferno is used on No Guard sets to punish switch-ins like Garganacl and Ting-Lu with a burn. Chi-Yu does struggle against special walls like Clodsire and Blissey, so physically offensive Pokemon like Meowscarada and Kingambit make good teammates. Chi-Yu is also physically frail, so it appreciates teammates like Corviknight and Avalugg that can switch into strong physical attacks and Wish passers like Florges and Scream Tail that can help it stay healthy.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "UT", "user_id": 523866}, {"username": "Isaiah", "user_id": 375662}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Isaiah", "user_id": 375662}]}]}
  },
  "Roaring Moon": {
    "sets": {
      "Choice Item": {
        "description": "<p>No matter which of Choice Band or Choice Scarf you decide to use, rest assured: Roaring Moon will be able to blast holes in the enemy team. A high Attack combined with the power of Sword of Ruin as well as a good Speed tier allows it to function as a potent wallbreaker or revenge killer, depending on your choice of item. Earthquake and Stone Edge allow Roaring Moon to hit Steel-types such as Heatran and Fairy-types such as Enamorus-T, which resists both of its STAB moves, respectively. Lash Out is a good option to punish Intimidate Corviknight. Choice Scarf allows Roaring Moon to act as excellent speed control, outspeeding and revenge killing threats like Azelf and Deoxys-S, while Choice Band lets it OHKO Unaware Deoxys-D and Galarian Zapdos. Roaring Moon struggles against Fluffy Corviknight and defensive Great Tusk, so partners such as Azelf and Gouging Fire are appreciated; in return, it can threaten their checks like Gholdengo and Walking Wake.</p>"
      },
      "Dragon Dance": {
        "description": "<p>Due to its high Attack and Speed further augmented by Dragon Dance, Roaring Moon functions incredibly as a threatening setup sweeper. Iron Head provides coverage for Fairy-types like Scream Tail, while Stone Edge nails Mandibuzz and can bypass Fluffy walls like Corviknight. Outrage is used to deal massive damage to physically bulky Pokemon such as Iron Hands at the cost of confusion; alternatively, Acrobatics can be used to handle Great Tusk and most Ogerpon formes after Weakness Policy's activation. Weakness Policy can easily be activated by a weak U-turn from Corviknight, Manaphy, or Azelf, while Life Orb provides consistent damage. Applicable partners include Prankster Corviknight for its dual screens support and ability to pivot Roaring Moon in safely, and Gholdengo, since it has incredible type synergy with Roaring Moon, being able to resist Fairy, Dragon, Bug, Ice, and having an immunity to Fighting. Roaring Moon struggles against defensive Great Tusk, especially Fluffy variants, and Fluffy Corviknight. With partners such as Azelf and Manaphy for Great Tusk and Iron Moth and Gouging Fire for Corviknight, Roaring Moon's biggest checks and counters become quite threatened. Additionally, wallbreakers such as Choice Band Iron Boulder and Dragon Dance Gouging Fire can both physically wear down defensive walls to clear the way for Roaring Moon to get a clean sweep.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Vertigo", "user_id": 543620}, {"username": "Gambit_Gamin", "user_id": 652656}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "LordBox", "user_id": 611238}, {"username": "UT", "user_id": 523866}, {"username": "Kinetic", "user_id": 552227}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Walking Wake": {
    "sets": {
      "Choice Item": {
        "description": "<p>Walking Wake is a strong wallbreaker thanks to its high Special Attack and powerful STAB moves with excellent coverage. Choice Specs can be run to provide Walking Wake with more wallbreaking power, notably giving it a chance to 2HKO RegenVest Swampert, while Choice Scarf helps to make up for its relatively poor Speed and lets it outspeed and OHKO the likes of Chien-Pao and Deoxys-S. Weather Ball is run on Primordial Sea sets for consistency and to chunk Desolate Land Heatran, while Hydro Pump is preferred on Dragon's Maw variants. Draco Meteor hits Desolate Land Iron Moth and Water-resistant switch-ins like RegenVest Manaphy and Hisuian Goodra, outdamaging Regenerator on the latter two and OHKOing the former with Dragon's Maw sets. Knock Off can be run to let Walking Wake better enable its own wallbreaking by crippling RegenVest Pokemon, while Scald and Dragon Pulse can be used if its team already has Knock Off support as more consistent damaging options with no drawbacks and, in the case of Scald, the chance to burn foes. Flip Turn allows Walking Wake to maintain momentum and pivot in teammates safely. Due to its middling Speed when running Choice Specs, Walking Wake is susceptible to being revenge killed by Chien-Pao and Gengar, so it appreciates teammates like Choice Scarf Roaring Moon and Azelf that can take care of faster threats. While Walking Wake can play around RegenVest Pokemon with Knock Off, it still benefits from physically offensive teammates like Galarian Zapdos and Iron Boulder that can more easily handle them. Due to its lack of recovery, Walking Wake appreciates entry hazard removal support from the likes of Great Tusk and Corviknight to allow it to come in safely.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Theia", "user_id": 439018}], "teams": [{"name": "Quality checked by", "members": [{"username": "cat", "user_id": 580765}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Ogerpon-Wellspring": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Fantastic STAB coverage, a solid Speed tier, and good coverage options all make Ogerpon-W a force to be reckoned with, being able to shatter most of the tier's physical walls such as Corviknight, Gholdengo, and Mandibuzz after a Swords Dance. Power Whip packs more of a punch, letting it OHKO RegenVest Manaphy without a Swords Dance boost, while Horn Leech grants it more longevity. Knock Off lets it threaten Desolate Land users such as Iron Moth, Ceruledge, and Heatran, while Play Rough picks off Dragon-types such as Roaring Moon, Dragonite, and Latios. Trailblaze enables Ogerpon-W to act as more of a sweeper, letting it outspeed threats such as Iron Boulder, Chien-Pao, and Deoxys-S, while Spikes can be used to help chip down Hisuian Goodra and other walls for its teammates. Ogerpon-W pairs well with fast cleaners such as Iron Boulder and Choice Scarf Roaring Moon, as they appreciate its ability to pressure Fluffy users such as Corviknight and Great Tusk thanks to Ivy Cudgel not making contact. In spite of its solid speed, Ogerpon-W is still threatened by faster targets such as Chien-Pao, Choice Scarf Azelf, and Roaring Moon, making defensive pivots such as Corviknight and Swampert crucial in order to bring it in safely.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "Slither Wing", "user_id": 603931}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic", "user_id": 552227}, {"username": "Gimmickyasitgets", "user_id": 540420}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Ogerpon-Hearthflame": {"sets": {"Swords Dance": {}}},
  "Ogerpon-Cornerstone": {
    "sets": {
      "Swords Dance": {
        "description": "<p>When boosted by the power of Rocky Payload and its Cornerstone Mask, Ogerpon-C is a devastating wallbreaker that's capable of threatening nearly the entire metagame due to the lack of capable Rock-resistant Pokemon. Power Whip is Ogerpon-C's strongest Grass-type attack, OHKOing specially defensive Manaphy and having a good chance to OHKO offensive Great Tusk, while Horn Leech can provide recovery if desired. For the last moveslot, Knock Off has a good chance of OHKOing Gholdengo at +2, Low Kick deals with Hisuian Goodra and Kingambit, and Trailblaze increases Ogerpon-C's effectiveness against faster teams. Other physical wallbreakers like Chien-Pao and Roaring Moon appreciate Ogerpon-C's presence, as together they can overwhelm physical walls such as Corviknight, Skarmory, and Great Tusk. Ogerpon-C's poor defensive typing and average Speed means it appreciates slow, bulky pivots such as Corviknight, RegenVest Swampert, and RegenVest Manaphy to provide it with safe entry onto the field. Its Speed also leaves it prone to getting picked off by faster offensive Pokemon such as Chien-Pao, so speedy teammates such as Barraskewda, Choice Scarf Azelf, and Choice Scarf Roaring Moon are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "abriel", "user_id": 473082}], "teams": [{"name": "Quality checked by", "members": [{"username": "Slither Wing", "user_id": 603931}, {"username": "Kinetic", "user_id": 552227}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Gouging Fire": {
    "sets": {
      "Magic Guard": {
        "description": "<p>With a fantastic offensive typing, great Attack, serviceable Speed, and access to Dragon Dance, Gouging Fire can don Magic Guard to become one of the scariest wallbreakers in the tier with a powerful, recoilless Flare Blitz. Morning Sun allows Gouging Fire reliable recovery, letting it better leverage its solid bulk to get Dragon Dance boosts, while Earthquake provides a powerful hit against Well-Baked Body Gholdengo and threatens opposing Gouging Fire without Outrage's downsides. With a Jolly nature, Gouging Fire outspeeds Modest Deoxys-S after a Dragon Dance. Gouging Fire is fantastic at pressuring physical walls such as Corviknight, Pecharunt, and Deoxys-D, making fast cleaners like Roaring Moon, Iron Boulder, and Chien-Pao excellent teammates, able to clean up these weakened walls. Gouging Fire can struggle to break through physically bulky Ground-types such as Great Tusk and Ursaluna, making teammates like Walking Wake, Enamorus-T, and offensive Manaphy worth considering. Gouging Fire's mediocre Speed before a boost means it pairs excellently with slow pivots such as Corviknight and Swampert, which are able to take a hit from threats like Iron Boulder and Walking Wake that otherwise OHKO it and switch Gouging Fire in undamaged, giving it more opportunities to set up with Dragon Dance.</p>"
      },
      "Dragon Dance": {
        "description": "<p>With access to Dragon Dance, a good base Attack, high natural bulk, and a good typing both offensively and defensively, Gouging Fire is one of the best wallbreakers and sweepers in the tier. Flare Blitz provides a reliable Fire-type STAB move, while Heat Crash avoids recoil damage at the cost of dealing less damage against heavier foes like Great Tusk and Iron Hands. Morning Sun provides reliable recovery, while Earthquake threatens Well-Baked Body Gholdengo and gives Gouging Fire a way to threaten Fire-resistant foes like Iron Boulder and opposing Gouging Fire without locking into Outrage. Heavy-Duty Boots allows Gouging Fire to avoid entry hazard chip damage, while Life Orb increases damage dealt at the cost of extra recoil, letting it 2HKO defensive Great Tusk. An Adamant nature lets it 2HKO Unaware Deoxys-D under sun without Life Orb and 2HKO Pecharunt with Life Orb, while a Jolly nature allows it to outspeed +1 Great Tusk and Modest Deoxys-S. Desolate Land should always be run with Morning Sun, as it increases the amount of healing from the move; Desolate Land also boosts the power of Flare Blitz and Heat Crash and blocks Water-types moves from Manaphy, Barraskewda, and Ogerpon-W. Sword of Ruin can be used on more offensive teams that value Gouging Fire's ability to threaten immediate damage and potentially sweep after setting up; Earthquake should be run over Morning Sun in this case, as these kinds of teams usually value coverage over recovery. Special attackers such as Latios and Azelf appreciate Gouging Fire's ability to threaten their walls like Empoleon, Heatran, and Hisuian Goodra; in return, they can pivot it in on a predicted switch and threaten switch-ins to it such as Great Tusk and Pecharunt. Gouging Fire struggles against bulky Ground-types like Great Tusk, as they can take a hit from it and threaten back significant damage, so teammates that can deal with them like Manaphy and Earth Eater Gholdengo are appreciated. Gouging Fire is also outsped and OHKOed by faster threats like Sandy Shocks and Walking Wake before a Dragon Dance, so teammates that can check them like Swampert and Empoleon, respectively, are appreciated.</p>"
      },
      "Earth Eater": {}
    },
    "credits": {"writtenBy": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Kinetic", "user_id": 552227}], "teams": [{"name": "Quality checked by", "members": [{"username": "Gimmickyasitgets", "user_id": 540420}, {"username": "Kinetic", "user_id": 552227}, {"username": "Tranquility", "user_id": 475288}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  },
  "Iron Boulder": {
    "sets": {
      "Choice Band": {
        "description": "<p>Choice Band Iron Boulder is one of the best single-button clickers imaginable; honestly, the other moves are mostly decorative. Sharpness- and Choice Band-boosted Mighty Cleave has excellent power and coverage, notably 2HKOing Unaware Deoxys-D and OHKOing most slower offensive Pokemon like Galarian Zapdos and Roaring Moon. Psycho Cut covers important targets like Great Tusk, Iron Hands, and Swampert, while Throat Chop reliably beats Gholdengo, and Sacred Sword beats Iron Treads and Hisuian Goodra. Iron Boulder has an awful defensive typing and greatly appreciates being brought in by slow pivots like Manaphy and Corviknight; thanks to its great Speed tier, it can usually force out the wallbreakers that come in on them in return. Iron Boulder also pairs well with other physically offensive threats like Barraskewda and Garchomp that can wear down opposing walls like Intimidate Corviknight with it. Fluffy walls such as Corviknight and Deoxys-D are extremely difficult for Iron Boulder to break past, so a strong Fire-type like Gouging Fire or Ceruledge makes an excellent teammate.</p>"
      },
      "Swords Dance": {
        "description": "<p>With an amazing Speed stat and great STAB moves, Iron Boulder stands out as one of the tier's strongest wallbreakers. Swords Dance lets it tear through some of the tier's most common physical walls including Great Tusk, Deoxys-D, and non-Fluffy Corviknight. Iron Boulder has plenty of options as a last move: Sacred Sword helps deal with Steel-types like Hisuian Goodra, Kingambit, and Iron Treads; Throat Chop notably hits Gholdengo; and Earthquake acts as a midground option, hitting the aformentioned Sacred Sword targets and non-Earth Eater Gholdengo at the cost of not getting boosted by Sharpness. Iron Boulder appreciates offensive pivots like Barraskewda and Choice Scarf Roaring Moon, as they're able to clean up after it has weakened the physical walls. Iron Boulder also appreciates defensive pivots like Corviknight and Swampert, as they can bring it in safely. Despite its amazing Speed stat, it's still prone to getting revenge killed by faster targets like Chien-Pao, Hisuian Electrode, and Choice Scarf Roaring Moon, making defensive walls like Corviknight, Meloetta, and Great Tusk necessary. Iron Boulder lacks damage without a boost from Swords Dance, so entry hazard setters like Deoxys-D, Sandy Shocks, and Skarmory are greatly appreciated, as they help chip foes into its KO range.</p>"
      }
    },
    "credits": {"writtenBy": [{"username": "UT", "user_id": 523866}, {"username": "Slither Wing", "user_id": 603931}], "teams": [{"name": "Quality checked by", "members": [{"username": "Kinetic", "user_id": 552227}, {"username": "LordBox", "user_id": 611238}, {"username": "UT", "user_id": 523866}]}, {"name": "Grammar checked by", "members": [{"username": "WrathoftheLeopard", "user_id": 511181}]}]}
  }
}