{
  "Pikachu": {
    "sets": [
      {
        "name": "Imposter",
        "description": "<p>Thanks to Light Ball, Pikachu is a niche Imposter user that can break past less-sturdy Imposter-proofers, although it forgoes defensive utility in exchange. When Pikachu transforms, only the ability, item, HP EVs, and Tera type listed here matter. Tera Fairy is useful against Dragon-types like Koraidon and Palkia-O, while Tera Dragon lets Pikachu transformed into Palkia-O 2HKO Ice Scales Dialga-O after Spikes. The listed moves, non-HP EVs, and nature will very rarely see use: since Pikachu outspeeds all other Imposter users like Chansey, it is extremely rare that Pikachu is not transformed. Nevertheless, Volt Switch provides a reasonably strong pivoting option against opposing transformed Imposter users, which cause Pikachu's Imposter to fail, while Glare can paralyze threats to aid Pikachu later on. Healing Wish and Spikes both provide some utility if Pikachu is no longer needed. Since Pikachu is extremely frail, it can easily fall to any strong move from opposing threats it wants to transform into. Therefore, significant team support is needed to realize its potential. Paralysis spam through Nuzzle and Glare ensures Pikachu always outspeeds opposing threats like Koraidon, and it can also generate free turns. Knock Off invalidates Pikachu, so Knock Off absorbers, such as Arceus with a held Plate and Flame Orb users like Flare Boost Flutter Mane, are recommended. Bulky special walls like Ice Scales Arceus-Ground and Dialga-O check Palkia-O and Arceus-Ghost, which Pikachu cannot safely transform into: the former is unsafe to switch in to, and the latter Imposter-proofs itself. Substitute + Baton Pass is a niche option to provide free turns to Pikachu, and this has the benefit of scouting potential Terastallization.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Chansey": {
    "sets": [
      {
        "name": "Imposter",
        "description": "<p>With Imposter, Chansey transforms into a far bulkier version of the opposing Pokemon, which can be further bolstered by Eviolite. This provides a myriad of benefits, including blanket checking most Pokemon, scouting sets, and PP stalling less threatening foes. While Eviolite is usually the best item, Covert Cloak is useful against Nuzzle and Spirit Shackle users. The given moves offer the most utility in the rare situations Chansey is not transformed, like phazing Substitute users, pivoting, and acting as a cleric. Offensive threats such as Palkia-O and Flutter Mane appreciate the information Imposter Chansey provides through scouting. Imposter Chansey appreciates slow pivoting from Pokemon like Dondozo and RegenVest Ting-Lu for safe scouting; these Pokemon can also provide Knock Off support, aiding against Judgment users that can otherwise defeat Imposter Chansey. Tera Normal gives Chansey a STAB boost on Judgment, improving its matchup into Pokemon like Arceus-Ground, while Tera Fire and Tera Ghost are useful against V-create users and trapping moves, respectively.</p> "
      },
      {
        "name": "Ice Scales",
        "description": "<p>With Eviolite and Ice Scales, Chansey becomes the bulkiest specially defensive wall in the tier, capable of walling virtually every special attacker. Ruination bypasses Chansey's meager offenses to deal damage. Toxic cripples bulky Pokemon like Arceus formes and setup sweepers like Palkia-O. Parting Shot allows Chansey to safely pivot teammates in thanks to its low Speed. Chansey’s low Attack limits Strength Sap healing from common special attackers, making it effective at wearing them down in the long run. Chansey's poor Defense means that it enjoys Fur Coat teammates like Groudon, Eternatus, and Arceus formes to check powerful physical attackers like Koraidon and Groudon. Chansey is also hindered by poison from Mortal Spin and Toxic, so having Hell Bell somewhere on the team is useful. Tera Ghost protects Chansey from being trapped, whereas Tera Poison makes it immune to poison and grants a resistance to Pixilate Extreme Speed from Arceus-Fairy.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}, {"username": "ponchlake", "user_id": 574634}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "TTTech", "user_id": 338877}, {"username": "Chessking345", "user_id": 355040}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Moltres": {
    "sets": [
      {
        "name": "Physically Defensive",
        "description": "<p>Moltres's useful typing and decent bulk allow it to check various dangerous physical attackers such as Groudon, Hoopa-U, and Zacian. Nuzzle reliably slows down offensive threats and bypasses Good as Gold, whereas Glare paralyzes Ground-types and Covert Cloak users. U-turn allows Moltres to maintain momentum against Nuzzle or Glare switch-ins. Covert Cloak grants immunity to the secondary effects of moves like Nuzzle, Magical Torque, and Salt Cure; alternatively, Heavy-Duty Boots gives it an immunity to Stealth Rock. Dangerous wallbreakers like Palkia-O are recommended to take maximum advantage of U-turn. Groudon is another good example, especially since Moltres can Imposter-proof it. Moltres is threatened by powerful special attackers, like Palkia-O, so a specially defensive Ground-type, like Ice Scales Groudon or Ting-Lu, is a strong partner. It's best to Imposter-proof Moltres with a teammate immune to Nuzzle and not weak to Torch Song, such as Ting-Lu.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Codename C.A.T", "user_id": 537972}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Chessking345", "user_id": 355040}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Groudon": {
    "sets": [
      {
        "name": "Setup Attacker",
        "description": "<p>Groudon's base stats and STAB on Precipice Blades make it a premier choice for a bulky attacker. Fur Coat allows Groudon to wall many common threats, such as Koraidon and opposing Groudon, while Mold Breaker ignores Fur Coat and Levitate on walls like Eternatus, Arceus-Ghost, and Zamazenta-C. Victory Dance lets it reliably set up on opposing physical attackers like Groudon and Koraidon, whereas Tidy Up removes entry hazards and makes it harder for Imposter users to safely switch in thanks to the lack of a Defense boost. Toxic heavily cripples Precipice Blades switch-ins like Arceus formes and Dondozo, and it works especially well with Mold Breaker, which lets Groudon bait and punish Prankster users. Alternatively, Knock Off removes Heavy-Duty Boots, Leftovers, and Ability Shield from bulkier targets like Dondozo, Eternatus, and opposing Groudon. Earth Plate boosts Precipice Blades's damage, whereas Heavy-Duty Boots leaves Groudon less susceptible to chip damage from Spikes, and Rocky Helmet provides extra security against Population Bomb users like Ursaluna. Groudon's best fit is on balance and offense teams that want to compress a bulky attacker, non-passive wall, and possibly an entry hazard remover into a single teamslot. Teammates like Dondozo and Eternatus are recommended to shore up Groudon's weakness to Palafin-H, with the latter also helping out against Solar Beam Arceus-Fire. Use Corviknight to Imposter-proof Toxic and Mold Breaker Groudon variants, and a Fur Coat user that doesn't mind Knock Off for other variants.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Rayquaza": {
    "sets": [
      {
        "name": "Aerilate",
        "description": "<p>Aerilate Rayquaza is a strong wallbreaker that also provides reliable entry hazard removal and strong priority. Aerilate allows Boomburst to take advantage of the lack of defensive Flying-resistant Pokemon to pressure defensive teams, while Rapid Spin provides guaranteed entry hazard removal, further complemented by Rayquaza's immunity to Spikes. Extreme Speed provides strong priority that helps against special setup sweepers like Palkia-O; alternatively, Precipice Blades threatens Boomburst switch-ins like Dialga-O. Covert Cloak protects Rayquaza from secondary effects from moves like Nuzzle, Scald, and Mortal Spin, whereas Sky Plate or Life Orb provides more immediate power, such as letting Rayquaza 2HKO Kyogre. Offensive Pokemon like Palkia-O and Enamorus appreciate Rayquaza weakening their checks like Dialga-O and RegenVest Ting-Lu, while the latter also appreciating Rayquaza switching into Ground-types. Defensive checks like Dialga-O and Ting-Lu are appreciated, as they can provide Rayquaza with slow pivoting and Spikes support while Rayquaza provides entry hazard removal. Tera Flying further boosts Rayquaza's damage output, whereas Tera Steel or Electric provides useful resistances, allowing Rayquaza to surprise threats like weakened Koraidon.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Dialga-Origin": {
    "sets": [
      {
        "name": "RegenVest",
        "description": "<p>RegenVest Dialga-O is a reliable specially defensive pivot. Revelation Dance lets it reliably threaten Arceus-Fairy and invalidates Normalize Flutter Mane, whereas Draco Meteor can OHKO Palkia-O. Nuzzle spreads paralysis and discourages faster threats like Zamazenta-C from switching in. U-turn allows Dialga-O to safely bring in teammates thanks to its low Speed. Stone Axe's Stealth Rock help make offensive threats more dangerous; alternatively, Knock Off removes items like Heavy-Duty Boots, Covert Cloak, and Imposter Chansey's Eviolite. Dialga-O's best fit is on balance teams that appreciate a non-passive slow pivot and a reliable source of paralysis. Offensive threats like Groudon, Flutter Mane, and Palkia-O are recommended to take maximum advantage of Dialga-O's slow U-turn; Dialga-O can also Imposter-proof the latter two. Imposter-proofing Dialga-O is normally done with a bulky Covert Cloak user like Arceus-Water or Groudon. Tera Fairy grants a Dragon immunity and makes Revelation Dance Fairy-type, improving Dialga-O's matchup against Koraidon and Palkia-O.</p> "
      },
      {
        "name": "Ice Scales",
        "description": "<p>Ice Scales Dialga-O is a robust special wall that can tank hits from most of the special attackers in the tier. Draco Meteor OHKOes the two most common special attackers in Palkia-O and Eternatus, and it also prevents specially-frail targets like Dondozo and Groudon from switching in safely. Toxic annoys bulky defensive Pokemon like Ting-Lu and Arceus formes, notably invalidating most setup variants of the latter, and it also prevents Fairy-types like Zacian from switching in freely. Parting Shot lets Dialga-O safely pivot in offensive teammates and can be cycled alongside a Prankster user to safely rack up Toxic damage; alternatively, Teleport allows Dialga-O to use 252 Speed EVs and moves after Ting-Lu's U-turn, which helps get dangerous wallbreakers like Koraidon and Enamorus in safe from utility moves like Knock Off and Nuzzle. Moonlight and Recover are largely the same, though Moonlight benefits from sun, whereas Recover is more consistent. Ice Scales Dialga-O's best fit is on balance teams that want a reliable, non-passive special wall and a slow pivot. Fairy-types like Zacian are recommended as backup checks for Tera Dragon + Dragon Energy attackers like Palkia-O, which can break past Dialga-O after Nasty Plot. Teammates like Primordial Sea Corviknight and Fur Coat Arceus-Fire are recommended to shore up Dialga-O's weakness to Pixilate Enamorus, which can threaten to 2HKO it with V-create or Headlong Rush. Tera Fairy grants a Dragon immunity and drops the Ground weakness, allowing Dialga-O to check Arceus-Ground, Palkia-O, and Enamorus in a pinch, even though it must watch out for the former's Toxic. Dialga-O Imposter-proofs itself thanks to its Toxic immunity, but it can be hard to prevent the foe from healing; pivoting to an offensive teammate like Choice Band Groudon or Koraidon is recommended to take advantage of this.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Palkia-Origin": {
    "sets": [
      {
        "name": "Nasty Plot Sweeper",
        "description": "<p>Nasty Plot Palkia-O is a terrifying sweeper thanks to its brutally powerful STAB combination and good Speed. A Timid nature guarantees that Palkia-O outspeeds and threatens to OHKO almost all Arceus. Steam Eruption provides more consistent damage output and a potential burn, while Water Spout has potentially higher damage, won't miss, and can OHKO Ice Scales Arceus-Fairy after Nasty Plot and Spikes. Strength Sap is necessary to keep Dragon Energy and Water Spout's damage high as well as to allow Palkia-O greater freedom to switch in. Tera Dragon allows Dragon Energy to OHKO Dondozo and +4 Dragon Energy to OHKO Ice Scales Dialga-O, while Tera Water lets Palkia-O withstand Fairy-type attacks from users like Arceus-Fairy and Zacian. Palkia-O's best fit is on offense teams that can maximize the opportunities it gets and can easily pressure faster threats like Koraidon. Prankster and Ice Scales Chansey are complete counters for Palkia-O, as they are never threatened by its attacks and make Strength Sap worthless; as such, mixed attacking teammates like Enamorus and Triple Arrows Arceus-Ghost are highly recommended. Imposter-proof Palkia-O with a Desolate Land Arceus-Fairy or Ice Scales Chansey.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Lumii", "user_id": 493772}, {"username": "UT", "user_id": 523866}]}]}
  },
  "Giratina": {
    "sets": [
      {
        "name": "Prankster",
        "description": "<p>Prankster + Haze Giratina's huge bulk and recovery and disruption options allow it to function as a reliable answer to setup users. Giratina has a wide array of options it can use to disrupt foes attempting to set up: Glare paralyzes fast attackers such as Palkia-O, Encore keeps them locked into moves such as Nasty Plot, Parting Shot lets Giratina pivot and Destiny Bond trades a KO, and Entrainment helps force out ability-dependent attackers. Heavy-Duty Boots helps Giratina switch in more easily without fear of entry hazard chip, while Covert Cloak helps prevent status from moves like Mortal Spin and Nuzzle. Tera Fairy improves Giratina's matchup into opposing Dragon-types such as Koraidon while maintaining a Fighting-type resistance, whereas Tera Dark grants immunity to status moves from opposing Prankster users and a Ghost- and Dark-type resistance for Flutter Mane and Arceus-Dark. Great partners for Prankster Giratina include RegenVest Ting-Lu, Fur Coat Dondozo, and Imposter users thanks to their strong defensive synergy, which allows Giratina to get in more comfortably against Arceus-Ghost and Koraidon.</p> "
      },
      {
        "name": "Magic Bounce",
        "description": "<p>Giratina is a great defensive Pokemon that provides utility and disruption with its immunity to Fighting and resistance to powerful attacks like V-create and Rising Voltage. Court Change makes Giratina effective at removing entry hazards against Mold Breaker entry hazard setters and Stone Axe Pokemon. Strength Sap helps with keeping strong physical attackers such as Groudon in check. Whirlwind bypasses Substitute to force out foes, whereas Encore can be used as another form of disruption. Scald is useful for spreading burns, especially against physical attackers such as Groudon and Zamazenta-C. Tera Fairy is great for the immunity to Dragon-type attacks from Koraidon, Eternatus, and Palkia-O, while Tera Dark is great for being resistant to Ghost- and Dark-type attacks from Arceus-Ghost and Hoopa-Unbound. Covert Cloak helps Giratina beat Imposter users and blocks troublesome status from Scald and Mortal Spin. Dondozo and RegenVest Ting-Lu are great partners for Giratina thanks to their physical bulk and complementary typings, which help Giratina against threats such as Eternatus and Arceus-Ghost.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TTTech", "user_id": 338877}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Chessking345", "user_id": 355040}]}, {"name": "Grammar checked by", "members": [{"username": "Isaiah", "user_id": 375662}]}]}
  },
  "Arceus": {"sets": [{"name": "Ice Scales"}]},
  "Arceus-Fairy": {
    "sets": [
      {
        "name": "Pixilate",
        "description": "<p>Pixilate Arceus-Fairy is a solid wallbreaker that also reliably removes entry hazards with Boomburst and unblockable Rapid Spin, respectively. Extreme Speed provides a strong priority option against opposing attackers like Koraidon and Palkia-O; alternatively, Nuzzle lets Arceus-Fairy cripple Palkia-O, Imposter users, and defensive checks, and a pivoting move like Volt Switch or Flip Turn is also an option to retain momentum. Heavy-Duty Boots increases Arceus-Fairy's longevity and further improves its entry hazard removal potential, while Covert Cloak protects Arceus-Fairy from common moves with secondary effects, such as Nuzzle and Mortal Spin. Pixie Plate is another alternative to provide more immediate power, notably allowing Tera Fairy Arceus-Fairy to potentially OHKO Palkia-O, and also is immune to Knock Off. Wallbreakers such as Enamorus and Koraidon appreciate Arceus-Fairy removing entry hazards, threatening opposing sweepers, and pressuring common walls like Dondozo and Ting-Lu. Tera Fairy further boosts Arceus-Fairy's damage output, whereas Tera Steel provides a wide array of useful resistances, allowing Arceus-Fairy to pick off threats like Dialga-O.</p> "
      },
      {"name": "Ice Scales"}
    ],
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Arceus-Fire": {
    "sets": [
      {
        "name": "Fur Coat",
        "description": "<p>Arceus-Fire's great defensive typing and base stats make it a solid Fur Coat wall. Lava Plume's burn heavily cripples common physical attackers like Koraidon and Groudon and forces chip damage on opponents. Heal Bell allows Arceus-Fire to support its teammates by removing status conditions like paralysis, burn, and poison. U-turn allows Arceus-Fire to safely bring in offensive teammates to exploit passive Lava Plume switch-ins, such as Dondozo and Giratina; alternatively, Knock Off allows Arceus-Fire to remove items like Covert Cloak and Heavy-Duty Boots, as well as an Imposter user's Eviolite. Arceus-Fire best fits on balance teams that appreciate a reliable check to V-create users and a bulky pivot. Teammates like Palkia-O and Koraidon appreciate Arceus-Fire's pivoting and ability to bring in and force damage on passive walls. Imposter-proofing can be done with any Pokemon immune to burn, such as a Covert Cloak user. Tera Flying gives Arceus-Fire an immunity to Ground-type attacks from Groudon and Ursaluna, on top of gaining a Spikes immunity.</p> "
      },
      {
        "name": "Desolate Land",
        "description": "<p>Arceus-Fire's Desolate Land-boosted V-create is a brutally strong attack, letting it force out most Pokemon by threatening an OHKO. Arceus-Fire's niche over other V-create users is its powerful Solar Beam, which removes common physical walls such as Dondozo and Groudon. Growth enables Arceus-Fire to set up on passive walls, whereas Glacial Lance targets Dragon-types such as Eternatus and Giratina. Life Orb increases Arceus-Fire's power to absurd levels, OHKOing Arceus formes that don't resist its moves and 2HKOing most resistant targets with V-create. Heavy-Duty Boots, on the other hand, allows Arceus-Fire to take better advantage of its resistance to common Fairy- and Fire-type attacks. Arceus-Fire has difficulty breaking past Fire-immune foes, most commonly Well-Baked Body Steel-types, so it pairs well with teammates that can handle these targets like Groudon and Headlong Rush Enamorus. Imposter-proofing is done with Well-Baked Body Steel-types or Primordial Sea users. Tera Fire boosts the power of V-create even further, while Tera Grass grants a Ground resistance and a much stronger Solar Beam.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "augustakira", "user_id": 445464}], "teams": [{"name": "Quality checked by", "members": [{"username": "TTTech", "user_id": 338877}, {"username": "Chessking345", "user_id": 355040}, {"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}, {"username": "Tea Guzzler", "user_id": 577920}]}]}
  },
  "Arceus-Flying": {
    "sets": [
      {
        "name": "Aerilate",
        "description": "<p>Aerilate Arceus-Flying takes advantage of its typing and ability to act as a reliable entry hazard remover and a defensive check to Ground-types such as Groudon and Ursaluna. Aerilate allows Boomburst to deal significant damage to those that don't resist it, such as Dondozo and Groudon. Rapid Spin provides guaranteed entry hazard removal, complemented by Arceus-Flying's immunity to Spikes and its ability to pressure common entry hazard setters. Nuzzle allows Arceus-Flying to punish offensive threats like Palkia-O and Imposter users. Covert Cloak protects Arceus-Flying from secondary effects from moves like Nuzzle and Mortal Spin, while Sky Plate cannot be removed and provides more immediate power. Offensive partners like Enamorus and Eternatus appreciate Arceus-Flying weakening their checks like Arceus-Steel and RegenVest Ting-Lu, while also providing a Ground immunity. Tera Flying further boosts Arceus-Flying's damage output, whereas Tera Electric provides a resistance to an Imposter user's moves.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Arceus-Ghost": {
    "sets": [
      {
        "name": "Fur Coat",
        "description": "<p>Fur Coat Arceus-Ghost acts as both a bulky physical wall and a potent setup sweeper. Spooky Plate + Judgment allows Arceus-Ghost to Imposter-proof itself while blocking Knock Off's item removal. Strength Sap has more PP and lets Arceus-Ghost handle strong physical threats like Choice Band Koraidon, while Shore Up provides reliable healing that is not neutered by low Attack Pokemon like Chansey. Nasty Plot significantly increases Arceus-Ghost's otherwise middling offensive presence to overpower foes like Imposter users, Groudon, and Arceus formes. Focus Blast provides perfect coverage with Judgment, hitting special walls like Ting-Lu and Dialga-O hard. Aura Sphere is an alternative with significantly more reliability and PP but is very weak, missing out on the 2HKO against RegenVest Ting-Lu when boosted. Arceus-Ghost struggles to get past bulky special walls like Chansey, Meloetta, and Ice Scales Dialga-O, with Chansey also significantly reducing its Strength Sap healing, so strong physical wallbreakers like Choice Band Koraidon and Groudon make good teammates. In return, Arceus-Ghost can Imposter-proof the aforementioned physical wallbreakers.</p> "
      },
      {
        "name": "No Retreat",
        "description": "<p>Simple + No Retreat turns Arceus-Ghost into a threatening setup sweeper that is hard to revenge kill. Spooky Plate + Judgment allows Arceus-Ghost to Imposter-proof itself while blocking Knock Off's item removal. A Fighting-type move provides perfect neutral coverage that hits Judgment switch-ins such as Ting-Lu and Ice Scales Dialga-O. Triple Arrows can potentially allow Arceus-Ghost to ignore Strength Sap Attack drops with critical hits, whereas Collision Course deals more consistent damage. Arceus-Ghost struggles to deal with bulky Prankster Pokemon like Ting-Lu and Arceus-Water, so strong wallbreakers like Flutter Mane and Palkia-O can help break past these. Opposing status users can also be crippling, so Heal Bell users like Dondozo and Ting-Lu are appreciated. Arceus-Ghost generally Imposter-proofs itself but opposing Spooky Plate + Imposter users can be troublesome, so an emergency Imposter-proof like the aforementioned Prankster users can be useful.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Isaiah", "user_id": 375662}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Arceus-Grass": {
    "sets": [
      {
        "name": "Ice Scales Wall",
        "description": "<p>Ice Scales Arceus-Grass is a reliable switch-in to many of the most threatening special attackers, such as Enamorus, Pixilate Flutter Mane, and Palkia-O. Nuzzle hinders setup sweepers, such as Palkia-O and Arceus-Ghost, with paralysis and dissuades threats such as Arceus-Fire and Imposter users from switching in freely. Knock Off removes items such as Covert Cloak, Leftovers, and Choice items from various Pokemon. Spikes forces chip damage on foes, letting offensive teammates wallbreak more easily. Alternatively, Whirlwind phazes setup sweepers that Arceus-Grass cannot deter, such as Groudon. Leftovers provides longevity, whereas Ability Shield counters Normalize Flutter Mane and Arceus-Ghost. Arceus-Grass appreciates offensive teammates such as Palkia-O, Groudon, and Koraidon that can take advantage of Spikes and Knock Off wearing down their defensive checks; notably, Arceus-Grass can also Imposter-proof the former two. Physical walls such as Fur Coat Moltres and Groudon can take on physical attackers that threaten Arceus-Grass, like Arceus-Fire. Arceus-Grass usually doesn't need to Terastallize, but Tera Steel offers a resistance to Dragon Energy from  Palkia-O and Boomburst from Pixilate Flutter Mane. Arceus-Grass can Imposter-proof itself with Nuzzle and Knock Off.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "memesketch", "user_id": 537558}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Chessking345", "user_id": 355040}]}, {"name": "Grammar checked by", "members": [{"username": "Isaiah", "user_id": 375662}]}]}
  },
  "Arceus-Ground": {
    "sets": [
      {
        "name": "Ice Scales",
        "description": "<p>Ice Scales Arceus-Ground serves as a sturdy special wall against threats like Eternatus and Flutter Mane with its great bulk and typing. Precipice Blades is chosen over Earthquake for its higher damage output. Tidy Up provides entry hazard removal while boosting Arceus-Ground's offensive presence. Toxic cripples special setup attackers like Arceus-Ghost, physical walls like Groudon and Dondozo that want to switch into Arceus-Ground, and Imposter users. Ability Shield checks Normalize users such as Dragapult and lets Arceus-Ground fare better against Mold Breaker users like Eternatus. Both Tera types offer a resistance to Refrigerate Iron Bundle's Boomburst, with Tera Steel offering a resistance to Dragon, while Tera Water offers a resistance to Palkia-O's Water-type attacks. A second specially defensive Pokemon like Chansey, Dialga-O, or Ice Scales Zacian can handle certain special attackers like Palkia-O and Iron Bundle that Arceus-Ground cannot check without Terastallizing. Corviknight completely nullifies Arceus-Ground's attacks, so it is recommended to pair it with strong attackers that can take advantage of Corviknight, such as Palkia-O and Flare Boost Flutter Mane. Imposter-proof Arceus-Ground with a Ground-immune Pokemon that doesn't care about Toxic, such as Corviknight or Jungle Healing Enamorus.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Dawn of Ares", "user_id": 467437}]}]}
  },
  "Arceus-Water": {
    "sets": [
      {
        "name": "Fur Coat",
        "description": "<p>Fur Coat Arceus-Water is a strong defensive wall thanks to its great typing and bulk. Scald reliably spreads burns, helping spread chip damage and neutralize physical attackers. Knock Off removes items like Covert Cloak and Leftovers, making its burns easier to spread and more damaging, and also boosts Arceus-Water's own survivability by removing Choice Band; alternatively, Spikes can force passive damage on foes, which offensive teammates can exploit. Flip Turn allows Arceus-Water to bring in dangerous offensive teammates against Scald switch-ins like Dondozo and Giratina. Covert Cloak allows Arceus-Water to stop status from moves like Magical Torque, Nuzzle, and Scald, while Leftovers boosts its longevity. Arceus-Water's best fit is on balance teams, which appreciate a reliable physcial wall and a pivot. Offensive teammates, like Koraidon and Flutter Mane, are recommended as they enjoy the safe pivoting Arceus-Water provides and the chip damage it inflicts.  Arceus-Water is best Improofed by itself, as Knock Off sets can threaten Imposter users with item removal and Scald burns.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Meloetta": {"sets": [{"name": "RegenVest"}]},
  "Goodra-Hisui": {"sets": [{"name": "RegenVest"}]},
  "Hoopa-Unbound": {
    "sets": [
      {
        "name": "Tough Claws",
        "description": "<p>Hoopa-U's unmatched mixed attacking stats make it an incredibly threatening wallbreaker and sweeper. Shift Gear allows Hoopa-U to outrun the entire tier after a boost, and it increases its damage output to levels able to OHKO Arceus. Grass Knot hits Ting-Lu, Dondozo, and Arceus-Water, bypassing Fur Coat. Hoopa-U's best fit is on offensive teams that appreciate its sweeping potential and nearly unmatched stallbreaking ability. Koraidon and Groudon are good teammates, as they help weaken the Fur Coat Arceus formes that aren't vulnerable to Hoopa-U, such as Arceus-Fire and Arceus-Fairy, helping enable its sweep. Tera Dark removes Hoopa-U's 4x weakness to U-turn and also increases Wicked Blow's damage, whereas Tera Fire boosts V-create's damage and potentially allows Hoopa-U to set up in front of Arceus-Fairy. Imposter-proofing requires a Fur Coat user, normally an Arceus forme like Arceus-Fire; however, if the Imposter user lacks Eviolite, then they must be wary of an OHKO if Hoopa-U moves first.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "TTTech", "user_id": 338877}, {"username": "Chessking345", "user_id": 355040}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Zacian": {
    "sets": [
      {
        "name": "Ice Scales",
        "description": "<p>Ice Scales Zacian is an effective special wall against prominent special attackers like Palkia-O and Arceus-Ghost. Spirit Break dissuades setup from Arceus formes, Eternatus, and Palkia-O, though Magical Torque is a stronger alternative. While seemingly counter-productive with Spirit Break, Haze is the best option to neuter Nasty Plot Palkia-O and Arceus-Ghost, and it also ensures Zacian beats No Retreat Arceus-Ghost. Spikes provides support for the team and makes progress against Strength Sap users. Spirit Shackle traps Imposter users, preventing them from recovering health for free on Zacian. Toxic punishes most setup special attackers like Calm Mind Arceus formes. Covert Cloak prevents burns from Palkia-O's Steam Eruption and protects against status conditions inflicted by Nuzzle and Mortal Spin. Alternatively, Heavy-Duty Boots and Leftovers help mitigate entry hazard damage and keep Zacian healthy. Ability Shield is useful against Normalize users like Dragapult and Mold Breaker users like Palkia-O. Zacian pairs very well with a secondary specially defensive pivot like RegenVest Ting-Lu or Dialga-O, as they can scout for moves from Choice Specs users while not being chipped down by Volt Switch. In return, Zacian provides a switch-in to strong Dragon-type moves while also checking setup Pokemon like Palkia-O and Nasty Plot Flutter Mane. Imposter-proofs for Spikes variants include Fur Coat Groudon and Arceus-Ground, while Toxic variants can be Imposter-proofed by Arceus-Poison and Corviknight. Tera Steel provides a resistance to Iron Bundle and Flutter Mane's Boomburst while retaining a Dragon resistance, as well as providing a Toxic immunity.</p> "
      },
      {
        "name": "Fur Coat",
        "description": "<p>Fur Coat Zacian differentiates itself from other Fur Coat users with its high Speed, outspeeding dangerous physical threats like Koraidon and threatening them with Knock Off or Will-O-Wisp. Spirit Break is a weaker alternative to Magical Torque that offers more PP and a useful secondary effect, preventing Calm Mind Arceus formes and Torch Song Eternatus from freely setting up. Knock Off removes important items like Choice Band and Assault Vest from Pokemon like Groudon and Ting-Lu, respectively, as well as removing Imposter Chansey's Eviolite. Will-O-Wisp neutralizes most physical attackers like Koraidon. Spirit Shackle threatens to trap and eliminate Imposter users and physical threats walled by Zacian. Toxic cripples Imposter users and most Fur Coat users. Heavy-Duty Boots and Leftovers help mitigate entry hazard damage, allowing Zacian to check physical threats more reliably, while Covert Cloak provides protection against status conditions from Nuzzle and Mortal Spin. Zacian can struggle to handle extremely powerful physical wallbreakers like Groudon and Mold Breaker Koraidon by itself, so secondary physical walls like Fur Coat Arceus formes are appreciated as teammates; they can also Imposter-proof Zacian. Despite outspeeding threats like Palkia-O and Flutter Mane, Zacian cannot switch in, so a special wall like Ice Scales Dialga-O or Chansey can help pivot Zacian in. Tera Water grants a resistance to V-create and Gigaton Hammer, the latterof which Koraidon commonly uses to threaten Zacian.</p> "
      },
      {
        "name": "Pixilate",
        "description": "<p>Pixilate Zacian is a powerful cleaner. Pixilate boosted Population Bomb is an incredibly strong STAB move, 2HKOing defensive behemoths like Fur Coat Dondozo at +2. Coil + Protective Pads and Swords Dance + Wide Lens both increase Population Bomb's power and accuracy, with the former bypassing Rocky Helmet and the latter providing a stronger boost, notably letting Zacian boost past Strength Sap. Rapid Spin with Pixilate provides unblockable entry hazard removal in a pinch, while Precipice Blades targets Fairy-resistant Pokemon like Arceus-Poison and Arceus-Fire. Spirit Shackle is an option with Coil to trap and eliminate Imposter users, which are otherwise problematic. Knock Off users like Ting-Lu and Groudon are mandatory for Wide Lens sets to remove Rocky Helmet. While Zacian can remove hazards with Rapid Spin, hazard setters often carry moves that can heavily cripple it like Nuzzle and Knock Off, making another hazard remover like Tidy Up Groudon or Mortal Spin Ting-Lu a good choice. Groudon notably also pressures Fairy-resistant Pokemon like Arceus-Poison and Arceus-Fire well. Imposter users serve as a strong check to this set, so having a sturdy Imposter-proofing teammate is necessary, with Rocky Helmet + Fur Coat users or Corviknight being good candidates.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}, {"username": "Sulo", "user_id": 528036}]}]}
  },
  "Eternatus": {
    "sets": [
      {"name": "Fur Coat", "description": "<p>Fur Coat Eternatus is a bulky wall that can set up late-game to clean through weakened teams. Spikes helps provide team support by setting entry hazards, while Teleport provides teammates with a safe switch-in. Torch Song hits most Steel-types and sets up at the same time; alternatively, Scorching Sands hits Steel-types for super effective damage with an additional chance to burn foes for constant chip. Heavy-Duty Boots increases longevity, while Draco Plate allows Eternatus to self-Imposter-proof with Judgment. Good teammates for Fur Coat Eternatus are Ice Scales Arceus-Fairy and RegenVest Dialga-O, as they can Imposter-proof or provide opportunities for Eternatus to switch in. Tera Flying provides Eternatus with a Ground-type immunity and helps with Imposter-proofing, whereas Tera Fairy grants a Dragon-type move immunity + Fighting-type resistance.</p> "},
      {"name": "Offensive", "description": "<p>Offensive Eternatus is a wallbreaker that provides immense pressure. Nasty Plot breaks past defensive walls such as Hisuian Goodra, Zamazenta-C, and Arceus formes like Arceus-Ghost and Arceus-Water. Strength Sap allows Eternatus to remain at full HP, negating Life Orb recoil and keeping Dragon Energy at full power. Magma Storm allows Eternatus to trap defeat opposing Steel-types such as Zamazenta-C and Dialga-O while providing additional chip damage; alternatively, Earth Power is weaker but allows Eternatus to hit Dialga-O harder. Good teammates for offensive Eternatus include Groudon, Palkia-O, and Flutter Mane since they can weaken special walls Eternatus can't break through. Tera Flying provides an immunity to Ground-type moves and Spikes, while Tera Fairy grants an immunity to Dragon-type moves and self-Imposter-proofs more easily.</p> "},
      {"name": "Regenerator", "description": "<p>Regenerator Eternatus is a reliable support pivot that provides good utility. Spikes apply more pressure on opposing Pokemon switching in; Stone Axe is an alternative as well. Final Gambit allows Eternatus to take out opposing special walls such as Ting-Lu, Dialga-O, and Hisuian Goodra when healthy, opening up opportunities for teammates if they're having trouble breaking through a defensive core. Heavy-Duty Boots helps Eternatus maintain high Base Power for Dragon Energy and Final Gambit. Good teammates for this Eternatus set include Arceus-Ghost and Palkia-O since Volt Switch gives them more opportunities to switch in while Final Gambit can remove potential special walls. Tera Fairy grants an immunity to Dragon-type attacks from attackers such as Koraidon, Palkia-O, and opposing Eternatus while also allowing Eternatus to Imposter-proof itself.</p> "}
    ],
    "credits": {"writtenBy": [{"username": "TTTech", "user_id": 338877}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "Chessking345", "user_id": 355040}]}, {"name": "Grammar checked by", "members": [{"username": "UT", "user_id": 523866}]}]}
  },
  "Ursaluna": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Ursaluna is an incredibly dangerous wallbreaker thanks to its great Attack and STAB combination. Population Bomb packs absurd power, 2HKOing Fur Coat Dondozo with 8 or more hits. Headlong Rush excels at removing the Steel- and Ghost-types that would switch in on Population Bomb, such as Zamazenta-C and Arceus-Ghost. Extreme Speed is the strongest priority in the tier and excels at picking off offensive threats, like Enamorus and Palkia-O, after slight chip damage. U-turn lets Ursaluna maintain momentum against switch-ins and helps scout Rocky Helmet. Ursaluna's best fit is on balance and offense teams, which can maximize the opportunities it gets to switch in and wallbreak. Knock Off support is mandatory to remove Rocky Helmet, as using Population Bomb into a holder often instantly KOes Ursaluna; for this reason, teammates like Groudon or RegenVest users like Ting-Lu are recommended, the latter of which also offers safe pivoting. Ursaluna struggles to break Fur Coat Ghost-types, such as Arceus-Ghost and Giratina, so teammates like Hoopa-U and Arceus-Ghost are recommended to overcome these. It's best to Imposter-proof Ursaluna with a bulky Rocky Helmet user, such as Fur Coat Dondozo or Groudon. Tera Normal boosts Ursaluna's damage output, notably allowing Extreme Speed to OHKO Palkia-O after Spikes.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Isaiah", "user_id": 375662}]}]}
  },
  "Enamorus": {
    "sets": [
      {
        "name": "Pixilate",
        "description": "<p>Enamorus's good offensive stats combined with Pixilate make it a reliable offensive utility Pokemon. Boomburst deals heavy damage to all targets, except the limited pool of Fairy-resistant Pokemon, and bypassing Substitute means Enamorus can soft check its users like Arceus-Dark. Rapid Spin makes Enamorus a strong entry hazard clearer, with a Spikes immunity making it difficult to wear down, and the Speed boost ensures Enamorus can threaten faster Pokemon like Palkia-O and Koraidon. V-create lets Enamorus significantly damage Ice Scales or Assault Vest users like Hisuian Goodra; alternatively, Headlong Rush hits many of these special walls super effectively at the cost of Base Power. Strength Sap provides reliable recovery, negates Life Orb recoil, and allows Enamorus to beat threats like Groudon and Zamazenta-C one-on-one. Life Orb notably ensures Boomburst will 2HKO Arceus, and V-create can OHKO Tera Grass Ice Scales Clodsire. Enamorus's best fit is on balance and offense teams, which appreciate a non-passive entry hazard remover. It synergizes with Ground-type attackers like Groudon and Ursaluna, as these can threaten Enamorus's walls like Arceus-Fire. Teammates that can bring Enamorus in safely, such as Koraidon and RegenVest Dialga-O, help bypass its middling bulk. Tera Fire boosts V-create's damage and allows Enamorus to beat a weakened Imposter user, whereas Tera Ground allows Headlong Rush to OHKO Hisuian Goodra and Clodsire.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Dondozo": {
    "sets": [
      {
        "name": "Fur Coat",
        "description": "<p>Fur Coat Dondozo is a great defensive Pokemon with its high physical bulk and typing, which allows it to wall physical attackers such as Koraidon and Groudon. Spikes supports offensive teammates, while Haze stops foes like Tidy Up Groudon from setting up. Knock Off removes items such as Covert Cloak and Leftovers, and Scald burns provide chip damage on foes. Flip Turn makes it easier to pivot into offensive teammates such as Koraidon, since Taunt, Dark-types, and Magic Bounce don't block it; alternatively, Parting Shot makes the foe easier to handle for Dondozo's teammates, but it's stopped by Taunt and Good as Gold. Heavy-Duty Boots, notably eases Dondozo's pivoting, while Rocky Helmet punishes contact moves such as U-turn and V-create. Covert Cloak protects against secondary effects like confusion from Magical Torque and burns from Scald. Tera Fire allows Dondozo to resist Magical Torque and Grass-type moves from Arceus-Fire, and it maintains Dondozo's resistance to Fire-type moves such as V-create. Dondozo appreciates defensive teammates with typing synergy such as RegenVest Ting-Lu, which helps protect Dondozo from threatening Pokemon such as Eternatus.</p> "
      },
      {
        "name": "Prankster",
        "description": "<p>Prankster Dondozo with Haze can reliably check physical setup sweepers such as Groudon thanks to its huge physical bulk. Entrainment forces out Pokemon dependent on their abilities, Encore can lock foes into unfavorable moves such as setup moves or V-create, and Glare debilitates fast attackers such as Koraidon and Palkia-O. Parting Shot allows Dondozo to maintain momentum against opposing threats such as Arceus-Ghost with its priority pivoting and attack stat reduction, making it easier for teammates such as Ting-Lu to take hits from them; alternatively, Flip Turn provides a pivoting option unaffected by Taunt, Dark-types, and Magic Bounce. Heavy-Duty Boots, notably eases Dondozo's pivoting, while Covert Cloak protects it from status conditions from moves such as Nuzzle, Mortal Spin, and Magical Torque. Tera Fire improves Dondozo's matchup against Arceus-Fire with Grass-type coverage and lets it resist V-create and Magical Torque, whereas Tera Dark makes Dondozo immune to status moves from other Prankster users and improves its matchup against Ghost- and Dark-types. RegenVest Hisuian Goodra, Ting-Lu, and Fur Coat users synergize with Dondozo, covering threats such as Arceus-Fairy, Groudon, and Palkia-O.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "TTTech", "user_id": 338877}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "Tea Guzzler", "user_id": 577920}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  },
  "Flutter Mane": {
    "sets": [
      {
        "name": "Flare Boost",
        "description": "<p>Flame Orb + Flare Boost grants Flutter Mane a pseudo-immunity to crippling status like paralysis and poison while granting a power boost that cannot be removed by Knock Off. At +2, Flutter Mane is capable of 2HKOing even Ice Scales Arceus formes with Astral Barrage. Due to Flutter Mane's naturally low HP stat, Pain Split is an effective way to increase its longevity while notably annoying Chansey and being ineffective for Imposter users. Tera Fairy boosts Moonblast's damage while shedding Flutter Mane's Ghost weakness, making it useful against Knock Off and stray Ghost-type moves. Tera Ghost further boosts Astral Barrage, helping Flutter Mane break past walls like Calm Mind Ice Scales Arceus formes, and helps defensively against Dialga-O's Revelation Dance. Tera Steel prevents potential revenge killing from Iron Bundle's Boomburst and Koraidon's Gigaton Hammer, as well as resisting Dialga-O's Revelation Dance. Flutter Mane pairs very well with other special attackers, such as Palkia-O, Eternatus, and setup Arceus formes, that place heavy pressure on opposing special walls like Chansey and Ice Scales Dialga-O. Setup Arceus formes can also inflict Chansey with poison using Toxic or Mortal Spin, greatly increasing Flutter Mane's capability of stalling it out of recovery. Defensive pivots like Ting-Lu can provide entry hazard support, deny momentum from Chansey, and pivot Flutter Mane in safely. Paralysis support from the likes of Ting-Lu can also slow down the troublesome Zacian, which outspeeds and threatens Flutter Mane. Imposter-proof Flutter Mane with a special wall with a relatively low HP stat like Ice Scales Zacian, though your Chansey can also Imposter-proof it at the risk of providing Pain Split healing for the opposing Imposter.</p> "
      },
      {
        "name": "Pixilate",
        "description": "<p>Pixilate Flutter Mane takes advantage of the lack of sturdy Fairy-resistant special walls to fire off powerful Pixilate-boosted Boombursts. Volt Switch retains momentum, chips checks like Chansey and Ice Scales Zacian, and scouts Terastallization. Pain Split increases Flutter Mane's longevity while chipping Chansey for good damage. Trick is an alternative to cripple special walls like Chansey for teammates. Tera Fairy further boosts Boomburst's damage output, letting it 2HKO Ice Scales Zacian, as well as 2HKOing Ice Scales Dialga-O and Arceus formes after 1 layer of Spikes. Flutter Mane greatly appreciates Knock Off support from teammates like Ting-Lu to remove items like Assault Vest, Heavy-Duty Boots, and Chansey's Eviolite to enhance its offensive potential. Entry hazards and paralysis support from the likes of Ting-Lu and Dialga-O help chip down special walls into 2HKO range and neutralize faster threats like Zacian, respectively. Other special attackers like Palkia-O and Eternatus can capitalize on crippled special walls from Flutter Mane's Trick. Flutter Mane can be easily Imposter-proofed by your own Chansey, but a Ground-type like Ice Scales Arceus-Ground can deny momentum from the Imposter user's Volt Switch.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Chessking345", "user_id": 355040}], "teams": [{"name": "Quality checked by", "members": [{"username": "Tea Guzzler", "user_id": 577920}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Iron Bundle": {
    "sets": [
      {
        "name": "Refrigerate",
        "description": "<p>Iron Bundle's niche lies in its good Speed and fair Special Attack, allowing it to outrun and chase out Koraidon and Flutter Mane. Refrigerate + Boomburst hits every relevant special wall for decent damage, notably OHKOing Ting-Lu after Spikes. Steam Eruption targets non-Desolate Land Arceus-Fire, which can otherwise tank Boomburst, and it also threatens to force extra chip damage on foes with a burn. Volt Switch maintains momentum against Iron Bundle's checks and helps rack up Spikes damage. Electro Drift 2HKOes Arceus-Water, Kyogre, and Eviolite Imposter users; alternatively, Trick can cripple switch-ins like Chansey, although it's ineffective against most Arceus. Iron Bundle's best fit is on balance teams, which can give it multiple opportunities to wallbreak and can keep it safe from entry hazards. Iron Bundle's damage output is relatively low compared to other special attackers like Flutter Mane and Palkia-O, even with Tera Ice, so entry hazard support from the likes of Zacian and Ting-Lu is highly recommended to break through walls like Ice Scales Dialga-O and Arceus. Iron Bundle's low bulk and vulnerability to paralysis mean that slow pivoting teammates, like Dialga-O and Ting-Lu, are recommended to get it on the field safely. Imposter-proof Iron Bundle with Chansey or an Ice Scales user like Zacian or Dialga-O.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "autumn", "user_id": 384270}]}]}
  },
  "Ting-Lu": {
    "sets": [
      {
        "name": "RegenVest",
        "description": "<p>RegenVest Ting-Lu is a reliable special wall and a premier momentum generator. Regenerator gives Ting-Lu reliable recovery without conflicting with Assault Vest. Nuzzle discourages dangerous attackers like Palkia-O from switching in. U-turn allows Ting-Lu to safely bring in teammates thanks to its low Speed. Stone Axe forces chip damage on foes, letting offensive teammates wallbreak more easily. Knock Off removes items like Heavy-Duty Boots and Covert Cloak, making Ting-Lu's own utility more effective; it also punishes Imposter users attempting to gain Regenerator. Ting-Lu fits best on balance teams, which appreciate its ability to spread paralysis and safely bring in teammates thanks to its huge bulk. Dangerous wallbreakers like Koraidon and Palkia-O help maximize the effectiveness of U-turn pivoting. Ting-Lu is unable to naturally check Palkia-O and Fairy-types like Flutter Mane, so a teammate that helps shore up this weakness, such as Arceus-Grass or Hisuian Goodra, is appreciated. Tera Fairy provides an immunity to Dragon, allowing Ting-Lu to block Dragon Energy from Palkia-O and Glaive Rush from Koraidon; alternatively, Tera Grass provides a Water resistance, covering for Palkia-O's Water Spout.</p> "
      },
      {"name": "Prankster"},
      {"name": "Magic Bounce"}
    ],
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Sulo", "user_id": 528036}]}]}
  },
  "Koraidon": {
    "sets": [
      {
        "name": "Choice Band",
        "description": "<p>Choice Band Koraidon is a premier wallbreaker thanks to its Speed and typing. Glaive Rush is immensely spammable and lacks consistent switch-ins outside of Fur Coat Dondozo and Zacian, and it's bolstered even further by Tera Dragon, which allows Koraidon to 2HKO Fur Coat Groudon and Arceus after Spikes. Mold Breaker is an alternative to Sword of Ruin that secures said 2HKOes without the need for Spikes, albeit at the cost of less damage against non-Fur Coat Pokemon. Close Combat nukes Ting-Lu and Corviknight. Gigaton Hammer threatens Zacian, Arceus-Fairy, and Enamorus, which are otherwise hard counters, and it also helps against Tera Fairy users like Groudon. Flip turn allows Koraidon to maintain momentum, helps scout Terastallization, and dents Groudon, whereas Toxic can benefit its team by forcing extra chip damage onto Fur Coat users. Koraidon's best fit is on balance and offense teams, as these give it multiple opportunities to wallbreak, and they easily take advantage of the passive walls it can't beat one-on-one, like Fur Coat Dondozo. Koraidon's mediocre defensive typing and vulnerability to status mean that slow-pivoting teammates, like Ting-Lu and Dialga-O, are recommended to bring it in safely; helpfully, Koraidon forces out Imposter users transformed into these pivots. Teammates that can limit opposing Strength Sap, like Chansey and Liquid Ooze users, help ensure that foes hit by Gigaton Hammer can't safely heal as Koraidon switches. To Imposter-proof Flip Turn sets, use bulky Fur Coat users that aren't weak to Koraidon's attacks, like Groudon or Arceus-Water, and Imposter-proof Toxic variants with Fur Coat Arceus-Poison or Prankster Corviknight.</p> "
      }
    ],
    "credits": {"writtenBy": [{"username": "Tea Guzzler", "user_id": 577920}], "teams": [{"name": "Quality checked by", "members": [{"username": "Chessking345", "user_id": 355040}, {"username": "TTTech", "user_id": 338877}]}, {"name": "Grammar checked by", "members": [{"username": "Adeleine", "user_id": 517429}]}]}
  }
}