{
  "Charmander": {"sets": {"Sun Wallbreaker": {}}},
  "Sandshrew": {"sets": {"Sand Sweeper": {}}},
  "Sandshrew-Alola": {
    "sets": {
      "Sweeper": {
        "description": "<p>Alolan Sandshrew carves out a neat role in LC as both a sweeper and utility Pokemon. Its Ice / Steel typing makes it one of the few reliable Flying-resistant Pokemon in the tier. Triple Axel gives Alolan Sandshrew strong STAB coverage, and Earthquake hits the Fire- and Steel-types that Triple Axel cannot. Building off of this, Alolan Sandshrew has a few useful options depending on team needs: Rapid Spin provides entry hazard control while making it faster than the entire unboosted metagame, Swords Dance allows it to sweep late-game, and Ice Shard picks off weakened threats like Vullaby. Tera Fairy is preferred because it flips the script on Fighting- and Dark-types like Mienfoo and Vullaby, letting Alolan Sandshrew stay in where it normally couldn’t. Alolan Sandshrew also has the option to run Safety Goggles to shut down Spore from opposing Foongus and set up on it.</p> <p>Alolan Sandshrew shines against Ground-, Grass-, and Flying-types, often forcing awkward Terastallizations like Water and Steel from staples like Foongus, Mudbray, and Mienfoo. This opens the door for teammates such as Elekid and Alolan Diglett to make progress. Pokemon that appreciate Rapid Spin support, such as Wingull and Vullaby, also pair very well with Alolan Sandshrew. On the flip side, Alolan Sandshrew really struggles with Mienfoo, Ground-types like Alolan Diglett and Mudbray, and uncommon coverage like Heat Wave from Vullaby. Pairing it with reliable checks to these threats such as Foongus, Grookey, and Chinchou helps cover those weaknesses and gives it the breathing room it needs to do its job.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 537035, "username": "rahul_3301"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 605215, "username": "Flou"}, {"user_id": 440139, "username": "Éric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 681606, "username": "BrisingrDraconis"}, {"user_id": 384270, "username": "autumn"}]}]}
  },
  "Diglett-Alola": {
    "overview": "<p>Alolan Diglett is an excellent wallbreaker and late-game cleaner in Little Cup, with a blazing Speed tier and dangerous STAB combination. With solid coverage and the power boost from Life Orb, Alolan Diglett can OHKO or 2HKO most of the tier. Despite its strengths, Alolan Diglett is very frail, making it difficult to get onto the field without support and means it is also susceptible to priority moves.</p>",
    "comments": "<h3>Other Options</h3> <p>Alolan Diglett can use Swords Dance to be near unstoppable after a boost, but it is unreliable due to Alolan Diglett's fragility leaving few opportunities to set up. Tera Blast Flying deals heavy damage to Mienfoo and Foongus and OHKOs the two if they lost their Eviolite as well as OHKOing Toedscool from full health with Eviolite, but other Tera types are often more useful. Alolan Diglett can be used as a lead on hyper offense teams with a Focus Sash to set Stealth Rock and faint with Memento for a teammate to set up.</p> <h3>Checks and Counters</h3> <p><strong>Choice Scarf Pokemon</strong>: Choice Scarf users such as Hisuian Growlithe and Mienfoo can outspeed and revenge kill Alolan Diglett.</p> <p><strong>Shellder</strong>: Shellder is able to set up Shell Smash on Alolan Diglett due to its high Defense and threaten to sweep, but should be wary of Earthquake into Sucker Punch, which will KO Shellder.</p> <p><strong>Grookey</strong>: Grookey's Grassy Terrain halves the power of Earthquake and lets it threaten Alolan Diglett with priority Grassy Glide.</p> <p><strong>Bulky Pokemon</strong>: Pokemon like Mienfoo, Foongus, and Mudbray can take a hit from Alolan Diglett if they are healthy enough and threaten it back.</p>",
    "sets": {
      "Life Orb": {
        "description": "<p>Earthquake threatens OHKOs on Pokemon such as Glimmet, Tinkatink, and Chinchou. Rock Blast threatens the Flying-types that otherwise would give Alolan Diglett trouble, notably Vullaby due to the interaction with Weak Armor. Sucker Punch helps Alolan Diglett pick off weakened foes that Speed tie or outspeed it, such as Wingull and Hisuian Growlithe. Iron Head lets Alolan Diglett almost always 2HKO Toedscool and Grookey, with the added flinch chance helping against bulky Pokemon like Mienfoo. Alternatively, Substitute can be used to scout for Terastallizations, switches, and Sucker Punch from Stunky and opposing Alolan Diglett. Alolan Diglett has many viable Tera types available to it: Tera Ground boosts the damage of Earthquake, KOing most neutral targets such as Mienfoo and Foongus after some chip damage, Tera Dark powers up Sucker Punch while giving Alolan Diglett a resistance to opposing Sucker Punch users like the aforementioned Stunky, and Tera Stellar provides a small boost to all of Alolan Diglett's attacks, which can allow it to pick up some surprise KOs.</p> <p>Alolan Diglett's high Speed and damage output make it a perfect fit on offensive structures. Pivot support is vital for Alolan Diglett to safely get onto the field, which can be provided by U-turn from Mienfoo and Vullaby and Volt Switch from Elekid and Chinchou. Shellder is a great ally for Alolan Diglett, as it can break down bulky checks such as Foongus and Mienfoo for Alolan Diglett while also turning Choice Scarf users like Hisuian Growlithe into opportunities to set up. Teammates like Vullaby, Stunky, and Tinkatink can remove Eviolite from Pokemon that are usually able to take a hit from Alolan Diglett such as Mienfoo and Mudbray are appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 605215, "username": "Flou"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641532, "username": "bleahey"}, {"user_id": 387847, "username": "Hacker"}]}, {"name": "Grammar checked by", "members": [{"user_id": 593115, "username": "igiveuponaname"}]}]}
  },
  "Meowth": {"sets": {"Revenge Killer": {}}},
  "Psyduck": {"sets": {"Rain Wallbreaker": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 330191, "username": "Altariel von Sweep"}]}]}},
  "Mankey": {
    "outdated": true,
    "sets": {
      "Choice Scarf": {
        "description": "<p>Mankey is one of the most powerful Choice Scarf users in Little Cup thanks to its high Speed, which allows it to outpace or tie with the entire unboosted metagame. This allows Mankey to beat other common Choice Scarf users such as Magnemite, Mudbray, and Gothita. U-turn allows it to greatly capitalize on the switches it forces. Earthquake is a powerful coverage move that hits Mareanie, Glimmet, and Voltorb. Assurance is used to deal as much damage as possible to Ghost-types, OHKOing Eviolite variants on the switch if Stealth Rock is up, while Ice Punch OHKOes Toedscool and threatens Flying-types like Wattrel. Stone Edge is an uncommon option to hit Larvesta and Flying-types. Vital Spirit can be helpful on teams lacking a Grass-type, as it provides a switch-in to Toedscool's Spore, while Defiant is very useful in matchups against Pokemon such as Sticky Web Surskit and Parting Shot Shroodle, as the Attack boosts make Mankey nigh unwallable. Tera Fighting allows Mankey to hit as hard as possible with Close Combat in situations where an unboosted hit is insufficient. Some of Mankey's best teammates include Toedscool to switch in on Ghost-types and remove entry hazards, which can hamper Mankey's pivoting abilities, and either Gothita or Diglett, which can remove the bulky Poison-types like Mareanie and Foongus that give Mankey trouble. Mankey also performs well as part of a VoltTurn core with Pokemon like Volt Switch Voltorb and U-turn Zorua.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 342456, "username": "Drifting"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 107567, "username": "gali"}, {"user_id": 440139, "username": "Éric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Growlithe-Hisui": {
    "sets": {
      "Choice Scarf": {
        "description": "<p>Hisuian Growlithe serves as a potent wallbreaker with a Choice Scarf. Its ability to spam high-Base Power moves makes it a difficult Pokemon to switch into, often forcing guessing games between Flare Blitz and Head Smash. Psychic Fangs deters more reliable switch-ins to Hisuian Growlithe's STAB moves, hitting Mienfoo and Mareanie. Psychic Fangs also has the additional benefit of breaking screens, something that may hinder Hisuian Growlithe's wallbreaking. The final slot is flexible, with Rock Blast offering a lower-power alternative to Head Smash, with better accuracy and more PP that also beats Terastalized Weak Armor Vullaby. Stealth Rock allows Growlithe to provide role compression to offensive teams through offering entry hazard support, while Sleep Talk lets it sponge Spore from Foongus and still pose a threat. Tera Fire provides a stronger Flare Blitz to power through other bulky checks like Mudbray and the aforementioned Mienfoo.</p> <p>Much like many other wallbreakers in the tier, Hisuian Growlithe prefers having hazards off the field as much as possible. Defog and Rapid Spin users such as Vullaby and Toedscool enable it to get in frequently, with the former also able to provide pivoting support and the latter providing Spore support. Mienfoo is another good teammate, as it can tank opposing Hisuian Growlithe's attacks and pivot your own in. Partners like Gastly and Gothita also provide offensive synergy, being able to pressure checks such as Mareanie and Glimmet.</p>"
      },
      "Eviolite": {
        "description": "<p>Eviolite Hisuian Growlithe is an amazing wallbreaker that trades the immediate speed of Choice Scarf sets for more utility options and the ability to switch moves, boasting powerful attacks that can 2HKO almost any foe without the drawback of recoil. Stealth Rock helps rack up passive damage on opposing Pokemon, while Flame Charge is sometimes chosen for a more offensive approach to make up for Hisuian Growlithe's middling Speed. Will-O-Wisp helps punish common switch-ins like Mienfoo and Mudbray, while Substitute is a safe way to scout for switches and catch Sucker Punch from opposing Pawniard and Stunky. Tera Fire boosts Flare Blitz's damage, allowing it to 2HKO offensive Mudbray, and removes Hisuian Growlithe's weakness to Fighting, while Tera Flying turns Hisuian Growlithe's weaknesses to Ground and Fighting into resistances.</p> <p>Hisuian Growlithe enjoys VoltTurn support from teammates such as Mienfoo and Hisuian Voltorb, which in turn enjoy Hisuian Growlithe's ability to nuke Pokemon like Foongus and Pawniard. Landing a Will-O-Wisp on prominent physical attackers like Mienfoo and Mudbray is greatly appreciated by setup sweepers such as Shellder, which appreciate not taking as much damage on setup turns. Hisuian Growlithe struggles with Pokemon that can resist its STAB moves and KO it back such as Mienfoo and Glimmet, so it pairs well with trappers like Gothita and Trapinch that can remove them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 205631, "username": "BlackKnight_Gawain"}, {"user_id": 623117, "username": "teamo"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 440139, "username": "Éric"}, {"user_id": 387847, "username": "Hacker"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}, {"user_id": 333742, "username": "modularform"}]}]}
  },
  "Tentacool": {"sets": {"Utility": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 430377, "username": "Acehunter1"}]}]}},
  "Magnemite": {"sets": {"Trapper": {}}},
  "Doduo": {"sets": {"Fast Attacker": {}}},
  "Grimer-Alola": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Thanks to a solid typing with one weakness and good defensive stats, Alolan Grimer is able to use Knock Offs consistently throughout a game, weakening the opposing team for its teammates to take advantage of. Gunk Shot is used to hit Pokemon that have already been hit by Knock Off, while Drain Punch OHKOs Pawniard and provides some recovery to increase Grimer's longevity. Drain Punch also allows it to damage other Alolan  Grimer neutrally, making it valuable in matchups against opposing Alolan Grimer. Sleep Talk can be used to make Alolan Grimer a great Foongus check and sleep absorber for the team, while Memento gives sweeper teammates a chance to set up. Imprison, together with a bit of Speed investment, lets Alolan Grimer completely shut down opposing Alolan Grimer. Tera Grass eliminates Grimer's only weakness to Ground and lets it take on opposing Hisuian Voltorb more easily.</p> <p>Alolan Grimer is forced out by Ground-types like Mudbray, Numel, and opposing Toedscool, so checks to those Pokemon like Drifloon, Toedscool, and Shellos are essential. Alolan Grimer pairs well with offensive sweepers like Unburden Shroodle, Shellder, and Numel, which can sweep more easily due to Alolan Grimer weakening the enemy team with Knock Off. Grookey is a good partner as well, since Grassy Terrain gives Alolan Grimer much appreciated passive recovery and cuts damage from Earthquake in half, while Alolan Grimer's Knock Off makes switching into Grookey's Wood Hammer much harder. Volt Switch users like Hisuian Voltorb and Wattrel can help get Alolan Grimer in safely, and they can help pressure and overwhelm Ground-types for each other.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 588203, "username": "Charis_Akins"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "ghost"}, {"user_id": 440139, "username": "Éric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 356215, "username": "Clouds"}]}]}
  },
  "Shellder": {
    "overview": "<p>Shellder is an elite setup sweeper in LC, as using Shell Smash provides it power, and Skill Link helps fire off consistent multi-hit moves with Icicle Spear and Rock Blast. Having great physical bulk gives it enough opportunities to set up. Once boosted, it can outspeed and break through most of the metagame. However, its poor Special Defense, reliance on setup, and weakness to priority make it dependent on correct positioning.</p>",
    "comments": "<h3>Other Options</h3> <p>Tera Blast Grass and Ground are options that can surprise foes that Terastallize into a Water- or Steel-type to wall Shellder, but this is inconsistent and often comes down to uncomfortable guesses. A Jolly nature can be used for insurance versus rare Speed ties in a mirror matchup, but the power drop compared to Adamant is significant. Ice Shard is a viable option to outplay Sucker Punch or get the KO when Shellder cannot outspeed a foe. Shellder also has the option of running a special set with Hydro Pump, Ice Beam, and Tera Blast.</p> <h3>Checks and Counters</h3> <p><strong>Faster Electric-types</strong>: Chinchou and Elekid can KO an unboosted Shellder or force it to Terastallize early.</p> <p><strong>Defensive Terastallizations</strong>: Niche picks like Tera Water Chespin with Bulletproof wall Shellder completely, while staples like Mienfoo and Foongus often use Tera Water or Steel to survive a hit and recover health with Regenerator.</p> <p><strong>Priority</strong>: Grassy Glide from Grookey and Sucker Punch from Stunky or Alolan Diglett can KO Shellder after chip damage.</p>",
    "sets": {
      "Shell Smash": {
        "description": "<p>Icicle Spear and Rock Blast are non-negotiable, as they are the hardest-hitting moves in its arsenal. The third moveslot depends on what the team needs: Liquidation adds Water-type coverage, Protect scouts for Fake Out and Terastallizations from foes, and Substitute can punish Sucker Punch or a passive play by giving Shellder a free setup turn. An Adamant nature is chosen for the extra power, since at +2, Shellder already outspeeds every relevant Choice Scarf user. For its Tera type choices, Tera Water boosts Liquidation's damage, Tera Rock provides a Fake Out resistance while boosting Rock Blast's damage, and Tera Ghost blocks Mienfoo's High Jump Kick to allow for setup oppurtunites. This array of possibilities makes it tough for the opponent to plan the optimal pathing to deal with Shellder.</p> <p>Shellder fits easily on many team styles. It appreciates Mienfoo and Vullaby, as they can strip Eviolite from bulky checks such as opposing Mienfoo, Mareanie, and Chinchou with Knock Off, as well as providing pivot support with U-turn to bring it in safely. Teammates like Mudbray and Chinchou handle Electric-types that threaten Shellder. Shellder also appreciates Stealth Rock and Spikes support from teammates like Mudbray, Glimmet, and Toedscool to chip foes like Mienfoo to get them into KO range of its attacks.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 537035, "username": "rahul_3301"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 605215, "username": "Flou"}, {"user_id": 387847, "username": "Hacker"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Koffing": {
    "sets": {
      "Tank": {
        "description": "<p>Koffing establishes itself as an excellent physical tank in Little Cup due to its high base Defense stat and Poison typing, which let it check physical attackers like Mienfoo and Timburr. Koffing's best use comes from its ability Neutralizing Gas, which has useful applications, such as denying Mienfoo and Foongus recovery from Regenerator, preventing Snivy from gaining a Special Attack boost from Leaf Storm with Contrary, and denying Hisuian Growlithe the ability to avoid recoil from Head Smash and Flare Blitz. Thunderbolt gives Koffing an option to hit Vullaby and Mareanie for super effective damage. Will-O-Wisp can weaken physical attackers that may switch into Koffing such as Mudbray and Trapinch. Pain Split is Koffing's only good recovery option. Fire Blast can be used over Will-O-Wisp or Pain Split to hit Steel-types and Foongus super effectively. Koffing's EV spread allows it to leverage its already high Defense stat and boost its attacks, letting it 2HKO Pokemon like Foongus with Sludge Bomb if its Eviolite is removed. Koffing uses Tera Water, as it's a generally good defensive type, and it additionally lets Koffing take minimal damage from Shellder's Icicle Spear.</p> <p>Teammates that appreciate Koffing's presence include Mudbray, as Koffing can check Snivy, which can come in easily against Mudbray. Pawniard also makes use of Koffing's ability to deny Mienfoo's Regenerator, making it easier to remove it for Pawniard. Koffing struggles against Glimmet and Hisuian Growlithe, as neither are threatened by any of Koffing's attacks. Mudbray is a good teammate, as it can switch in to both Pokemon and scare them out with Earthquake. Additionally, Gothita can assist Koffing with Glimmet due to Shadow Tag, letting it trap Glimmet for Koffing.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 605215, "username": "Flou"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "ghost"}, {"user_id": 387847, "username": "Hacker"}]}, {"name": "Grammar checked by", "members": [{"user_id": 594478, "username": "ken"}]}]}
  },
  "Rhyhorn": {"sets": {"Setup Sweeper": {}}},
  "Chinchou": {
    "sets": {
      "Pivot": {
        "description": "<p>Chinchou's defensive typing and ability, as well as its excellent coverage, make it a serviceable pivot. It is malleable to many team archetypes due to its role compression; Chinchou can block Volt Switch from common Electric-types like Elekid and opposing Chinchou, switch into Wingull and Fire-types like Hisuian Growlithe, and break open teams with few existing switch-ins to its STAB attacks. Ice Beam is a midground attack for Ground- and Grass-type switch-ins like Foongus and Mudbray that may sneak in when Chinchou faces Flying-type Pokemon. Its accuracy also makes it a reliable attack against chipped Electric-resistant foes. Flip Turn may be used over Volt Switch for more reliable pivoting against Electric-immune Pokemon. With 132 Defense EVs, Chinchou survives two Knock Offs from physical Vullaby. Tera Flying shields Chinchou from Ground-types like Alolan Diglett; Tera Ground and Tera Grass Tera Blast users like Wingull and Elekid, respectively; and Fighting-types like Mienfoo. Further, Chinchou benefits even more from its valuable Electric-type immunity.</p> <p>Chinchou's defensive profile makes it a versatile fit on many balance and offense structures. Teams weak to Electric-type moves, such as those with Vullaby, Mareanie, or Wingull, appreciate Chinchou's presence, as Chinchou may switch in on Elekid and opposing Chinchou. Chinchou is also one of the few Wingull and Nasty Plot Vullaby switch-ins, and it rounds off balance structures centered around Mienfoo and Foongus. Alolan Diglett appreciates Chinchou's Fire- and Water-type resistances, and it may serve as a second Electric-immune Pokemon without the vulnerabilities of using double Ground-types. Chinchou has trouble breaking through Mienfoo and Grass-types like Foongus. Thus, Gothita makes an excellent partner, threatening to trap and KO either one each time it switches in. Fire- and Flying-types such as Hisuian Growlithe and Vullaby also make strong partners, feeding off the momentum generated by Chinchou pivoting on these targets with Volt Switch. Opposing Alolan Diglett may switch in on Volt Switch or after an ally faints and threaten to KO Chinchou or set up a Substitute. Mudbray, Grookey, and Foongus are fallbacks that can switch in and check Alolan Diglett, though Foongus may be 2HKOed if Alolan Diglett Terastallizes. Mudbray also complements Chinchou as a Vullaby check that is not weak to Ground-type foes.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641532, "username": "bleahey"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 605215, "username": "Flou"}, {"user_id": 440139, "username": "Éric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Snubbull": {
    "sets": {
      "Physically Defensive": {
        "description": "<p>Snubbull fills a valuable role in Little Cup as a reliable Fighting- and Dark-type check through the combination of its pure Fairy typing and ability in Intimidate, allowing it to check common offensive threats such as Mienfoo, Timburr, and Vullaby. Psychic Fangs allows Snubbull to hit Poison-types like Gastly and Foongus that otherwise wall it. Thunder Wave is a useful tool to hinder opponents, potentially giving Snubbull and its teammates free turns. Thief is a good option for Snubbull in the case that it loses its Eviolite, which happens in nearly every game due to its defensive profile. Earthquake is an option over Thief to hit Steel-types like Pawniard and Tinkatink, as well as OHKOing Hisuian Growlithe. Temper Flare is worth mentioning as well, as it lets Snubbull hit Steel-types and Foongus in one moveslot. The given EV spread allows Snubbull to effectively check the physical attackers it is tasked with taking on while ensuring it still has good power behind its attacks. Snubbull can Terastallize into the Steel typing to cover its weaknesses to Poison- and Steel-type attacks, additionally letting it resist Vullaby's Brave Bird if Snubbull gets weakened enough for Brave Bird to otherwise KO. However, this has the disadvantage of making Snubbull weak to Mienfoo's High Jump Kick, as well as other powerful moves like Mudbray and Trapinch's Earthquake and Hisuian Growlithe's Flare Blitz.</p> <p>Beneficiaries of Snubbull include Stunky, which struggles into the Fighting-types that Snubbull can easily switch into. Mienfoo enjoys Snubbull checking Vullaby, as Vullaby can come in on all of Mienfoo's attacks and threaten teams with its powerful Brave Bird and Knock Off. Snubbull is a decent partner for Pawniard, as Snubbull can switch into Mienfoo's High Jump Kick for Pawniard. Slow, strong Pokemon like Mudbray and Timburr appreciate Snubbull using Thunder Wave to slow down opposing Pokemon. Snubbull itself is threatened by Poison-types such as Foongus, which threatens Snubbull with either Sludge Bomb or Spore. Gothita can cover Foongus by trapping it with Shadow Tag, while other Poison-types can be threatened by strong Ground-type Pokemon like Mudbray and Trapinch.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 605215, "username": "Flou"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 387847, "username": "Hacker"}, {"user_id": 107567, "username": "gali"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Elekid": {
    "sets": {
      "Offensive Pivot": {
        "description": "<p>Elekid is an elite pivot in Little Cup, with an unmatched Speed tier and a wide range of coverage options that threaten much of the metagame. Vital Spirit provides teams another option to switch in on Spore from Foongus. Elekid's moveset is highly customizable to fit the role it plays on a team. Thunderbolt threatens high damage on Vullaby, Mareanie, and Wingull. Knock Off can weaken checks such as Mudbray and Chinchou for Elekid to KO them later in the game. Focus Blast can be used over either Thunderbolt or Knock Off to OHKO Alolan Diglett and Alolan Sandshrew. Psychic hits Foongus and Mienfoo super effectively. Volt Switch offers frail attackers such as Wingull and Stunky a safe way to enter the field on the switches that Elekid forces. Alternatively, Tera Blast Grass is used to more directly threaten the aforementioned Chinchou and Mudbray. Tera Psychic boosts the damage of Psychic against targets like Mienfoo, Foongus, and Glimmet and also makes Elekid resistant to Choice Scarf Gothita's Psychic.</p> <p>Elekid complements powerful but frail Pokemon like Alolan Diglett and Wingull through Volt Switch, offering safe entry for them to wallbreak. Additionally, Elekid can use Tera Blast Grass to remove their checks such as Mudbray and Chinchou, respectively. Elekid struggles to break through Grass-types like Foongus and Grookey, so Vullaby and Alolan Sandshrew make good teammates. In return, Elekid can threaten opposing Alolan Sandshrew for Vullaby and Mareanie for ally Alolan Sandshrew. Without Tera Blast Grass, Elekid struggles to get past Mudbray. A partner that can weaken Mudbray like Vullaby or Stunky can help with this.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 605215, "username": "Flou"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641532, "username": "bleahey"}, {"user_id": 387847, "username": "Hacker"}]}, {"name": "Grammar checked by", "members": [{"user_id": 528364, "username": "adorluigi"}]}]}
  },
  "Wingull": {
    "sets": {
      "Offensive": {
        "description": "<p>Wingull is the gambler's fast attacker: a potent wallbreaker with a threatening STAB move combination that can OHKO or 2HKO nearly the entire metagame but is limited by its longevity and Hurricane's accuracy. Ice Beam provides a more reliable alternative to Hurricane for targets like Vullaby, Foongus, and Toedscool. Meanwhile, Tera Blast Ground improves Wingull's great coverage to pick off its few defensive checks, notably Chinchou, Mareanie, and Tinkatink. Protect blocks Mienfoo's Fake Out, alleviating chip damage and the pressure to switch out, and allows Wingull to scout attacks from Choice Scarf users. On teams where switching out is less of a concern, Substitute protects Wingull from Sucker Punch users like Stunky and opens it up for a free attack on switch-ins or sacrifices in exchange for worse longevity. Both fourth-move options allow Wingull to scout for defensive Tera types such as Steel and Water, allowing it to deal extra damage or safely switch out. By allotting only 19 HP IVs, Wingull takes reduced Life Orb recoil and Stealth Rock chip damage. Tera Dark shields Wingull from revenge kill attempts by Gothita while Wingull is out of Energy Ball's range or after it has scouted for Psychic with Protect; Tera Dark also lets Wingull resist Sucker Punch from Stunky and Diglett. In addition to its offensive utility with Tera Blast, Tera Ground opens up surprise KOs on Volt Switch Elekid and reduces Stealth Rock damage.</p> <p>Wingull's Speed and few switch-ins make it a good fit for bulkier structures that compensate for its frailty with entry hazard removal and pivots or offensive structures that don't require repeated switching. Relatively passive cores featuring Tinkatink, Toedscool, and Mareanie bolster Wingull teams with a bulky Vullaby switch-in, a hazard removal option that can switch in on Elekid, and a consistent switch-in to most Choice Scarf users like Hisuian Growlithe and Mienfoo, respectively. In turn, they benefit from its ability to make progress nearly every time it attacks. Elekid and Stunky appreciate a Ground-immune teammate and can dish out Knock Off to open up OHKOs for Wingull. Swords Dance Mienfoo and Hisuian Growlithe may fit on more offensive structures, pressuring shared checks like Stunky and Mareanie. These Pokemon pair exceptionally well with Tera Blast Ground Wingull, which can remove Mareanie for physically oriented allies and Chinchou for Elekid. Wingull is very vulnerable to Electric-type Pokemon like Chinchou and opposing Elekid, so it should be paired with Electric-immune teammates such as Mudbray, Toedscool, and your own Chinchou. Protect variants are checked by Sucker Punch users, most notably Stunky, thus they pair well with checks like Mudbray and Trapinch. Substitute variants, on the other hand, can be forced out by Mienfoo's Fake Out. Therefore, Substitute Wingull appreciates Mienfoo switch-ins like Foongus and Mareanie, as well as hazard removal options like Toedscool, Alolan Sandshrew, and Defog Vullaby to reduce Stealth Rock chip damage when it is switching back in.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641532, "username": "bleahey"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 605215, "username": "Flou"}, {"user_id": 568849, "username": "Colin"}]}, {"name": "Grammar checked by", "members": [{"user_id": 649096, "username": "a blue banana"}]}]}
  },
  "Azurill": {"outdated": true, "sets": {"Belly Drum": {}}},
  "Numel": {"sets": {"Special Attacker": {}}},
  "Trapinch": {
    "sets": {
      "Trapper": {
        "description": "<p>Trapinch's respectable bulk, insane Attack stat, and access to Arena Trap make it a powerful trapper. Earthquake OHKOes many targets, including Elekid, Alolan Diglett, Tinkatink, Glimmet, Stunky, and Hisuian Growlithe. Stone Edge completes its EdgeQuake coverage, letting Trapinch hit Flying-types like Vullaby and Wingull. First Impression can finish off chipped foes and revenge kill Gothita. Feint is another form of priority and can bypass Protect. Trapinch has very low base Speed, so it is better to invest in bulk. This EV spread prevents 2HKOs from Stunky's Knock Off and Elekid's Psychic while also avoiding OHKOs from Terastallized Hisuian Growlithe's Flare Blitz and Terastallized Alolan Diglett's Earthquake. Tera Bug is used to further boost First Impression's damage, OHKOing Toedscool and Grookey. In a pinch, it can be used to resist Earthquakes from Alolan Diglett.</p> <p>Flying-types like Vullaby and Wingull appreciate Trapinch's ability to trap Steel- and Electric-types. Vullaby can U-turn on Glimmet and Tinkatink, bringing Trapinch in safely to trap and remove them with Earthquake. Wingull struggles with Elekid and Stunky, both of which Trapinch can eliminate. In return, these partners handle Grass-types like Foongus, Toedscool, and Grookey that threaten Trapinch. VoltTurn support from teammates like Mienfoo, Elekid, and Chinchou makes switching in and trapping easier for Trapinch.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 649184, "username": "xonks"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 537035, "username": "rahul_3301"}, {"user_id": 440139, "username": "Éric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 391343, "username": "EthanLac"}]}]}
  },
  "Corphish": {"sets": {"Dragon Dance": {}}},
  "Buizel": {"sets": {"Rain Wallbreaker": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 330191, "username": "Altariel von Sweep"}]}]}},
  "Shellos": {
    "sets": {
      "Defensive": {
        "description": "<p>Shellos is a solid entry hazard setter with its high defenses and its ability Sticky Hold, which allows it to always keep its Eviolite. With its bulk and access to Recover, Shellos can reliably set up Stealth Rock in front of powerful threats like Hisuian Growlithe and Alolan Diglett. Although it's mainly defensive, Shellos's Ground- and Ice-type coverage is a potent offensive combo, as no type resists both. Earth Power hits Steel-types like Tinkatink and Alolan Sandshrew, Electric-types like Chinchou and Elekid, and Rock-types like Glimmet and Hisuian Growlithe for super effective damage, while Ice Beam threatens foes such as Vullaby, Toedscool, and Mudbray. This EV spread maximizes Shellos's bulk, allowing it to sponge multiple hits and regain health via Recover. The added bulk prevents 2HKOs from Vullaby, Alolan Diglett, and Stunky as well as OHKOs from Wingull and boosted Shellder. Tera Poison is good defensively—it lets Shellos resist Mienfoo's High Jump Kick, Stunky's Gunk Shot, and both of Foongus's STAB moves. It can also prevent Shellos from being poisoned, increasing its longevity.</p> <p>Shellos's passivity makes it fits best on balance structures where it can use its bulk to repeatedly switch in and outlast threats such as Vullaby, Alolan Sandshrew, Alolan Diglett, and Hisuian Growlithe. It can also beat Rapid Spin users, helping keep Stealth Rock up, which benefits VoltTurn users such as Mienfoo, Elekid, and Vullaby. Shellos supports frail, offensive wallbreakers like Alolan Diglett and Hisuian Growlithe, since it soft checks most of the metagame. Additionally, Stealth Rock can provide extra chip for them to secure KOs. Shellos can be weak to hazards, so it appreciates Rapid Spin users such as Toedscool and Alolan Sandshrew. In return, Shellos checks threats such as Hisuian Growlithe and Vullaby. Foongus is another hard matchup, so teammates like Elekid, Gothita, and your own Foongus can be helpful.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 649184, "username": "xonks"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 440139, "username": "Éric"}, {"user_id": 537035, "username": "rahul_3301"}]}, {"name": "Grammar checked by", "members": [{"user_id": 297659, "username": "deetah"}]}]}
  },
  "Drifloon": {"sets": {"Setup Sweeper": {}}},
  "Stunky": {
    "sets": {
      "Physical Attacker": {
        "description": "<p>Stunky serves as an effective wallbreaker, using its strong STAB combination to dismantle opposing defensive cores. Being a grounded Poison-type, Stunky also helps teams by clearing Toxic Spikes. Knock Off strips off Eviolite, while Sucker Punch provides a priority option against foes that outspeed Stunky, like Alolan Diglett and boosted Shellder. Temper Flare is good against Steel-types like Tinkatink, and it is complemented by Gunk Shot, receiving a damage boost if the move misses. Alternatively, Substitute helps Stunky dodge status from foes like Foongus while also allowing it to scout defensive Terastallizations from foes such as Mienfoo. The maximum Speed investment along with a Jolly Nature enables Stunky to outspeed metagame staples like Mienfoo and Chinchou. Tera Dark boosts Knock Off even more and empowers Sucker Punch to give Stunky stronger priority presence, whereas Tera Poison boosts its strongest move in Gunk Shot and grants better defensive positioning against Fighting-types.</p> <p>Stunky's ability to strip items with Knock Off makes it an excellent partner for Alolan Diglett, which appreciates facing weakened targets. Vullaby is another supreme teammate, as the combination of powerful STAB moves from the core is extremely difficult to mitigate for the majority of team structures. Ground-types like Mudbray and Alolan Diglett comfortably threaten Stunky and impede its progress. Options like Shellder, which threatens them offensively, Toedscool, which can pivot into them safely, and Mudbray, which can favorably trade against them, are great teammate choices for Stunky.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 537035, "username": "rahul_3301"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 387847, "username": "Hacker"}, {"user_id": 440139, "username": "Éric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 593115, "username": "igiveuponaname"}]}]}
  },
  "Gible": {"sets": {"Setup Sweeper": {}}},
  "Hippopotas": {"sets": {"Sand Setter": {}}},
  "Croagunk": {"outdated": true, "sets": {"Bulky Attacker": {}}},
  "Snover": {"sets": {"Snow Setter": {}}},
  "Drilbur": {"sets": {"Utility": {}}},
  "Timburr": {"sets": {"Physical Attacker": {}}},
  "Cottonee": {"sets": {"Memento": {}}},
  "Sandile": {"sets": {"Bulky Stealth Rock": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 553008, "username": "Quinn"}]}]}},
  "Zorua": {"sets": {"Choice Scarf": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 585065, "username": "TheShoddyStrawman"}]}]}},
  "Zorua-Hisui": {
    "sets": {
      "Wallbreaker": {
        "description": "<p>Hisuian Zorua provides excellent utility to a team with its combination of a high Special Attack stat, unique defensive typing, and its ability to spread burns and Knock Off. Thanks to its Normal typing, Hisuian Zorua can use Tera Blast as a STAB move even before Terastallizing to hit threats like Alolan Grimer and Shroodle. Tera Fighting lets it hit Pawniard and provides defensive value by flipping its Dark-type weakness, while Tera Ground allows it to hit Alolan Grimer, Glimmet, and Tinkatink. Hex in combination with Will-O-Wisp's burns does massive damage to even bulkier foes like Mudbray and Toedscool while cleanly OHKOing Drifloon. Will-O-Wisp helps neutralize physical attackers like Pawniard and Crabrawler and can turn them into setup fodders for other sweepers. Knock Off lets Hisuian Zorua soften up opposing teams and is also its best option for hitting opposing Hisuian Zorua. U-turn is an alternative that lets Hisuian Zorua capitalize on the switches it forces from foes like Drifloon. Nasty Plot is an option on dual screens teams where Hisuian Zorua can become a threatening sweeper.</p> <p>Illusion is a highly unique ability that lets Hisuian Zorua create uncomfortable turns for your opponent by disguising as Pokemon whose checks it might beat, and Glimmet and Mudbray appreciate its ability to chip or beat opposing Mudbray and Drifloon, respectively. Pawniard enjoys Hisuian Zorua checking Crabrawler. Hisuian Zorua is often competing with Drifloon for the team's Ghost-type, so it appreciates teammates like Wattrel and Toedscool that can cover for its lack of Ground-type immunity. Crabrawler and Mudbray check opposing Pawniard for Hisuian Zorua when Tera Fight is not an option, and Alolan Grimer, Mudbray, and Croagunk switch into opposing Alolan Grimer.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 32350, "username": "ghost"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 107567, "username": "gali"}]}, {"name": "Grammar checked by", "members": [{"user_id": 262594, "username": "Milak"}]}]}
  },
  "Minccino": {"sets": {"Skill Link Attacker": {}}},
  "Gothita": {
    "sets": {
      "Trapper": {
        "description": "<p>Gothita serves as a support Pokemon in Little Cup thanks to its ability to trap Poison-types such as Foongus and Mareanie and other metagame staples such as Mienfoo, forcing them to Terastallize to survive once in range of Psychic. Trick is very important on Gothita because without it, Gothita cannot reliably threaten a healthy Foongus due to the threat of Spore, and Trick is effective at crippling bulky foes. Thunderbolt provides coverage against Vullaby, while Energy Ball deals extra damage to Ground-types such as Mudbray. Tera Psychic is the most common Tera type to enable Gothita to secure earlier KOes such as OHKOing a healthy Mienfoo.</p> <p>Gothita fits best on bulky offense or balance teams with other pivots, most notably Mienfoo and Hisuian Voltorb, which typically struggle against bulky Regenerator Pokemon like Foongus and Mareanie. Choice Scarf Hisuian Growlithe also has significant synergy with Gothita, as bulky Fire resistant Pokemon such as Mareanie and Glimmet are vulnerable to being trapped. Gothita's biggest weaknesses are that it gives free entry to offensive Dark- and Steel-types after it secures a KO and that it lacks power by itself. Therefore, Gothita needs both a defensive backbone with teammates such as Mienfoo, Mudbray, and Glimmet to switch into Dark-types, as well as offensive threats and sweepers like Shellder and the aforementioned Hisuian Voltorb to break through defensive cores.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 568849, "username": "Colin"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 342456, "username": "Drifting"}, {"user_id": 387847, "username": "Hacker"}]}, {"name": "Grammar checked by", "members": [{"user_id": 197240, "username": "sunny"}]}]}
  },
  "Deerling": {"outdated": true, "sets": {"Offensive": {}}},
  "Foongus": {
    "overview": "<p>Due to its good defensive typing, excellent ability, and utility provided by Spore, Foongus is one of the best defensive Pokemon in Little Cup. With the longevity provided by Regenerator and Synthesis, Foongus is able to reliably check many threats over the course of the game, including Chinchou, Grookey, and Mienfoo. Spore is threatening due to the fast-paced nature of Little Cup and luck-based nature of sleep. However, due to Foongus being relatively passive, it can be taken advantage of offensively once Spore has been exhausted.</p>",
    "comments": "<h3>Other Options</h3> <p>An alternative EV spread of 76 Special Attack, 76 Special Defense, and 76 Speed EVs can be considered to beat opposing Foongus one-on-one. However, due to the reduced bulk, Foongus will take significantly more damage from Chinchou's Ice Beam, Elekid's Psychic, and Glimmet's Power Gem. Tera Ghost can be used for Foongus to escape Gothita's Shadow Tag, but it leaves Foongus weak to Knock Off from multiple Pokemon including Mienfoo, Vullaby, Stunky, and Grookey.</p> <h3>Checks and Counters</h3> <p><strong>Spore-Immune Pokemon</strong>: Some Pokemon are able to use items or moves to block Spore from Foongus while not being threatened by its STAB moves. Alolan Sandshrew can use Safety Goggles to safely switch in on Foongus and threaten it with Triple Axel, while Stunky can use Substitute, which Foongus cannot break in one hit.</p> <p><strong>Gothita</strong>: Gothita is able to easily trap and remove Foongus with Psychic, which can be made easier with help provided by Chinchou or Elekid's Volt Switch or Mienfoo's U-turn. Additionally, Gothita can opt for a Tera Steel SubCM set that completely shuts down and turns Fooongus into a setup opportunity for it to sweep.</p>",
    "sets": {
      "Defensive": {
        "description": "<p>Giga Drain and Sludge Bomb make for an effective STAB combination capable of hitting most of the tier for at least neutral damage. Sludge Bomb's chance for poison can ruin potential switch-ins such as Mienfoo or Toedscool. Synthesis provides extra longevity so Foongus doesn't solely rely on Regenerator, as Giga Drain doesn't provide consistent healing. The given EV spread maximizes Foongus's bulk, allowing it to soft check a variety of Pokemon. Tera Water is a generally good Tera type and makes Foongus resistant to Shellder's Icicle Spear but leaves Foongus vulnerable to Electric- and Grass-types such as Elekid and Grookey in return. Tera Steel allows Foongus to resist Vullaby's Brave Bird and is more effective at checking Shellder with the added resistance to Rock Blast; however, Foongus becomes weak to Ground- and Fighting-types such as Mudbray and Mienfoo. It should be noted that once Terastallized, Foongus is no longer able to absorb Spore from opposing Foongus.</p> <p>Foongus is a staple on many teams and defensively supports its team with its longevity and Spore. Wingull and Vullaby appreciate Foongus switching in on Electric-type moves from Chinchou and Elekid. Foongus has issues with Flying-types such as Wingull and Vullaby, making Chinchou a good partner. Teammates that can remove entry hazards like Defog Vullaby and Rapid Spin Alolan Sandshrew enable Foongus to switch around more comfortably. As Foongus often acts as a check to itself, Pokemon that can help it succeed in the mirror match such as Alolan Sandshrew and Stunky make good teammates. These two can switch in on and offensively pressure opposing Foongus that are attacking or healing with Synthesis.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 605215, "username": "Flou"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 387847, "username": "Hacker"}, {"user_id": 641532, "username": "bleahey"}]}, {"name": "Grammar checked by", "members": [{"user_id": 664887, "username": "wisteriapurple"}]}]}
  },
  "Axew": {"sets": {"Dragon Dance": {}}},
  "Mienfoo": {
    "sets": {
      "Fast Pivot": {
        "description": "<p>Mienfoo continues its LC dominance with its mixture of defensive fortitude from Regenerator, moveset utility, and its Speed acting as the benchmark for the rest of the tier. Knock Off enables Mienfoo to create consistent progress against opposing Pokemon like Foongus and Mareanie that resist its Fighting-type attacks. U-turn synergizes with Mienfoo's Regenerator ability while also exploiting defensive switches that Mienfoo often causes. Fake Out is a useful move for helping Mienfoo lead against opposing teams and chipping down Choice Scarf users. Taunt is a valuable substitute to Fake Out that can prevent setup like Shellder's Shell Smash as well as Foongus's Spore. Tera Steel grants Mienfoo important resistances to Vullaby's Brave Bird and both of Foongus's STAB move options. Alternatively, Tera Water can be used in order to resist Shellder's Icicle Spear and Liquidation and Hisuian Growlithe's Flare Blitz.</p> <p>Mienfoo's versatility allows it to fit on a large variety of teams. Vullaby is Mienfoo's most common partner because of its ability to manage Foongus and Gothita, which Mienfoo struggles to deal with, while Mienfoo can deal significant damage to Vullaby's switch-ins like Tinkatink. Mienfoo's pivoting power from U-turn allows frailer teammates like Elekid and Alolan Diglett more opportunities to enter the battlefield. Gothita is another excellent partner for Mienfoo, as its Shadow Tag ability allows it to switch in after Mienfoo's U-turn to trap Poison-types like Foongus and Mareanie that Mienfoo has difficulties making progress against. Chinchou is a great teammate for switching into fast offensive threats like Elekid and Wingull that threaten big damage to Mienfoo.</p>"
      },
      "Slow Pivot": {
        "description": "<p>Defensive Mienfoo is one of the tier's most reliable pivots, with Regenerator letting it repeatedly sponge hits and Knock Off and U-turn removing Eviolites and maintaining momentum, respectively. Fake Out provides useful chip damage, while High Jump Kick is its STAB of choice, pressuring most of the metagame. The EV spread balances physical and special bulk, letting it withstand hits from threats like Shellder, Hisuian Growlithe, and opposing Mienfoo, with its most notable benchmark being the ability to survive Brave Bird from Adamant Vullaby. Additionally, the physical bulk and lack of Speed investment allows it to exchange Knock Off in the Mienfoo mirror and hit back with High Jump Kick or pivot out with U-turn thanks to its bulk. Tera Steel improves its matchup against Vullaby and Shellder, while Tera Water lets it check Alolan Sandshrew and Hisuian Growlithe.</p> <p>Mienfoo pairs well with offensive teammates that benefit from its item removal and slow pivoting, such as Elekid, Gothita, and Alolan Sandshrew; these teammates also help pressure bulky Poisons-types like Foongus and Mareanie. However, its lack of Speed investment leaves it vulnerable to threats like Vullaby, Glimmet, and opposing Alolan Sandshrew, making partners such as Tinkatink, Chinchou, and Mudbray valuable to cover these matchups. Having faster teammates like Elekid or Choice Scarf Gothita paired with Mienfoo also helps maintain offensive pressure and compensate for its lower Speed.</p>"
      },
      "Swords Dance": {
        "description": "<p>Swords Dance Mienfoo is one of the tier's scariest wallbreakers and sweepers. +2 High Jump Kick will OHKO almost all targets that do not resist it, with the exception of fully healthy Mudbray and Vullaby with at least 156 Defense EVs. Knock Off provides nearly perfect coverage against Ghost-types and Terastallized foes while also applying lasting pressure by removing Eviolites. The last moveslot is flexible, but Substitute is popular for its ability to overpower Foongus by removing Spore from the equation as well as scout Terastallization from foes. Tera Steel is still an excellent defensive Tera type against some Shellder and Wingull sets even with minimal Defense investment and also prevents Foongus from breaking Mienfoo's Substitute in one hit.</p> <p>Swords Dance Mienfoo sacrifices bulk and pivoting to run this set, so it pairs best with pivots such as Chinchou and Vullaby as well as sturdy defensive Pokemon such as Foongus and Mareanie. Some fast options to help close out games include Alolan Diglett, Stunky, and Elekid, which are needed because Mienfoo is often too slow to close out games on its own but can break huge holes for its teammates. Some Swords Dance Mienfoo sets can also work on hyper offense builds, with supporters such as lead Stealth Rock Alolan Diglett and sweepers such as Shellder and Nasty Plot Vullaby. These Mienfoo sets often have more variety, as they can specialize to sweep in specific circumstances by being able to run sets such as Reckless Agility + Swords Dance, among others.</p>"
      },
      "Choice Scarf": {
        "description": "<p>Choice Scarf Mienfoo's superb Speed tier, in conjunction with its Reckless-boosted High Jump Kick, makes it an excellent wallbreaker capable of OHKOing or 2HKOing most neutral targets. Knock Off removes Eviolite from Fighting-resistant foes like Foongus and Mareanie, wearing them down for later, while hitting Ghost-types and Tera Ghost Pokémon. U-turn lets Mienfoo scout for switch-ins and punish them accordingly. Close Combat is used when a more accurate move is preferred and High Jump Kick’s power isn't needed. Tera Fighting combined with Reckless skyrockets Mienfoo's damage output, letting it OHKO targets like less bulky variants of pivot Mienfoo, Tinkatink, and Vullaby while having a favorable roll to 2HKO Foongus with High Jump Kick after Stealth Rock.</p> <p>Choice Scarf Mienfoo is best utilized on offensive teams that appreciate its immediate Speed and power. It pairs especially well with Gothita, which can use Shadow Tag to trap and remove bulky Poison-types like Foongus and Mareanie that otherwise check Mienfoo. This synergy allows Choice Scarf Mienfoo to break more freely later in the match without constantly pivoting out. Choice Scarf Mienfoo appreciates teammates that share complementary breaking power, such as Vullaby, Wingull, and Elekid; all of these help pressure Mienfoo's checks. Additionally, Choice Scarf Mienfoo is very frail, so it benefits from being brought in safely by pivots like Chinchou, Elekid, and Vullaby. Choice Scarf Mienfoo also punishes teams expecting a pivot set, blowing up typical checks like Vullaby and Tinkatink. This can open up opportunities for allies such as Grookey, Stunky, and Vullaby.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 532065, "username": "Greedy_eb"}, {"user_id": 568849, "username": "Colin"}, {"user_id": 647970, "username": "Astarion"}, {"user_id": 683780, "username": "mm"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 605215, "username": "Flou"}, {"user_id": 641532, "username": "bleahey"}]}, {"name": "Grammar checked by", "members": [{"user_id": 336073, "username": "Rabia"}, {"user_id": 555379, "username": "Tbolt"}, {"user_id": 664887, "username": "wisteriapurple"}]}]}
  },
  "Pawniard": {
    "sets": {
      "Swords Dance": {
        "description": "<p>Pawniard is a solid defensive Pokemon with the potential to win games. Swords Dance can be used against Pokemon such as on Vullaby, Gastly, and Snubbull. Sucker Punch is a strong STAB priority move that allows Pawniard to hit foes that would otherwise outspeed it such as Gastly and Snivy. Tera Flying lets Pawniard beat common Fighting- and Ground-types such as Mienfoo, Mudbray, and Trapinch that would otherwise stop its sweep; Tera Blast cleaves through common Pokemon such as the aforementioned Mienfoo and Foongus. Inner Focus is preferred over Defiant to avoid being flinched by Mienfoo's Fake Out, especially after Terastallizing.</p> <p>Pawniard's presence helps deal with Gothita, assisting teammates such as Foongus, Mienfoo, and Timburr. Vullaby works well with Pawniard due to Pawniard's good matchup against both Snubbull and Glimmet. Mienfoo can U-turn into Pawniard and is a great partner for luring in Vullaby and Snubbull. While Pawniard can Terastallize to remove its Fighting weakness, teammates such as Snubbull, Koffing, and Gothita help against Mienfoo and Timburr without needing to Terastallize themsleves. Snubbull can also help Pawniard set up with Intimidate.</p>"
      },
      "Stealth Rock": {
        "description": "<p>Pawniard is a solid utility Pokemon, pairing its excellent typing that allows it to check common Pokemon like Vullaby with its useful support options in Stealth Rock and Thunder Wave. Thunder Wave keeps Pawniard from being too passive, and it combines well with Iron Head to paraflinch opposing Pokemon. Iron Head lets Pawniard hit both Mienfoo and Vullaby for neutral damage. Sucker Punch is a strong priority move that can pick off setup sweepers such as Shell Smash Shellder or Choice Scarf users like Hisuian Growlithe. Pawniard's EV spread gives it the bulk it needs to handle the aforementioned threats while keeping itself fast and strong enough to deal damage on its own. Pawniard struggles with Fighting- and Ground-type moves from Pokemon like Mienfoo and Mudbray respectively, so Pawniard can use Tera Flying to turn these attacks into a resistance and an immunity, respectively.</p> <p>Pawniard can complement Vullaby-weak Pokemon such as Foongus, which struggle to deal with Vullaby's STAB moves, with Foongus being able to check Mienfoo, which gives Pawniard trouble. Slow and strong wallbreakers such as Mudbray and Eviolite Hisuian Growlithe can take advantage of Thunder Wave from Pawniard to become more threatening when opposing Pokemon are outpaced by them.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 585065, "username": "TheShoddyStrawman"}, {"user_id": 605215, "username": "Flou"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "ghost"}, {"user_id": 387847, "username": "Hacker"}, {"user_id": 440139, "username": "Éric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}, {"user_id": 633500, "username": "StupidFlandrs48"}]}]}
  },
  "Vullaby": {
    "sets": {
      "Physical Attacker": {
        "description": "<p>Vullaby cements itself as an elite option in LC due to its versatility, great STAB combination, and ability to check threats like Mienfoo and Gothita. Knock Off hits Vullaby's few reliable switch-ins like Pawniard, Hisuian Growlithe, and Mudbray and makes them shakier answers without Eviolite. U-turn allows Vullaby to function as a pivot and provide momentum against Pokemon like Tinkatink and Pawniard. Alternatively, Defog is an option to support its teammates that are weak to entry hazards. Weak Armor is a great ability, as it allows Vullaby to outspeed the entire metagame after one Weak Armor drop, making Vullaby more offensively potent. Tera Electric removes all of Vullaby's weaknesses, notably allowing it to resist opposing Vullaby's Brave Bird and giving it immunity to paralysis from Pokemon like Snubbull.</p> <p>Vullaby basically fits on every teamstyle, but it appreciates wallbreakers like Stunky and Hisuian Growlithe that can deal with its checks like Snubbull and Tinkatink. Other Pokemon with pivot moves like Mienfoo and Hisuian Voltorb can form a potent VoltTurn combination with Vullaby. Mudbray and Mienfoo appreciate Vullaby's ability to check Snivy and Foongus. In return, Mudbray and Mienfoo can switch into Pokemon Vullaby is threatened by like Pawniard, Hisuian Growlithe, and Snubbull in Mudbray's case. If Vullaby is instead running Defog, Pokemon weak to Stealth Rock such as Hisuian Growlithe and Larvesta appreciate Vullaby's ability to remove hazards to support them coming in safely.</p>"
      },
      "Nasty Plot": {}
    },
    "credits": {"writtenBy": [{"user_id": 567483, "username": "Bella"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 32350, "username": "ghost"}, {"user_id": 387847, "username": "Hacker"}]}, {"name": "Grammar checked by", "members": [{"user_id": 109385, "username": "aurora"}]}]}
  },
  "Larvesta": {"sets": {"Defensive": {}}},
  "Chespin": {"sets": {"Spikes": {}}},
  "Mareanie": {
    "sets": {
      "Physical Wall": {
        "description": "<p>Physically defensive Mareanie is a bulky pivot that enters the game on strong attacks, such as Mienfoo's High Jump Kick. Once on the field, its good coverage can threaten various foes. Ice Beam threatens an incoming Foongus or Toedscool, Mud Shot hits opposing Mareanie and slows incoming Pokemon that would be faster than itself. Mareanie invests in bulk in order to stomach attacks from boosted Shellder, Flare Blitz from Hisuian Growlithe, and High Jump Kick from Mienfoo even after its Eviolite has been removed. Its Special Defense EVs allow Mareanie to check Wingull and survive Gothita's Psychic from full HP. Tera Dragon provides insurance against the Electric-types in Elekid and Chinchou. Mareanie also has the option of using Tera Ghost to escape being trapped by Shadow Tag Gothita and to surprise a Choice Scarf Mienfoo, which is expected to 2HKO after Spikes with Reckless-boosted High Jump Kick.</p> <p>Mareanie and Mienfoo form a double Regenerator core. Nearly everything benefits from Mareanie's ability to check Mienfoo, notably Rock and Steel-types like Glimmet and Alolan Sandshrew. Mareanie partners well with Toedscool, which is OHKOed by Flare Blitz from Hisuian Growlithe. Mareanie is weak to Spikes, Electric-types, and Ground-types, all which Toedscool covers in return. Mareanie and Tinkatink also make good partners because of their capacity to cover the dual threat of Mienfoo and Vullaby; with Mareanie taking High Jump Kick for Tinkatink, which absorbs Knock Off and takes Brave Bird. Gothita can be a huge thorn because it threatens to trap and remove Mareanie. It is wise to pair Mareanie with a Dark-type like Vullaby or Stunky to take advantage of a Choice Scarf Gothita locked into Psychic.</p>"
      },
      "Offensive Wall": {
        "description": "<p>Offensive Mareanie leverages its natural bulk, typing, and Regenerator to invest in its Special Attack, making it much more threatening. Mud Shot allows Mareanie to hit a variety of Pokemon: Elekid, Chinchou, Stunky, Tinkatink, Glimmet, and opposing Mareanie, with the bonus of making Mareanie faster than the latter two after one hit. Ice Beam hits Ground- and Grass-types like Mudbray, Toedscool, and Foongus as well as Vullaby super effectively. Sacrificing some of its Special Defense, Mareanie invests heavily into its Special Attack, which improves its damage rolls against much of the tier, notably allowing it to 2HKO Foongus with Ice Beam after Stealth Rock. Due to the loss of bulk, however, Mareanie has a harder time defending against Pokemon like Alolan Sandshrew and Stunky. Tera Dragon protects Mareanie from Elekid and Chinchou, while Tera Ghost allows it to escape Gothita's Shadow Tag and block Rapid Spin from Toedscool and Alolan Sandshrew.</p> <p>Mareanie complements Pokemon that are threatened by Mienfoo, such as Alolan Sandshrew. In return, Alolan Sandshrew can remove entry hazards with Rapid Spin, which helps Mareanie last longer despite its lessened bulk. Grookey is a great partner, as it can check the Ground-types that threaten Mareanie, with the Grassy Terrain it provides keeping Mareanie healthy and halving the power of Earthquake. Toedscool fills a similar role to Grookey, as it can check Ground-types while being a better switch-in to Electric-types than Grookey, in addition to its ability to clear hazards. Dark-type teammates that can take advantage of a Gothita trapping Mareanie are also appreciated.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 588507, "username": "emptywisdom"}, {"user_id": 605215, "username": "Flou"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641532, "username": "bleahey"}, {"user_id": 537035, "username": "rahul_3301"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}, {"user_id": 593115, "username": "igiveuponaname"}]}]}
  },
  "Mudbray": {
    "overview": "<p>With access to excellent coverage moves and a sky-high Attack stat, Mudbray possesses the tools required to be a threat offensively. This enables Mudbray to trade damage well with opposing Pokemon once it comes on the field. Additionally, owing to an excellent defensive ability in Stamina paired with solid defensive stats, Mudbray is one of the best entry hazard setters and defensive Pokemon in Little Cup.</p>",
    "comments": "<h3>Other Options</h3> <p>Mudbray can run Heavy Slam as a coverage move instead of Stone Edge to reliably threaten Vullaby, since it has better accuracy, though it has a smaller damage output. When paired with Grookey, whose Grassy Terrain halves the power of Earthquake, Mudbray can run High Horsepower as an alternate move. Counter is a niche option for Mudbray to deal double damage against foes that hit it with strong physical attacks. Choice Scarf is also an option for Mudbray, since it boasts high Attack, can outspeed the entire unboosted metagame, and, notably, Speed ties Choice Scarf Gothita. It is wise to run Tera Ground on a Choice Scarf set, as Earthquake is the most reliable move Mudbray has. RestTalk is a set that trades immediate offensive pressure for longevity. The plan for RestTalk Mudbray is to get rid of opposing special attackers and rely on Stamina to make it resilient to physical attackers. Both RestTalk and Choice Scarf sets forego Stealth Rock, which forces the team to either sacrifice entry hazards or add another teammate with access to them.</p> <h3>Checks and Counters</h3> <p><strong>Grass-types:</strong> Pokemon like Toedscool, Grookey, Foongus, and Chespin can switch into Mudbray with ease, resist Earthquake, and threaten back with Grass-type attacks.</p> <p><strong>Water-types:</strong> Chinchou and Wingull are massive threats, as they outspeed Mudbray and threaten it with super effective Water-type attacks. A boosted Shellder threatens an OHKO with Liquidation as well.</p> <p><strong>Mudbray:</strong> Both teams using their Mudbray to trade damage is a common occurence in the Little Cup metagame. It is important to note that Mudbray can only act as a check to any opposing Mudbray and only one party stands to gain from such a trade. Before using Mudbray to check the opposing Mudbray, keep in mind that it has to check multiple targets, and without a reliable recovery option, chip damage from Pokemon like Vullaby will prevent it from doing so.</p>",
    "sets": {
      "Offensive Stealth Rock": {
        "description": "<p>Mudbray is a reliable Stealth Rock setter that doubles as a sturdy physical tank. Earthquake is the strongest and most consistent STAB move, hitting majority of the tier hard and threatening OHKOs on Pokemon like Glimmet, Mareanie, and Tinkatink. Stone Edge covers the Flying-types such as Vullaby and Wingull that would otherwise be immune to Earthquake. Close Combat provides coverage against foes that resist Mudbray's primary moves such as Toedscool and Grookey. Roar allows Mudbray to phaze out setup sweepers like Shellder and Nasty Plot Vullaby. An Impish nature is preferred for extra physical durability, but an Adamant nature can be used for greater offensive presence. Tera Steel improves its matchup against Grass- and Ice-type attacks such as Giga Drain from Foongus and Toedscool and Icicle Spear from Shellder, as well as Brave Bird from Vullaby. Tera Water helps Mudbray resist Water- and Ice-type attacks such as Hydro Pump and Surf from Chinchou and Wingull, respectively, while allowing Mudbray to survive Liquidation and Icicle Spear from Shellder comfortably.</p> <p>Mudbray can switch into Elekid and Stunky and tank multiple hits while threatening an OHKO with Earthquake. Mudbray has to be wary of Vullaby, which aims to remove Mudbray's Eviolite with Knock Off and then either pivot out with U-turn or damage Mudbray with Brave Bird. Vullaby can do this knowing that it only gets 2HKOed by Stone Edge. Vullaby itself pairs seamlessly with Mudbray, as it can cover Grass-types like Grookey, Toedscool, Foongus, and Chespin that check Mudbray. In exchange, Mudbray handles Rock- and Steel-types like Tinkatink and Glimmet that cause Vullaby trouble. Foongus is another great partner that can take care of Water-types for Mudbray, and in return, Mudbray can handle Steel- and Poison-types that wall Foongus, including Tinkatink and Stunky. Alolan Diglett and Mudbray combine to become a formidable Ground-type spam core that pressures each others checks. Mudbray can tank hits and Alolan Diglett is fast and runs Life Orb for heavy damage output.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 537035, "username": "rahul_3301"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 647970, "username": "Astarion"}, {"user_id": 605215, "username": "Flou"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Grookey": {
    "sets": {
      "Pivot": {
        "description": "<p>Grookey finds a solid niche in the metagame with its ability to set Grassy Terrain and access to a reliable priority move that shuts down the best sweepers. The STAB combination of Grassy Glide and Wood Hammer allows Grookey to check Water-types like Chinchou and Shellder and Ground-types like Mudbray and Alolan Diglett. Knock Off allows it to remove Eviolites, wearing down checks to itself and its partners. U-turn allows Grookey to escape bad matchups such as Tinkatink and Vullaby and safely bring in frail, offensive teammates like Wingull and Hisuian Growlithe. Tera Grass is used to further boost the damage of Wood Hammer and Grassy Glide.</p> <p>On bulky offense teams, Grookey functions as an anti-offense Pokemon, threatening fast and frail attackers like Shellder and Alolan Diglett with Grassy Glide. It can also enable hyper offense teams with Grassy Terrain support, keeping setup sweepers like Shellder and Swords Dance Mienfoo healthy. With Grassy Terrain halving Earthquake's power, partners such as Chinchou and Mareanie are safer against Ground-types like Alolan Diglett and Mudbray. Other pivots, such as the aforementioned Chinchou and Elekid, make great teammates by creating VoltTurn cores. While niche, Unburden sweepers such as Shroodle and Drifloon can also be used. Grookey really struggles with Foongus, so it appreciates teammates that threaten Foongus such as Alolan Sandshrew and Hisuian Growlithe. Vullaby is another problematic matchup, so switch-ins to it such as Mudbray, Glimmet, and Tinkatink are appreciated. To avoid type overlap, Grookey and Foongus usually aren't used together, so it's important to have buffers against Spore like Vital Spirit Elekid and Safety Goggles Sandshrew.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 649184, "username": "xonks"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 605215, "username": "Flou"}, {"user_id": 641532, "username": "bleahey"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Chewtle": {"sets": {"Shell Smash": {}}},
  "Impidimp": {"sets": {"Dual Screens": {}}},
  "Fuecoco": {"outdated": true, "sets": {"Defensive": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 607664, "username": "Joeshh"}]}]}},
  "Quaxly": {"sets": {"Rapid Spin": {}}},
  "Nymble": {
    "sets": {
      "Revenge Killer": {
        "description": "<p>Nymble functions as a priority attacker capable of being both a revenge killer and a potential late-game cleaner that takes advantage of Tinted Lens and Life Orb-boosted Bug-type moves. First Impression threatens to revenge kill most of the metagame's offensive threats with proper chip damage. Leech Life lets Nymble stay in and make progress while offsetting Life Orb recoil and easing entry hazard chip damage. U-turn supports Nymble's role on momentum-heavy structures allowing switches into bulkier answers to be handled by teammates, and maintaining momentum while racking up chip damage that pushes future First Impression or Leech Life rolls into KO range. Agility allows Nymble to turn into a threatening cleaner that can outrun nearly every relevant Choice Scarf user once it sets up, while Sucker Punch trades that late-game sweeping potential for a more repeatable priority move that punishes full-attacking sets after First Impression has been used. An Adamant Nature with 228 EVs maximizes Nymble's Attack to capitalize on Life Orb and Tinted Lens, while 236 EVs in Speed allow it to hit 14 Speed, letting it outpace some defensive switch-ins, such as Mudbray, Mareanie, and Foongus. Agility allows for sweeping potential and a way to outplay Protect, which conveniently helps pressure Shellder sets that hit 13 Speed. The leftover EVs in Defense help to ease damage against common priority moves such as Fake Out and Sucker Punch. Tera Bug amplifies Nymble's main game plan by further boosting First Impression, Leech Life, and U-turn, turning previously manageable rolls into guaranteed KOs and making it much harder for even bulky Bug-resistant foes to pivot around its attacks once Tera Bug is committed.</p> <p>Nymble fits best on offensive structures and VoltTurn-style teams that value the combination of strong priority, chip damage, and momentum it provides. It pairs well with pivots like Mienfoo and Chinchou that spread chip damage with U-turn and Volt Switch to take advantage of softened teams that are forced to play conservatively around Tinted Lens-boosted First Impression. Life Orb recoil and frequent switching quickly wear Nymble down, so it appreciates reliable entry hazard control from spinners like Toedscool and Alolan Sandshrew, which keep Stealth Rock and Spikes from limiting the number of times it can safely enter the field. Nymble struggles against bulky Pokemon that can cripple its damage via Knock Off, hampering its revenge killing potential, or threaten to knock it out. Vullaby is an example of both, able to comfortably stomach both First Impression and Sucker Punch while threatening to OHKO with Brave Bird, Air Slash, or Heat Wave. Tinkatink is another such bulky Pokemon that offers resistance to all of Nymble's common moves while threatening to heal off the chip damage with Draining Kiss or punish its momentum-based game plan with Stealth Rock. Nymble appreciates partners like Glimmet and Toedscool that weaken foes into range of Nymble's First Impression or Sucker Punch via entry hazards and pack coverage to address the bulky checks. Other strong partners include Vullaby, Tinkatink, Mareanie, and Alolan Sandshrew; who's coverage are able to help alleviate pressure by threatening Nymble's common bulky checks. In return, Nymble offers immediate revenge killing, strong tempo, and a dangerous late-game presence when its answers have been adequately chipped.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 615880, "username": "xzeroxman"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 647970, "username": "Astarion"}, {"user_id": 440139, "username": "Éric"}]}, {"name": "Grammar checked by", "members": [{"user_id": 315566, "username": "AceTrainerOrange"}, {"user_id": 197240, "username": "sunny"}]}]}
  },
  "Wattrel": {"sets": {"Pivot": {}}},
  "Maschiff": {"outdated": true, "sets": {"Choice Scarf": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 580548, "username": "Shandeur"}]}]}},
  "Shroodle": {
    "sets": {
      "Unburden Sweeper": {
        "description": "<p>Shroodle functions as a potent setup sweeper on hyper offense teams, using Grassy Terrain to outspeed the entire metagame thanks to Unburden. Grassy Seed triggers Unburden while providing a much-needed Defense boost, which aids Shroodle in setting up. Swords Dance allows Shroodle to reach threatening levels of Attack, which help it secure OHKOs on metagame staples like Mienfoo, Vullaby, Foongus, and Toedscool. Gunk Shot threatens heavy damage on most foes at the risk of lower accuracy, while Knock Off removes Eviolite from walls like Mareanie. Alternatively, Double-Edge is an accurate STAB move that allows Shroodle to hit Mudbray and Mareanie for huge damage without burning its own Terastallization at the cost of recoil damage. Acrobatics pairs well with Grassy Seed, gaining a power boost after Shroodle consumes Grassy Seed and allowing it to pressure key threats like Mienfoo and Foongus. Tera Flying provides Shroodle with an immunity to Ground-type attacks from Mudbray and Alolan Diglett, making it easier for it to set up and boosting Acrobatics for late-game cleaning. On the other hand, Tera Ground with Tera Blast lets Shroodle muscle past Steel- and Rock-types such as Tinkatink and Glimmet that resist its STAB moves.</p> <p>Shroodle is best supported by teammates that help it activate Unburden and cover its defensive gaps. Grookey is mandatory to set Grassy Terrain to activate Grassy Seed, weaken the power of Earthquake, offer valuable passive recovery, and act as a pivot. Shroodle appreciates Shellder's ability to pressure bulky Ground-types such as Mudbray. In return, Shroodle threatens foes like Foongus, Mareanie, and Mienfoo that hinder Shellder's sweep. Shroodle can also be paired with another Unburden sweeper in Drifloon that forms a Grassy Terrain core along with Grookey. Other offensive partners like Alolan Diglett can help handle foes that trouble Shroodle, such as Tinkatink and Glimmet, while also punishing defensive Terastallization attempts, such as Tera Steel on Mienfoo that Shroodle can bait out.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 537035, "username": "rahul_3301"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 605215, "username": "Flou"}, {"user_id": 562547, "username": "PoseidonWrath"}, {"user_id": 641532, "username": "bleahey"}]}, {"name": "Grammar checked by", "members": [{"user_id": 384270, "username": "autumn"}]}]}
  },
  "Bramblin": {"sets": {"Spinner": {}}},
  "Toedscool": {
    "sets": {
      "Utility": {
        "description": "<p>Toedscool is a capable utility option offering role compression, excellent entry hazard control, good coverage, solid Speed, and relevant immunities to both Electric-type attacks and Spore. At 17 Speed, Toedscool is the fastest Pokemon in the tier with access to Rapid Spin. Its Speed, coupled with Knock Off, allows it to consistently cripple switch-ins and make progress against a wide variety of team structures. Dazzling Gleam is a fantastic coverage option to punish common switch-ins like Vullaby and faster variants of pivot Mienfoo, both of which can otherwise take advantage of Toedscool’s usual coverage. Spikes is another way for Toedscool to make progress and typically replaces Giga Drain first but can replace Earth Power or Knock Off in rare instances. Toedscool's high Special Defense allows it to check special Electric-types like Elekid, comfortably taking on its special coverage while preventing it from freely whittling teams down with Volt Switch. The Speed investment lets Toedscool Speed tie with key 17 Speed threats like Mienfoo and Chinchou, while its Defense investment allows it to reliably check common physical hazard setters such as Mudbray by allowing it to live 2 Close Combats; it also allows Toedscool to live a U-turn from Mienfoo. Tera Water lets Toedscool flip common Ice- and Fire-type matchups, while Tera Fairy offers a more offensive option that enhances Dazzling Gleam and improves its resilience against Dark-types.</p> <p>Toedscool fits best on teams that appreciate its utility and defensive profile. Mareanie benefits greatly from Toedscool's Electric-type immunity, Ground resistance, ability to remove entry hazards, and immunity to Spore. Flying-type Pokemon like Vullaby and Wingull also appreciate the Stealth Rock removal and Electric-type immunity. Other Stealth Rock-weak Pokemon, such as Hisuian Growlithe, similarly appreciate Toedscool's hazard removal and Ground resistance. Toedscool is much weaker to Mienfoo and Vullaby, especially when it lacks Dazzling Gleam. Choice Scarf Hisuian Growlithe can OHKO Toedscool with Flare Blitz. Additionally, Pokemon with surprise coverage options, such as Ice Punch Elekid and Ice Hammer Tinkatink, can OHKO Toedscool that attempt to make progress via Spikes, Rapid Spin, or Knock Off. Shellos walls Ice- and Fire-type attacks while preventing progress from Knock Off with its ability Sticky Hold. Shellos appreciates Toedscool's hazard removal to keep it healthy enough to reliably live attacks from both Mienfoo and Vullaby. Toedscool partners well with Mareanie, which also comfortably absorbs Ice- and Fire-type attacks and switches into Mienfoo. Tinkatink rounds out an excellent core with Mareanie and Toedscool, covering for Toedscool's weaknesses to Vullaby and Mienfoo, stacking hazards with Stealth Rock, and providing speed control with Thunder Wave. Toedscool switches into both Ground-type attacks and Spore for Tinkatink and Mareanie, using these moves to open opportunities to remove entry hazards for the core or make progess with Spikes and Knock Off. Glimmet is another notable partner that can absorb Toxic Spikes for Toedscool, set Stealth Rock, and handle Vullaby.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 615880, "username": "xzeroxman"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 641532, "username": "bleahey"}, {"user_id": 605215, "username": "Flou"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  },
  "Tinkatink": {
    "sets": {
      "Utility": {
        "description": "<p>Tinkatink is the sturdiest counter to physical Vullaby and the best defensive Steel-type in Little Cup. Pickpocket turns the tables against Knock Off users such as Stunky and the aforementioned Vullaby, stealing the foe's item after Tinkatink loses its own. Air Balloon Tinkatink is able to steal the foe's item after any contact move, but it sacrifices immediate bulk to do so. Tinkatink cannot deal much damage with bulky sets, so it most commonly runs a utility Stealth Rock set with Knock Off to remove items, Draining Kiss as a STAB move with extra healing, and Thunder Wave to hobble threats such as Mienfoo and Alolan Sandshrew. Tera Fairy boosts Tinkatink's Draining Kiss while allowing it to resist Mienfoo's attacks. Tinkatink's EV spread can be adjusted to best handle the threats it is tasked with fighting, but this one is notable for surviving +2 Heat Wave from Nasty Plot Vullaby most of the time.</p> <p>Compared to Mudbray and Glimmet, which compete with it as Stealth Rock setters and Vullaby counters, Tinkatink boasts far better longevity but deals nowhere near as much damage. Tinkatink is commonly seen in defensive cores with Mienfoo and Foongus or Mareanie. Grass-types such as Toedscool and Foongus are great partners for Tinkatink because they can switch into Ground-types, notably Mudbray and Alolan Diglett. Fire-resistant Pokemon such as Mareanie and Chinchou are important to patch up Tinkatink's weakness to Fire-types such as Hisuian Growlithe. Speed control such as the previously mentioned Alolan Diglett is necessary because Tinkatink can get overwhelmed by repeated hits or super effective coverage and is generally passive. For the same reasons, Tinkatink appreciates teammates that can trade hits well, like Vullaby and Mienfoo. Vullaby is especially useful because its Weak Armor denies opportunities for fast Life Orb or Choice Scarf wallbreakers to enter the field via U-turn on a predicted Tinkatink switch-in.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 568849, "username": "Colin"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 605215, "username": "Flou"}, {"user_id": 641532, "username": "bleahey"}]}, {"name": "Grammar checked by", "members": [{"user_id": 664887, "username": "wisteriapurple"}]}]}
  },
  "Finizen": {"sets": {"Offensive": {}}, "credits": {"writtenBy": [], "teams": [{"name": "Set(s) by", "members": [{"user_id": 484613, "username": "Lokifan"}]}]}},
  "Glimmet": {
    "overview": "<p>Glimmet's unique ability, Toxic Debris, coupled with its access to both Stealth Rock and Spikes, cements it as one of Little Cup's most reliable entry hazard setters. Glimmet also packs the highest Special Attack in the tier, making for an excellent progress-making piece on offensive teams. Its defensive typing and Speed tier let Glimmet switch into and check Vullaby. However, Glimmet requires support for Ground-types like Mudbray that it can struggle against.</p>",
    "comments": "<h3>Other Options</h3> <p>Sludge Wave may be used over Sludge Bomb, especially on Spikes variants, so that Chespin does not wall Glimmet. Offensive Glimmet sets have high potential due to Glimmet's impressive Special Attack stat. A Modest nature grants Glimmet a 75% chance to OHKO Vullaby with Power Gem without requiring Stealth Rocks up but gives up its Speed tie with Vullaby and opposing Glimmet. Glimmet may also use a Choice Scarf set with a Modest nature and a spread of 52 HP / 20 Def / 236 SpA / 196 Spe. This can 2HKO most bulky switch-ins like Foongus after Stealth Rock chip and has a chance to OHKO less bulky variants of pivot Mienfoo with a Tera Poison Sludge Wave. Choice Scarf sets are typically outclassed by Hisuian Growlithe, which is able to break through its checks like Mudbray more easily. However, it can use the element of surprise to earn KOs against faster foes like Elekid when it is not yet revealed to be Choice Scarf, since hazard-setting sets are much more common. Rock Polish is another Speed-boosting option that can be used over Stealth Rock to make Glimmet a surprise sweeper.</p> <h3>Checks and Counters</h3> <p><strong>Ground-type Pokemon</strong>: Ground-type attacks are extremely threatening due to Glimmet's 4x weakness to them. Ground-types also wall Glimmet's STAB attacks, though Mud Shot can deter those weak to it, like Alolan Diglett, from switching in. Mudbray is particularly problematic, as it can consistently switch into Glimmet and set entry hazards or threaten massive damage.</p> <p><strong>Trappers</strong>: Glimmet is susceptible to being trapped by Gothita, especially after being hit by Vullaby's Knock Off, and Trapinch is able to safely switch in and OHKO Glimmet at full HP.</p> <p><strong>Tera Blast Users</strong>: Some foes that struggle to break through Glimmet, such as Vullaby, may fit Tera Blast Ground to earn a surprise KO. Other Tera types like Psychic may be used by foes that also want to KO Mienfoo, and they may also use the move to bypass Glimmet.</p>",
    "sets": {
      "Hazard Setter": {
        "description": "<p>Power Gem OHKOes Vullaby after Stealth Rock chip damage, while Spikes punishes opposing teams without entry hazard removal. Mud Shot provides coverage for opposing Steel- and Poison-type Pokemon and slows down faster foes or switch-ins, granting Glimmet more chances to move. Toxic Debris sets Toxic Spikes when Glimmet is hit by physical attacks, restricting which teammates foes can switch into. Glimmet's 132 HP and 100 Defense EVs allow it to live two Knock Offs from Vullaby. With Tera Ghost, Glimmet becomes immune to Mienfoo's High Jump Kick, can block Rapid Spin, survives Ground-type attacks from Toedscool and Alolan Sandshrew, and can switch out of both Shadow Tag Gothita and Arena Trap Trapinch. Alternatively, Tera Flying lets Glimmet resist Fighting-type moves and makes it immune to Trapinch's Arena Trap. Tera Flying also improves Glimmet's matchup against other Ground-types like Toedscool and Alolan Diglett.</p> <p>Teammates that can switch into Ground-type moves, such as Foongus and Toedscool, are vital to support Glimmet. Toxic Debris can force in common Poison-types like Foongus and Mareanie. Pivots like Vullaby and Elekid or trappers like Gothita can maintain offensive pressure or threaten to trap these foes, respectively. Spikes Glimmet enables sweepers like Shellder, which OHKOes Foongus using Rock Blast with Stealth Rock and one layer of Spikes up, and other late-game cleaners that appreciate chip damage like Alolan Diglett and Hisuian Growlithe. Dark-type allies like Stunky can punish Gothita after it has trapped and KOed Glimmet with Psychic.</p>"
      }
    },
    "credits": {"writtenBy": [{"user_id": 641532, "username": "bleahey"}], "teams": [{"name": "Quality checked by", "members": [{"user_id": 440139, "username": "Éric"}, {"user_id": 605215, "username": "Flou"}]}, {"name": "Grammar checked by", "members": [{"user_id": 555379, "username": "Tbolt"}]}]}
  }
}